[{"directions": "\n\n              Lightly butter and flour two 9 x 1 1/2-inch round cake pans. Position a rack in the middle of the oven and preheat to 350 degrees F.\n            \n\n              In a standing mixer fitted with the paddle attachment, cream the butter at low speed until smooth, about 1 minute. Slowly add the sugar and mix until just incorporated. Raise the speed to high and mix until light and fluffy, about 10 minutes. (Occasionally turn the mixer off, and scrape the sides of the bowl down with a rubber spatula.)\n            \n\n              Meanwhile, sift the flour, baking powder, and salt together into a large bowl. In a small bowl, whisk together the milk and vanilla.\n            \n\n              Reduce the mixer's speed to low. Alternately add the flour mixture and milk mixture, waiting for each to be fully incorporated before adding the next (scrape the bowl down occasionally). Raise the speed to medium and mix briefly until a smooth batter is formed. Transfer the batter to a large bowl.\n            \n\n              Thoroughly clean the bowl of the mixer and place the egg whites inside. Using the whisk attachment, whip the egg whites on high speed, until stiff peaks are formed.\n            \n\n              Working in 3 batches, using a rubber spatula, fold the egg whites into the batter, until just incorporated.\n            \n\n              Divide the cake batter evenly between the prepared cake pans. Place the pans on the middle oven rack evenly spaced apart. Bake, rotating the pans halfway through the cooking, until golden brown and a toothpick inserted in the center of the cakes comes out clean, about 30 minutes.\n            \n\n              Remove the cakes from the oven and run a knife around the edges to loosen them from the sides of the pans. One at a time, invert the cakes onto a plate and then re-invert them onto a cooling rack, rounded-sides up. Let cool completely.\n            \n\n              Frost the cake. Place one layer, rounded-side down, in the middle of a rotating cake stand. (If using the vanilla frosting, reserve about 1 to 2 cups for coloring and decorating.) Using a palette knife or offset spatula spread about half of the frosting all over the cake. (Spread enough frosting over the top to make a 1/4-to-1/2-inch layer.) Carefully set the other layer on top, rounded-side up, and spread all over with the remaining frosting.\n            \n\n              If coloring the vanilla frosting, place the reserved frosting in a medium bowl and stir in the food coloring, little by little, until the desired color is reached. Transfer the colored frosting to a pastry bag with small, round or fluted tip, or a plastic baggie with a small portion of a corner cut off.\n            \n\n              Using the colored frosting, creatively write \"Happy Birthday\" to whomever and decorate the edges in fringes and whirls, if desired. Serve immediately with lit candles or store at room temperature or in the refrigerator covered with a cake or pie lid. (If storing the cake in the refrigerator, remember to remove it several hours before serving, to bring it to room temperature.)\n            \n\nVanilla Frosting:\n\n\n              In a standing mixer fitted with the paddle attachment, or with a hand-held electric mixer, combine the butter and sugar and mix on low until incorporated. Raise the speed to high and mix until light and fluffy, about 10 minutes. (Occasionally turn the mixer off, and scrape the sides of the bowl down with a rubber spatula.)\n            \n\n              Meanwhile, in a small bowl, whisk together the milk, vanilla, lemon juice, and zest.\n            \n\n              Reduce the speed of the mixer to low. Add the milk mixture in 3 batches, waiting for each batch to be fully incorporated before adding the next (scrape the bowl down occasionally). Raise the speed to high and mix briefly until fluffy. Use as desired. May be stored, covered, in the refrigerator for 3 days.\n            \n\n              Yield: about 6 cups\n            \n\nChocolate Frosting:\n\n\n              Put the chocolate in a large bowl and set aside.\n            \n\n              In a small saucepan, whisk together the cream and corn syrup and bring to a boil. Pour the cream mixture over the bowl of chocolate and immediately whisk until smooth. Set aside to cool completely, about 1 hour.\n            \n\n              Transfer the chocolate mixture to the bowl of a standing electric mixer, or with a hand-held mixer and whip on high speed until creamy and fluffy. Use as desired. May be stored covered in the refrigerator for up to 1 week.\n            \n\n              Yield: about 4 cups\n            \n\n              Copyright 2001 Television Food Network, G.P. All rights reserved\n            \n", "ingredients": [{"food": "pan dulce", "quantity": 1.5}, {"food": "sugar", "quantity": 2.25}, {"food": "potato flour", "quantity": 3.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 0.75}, {"food": "whole milk", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.5}, {"food": "egg substitute", "quantity": 6.0}, {"food": "barley flour or meal", "quantity": 4.0}, {"food": "", "quantity": 1}, {"food": "hearts of palm", "quantity": 1}, {"food": "butter oil", "quantity": 1.5}, {"food": "sugar", "quantity": 4.5}, {"food": "whole milk", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 1.75}, {"food": "lemon juice", "quantity": 1.5}, {"food": "lemon juice", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1.5}, {"food": "corn bran", "quantity": 0.3333333333333333}], "title": "\nA Birthday Cake\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Melt the butter in a Dutch oven set over medium-high heat. Add the garlic, onions and carrots and cook, stirring often, until the onion is translucent, about 5 minutes. Season lightly with salt and pepper.\n            \n\n              Stir in the chicken broth, chard, pasta, green beans, oregano, pasta sauce, cannellini beans, squash, zucchini, 1 cup water, 2 teaspoons salt and several grinds of pepper. Bring to a simmer and cook until the pasta is cooked and the vegetables are tender, about 5 minutes.\n            \n\n              Divide among 6 bowls and top with the torn basil and Parmesan.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 3.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "diced chicken", "quantity": 4.0}, {"food": "chrysanthemum leaves", "quantity": 3.0}, {"food": "italian veg medley pasta", "quantity": 4.0}, {"food": "fava beans", "quantity": 4.0}, {"food": "", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 16.0}, {"food": "fava beans", "quantity": 15.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 0.25}, {"food": "", "quantity": 1}], "title": "\nAbruzzo Summer Minestrone\n"}, {"directions": "\n\n              Combine 1/4 cup each vodka, apple brandy and apple cider in a jar; stir in half of a thinly sliced Granny Smith apple and 1 tablespoon sugar. Cover and refrigerate at least 2 hours or overnight. Pour a splash of absinthe into 2 martini glasses; swirl to coat. Fill a cocktail shaker with ice and add the vodka mixture, reserving the apple slices; shake well, then strain into the glasses. Add the reserved apple slices.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [], "title": "\nAbsinthe Appletinis\n"}, {"directions": "\n\n              Break the frozen acai up a little by slapping the sealed packets on the countertop or hitting them with a meal mallet. Blend the berries with 1/2 the banana, 1/4 cup of the blueberries and the honey in the blender, stopping to stir and break up the mixture as needed, until it's the consistency of a thick smoothie; transfer to a cereal bowl.\n            \n\n              Slice the remaining 1/2 banana. Arrange the slices, the remaining 1/4 cup blueberries, granola, pomegranate seeds and coconut flakes in neat piles or rows on top of the acai. Then take a photo!\n            \n", "ingredients": [{"food": "prune puree", "quantity": 4.0}, {"food": "banana", "quantity": 1.0}, {"food": "blueberries", "quantity": 0.5}, {"food": "honey smoked ham", "quantity": 1.0}, {"food": "granola bar", "quantity": 3.0}, {"food": "pomegranate", "quantity": 2.0}, {"food": "coconut water", "quantity": 1.0}], "title": "\nAcai Breakfast Bowl\n"}, {"directions": "\n\n              Cut each banana into 6 chunks, and freeze until rock solid, preferably overnight.\n            \n\n              With the acai inside the packet, crush the puree into smaller pieces. Process the pieces in a food processor to a fine slush. Add the frozen banana chunks, coconut oil and maple syrup, and begin to process (the food processor may jolt in the very beginning). As the bananas break down and combine with the acai, the mixture will look crumbly, then gooey and eventually smooth and slightly slushy, like a sorbet. Stop the food processor frequently to scrape down the side of the bowl and break up any clumps. Serve right away, or scrape into a container and freeze until ready to serve.\n            \n", "ingredients": [{"food": "bananas", "quantity": 2.0}, {"food": "prune puree", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "syrup", "quantity": 1.0}], "title": "\nAcai-Banana Sorbet\n"}, {"directions": "\n\n              Cook the rice as the label directs. Meanwhile, cut the hens in half with kitchen shears, cutting along one side of the breastbone; season with salt and pepper. Heat the canola oil in a large Dutch oven or pot over high heat. Add the hens, skin-side down, and cook until browned, about 5 minutes. Remove and set aside.\n            \n\n              Pour off all but about 2 tablespoons oil from the pot. Add the onion and garlic; cook, stirring, until the onion is translucent, about 5 minutes. Return the hens to the pot, skin-side up; add 2 cups water, the soy sauce, sugar, peppercorns and bay leaves. Bring to a boil. Lay the scallions on top of the hens; cover and cook until the scallions are tender and the hens are cooked through, about 10 minutes.\n            \n\n              Uncover the pot and add the vinegar (do not stir). Cook, uncovered, until the liquid is reduced by about two-thirds, 8 to 10 minutes. Remove the hens and scallions; discard the bay leaves from the pan sauce. Serve with the rice.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [{"food": "crisped rice bar", "quantity": 1.0}, {"food": "game meat bison", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 5.0}, {"food": "soy sauce", "quantity": 0.6666666666666666}, {"food": "sugar", "quantity": 0.25}, {"food": "black bean mango", "quantity": 0.5}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "vinegar", "quantity": 0.25}], "title": "\nAdobo-Style Cornish Hens\n"}, {"directions": "\n\n              Place 2 small scoops of ice cream (coffee, chocolate or vanilla) in a coffee cup, then pour in a shot of espresso or 3 tablespoons strong brewed coffee. Top with shaved dark chocolate and chopped hazelnuts.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nAffogato\n"}, {"directions": "\n\n              Put a scoop of vanilla ice cream or gelato in a small mug and top it with a shot of hot espresso or strong coffee. You'll have what may be the loveliest-and simplest-of Italian desserts: \"affogato,\" which aptly means \"drowned.\"\n            \n\n              Photograph by Tina Rupp\n            \n", "ingredients": [], "title": "\nAffogato\n"}, {"directions": "\n\n              Combine the artichokes, half-and-half, garlic, red pepper flakes and 1/4 teaspoon salt in a large skillet and bring to a simmer over medium heat. Cover and cook until the artichokes are tender, about 5 minutes. Add the peas and continue to cook, covered, until tender, about 5 more minutes. Remove from the heat and stir in the lemon zest and juice. Discard the garlic clove.\n            \n\n              Meanwhile, bring a large pot of salted water to a boil. Add the agnolotti and cook as the label directs. Reserve 1/2 cup cooking water, then drain the pasta and transfer to the skillet with the sauce.\n            \n\n              Add the parmesan to the skillet and gently stir until the pasta is coated. Thin the sauce with some of the reserved cooking water. Stir in the basil.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "artichoke hearts", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.125}, {"food": "salt", "quantity": 1}, {"food": "pigeon peas", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "hot pockets ham cheese stuffed swich", "quantity": 1.0}, {"food": "parmesan cheese", "quantity": 0.25}, {"food": "chrysanthemum leaves", "quantity": 0.25}], "title": "\nAgnolotti With Artichoke Sauce\n"}, {"directions": "\n\n              Blend 5 cups of any chopped fruit (we used strawberries, cantaloupe, pineapple, honeydew, watermelon and mango) with 3 cups water, 1/2 cup sugar and 2 tablespoons lime juice. Add more sugar and/or lime juice to taste and serve over ice.\n            \n\n              Photograph by Sam Kaplan\n            \n", "ingredients": [], "title": "\nAguas Frescas\n"}, {"directions": "\n\n              Whisk 2 or 3 minced garlic cloves with 2 egg yolks. Gradually whisk in 1 1/2 cups olive oil. Add lemon juice, salt and pepper to taste; thin with water as needed. Serve with crudites.\n            \n\n              Olive Aioli\n            \n\n              Make Aioli. Stir in 3 tablespoons store-bought olive tapenade.\n            \n\n              Orange-Saffron Aioli\n            \n\n              Make Aioli with orange juice instead of lemon. Steep 1/2 teaspoon saffron in 2 tablespoons Pernod for 5 minutes, then add to the aioli\n            \n\n              See all 50 Game-Day Dips\n            \n\n              Photographs by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nAioli\n"}, {"directions": "\n\n              Place 10 garlic cloves in a saucepan and cover with cold water. Bring to a simmer over medium-high heat and cook 3 minutes, then drain. Return the garlic to the saucepan and cover with fresh water. Bring to a simmer and cook 3 more minutes, then drain again.\n            \n\n              Mince the remaining 2 garlic cloves; sprinkle with salt. Use the flat side of a chef's knife to mash the garlic and salt into a smooth paste. (For a stronger aioli, cook 8 cloves in step 1 and mash 4 into a paste.)\n            \n\n              Combine the cooked garlic and garlic paste in a food processor. Add the egg yolks and 3 tablespoons warm water; pulse to blend, scraping down the sides as needed. With the motor running, add the olive oil in a steady stream and blend until thick. Transfer to a bowl; cover and refrigerate 1 to 4 hours.\n            \n\n              Remove the aioli from the refrigerator about 15 minutes before serving. Whisk in up to 4 tablespoons water to thin it, if desired. Season with salt. Serve with the roasted vegetables.\n            \n\n              Choose several vegetables and make a foil packet for each: Pile the vegetables on foil, sprinkle with salt and drizzle with 1 tablespoon olive oil and 2 tablespoons water. Seal into a packet, put on a baking sheet and roast at 450 degrees F until tender. Keep sealed until ready to serve.\n            \n\n              Photograph by Anna Williams\n            \n", "ingredients": [{"food": "garlic powder", "quantity": 12.0}, {"food": "salt", "quantity": 1}, {"food": "egg substitute", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1.5}], "title": "\nAioli With Roasted Vegetables\n"}, {"directions": "\n\n              Soak 1/3 cup finely diced white onion in ice water 15 minutes; drain. Mix with 1/2 cup each finely diced tomato and chopped cilantro, 1 each seeded minced aji chile and garlic clove, 2 tablespoons white wine vinegar, 1 tablespoon lime juice and 2 teaspoons extra-virgin olive oil. Thin with water. Season with salt.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [], "title": "\nAji Chile Salsa\n"}, {"directions": "\n\n              In a 5-quart pot, combine the chicken, 1 1/2 teaspoons salt and 8 cups water to cover. Bring to a boil, reduce to a simmer and skim any foam or impurities from the top. Add the onion, garlic, bay leaf, cilantro stems and scallion whites. Simmer, partially covered, until the chicken is tender and releases easily when pierced with a knife, 35 to 40 minutes. Transfer the chicken to a bowl to cool, about 10 minutes.\n            \n\n              Meanwhile make the aji sauce: In a food processor, combine the scallion greens, hot sauce, tomatoes, 1/2 teaspoon salt and 1/2 cup of the cilantro leaves and pulse to a coarse sauce. Set aside. (Alternatively, the ingredients can be chopped by hand and stirred to combine.)\n            \n\n              Add the potatoes to the soup along with 1 1/4 teaspoons salt. Cover, bring back to a simmer and simmer another 10 minutes. \n            \n\n              Meanwhile, remove the chicken meat from the bones and shred with your hands or 2 forks (discard the bones and skin). Set aside. \n            \n\n              Add the corn to the soup and cook until the corn and potatoes are tender when pierced with a knife, 3 to 4 minutes. Add the chicken meat back to the soup and return the soup to a simmer. Add salt if needed.\n            \n\n              Divide the soup among 6 bowls and serve with sliced avocado, sour cream, capers, aji sauce and remaining cilantro leaves.\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "corier leaf", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "turnip greens", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "tomatoes", "quantity": 3.0}, {"food": "mixed nuts", "quantity": 1.75}, {"food": "corn bran", "quantity": 1.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "sour cream", "quantity": 0.5}, {"food": "capers", "quantity": 0.25}], "title": "\nAjiaco (Colombian Chicken, Potato and Corn Soup)\n"}, {"directions": "\n\n              Toppings: Deli-sliced corned beef, shredded Swiss cheese, grated horseradish and spicy mustard\n            \n\n              How to Make Classic Potato Skins:\n            \n\n              Pierce 4 large russet potatoes with a fork. Bake directly on the oven rack at 350 degrees until tender, about 1 hour. Let cool, then quarter lengthwise and scoop out the flesh, leaving a 1/4-inch shell. Brush both sides with melted butter and season with salt and pepper. Bake, skin-side up, at 450 degrees until crisp, about 20 minutes. Add your favorite team toppings. (For cheesy skins, flip the baked shells over before topping, sprinkle with 1 cup grated cheddar cheese and bake an extra 5 minutes.)\n            \n\n              Photograph by Karl Juengel/Studio D\n            \n", "ingredients": [], "title": "\nAll the Way Potato Skins\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Spray an 18-by-13-inch sheet pan with cooking spray.\n            \n\n              Melt the butter with the thyme in small saucepan over medium heat. Whisk in the flour and cook, stirring, until a sandy consistency, about 1 minute. Pour in the chicken broth, whisking constantly until smooth. Stir in 2 teaspoons salt and a few grinds of black pepper and bring to a boil. Lower the heat and simmer gently until thickened and the flour flavor is gone, about 10 minutes. \n            \n\n              Meanwhile, add the chicken, onions, carrots and celery to the prepared sheet pan and toss to combine; set aside. \n            \n\n              Stack 2 puff pastry sheets on top of each other on a lightly floured surface. Roll the puff pastry out to a 15-by-15-inch square. Cut the pastry into 1-inch strips so you have 15 strips total. Repeat with the remaining 2 puff pastry sheets. \n            \n\n              Pour the gravy over top of the chicken mixture on the sheet pan. Arrange the pastry strips over the filling lengthwise, overlapping them slightly so most of the filling is covered. Trim any overhang from the edges of the pan. Brush the pastry with the egg wash and bake until deep golden brown, 35 to 40 minutes. \n            \n", "ingredients": [{"food": "pan dulce", "quantity": 1}, {"food": "butter oil", "quantity": 3.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "potato flour", "quantity": 0.3333333333333333}, {"food": "diced chicken", "quantity": 3.0}, {"food": "black bean mango", "quantity": 1}, {"food": "diced chicken", "quantity": 1.0}, {"food": "onions", "quantity": 14.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "cream puff shell", "quantity": 17.0}, {"food": "egg substitute", "quantity": 1.0}], "title": "\nAll-Crust Sheet Pan Chicken Pot Pie\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: an 18-by-13-inch sheet pan\n\n              Position a rack in the center of the oven and preheat to 450 degrees F.\n            \n\n              Heat 1 tablespoon olive oil in a large skillet over medium-high heat. Add the sausage and cook, breaking up the meat with a wooden spoon, until browned and cooked through, about 5 minutes. Transfer the sausage to a bowl with a slotted spoon and reserve the drippings in the pan. \n            \n\n              Reduce the heat to medium. Add the remaining 2 tablespoons olive oil and the garlic to the pan. When the garlic begins to brown at the edges, about 1 minute, add the tomatoes with their juices, 3/4 teaspoon salt and 1/4 teaspoon pepper. Bring to a simmer and continue to cook, stirring occasionally, until the sauce thickens, about 8 minutes. \n            \n\n              Mix the ricotta, egg, milk, basil, 1/2 cup of the grated Parmesan, 3/4 teaspoon salt and 1/4 teaspoon pepper together in a large bowl. Spread 2/3 cup of the tomato sauce across the bottom of an 18-by-13-inch sheet pan. Next, space out 6 lasagna noodles on top of the sauce, turning them to fit so there are 2 noodles across and 3 noodles down. (The noodles will expand when they cook.) Top the noodles with all of the ricotta mixture, all of the sausage, 2/3 cup tomato sauce, and half the shredded mozzarella. Add another layer of 6 lasagna noodles and top with the remaining sauce, mozzarella, and 1/4 cup grated Parmesan.  \n            \n\n              Lightly oil one side of a large piece of foil. Cover the pan with the foil, greased side down. Bake until the noodles are tender when pierced with a paring knife, about 20 minutes. Carefully remove the foil and continue to bake until the top is very crusty and brown, 10 to 15 minutes more.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "sweet potatoes", "quantity": 12.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "whole milk", "quantity": 28.0}, {"food": "salt", "quantity": 1}, {"food": "macaroni cheese", "quantity": 15.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "milk", "quantity": 0.25}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "meat drippings ", "quantity": 0.75}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "lasagna", "quantity": 12.0}], "title": "\nAll-Crust Sheet-Pan Lasagna\n"}, {"directions": "\nSpecial equipment: an 18-by-13-inch sheet pan\n\n              Preheat the oven to 450 degrees F. Lightly grease an 18-by-13-inch sheet pan with the butter.\n            \n\n              Bring the cream, garlic, thyme, 1/2 teaspoon salt and 1/4 teaspoon pepper to a simmer in a small saucepan over medium heat, then turn off stove.\n            \n\n              Thinly slice the potatoes on a mandoline or vegetable slicer (about 1/8-inch-thick rounds.) Arrange half the potato slices into a single, overlapping layer on the sheet pan, and sprinkle evenly with salt and half the grated Parmesan. Top with the remaining potato slices and sprinkle with salt. Drizzle the hot cream mixture evenly over the potatoes.\n            \n\n              Cover the pan with foil and bake until the potatoes are tender when pierced with a paring knife, about 20 minutes. Carefully remove the foil and sprinkle the potatoes with Gruyere and the remaining Parmesan. Cook uncovered until very brown and crusty on top, rotating the pan halfway through, 15 to 20 minutes more.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "sweet potatoes", "quantity": 2.25}, {"food": "", "quantity": 0.3333333333333333}, {"food": "", "quantity": 1.5}], "title": "\nAll-Crust Sheet-Pan Scalloped Potatoes\n"}, {"directions": "\n\n              Peel the mangoes, cut the flesh from around the pit and cut into approximately 1/2-inch chunks (you should have about 4 cups). Arrange the chunks in a single layer on a baking sheet, and loosely cover with plastic wrap. Freeze the mango until hard, at least 4 hours up to overnight.\n            \n\n              Meanwhile, preheat the oven to 350 degrees F. Spread the coconut out on a rimmed baking sheet, and bake until lightly golden and toasted, about 4 minutes, tossing about halfway through.\n            \n\n              Once the mango is completely frozen, transfer it to a food processor. Add 1/4 to 1/2 cup hot water, and process the mango until completely smooth; turn the food processor off and stir with a wooden spoon or spatula as needed. The finished texture should be like creamy sorbet (a few small chunks of mango are fine). Scoop the sorbet into 4 serving glasses or bowls, squeeze a quarter of a lime over each, drizzle with honey if using and sprinkle with toasted coconut.\n            \n", "ingredients": [{"food": "silk very vanilla", "quantity": 2.0}, {"food": "coconut water", "quantity": 2.0}, {"food": "lime", "quantity": 1.0}, {"food": "", "quantity": 1}], "title": "\nAll-Fruit Mango Sorbet\n"}, {"directions": "\n\n              1/4 cup white wine vinegar, balsamic vinegar, red wine vinegar, or aged sherry wine vinegar 2 to 4 teaspoons Dijon mustard 1 teaspoon kosher salt plus more Freshly ground black pepper 2/3 to 3/4 cups extra-virgin olive oil.\n            \n", "ingredients": [{"food": "vinegar", "quantity": 0.25}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "salt", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.4166666666666665}], "title": "\nAll-Purpose Vinaigrette\n"}, {"directions": "\n\n              Finely grind 1 cup roasted almonds in a food processor, then add 2 teaspoons vegetable oil and a pinch of salt and blend into a smooth paste. Store in the refrigerator, in an airtight container, for up to 2 weeks.\n            \n\n              Photograph courtesy of Ben Goldstein\n            \n", "ingredients": [], "title": "\nAlmond Butter\n"}, {"directions": "\n\n              Toss 4 cups cubed Italian bread with 2 tablespoons each olive oil, sliced almonds and grated parmesan, the zest of 1/2 lemon, and salt and pepper. Spread on a baking sheet and bake at 425 degrees F, about 8 minutes. Meanwhile, puree 1/4 cup each olive oil, sliced almonds and grated parmesan, the juice of 1 lemon, 3 anchovies, 2 teaspoons dijon mustard and 1 garlic clove in a food processor; season with salt and pepper. Toss with red-leaf lettuce and the croutons.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nAlmond Caesar Salad\n"}, {"directions": "\n\n              Preheat an oven to 325 degrees F. Coat an 8-inch square glass baking dish with cooking spray. Line the bottom with a piece of parchment or waxed paper leaving a 4-inch overhang on two opposite sides and spray the paper with cooking spray.\n            \n\n              Put 1 cup of the rice cereal in a resealable plastic bag and crush to a fine powder with the back of the measuring cup. Combine the remaining 1 cup rice cereal, pepitas, almonds and cherries in a large bowl. Heat the rice syrup and almond butter in a small saucepan until warm and bubbling and remove from heat. Stir in the almond extract and salt, and pour into the nut mixture. Fold with a spatula until it is everything is moistened and well combined. Add the crushed rice cereal and continue to fold until evenly incorporated.\n            \n\n              Press the mixture very firmly and evenly into the prepared pan using the overhanging pieces of parchment to prevent sticking. Bake until beginning to brown, about 25 minutes. Cool 15 minutes on a wire rack, then press again to compact the mixture. Chill until firm but not completely set , about 45 minutes. Remove the block by the paper handles and invert onto a cutting board. Gently peel off the paper. Cut the block in half, then cut each half into 6 bars for 12 total. Refrigerate until fully set.\n            \n\n              Store the bars individually wrapped or layered between sheets of parchment or waxed paper in the refrigerator for up to 2 weeks. The bars will soften up and become chewy as they come to room temperature.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "crisped rice bar", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "almonds", "quantity": 1.0}, {"food": "maraschino cherries", "quantity": 0.5}, {"food": "crisped rice bar", "quantity": 0.6666666666666666}, {"food": "almond butter", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "sea lion", "quantity": 0.5}], "title": "\nAlmond Cherry Pepita Bars\n"}, {"directions": "\n\n              Plunge the noodles in hot very hot tap water and let soften for 15 minutes, then drain.\n            \n\n              In the meantime, heat the oil in a large skillet over medium-high heat until hot. Sprinkle the chicken with 1 teaspoon salt and 3/4 teaspoon pepper, and then add to the skillet. Cook, turning occasionally with tongs, until browned on all sides, about 6 minutes. Stir in the ginger and garlic and cook until very fragrant, 1 to 2 minutes. Stir in the coconut milk, almond butter, 1/4 cup water and 1/2 teaspoon salt, and bring to a simmer. Stir in the snap peas and cook until the peas are bright green, about 3 minutes. Stir in the lime juice and season with salt and pepper.\n            \n\n              Serve the chicken over the rice noodles, sprinkled with chile and cilantro.\n            \n", "ingredients": [{"food": "rice noodles", "quantity": 6.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "diced chicken", "quantity": 2.75}, {"food": "black bean mango", "quantity": 1}, {"food": "ginger", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "coconut milk", "quantity": 14.0}, {"food": "almond butter", "quantity": 0.3333333333333333}, {"food": "pigeon peas", "quantity": 12.0}, {"food": "lime juice", "quantity": 2.0}, {"food": "hot pockets ham cheese stuffed swich", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1}], "title": "\nAlmond Chicken Satay\n"}, {"directions": "\n\n              Finely chop the almonds in a mini-chopper or food processor. Transfer the nuts to a shallow dish and stir in the paprika. Lightly whisk the egg whites in another shallow dish. Pat the chicken dry and season both sides with salt and pepper. Dip each piece of chicken into the egg, letting the excess fall back into the dish. Then press both sides of the chicken into the nuts to coat. Place on a baking sheet, cover, and refrigerate for at least 20 minutes to set the crust.\n            \n\n              Preheat the oven to 350 degrees F. Place rack on a baking sheet.\n            \n\n              Heat a medium nonstick skillet over medium-low heat and add 1 tablespoon of the oil and the butter. Place the chicken smooth-side down in the pan and then raise the heat to medium-high. Cook turning once, until the nuts set and turn golden brown, about 3 to 4 minutes per side. Transfer meat to the prepared pan and bake until an instant-read thermometer inserted into the sides of the chicken registers 160 degrees F, about 20 minutes.\n            \n\n              Whisk the vinegar, salt, and pepper to taste in a medium bowl. Gradually whisk in the remaining 3 tablespoons olive oil, starting with a few drops and then adding the rest in a steady stream, to make a smooth dressing. Add the salad greens and toss to coat evenly. Divide the salad evenly among 4 plates, top with the chicken and serve.\n            \n", "ingredients": [{"food": "whole milk", "quantity": 1.0}, {"food": "paprika", "quantity": 1.5}, {"food": "eggs", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "diced chicken", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 4.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "turnip greens", "quantity": 5.0}], "title": "\nAlmond Crusted Chicken\n"}, {"directions": "\n\n              Finely chop the almonds in a mini-chopper or food processor. Transfer the nuts to a shallow dish and stir in the paprika. Lightly whisk the egg whites in another shallow dish. Pat the chicken dry and season both sides with salt and pepper. Dip each piece of chicken into the egg, letting the excess fall back into the dish. Then press both sides of the chicken into the nuts to coat. Place on a baking sheet, cover, and refrigerate for at least 20 minutes to set the crust.\n            \n\n              Preheat the oven to 350 degrees F. Place rack on a baking sheet.\n            \n\n              Heat a medium nonstick skillet over medium-low heat and add 1 tablespoon of the oil and the butter. Place the chicken smooth-side down in the pan and then raise the heat to medium-high. Cook turning once, until the nuts set and turn golden brown, about 3 to 4 minutes per side. Transfer meat to the prepared pan and bake until an instant-read thermometer inserted into the sides of the chicken registers 160 degrees F, about 20 minutes.\n            \n\n              Whisk the vinegar, salt, and pepper to taste in a medium bowl. Gradually whisk in the remaining 3 tablespoons olive oil, starting with a few drops and then adding the rest in a steady stream, to make a smooth dressing. Add the salad greens and toss to coat evenly. Divide the salad evenly among 4 plates, top with the chicken and serve.\n            \n", "ingredients": [{"food": "almonds", "quantity": 1.0}, {"food": "paprika", "quantity": 1.5}, {"food": "eggs", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "diced chicken", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 4.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "turnip greens", "quantity": 5.0}], "title": "\nAlmond Crusted Chicken\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Toss the kale and apples on a baking sheet with 3 tablespoons vegetable oil and 3/4 teaspoon salt. Roast, stirring occasionally,until the apples are tender and the kale is crisp, about 20 minutes.\n            \n\n              Whisk the almond butter with the milk, honey and 1 teaspoon salt in a small bowl. Dredge the chicken in flour, coat with the almond butter mixture, then roll in the panko.\n            \n\n              Heat 1/2 inch vegetable oil in a large skillet over medium-high heat. Pan-fry the chicken, adjusting the heat as necessary to keep it from burning, until crispy and cooked through, 5 to 6 minutes per side. Serve with the roasted kale and apples and a squeeze of lemon.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "apples", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "almond butter", "quantity": 0.5}, {"food": "milk", "quantity": 0.3333333333333333}, {"food": "honey smoked ham", "quantity": 1.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "potato flour", "quantity": 1}, {"food": "", "quantity": 2.0}, {"food": "", "quantity": 1}], "title": "\nAlmond Fried Chicken with Roasted Kale and Apples\n"}, {"directions": "\nSpecial equipment: two 9-inch-round cake pans\n\n              Make the cake: Preheat the oven to 350 degrees F. Lightly butter two 9-inch-round cake pans and line the bottoms with parchment paper; butter the parchment and dust with flour, tapping out the excess. Pulse 2 cups flour, the baking powder, salt and almonds in a food processor until the nuts are finely ground into a powder, 2 to 3 minutes. Whisk the egg whites, milk, and vanilla and almond extracts in a medium bowl until combined.\n            \n\n              Beat 1 stick butter and the granulated sugar in a large bowl with a mixer on medium speed until light and fluffy, about 3 minutes. Reduce the mixer speed to low; beat in the flour mixture in 3 additions, alternating with the milk mixture, beginning and ending with the flour, until just combined.\n            \n\n              Divide the batter between the prepared pans and smooth the tops. Bake until a toothpick inserted into the center comes out clean, 25 to 30 minutes. Transfer to racks and let cool in the pans. (The cakes can be frozen, wrapped in plastic wrap, for up to 2 weeks. Unwrap and thaw at room temperature.)\n            \n\n              Make the frosting: Microwave the white chocolate in a microwave-safe bowl in 20-second intervals, stirring, until melted; set aside. Beat the cream cheese, butter, confectioners' sugar and vanilla in a large bowl with a mixer on medium speed until smooth and creamy, about 4 minutes. Gently fold in the melted white chocolate with a rubber spatula. (The frosting can be refrigerated, covered, for up to 2 days. Beat with a mixer to soften just before frosting the cake.)\n            \n\n              Assemble the cake: Loosen the edges of the cakes with a knife, then invert 1 layer onto a platter and peel off the parchment. Spread 1 to 1 1/2 cups frosting on top. Remove the other layer from the pan, peel off the parchment and carefully place on top of the first layer. Cover the top and sides of the cake with a thin layer of frosting (this is the \"crumb coat\"; it doesn't have to be perfect). Chill 15 minutes, then cover with the remaining frosting and decorate with nonpareils.\n            \n\n              Photograph by Johnny Miller\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "almonds", "quantity": 0.5}, {"food": "egg substitute", "quantity": 5.0}, {"food": "whole milk", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.5}, {"food": "sugar", "quantity": 1.5}, {"food": "barley flour or meal", "quantity": 1}, {"food": "baking chocolate", "quantity": 8.0}, {"food": "macaroni cheese", "quantity": 2.0}, {"food": "butter oil", "quantity": 1.5}, {"food": "sugar", "quantity": 1.0}], "title": "\nAlmond Layer Cake With White Chocolate Frosting\n"}, {"directions": "\n\n              Combine the ingredients in a large bowl. Store in an airtight container.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "almonds", "quantity": 1.0}, {"food": "almonds", "quantity": 1.0}, {"food": "dates", "quantity": 1.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 1.0}, {"food": "prunes", "quantity": 1.0}, {"food": "apricots", "quantity": 1.0}], "title": "\nAlmond Lover's Trail Mix\n"}, {"directions": "\n\n              Make the cake: Preheat the oven to 325 degrees F. Brush a 10- to 12-cup Bundt pan with olive oil; dust with flour and tap out the excess. Whisk the all-purpose flour, almond flour, baking powder and salt in a medium bowl; set aside.\n            \n\n              Combine the granulated sugar and eggs in a large bowl; beat with a mixer on medium-high speed until thick and pale yellow, about 3 minutes. Reduce the mixer speed to medium and slowly beat in the olive oil until the batter is smooth. Beat in the vanilla and almond extracts. Reduce the mixer speed to low; beat in the flour mixture in two additions, alternating with the almond milk, until just combined.\n            \n\n              Pour the batter into the prepared pan and smooth the top. Bake until a toothpick inserted into the middle comes out with a few moist crumbs, 50 to 60 minutes. Transfer to a rack and let cool 15 minutes in the pan. Loosen with an offset spatula, then invert onto the rack to cool completely.\n            \n\n              Make the glaze: Whisk the confectioners' sugar and 2 tablespoons milk in a bowl until smooth; stir in the remaining 1 tablespoon milk if the glaze is too thick. Spoon the glaze over the cake, letting it drip down the sides. Sprinkle with pomegranate seeds and chopped almonds. Let the glaze set, about 20 minutes.\n            \n\n              Photograph by Ben Goldstein\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "potato flour", "quantity": 2.5}, {"food": "potato flour", "quantity": 0.75}, {"food": "baking chocolate", "quantity": 1.5}, {"food": "salt", "quantity": 0.5}, {"food": "sugar", "quantity": 1.75}, {"food": "eggs", "quantity": 4.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "milk", "quantity": 0.5}, {"food": "sugar", "quantity": 2.0}, {"food": "milk", "quantity": 2.0}, {"food": "seeds", "quantity": 1}], "title": "\nAlmond Olive Oil Bundt Cake\n"}, {"directions": "\nSpecial equipment: 9-inch tart fluted pan with a removable bottom\n\n              Preheat oven to 325 degrees F. Blend and pulse the 1/2 cup nuts in a food processor with the sugar until mixture resembles coarse sand. (If there are a couple small chunks of nuts that is fine.) Add the butter, vanilla and almond extracts, and the salt, and pulse until creamy. Add the flour and continue to pulse to make a soft dough. \n            \n\n              Turn the dough out into a 9-inch tart pan and spread it out evenly with an off-set spatula. Dip the spatula in a little warm water to help smooth and even the surface of the shortbread. Cover and freeze until firm, about 20 minutes. \n            \n\n               Put the tart pan on a baking sheet and dock (prick) the dough all over with a fork. Generously sprinkle the top of the shortbread with sugar. Toss the remaining whole almonds in the egg white; evenly arrange and press the nuts into the dough around the edge of the pan. Bake until golden brown and set, about 1 hour and 10 minutes. \n            \n\n               Cool the short bread in the pan on a rack for 10 minutes. Carefully remove the tart ring and cut the shortbread with a sharp knife into wedges, each with a nut. Cool shortbreads on a rack completely. (Alternatively present the shortbread as 1 large cookie. Cool the shortbread in the pan completely and remove the tart ring. Cut the shortbread into wedges as desired.) Serve. Store in a tightly sealed container for up to 5 days.\n            \n", "ingredients": [{"food": "almonds", "quantity": 0.5}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "", "quantity": 14.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 0.25}, {"food": "salt", "quantity": 0.5}, {"food": "potato flour", "quantity": 1.5}, {"food": "egg substitute", "quantity": 1.0}], "title": "\nAlmond Shortbreads\n"}, {"directions": "\n\n              Whisk 1 cup flour, 1 1/2 cups almond meal, 1 tablespoon baking powder and 1/2 teaspoon salt in a bowl. In a separate bowl, whisk 2/3 cup milk, 1 egg and 1/3 cup vegetable oil, then stir in the flour mixture. Drop scoops of the dough on a parchment paper-lined baking sheet, sprinkle with sugar and bake at 475 degrees F until golden, 10 to 12 minutes. Split the shortcakes and fill with whipped cream and blackberries.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nAlmond Shortcakes\n"}, {"directions": "\n\n              Pulse the almonds and sugar in a food processor until very finely ground. Add the butter and process until smooth, about 1 minute. Scrape the dough off the inside of the bowl, if needed. Add the vanilla and almond extracts and pulse to combine. Add the flour and salt and pulse to make a soft dough. Turn the dough out onto a large piece of waxed paper and roll into a log about 15 inches long and 1 1/2 inches wide. Wrap and refrigerate for 30 minutes.\n            \n\n              Preheat the oven to 325 degrees F. Line 2 baking sheets with parchment paper.\n            \n\n              Cut the chilled dough into 1/2-inch pieces and roll by hand into balls. Space the cookies evenly on the prepared baking sheets and bake until slightly golden, rotating the sheets once, 15 to 20 minutes. Put the confectioners' sugar in a pie plate. Briefly cool the cookies on a rack, then gently toss in the confectioners' sugar until evenly coated. Return to rack, cool to room temperature, and then toss again in the confectioners' sugar.\n            \n", "ingredients": [{"food": "pasta with sliced franks in tomato sauce", "quantity": 0.75}, {"food": "sugar", "quantity": 0.75}, {"food": "butter oil", "quantity": 0.75}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 0.125}, {"food": "potato flour", "quantity": 1.6666666666666665}, {"food": "salt", "quantity": 0.5}, {"food": "sugar", "quantity": 1.0}], "title": "\nAlmond Snowball Cookies\n"}, {"directions": "\n\n              Pulse the almonds and sugar in a food processor until very finely ground. Add the butter and process until smooth, about 1 minute. Scrape the dough off the inside of the bowl, if needed. Add the vanilla and almond extracts and pulse to combine. Add the flour and salt and pulse to make a soft dough. Turn the dough out onto a large piece of waxed paper and roll into a log about 15 inches long and 1 1/2 inches wide. Wrap and refrigerate for 30 minutes.\n            \n\n              Preheat the oven to 325 degrees F. Line 2 baking sheets with parchment paper.\n            \n\n              Cut the chilled dough into 1/2-inch pieces and roll by hand into balls. Space the cookies evenly on the prepared baking sheets and bake until slightly golden, rotating the sheets once, 15 to 20 minutes. Put the confectioners' sugar in a pie plate. Briefly cool the cookies on a rack, then gently toss in the confectioners' sugar until evenly coated. Return to rack, cool to room temperature, and then toss again in the confectioners' sugar.\n            \n", "ingredients": [{"food": "pasta with sliced franks in tomato sauce", "quantity": 0.75}, {"food": "sugar", "quantity": 0.75}, {"food": "butter oil", "quantity": 0.75}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 0.125}, {"food": "potato flour", "quantity": 1.6666666666666665}, {"food": "salt", "quantity": 0.5}, {"food": "sugar", "quantity": 1.0}], "title": "\nAlmond Snowball Cookies\n"}, {"directions": "\n\n              Line an 8-inch square baking dish with parchment paper, leaving a 2-inch overhang; coat with cooking spray. Bring the honey and granulated sugar to a simmer in a small saucepan over medium heat, stirring to dissolve. Remove from the heat and transfer to a large bowl. Stir in the cinnamon, cloves and nutmeg; let cool slightly, 10 minutes.\n            \n\n              Whisk the flour, baking powder and salt in a medium bowl. Quickly stir the beaten egg into the honey-sugar mixture with a rubber spatula, then add the almonds, orange peel, vanilla, lemon zest and 1 tablespoon liqueur. Stir in the flour mixture until combined (the dough will be stiff and dry). Scrape into the prepared pan. Lightly coat a piece of plastic wrap with cooking spray and use to press the dough into an even layer. Set aside 1 hour.\n            \n\n              Preheat the oven to 375 degrees F. Bake the bars until golden brown and a toothpick inserted into the center comes out with only a few crumbs, 25 to 30 minutes.\n            \n\n              Make the glaze: Whisk the confectioners' sugar, orange juice and remaining 1 tablespoon\n            \n\n              liqueur in a bowl until smooth. Brush the warm bars with some of the glaze; cover the remaining glaze and set aside. Let the bars cool 10 minutes in the pan, then remove to a cutting board. Cut into 1-by-2 1/2-inch bars and let cool completely on a rack.\n            \n\n              Drizzle the bars with the remaining glaze; top with candied orange peel.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "honey smoked ham", "quantity": 0.5}, {"food": "sugar", "quantity": 0.5}, {"food": "cinnamon", "quantity": 1.0}, {"food": "cloves", "quantity": 0.25}, {"food": "nutmeg", "quantity": 0.25}, {"food": "potato flour", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 1.5}, {"food": "salt", "quantity": 0.25}, {"food": "egg substitute", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.5}, {"food": "orange peel", "quantity": 0.25}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "orange", "quantity": 2.0}, {"food": "sugar", "quantity": 0.5}, {"food": "orange juice", "quantity": 1.0}], "title": "\nAlmond Spice Bars\n"}, {"directions": "\n\n              Whisk the almond flour, salt and baking soda in a bowl. Beat the butter and sugar in a separate bowl with a mixer until light and fluffy. Beat in the egg and vanilla until smooth, then mix in the dry ingredients. Refrigerate the dough until firm, about 30 minutes.\n            \n\n              Preheat the oven to 350 degrees F. Line 2 baking sheets with silicone mats or parchment paper. Drop heaping teaspoonfuls of dough about 3 inches apart on the prepared sheets. Bake until golden and crisp, about 8 minutes.\n            \n\n              Let the cookies cool about 2 minutes on the baking sheets. One at a time, gently lift each cookie with an offset spatula. Immediately wrap it around the handle of a wooden spoon to curl. Once it sets, slide the cookie off the handle and let cool on a rack. Repeat with the remaining dough, allowing the baking sheets to cool between batches. (Don't make too many cookies at once; they need to be shaped while still warm.) Serve with sorbet.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.25}, {"food": "salt", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 0.75}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "fruit cocktail", "quantity": 1}], "title": "\nAlmond Tuiles\n"}, {"directions": "\n\n              Line 2 baking sheets with parchment paper. Whisk the all-purpose flour, cornstarch and salt in a medium bowl; set aside. Beat the butter, granulated sugar, almond butter, honey and almond extract in a large bowl with a mixer on medium speed until light and fluffy, about 2 minutes. Beat in the heavy cream, 1 tablespoon at a time, then beat in the almond flour until well combined. Reduce the mixer speed to low; gradually add the dry ingredients and beat until just combined. Transfer to a pastry bag fitted with a large star tip.\n            \n\n              Pipe 2 1/2-inch rings about 2 inches apart onto the prepared baking sheets. (If the dough is too stiff to pipe, let soften slightly at room temperature.) Decorate the cookies with sanding sugar and/or nonpareils. Refrigerate the cookies until firm, about 1 hour.\n            \n\n              Position racks in the upper and lower thirds of the oven; preheat to 350 degrees F. Bake, switching the pans halfway through, until the cookies are lightly golden around the edges, about 18 minutes. Let cool completely on the baking sheets.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.3333333333333333}, {"food": "cornstarch", "quantity": 0.6666666666666666}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 2.0}, {"food": "sugar", "quantity": 0.75}, {"food": "almond butter", "quantity": 2.0}, {"food": "honey smoked ham", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1}, {"food": "ice cream swich", "quantity": 3.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "sugar", "quantity": 1}], "title": "\nAlmond Wreaths\n"}, {"directions": "\n\n              Thinly slice a baguette; arrange in a single layer on a baking sheet. Brush with softened butter and sprinkle with salt and sugar. Bake at 425 degrees F until lightly golden, about 7 minutes. Let cool slightly.\n            \n\n              Spread softened almond paste on the toast rounds. Press toasted pine nuts into the paste, then brush with melted butter; dust with confectioners' sugar.\n            \n\n              Photograph by Andrew McCaul\n            \n", "ingredients": [], "title": "\nAlmond-Pine Nut Bruschetta\n"}, {"directions": "\n\n              Chop the chocolate and put in a heatproof bowl. Bring the heavy cream, butter and salt to a simmer in a saucepan over medium heat; pour over the chocolate and let sit until completely melted, about 10 minutes. Stir with a rubber spatula or whisk until smooth. (If necessary, microwave in 20-second intervals until the chocolate melts.) \n            \n\n              Whisk in the vanilla and almond extracts and the rum. Stir until the ganache is smooth and shiny. Pour into a shallow baking dish and refrigerate until firm, at least 3 hours or overnight. \n            \n\n              Roll tablespoonfuls of the ganache into 18 to 24 balls, then roll in crushed amaretti cookies. Transfer to a parchment-lined baking sheet, cover with plastic wrap and refrigerate until firm, at least 1 hour or overnight. (To make these in advance, roll into balls but do not coat; cover and freeze up to 2 weeks. Let sit at room temperature for 20 minutes before uncovering, then roll in coating.)\n            \n\n              Photograph by Johnny Miller\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 12.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "", "quantity": 0.25}, {"food": "chocolate chip cookies", "quantity": 1}], "title": "\nAlmond-Rum Chocolate Truffles With Amaretti Cookies\n"}, {"directions": "\n\n              For the pancake mix: Put the oats in the bowl of a food processor and pulse a few times until chopped. Add the flour, sugar, baking powder, baking soda, salt and lemon zest and pulse a few more times to combine. Add the oil and lemon juice and pulse to moisten the dry ingredients. Store in a resealable plastic container in the refrigerator for up to 2 weeks.\n            \n\n              For the pancakes: Whisk together the pancake mix, milk and egg in a medium bowl until combined.\n            \n\n              Heat a large nonstick skillet over medium heat. Lightly coat the skillet with a bit of butter or cooking spray. Drop 1/4 cup batter per pancake into the skillet; you will be able to make about 3 pancakes at a time. Cook until the edges are set and the tops are bubbly, about 2 minutes. Flip and cook until the bottoms are browned, another 1 to 2 minutes. Repeat with the remaining batter. Serve warm with your favorite toppings.\n            \n", "ingredients": [{"food": "oats", "quantity": 1.0}, {"food": "potato flour", "quantity": 3.0}, {"food": "sugar", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "salt", "quantity": 0.75}, {"food": "lemon juice", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.75}, {"food": "lemon juice", "quantity": 1.0}, {"food": "cheesecake mix", "quantity": 1.0}, {"food": "milk", "quantity": 0.3333333333333333}, {"food": "egg substitute", "quantity": 1.0}, {"food": "barley flour or meal", "quantity": 1}, {"food": "blueberries", "quantity": 1}], "title": "\nAlmost Instant Pancake Mix\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Heat the vegetable oil in a large skillet over medium-low heat. Add the onions and 3/4 teaspoon salt, cover and cook, stirring occasionally, until golden and soft, about 30 minutes. (If the onions brown too quickly, reduce the heat to low.) Uncover, increase the heat to medium high and continue to cook, stirring often, until caramelized, about 8 more minutes. Add 1/2 cup water to the skillet, scraping up any browned bits from the bottom of the pan. Simmer, stirring, until the water evaporates, about 2 more minutes; transfer to a bowl and set aside. (The onions can be made up to 3 days ahead; cover and refrigerate, then reheat before using.)\n            \n\n              Mix the mayonnaise, ketchup, relish and vinegar in a bowl; set aside. Shape the beef into 8 patties, about 4 inches wide and 1/2 inch thick.\n            \n\n              Heat a griddle or skillet over medium heat; lightly brush with vegetable oil. Toast the buns on the griddle, split-side down. Spread each toasted bun bottom with about 1 tablespoon of the mayonnaise mixture, then top with a few pickles, some lettuce, 1 or 2 slices tomato and another dollop of the mayonnaise mixture; set aside. (Keep the griddle hot.)\n            \n\n              Season both sides of the patties with salt and pepper. Working in batches if necessary, put the patties on the griddle and cook 3 minutes. Spread about 1 1/2 teaspoons mustard on the uncooked side of each patty, then flip and top each with 1 slice cheese; continue cooking about 2 more minutes for medium doneness. Top 4 of the patties with caramelized onions, then cover with the remaining patties, cheese-side up. Sandwich the double patties on the buns.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "onions", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "mayonnaise dressing", "quantity": 0.25}, {"food": "", "quantity": 2.0}, {"food": "pickle relish", "quantity": 1.0}, {"food": "vinegar", "quantity": 0.5}, {"food": "frankfurter beef", "quantity": 2.0}, {"food": "split pea soup", "quantity": 4.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.25}, {"food": "lettuce", "quantity": 0.75}, {"food": "pasta with tomato sauce", "quantity": 4.0}, {"food": "pepper", "quantity": 1}, {"food": "mustard spinach", "quantity": 0.25}, {"food": "macaroni cheese", "quantity": 8.0}], "title": "\nAlmost-Famous Animal-Style Burgers\n"}, {"directions": "\n\n              Brush a large bowl with olive oil. Shape the pizza dough into a ball, add it to the bowl and turn to coat with the oil. Cover tightly with plastic wrap and set aside in a warm place, 30 to 40 minutes. \n            \n\n              Position racks in the upper third and middle of the oven. Place a pizza stone or inverted baking sheet on the top rack and preheat the oven to 425 degrees F for at least 30 minutes. \n            \n\n              Meanwhile, lay out a sheet of parchment paper and brush with olive oil. Transfer the ball of dough to the parchment and roll it out into a 10-inch round, stretching it with your hands as needed. Lightly brush the dough with olive oil, cover with another piece of parchment and set aside to let rise slightly, about 30 minutes. \n            \n\n              While the dough rises, mix 2 tablespoons barbecue sauce and 1 teaspoon olive oil in a small bowl. Put the chicken in a baking dish, season with salt and pepper and brush with the barbecue sauce mixture. Bake on the middle oven rack until cooked through, about 20 minutes. Let cool, then cut into 1/2-inch cubes. \n            \n\n              Uncover the dough and spread with the remaining 1/3 cup barbecue sauce, leaving a 3/4-inch border. Top with the chicken, gouda, mozzarella and red onion. Slide the pizza (on the parchment) onto a pizza peel or another inverted baking sheet, then slide onto the hot stone or baking sheet; bake until the cheese melts and the crust is golden, 20 to 25 minutes. Sprinkle with cilantro. \n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "pizza rolls", "quantity": 0.5}, {"food": "Worcestershire sauce", "quantity": 0.3333333333333333}, {"food": "fat free chicken breast ", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "smoked turkey roll", "quantity": 0.6666666666666666}, {"food": "macaroni cheese", "quantity": 0.6666666666666666}, {"food": "onion powder", "quantity": 0.5}, {"food": "dessert topping", "quantity": 1}], "title": "\nAlmost-Famous Barbecue Chicken Pizza\n"}, {"directions": "\n\n              Make the marinade: Whisk the brown sugar, vinegar, onion, garlic, 1 tablespoon salt and 1/2 teaspoon black pepper in a bowl. Put the ribs meat-side down on a cutting board. Starting at one end, slip a paring knife under the membrane that covers the back of the rack. Loosen the membrane with the knife, then pull it off. Coat the ribs on both sides with the marinade; wrap in plastic wrap and refrigerate overnight.\n            \n\n              Make the rub: Mix the brown sugar, chili powder, garlic powder, onion powder, celery salt, celery seeds, cayenne, 1 tablespoon salt and 1 teaspoon black pepper in a bowl.\n            \n\n              Soak 2 cups hickory wood chips in water, 30 to 40 minutes. Meanwhile, preheat a grill to medium low (275 degrees F) and prepare for indirect grilling: For a charcoal grill, bank the coals to one side; for a gas grill, turn off the burners on one side. Cover the grate on the cooler side of the grill with foil.\n            \n\n              Drain the wood chips. For a charcoal grill, scatter the chips over the hot coals; for a gas grill, put the chips in a smoker box and place over direct heat. Close the lid and allow smoke to build up, about 10 minutes. Rinse the marinade off the ribs and pat dry with paper towels. Work the spice rub into both sides of each rack with your hands.\n            \n\n              Place the ribs, meat-side up, on the foil over indirect heat. Close the lid and cook, undisturbed, until the meat shrinks back slightly to expose a bit of the bone, about 1 hour, 30 minutes.\n            \n\n              Rotate the ribs (keep them meat-side up and over indirect heat), then close the lid and continue cooking, 2 hours to 2 hours, 30 minutes. (For a charcoal grill, add more hot coals as needed to maintain the temperature.)\n            \n\n              Meanwhile, make the barbecue sauce: Heat the vegetable oil in a medium saucepan over medium heat. Add the garlic and cook, stirring occasionally, until golden, about 1 minute. Stir in the tomato paste and chili powder until incorporated, about 1 minute. Whisk in the vinegar, 1/4 cup water, the molasses, Worcestershire sauce, honey, mustard powder, espresso powder, 3/4 teaspoon black pepper and the cayenne. Bring to a simmer and cook, whisking occasionally, 5 minutes. Whisk in the ketchup and pineapple preserves. Bring to a gentle simmer and cook, whisking occasionally, until thickened, about 45 minutes. Whisk in the liquid smoke. Let the sauce cool to room temperature, then remove the garlic. (The sauce will keep, refrigerated, up to 2 weeks.)\n            \n\n              Baste the ribs generously with the prepared barbecue sauce. Close the lid and continue cooking until glazed, about 20 more minutes. Transfer to a cutting board; let rest a few minutes before cutting into individual ribs. Serve with more sauce on the side.\n            \n\n              Photograph by Paul Sirisalee\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "sugar", "quantity": 0.25}, {"food": "vinegar", "quantity": 2.0}, {"food": "onion powder", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "pork skins", "quantity": 2.0}, {"food": "", "quantity": 1}, {"food": "sugar", "quantity": 0.5}, {"food": "chili powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "celery seed", "quantity": 1.0}, {"food": "celery seed", "quantity": 1.0}, {"food": "pepper", "quantity": 0.25}, {"food": "Worcestershire sauce", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "pasta with tomato sauce", "quantity": 0.25}, {"food": "vinegar", "quantity": 1.75}, {"food": "molasses", "quantity": 0.25}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "honey smoked ham", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "onion powder", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "pepper", "quantity": 0.5}, {"food": "", "quantity": 1.0}, {"food": "pineapple chunks", "quantity": 1.0}, {"food": "", "quantity": 0.5}], "title": "\nAlmost-Famous Barbecue Spareribs\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Combine all of the dip ingredients in a bowl, cover and refrigerate.\n            \n\n              Slice the onion (see Cook's Note). Whisk the flour, cayenne, paprika, thyme, oregano, cumin and 1/2 teaspoon black pepper in a bowl. In a small deep bowl, whisk the eggs, milk and 1 cup water.\n            \n\n              Place the onion in a separate bowl, cut-side up, and pour all of the flour mixture on top. Cover the bowl with a plate, then shake back and forth to distribute the flour. Check to make sure the onion is fully coated, especially between the \"petals.\" Lift the onion by the core, turn over and pat off the excess flour; reserve the bowl of flour.\n            \n\n              Using a slotted spoon, fully submerge the onion in the egg mixture (spoon on top, if necessary). Remove and let the excess egg drip off, then repeat the flouring process. Refrigerate the onion while you heat the oil.\n            \n\n              Heat the oil in a large deep pot over medium-high heat until a deep-fry thermometer registers 400 degrees. Pat off excess flour from the onion. Using a wire skimmer, carefully lower the onion into the oil, cut-side down. Adjust the heat so the oil temperature stays close to 350 degrees. Fry about 3 minutes, then turn the onion over and cook until golden, about 3 more minutes; drain on paper towels. Season with salt and serve with the dip.\n            \n\n              Photograph by Kate Mathis; Illustration by Brown Bird Design\n            \n", "ingredients": [{"food": "mayonnaise dressing", "quantity": 2.0}, {"food": "sour cream", "quantity": 2.0}, {"food": "", "quantity": 1.5}, {"food": "Worcestershire sauce", "quantity": 0.5}, {"food": "horseradish", "quantity": 1.0}, {"food": "paprika", "quantity": 0.25}, {"food": "hearts of palm", "quantity": 1}, {"food": "black bean mango", "quantity": 1}, {"food": "sweet potatoes", "quantity": 1.0}, {"food": "potato flour", "quantity": 2.5}, {"food": "pepper", "quantity": 1.0}, {"food": "paprika", "quantity": 2.0}, {"food": "thyme", "quantity": 0.5}, {"food": "", "quantity": 0.5}, {"food": "cumin seed", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "eggs", "quantity": 2.0}, {"food": "whole milk", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "salt", "quantity": 1}], "title": "\nAlmost-Famous Bloomin' Onion\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Make the dough: Place 1/4 cup warm water in the bowl of a mixer; sprinkle in the yeast and set aside until foamy, about 5 minutes. Add the flour, butter, sugar, fine salt and 1 1/4 cups plus 2 tablespoons warm water; mix with the paddle attachment until a slightly sticky dough forms, 5 minutes.\n            \n\n              Knead the dough by hand on a floured surface until very smooth and soft, 3 minutes. Roll into a 2-foot-long log; cut into 16 1 1/2-inch-long pieces. Knead each piece slightly and shape into a 7-inch-long breadstick; arrange 2 inches apart on a parchment-lined baking sheet. Cover with a cloth; let rise in a warm spot until almost doubled, about 45 minutes.\n            \n\n              Preheat the oven to 400 degrees. Make the topping: Brush the breadsticks with 1 1/2 tablespoons of the butter and sprinkle with 1/4 teaspoon kosher salt. Bake until lightly golden, about 15 minutes. Meanwhile, combine the remaining 1/4 teaspoon salt with the garlic powder and oregano. Brush the warm breadsticks with the remaining 1 1/2 tablespoons melted butter and sprinkle with the flavored salt.\n            \n\n              Photograph by Kate Sears\n            \n", "ingredients": [{"food": "yeast extract spread", "quantity": 1.0}, {"food": "", "quantity": 4.25}, {"food": "", "quantity": 2.0}, {"food": "sugar", "quantity": 2.0}, {"food": "salt", "quantity": 1.0}, {"food": "", "quantity": 3.0}, {"food": "salt", "quantity": 0.5}, {"food": "garlic powder", "quantity": 0.375}, {"food": "hearts of palm", "quantity": 1}], "title": "\nAlmost-Famous Breadsticks\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Melt the butter in a large Dutch oven or pot over medium heat. Add the onion and cook until tender, about 5 minutes. Whisk in the flour and cook until golden, 3 to 4 minutes, then gradually whisk in the half-and-half until smooth. Add the chicken broth, bay leaves and nutmeg, then season with salt and pepper and bring to a simmer. Reduce the heat to medium-low and cook, uncovered, until thickened, about 20 minutes.\n            \n\n              Meanwhile, prepare the bread bowls: Using a sharp knife, cut a circle into the top of each loaf, leaving a 1-inch border all around. Remove the bread top, then hollow out the middle with a fork or your fingers, leaving a thick bread shell.\n            \n\n              Add the broccoli and carrot to the broth mixture and simmer until tender, about 20 minutes. Discard the bay leaves. Puree the soup in batches in a blender until smooth; you'll still have flecks of carrot and broccoli. Return to the pot. (Or puree the soup in the pot with an immersion blender.)\n            \n\n              Add the cheese to the soup and whisk over medium heat until melted. Add up to 3/4 cup water if the soup is too thick. Ladle into the bread bowls and garnish with cheese.\n            \n\n              Photograph by Kate Mathis\n            \n", "ingredients": [{"food": "butter oil", "quantity": 6.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "potato flour", "quantity": 0.25}, {"food": "", "quantity": 2.0}, {"food": "diced chicken", "quantity": 3.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "nutmeg", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "garlic bread", "quantity": 4.0}, {"food": "broccoli raab", "quantity": 4.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "cheddar cheese", "quantity": 2.5}], "title": "\nAlmost-Famous Broccoli-Cheddar Soup\n"}, {"directions": "\n\n              Put the vegetable oil and a few test popcorn kernels in a large pot. Heat over medium-high heat until the kernels pop, then carefully add the remaining kernels in a single layer. Cover and cook, shaking the pot, until there are several seconds between pops. Transfer the popcorn to a bowl. Lightly oil a baking sheet.\n            \n\n              Wipe out the pot, then add the sugar, corn syrup, molasses, peanut oil, 1/4 teaspoon salt and the peanuts. Cook over medium-high heat, stirring often, until a candy thermometer registers 290 degrees F, about 8 minutes. Remove from the heat and stir in the popcorn until coated. Transfer the caramel corn to the prepared baking sheet and let cool, then break into small pieces.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "sunflower seed kernels", "quantity": 0.3333333333333333}, {"food": "sugar", "quantity": 1.0}, {"food": "corn bran", "quantity": 3.0}, {"food": "molasses", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "peanuts", "quantity": 0.5}], "title": "\nAlmost-Famous Caramel Corn\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Position a rack in the upper third of the oven and preheat to 425 degrees. Lightly mist a large baking sheet with cooking spray.\n            \n\n              Make the biscuits: Pulse the flour, baking powder, sugar and salt in a food processor. Add the shortening and pulse until combined. Add the butter; pulse 4 or 5 times, or until the butter is in pea-size pieces. Add the cheese and pulse 2 or 3 times. Pour in the milk and pulse just until the mixture is moistened and forms a shaggy dough. Turn out onto a clean surface and gently knead until the dough comes together. Do not overwork the dough or the biscuits will be tough.\n            \n\n              Drop the dough onto the baking sheet in scant 1/4-cup portions, 2 inches apart, and bake until golden, 15 to 20 minutes.\n            \n\n              Meanwhile, make the garlic butter: Melt the butter with the garlic in a small saucepan over medium heat; cook for 1 minute. Remove from the heat and stir in the parsley. Brush the biscuits with the garlic butter and serve warm.\n            \n\n              Photograph by Kate Mathis\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 1.75}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "sugar", "quantity": 2.5}, {"food": "salt", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "butter oil", "quantity": 4.5}, {"food": "cheddar cheese", "quantity": 6.0}, {"food": "whole milk", "quantity": 0.75}, {"food": "butter oil", "quantity": 3.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "parsley", "quantity": 1.0}], "title": "\nAlmost-Famous Cheddar Biscuits\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Mix the strawberries, jam and 2 tablespoons warm water in a bowl; set aside. Preheat the oven to 200 degrees F.\n            \n\n              Pulse the flour, buttermilk, egg, vegetable oil, granulated sugar, baking powder, baking soda and salt in a blender until smooth. Transfer to a bowl and stir in the cheesecake pieces, keeping them whole.\n            \n\n              Coat a large nonstick skillet or griddle with cooking spray and heat over medium heat. Working in batches, pour about 1/4 cup batter into the skillet for each pancake. Cook until bubbly on top, about 4 minutes, then flip and cook until the other side is golden brown, about 2 more minutes. Transfer the finished pancakes to a baking sheet and keep warm in the oven. Serve the pancakes topped with the strawberry sauce; top with butter, confectioners' sugar or whipped cream, if desired.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [{"food": "pasta with sliced franks in tomato sauce", "quantity": 1.5}, {"food": "silk strawberry soy yogurt", "quantity": 2.0}, {"food": "potato flour", "quantity": 11.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 11.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "sugar", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "cheesecake mix", "quantity": 2.0}, {"food": "", "quantity": 1}, {"food": "whipped topping", "quantity": 1}], "title": "\nAlmost-Famous Cheesecake Pancakes\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Prepare the chicken: Whisk the egg white, cornstarch and rice wine in a bowl. Add the chicken and toss to coat. Cover and refrigerate at least 30 minutes. Make the stir-fry sauce: Whisk 1/3 cup water, the oyster, hoisin and soy sauces, the rice wine and sesame oil in a bowl, then whisk in the cornstarch until dissolved.\n            \n\n              Fry the noodles: Pull the noodles apart into sections. Heat 3/4 inch peanut oil in a medium saucepan until a deep-fry thermometer registers 380 degrees F. Working in batches, press the noodles into the oil with a spatula until they puff, 5 to 10 seconds. Drain on paper towels.\n            \n\n              Make the stir-fry: Heat 2 tablespoons peanut oil in a large skillet over medium-high heat. Add the chicken and cook, stirring, 2 to 3 minutes. Remove with a slotted spoon to a plate. Add the remaining 2 tablespoons peanut oil to the skillet; when almost smoking, stir in the garlic, ginger, jalapeno and minced scallions, then add 1/2 teaspoon salt and the sugar and stir-fry 30 seconds. Add the mushrooms, water chestnuts and scallion pieces and stir-fry 2 minutes. Add the stir-fry sauce and chicken and cook 1 minute. Make a bed of noodles on a platter and top with the chicken mixture. Serve the noodles and stir-fry with lettuce leaves and soy sauce for dipping. Photograph by Andrew Mccaul\n            \n", "ingredients": [{"food": "egg substitute", "quantity": 1.0}, {"food": "cornstarch", "quantity": 1.0}, {"food": "crisped rice bar", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.5}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "soy sauce", "quantity": 1.0}, {"food": "crisped rice bar", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "cornstarch", "quantity": 2.0}, {"food": "noodles", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "vegetable oil", "quantity": 4.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "ginger", "quantity": 1.0}, {"food": "pepper", "quantity": 1.0}, {"food": "", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "sugar", "quantity": 0.25}, {"food": "diced chicken", "quantity": 0.5}, {"food": "diced chicken", "quantity": 0.75}, {"food": "chrysanthemum leaves", "quantity": 1}, {"food": "Worcestershire sauce", "quantity": 1}], "title": "\nAlmost-Famous Chicken Lettuce Wraps\n"}, {"directions": "\n\n              Cut the chicken breasts in half horizontally to make 4 thin cutlets. Place the cutlets between 2 pieces of heavy-duty plastic wrap and pound to 1/8-inch thick with a mallet or heavy skillet. Season the chicken with 1 teaspoon salt and 1/2 teaspoon each pepper and paprika. \n            \n\n              Heat about 2 inches peanut oil in a heavy-bottomed pot over medium heat until a deep-fry thermometer registers 325 degrees F. Meanwhile, whisk the egg, milk and 2 tablespoons water in a baking dish. Whisk both flours, the malted milk powder, confectioners sugar, baking soda, dry mustard, the remaining 1/2 teaspoon paprika and 1 teaspoon each salt and pepper in another dish. Toss the pickle slices, pickle juice and vinegar in a bowl and set aside. \n            \n\n              Working in batches, dip the chicken in the egg mixture, turning to coat, then dredge in the flour mixture and shake off any excess. Fry the chicken in the hot oil until golden brown, about 4 minutes, adjusting the heat as needed. Drain on paper towels. \n            \n\n              Heat a large skillet over medium heat. Spread the cut sides of the buns with some of the butter and lightly toast in the skillet, buttered-side down; spread with more butter. Put 2 pickle slices on each bun bottom; top with a piece of chicken and cover with the bun tops. \n            \n\n              Photograph by Kate Sears\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "paprika", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "egg substitute", "quantity": 1.0}, {"food": "milk", "quantity": 0.5}, {"food": "potato flour", "quantity": 0.75}, {"food": "potato flour", "quantity": 0.25}, {"food": "milk", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "mustard spinach", "quantity": 0.25}, {"food": "pickle loaf", "quantity": 1.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "split pea soup", "quantity": 4.0}, {"food": "butter oil", "quantity": 1.0}], "title": "\nAlmost-Famous Chicken Sandwiches\n"}, {"directions": "\n\n              Preheat the oven to 450 degrees F. Melt the butter with 2 tablespoons vegetable oil in a skillet; transfer to a bowl. Heat the remaining 2 tablespoons oil in the skillet. Add the onion, garlic and jalapeno and cook until soft, about 3 minutes. Add the chili powder, cumin, cinnamon and 1 teaspoon salt; toast 30 seconds. Add the tomato and cilantro and cook until slightly dry, about 2 minutes. Stir in the chicken and sour cream and warm through. Remove from the heat.\n            \n\n              Brush a rimmed baking sheet with some of the butter-oil mixture. Spread 2 tablespoons refried beans down the center of each tortilla, leaving a 2-inch border on both ends. Top with 1 cup chicken mixture and 1/4 cup cheese. Fold in the ends and roll up.\n            \n\n              Put the chimichangas seam-side down on the baking sheet; brush with the butter-oil mixture. Bake 8 to 10 minutes per side, brushing again after you flip. Top with the sauce, more cheese, lettuce and tomato. Serve with rice and the remaining beans.\n            \n\n              Make Chi-Chi's Mexi-sauce:\n            \n\n              Saute 1/2 cup chopped onion and 2 chopped garlic cloves in a skillet with vegetable oil. Add a pinch each of chili powder, cumin, sugar and salt; cook 30 seconds. Stir in two 4-ounce cans chopped green chiles (drained and rinsed); cook 2 minutes. Add 1 cup chicken broth and simmer until thickened, then puree. Stir in 1/4 cup chopped cilantro.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 4.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "chili powder", "quantity": 1.5}, {"food": "cumin seed", "quantity": 0.5}, {"food": "cinnamon", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "", "quantity": 2.0}, {"food": "diced chicken", "quantity": 2.5}, {"food": "sour cream", "quantity": 0.25}, {"food": "refried beans", "quantity": 1.0}, {"food": "potato flour", "quantity": 4.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "dessert topping", "quantity": 1}, {"food": "lettuce", "quantity": 1}, {"food": "crisped rice bar", "quantity": 1}], "title": "\nAlmost-Famous Chimichangas\n"}, {"directions": "\n\n              Make the cake: Prepare the cake mix as the label directs for a 9-by-13-inch cake. Bake; cool slightly in the pan, then invert onto a rack to cool completely.\n            \n\n              Clean out the cake pan and line it with plastic wrap. Cut the cake in half lengthwise, then in thirds crosswise to make 6 rectangles. Using a serrated knife, slice each rectangle in half to make two layers. Arrange half of the pieces snugly in the cake pan. Crumble the remaining pieces and press tightly into 6 small balls; arrange 1 cake ball in the center of each cake rectangle in the pan.\n            \n\n              Make the mousse: Heat the chocolate, butter, coffee and 1/4 cup water in a heatproof bowl set over a saucepan of simmering water (do not let the bowl touch the water), stirring, until melted. Remove the bowl from the pan; stir until cool. Reserve the simmering water. Fill a large bowl with ice water.\n            \n\n              Whisk the egg yolks, 1 1/2 cups sugar and 2 tablespoons water in a separate large heatproof bowl. Set the bowl over the saucepan of simmering water and whisk until pale yellow, 6 to 8 minutes. Add the chocolate-coffee mixture and the vanilla and whisk until combined, about 2 minutes. Remove the bowl from the pan and set in the bowl of ice water; whisk until slightly cool but not thick, about 4 minutes.\n            \n\n              Beat the egg whites and salt in a bowl with a mixer until foamy. Add 2 tablespoons sugar and beat until almost stiff; gently fold into the chocolate-yolk mixture to make a dark chocolate mousse. Spread 5 cups over the cake and cake balls. Freeze until firm on top, about 30 minutes.\n            \n\n              Beat the heavy cream and the remaining 4 tablespoons sugar until soft peaks form; fold into the remaining mousse. Remove the cake from the freezer; spread with the light chocolate mousse, cover with plastic wrap and freeze until firm, at least 6 hours or overnight.\n            \n\n              Make the chocolate shell: Stir the chocolate, heavy cream and 4 tablespoons corn syrup in a heatproof bowl set over a saucepan of simmering water (do not let the bowl touch the water) until melted. A spoonful at a time, spread half of the shell mixture over the frozen mousse. Return to the freezer.\n            \n\n              Make the chocolate sauce: Add the remaining 1 tablespoon corn syrup and the butter to the remaining chocolate shell mixture. Microwave 30 seconds, then stir until glossy.\n            \n\n              To serve the cake, beat the heavy cream with a mixer until foamy. Add the sugar and beat until soft peaks form. Remove the cake from the freezer; invert onto a baking sheet and unmold, then invert again onto a platter, chocolate shell-side up.\n            \n\n              Cut the cake in half lengthwise using a warm knife, then cut into thirds crosswise to make 6 rectangles; cut each rectangle in half diagonally to make 2 triangles. Top each triangle with whipped cream, ice cream and the prepared chocolate sauce.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [{"food": "shortening cake mix", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 14.0}, {"food": "", "quantity": 12.0}, {"food": "silk coffee", "quantity": 0.25}, {"food": "eggs", "quantity": 10.0}, {"food": "sugar", "quantity": 1.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 12.0}, {"food": "ice cream swich", "quantity": 0.75}, {"food": "silk light vanilla", "quantity": 5.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 1.5}, {"food": "sugar", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1.0}], "title": "\nAlmost-Famous Chocolate Mousse Cake\n"}, {"directions": "\n\n              Make the dough: Warm the milk in a medium saucepan over low heat until it reaches about 100. Remove from the heat and sprinkle in the yeast and 1/4 teaspoon sugar (don't stir). Set aside until foamy, 5 minutes. Whisk in the melted butter, egg yolk and vanilla.\n            \n\n              Whisk the flour, the remaining 1/4 cup sugar, the salt and nutmeg in the bowl of a stand mixer. Make a well in the center and pour in the yeast mixture. Mix on low speed with the dough hook until thick and slightly sticky. Knead on medium speed until the dough gathers around the hook, 6 minutes. (Add up to 2 more tablespoons flour if necessary.)\n            \n\n              Remove the dough and shape into a ball. Butter the mixer bowl and return the dough to the bowl, turning to coat with butter. Cover with plastic wrap and let rise until doubled, 1 hour 15 minutes.\n            \n\n              Roll out the dough, fill and cut into buns (see Cook's Note). Butter a 9-by-13-inch baking pan; place the buns cut-side down in the pan, leaving space between each. Cover with plastic wrap and let rise until doubled, 40 minutes. Preheat the oven to 325.\n            \n\n              Bake the buns until golden brown, about 35 minutes. Cool in the pan 15 minutes. Meanwhile, make the glaze: Sift the confectioners' sugar into a bowl, then whisk in the cream and melted butter. Transfer the buns to a rack and spoon the glaze on top while still warm.\n            \n\n              Photograph by Ngoc Minh Ngo\n            \n", "ingredients": [{"food": "whole milk", "quantity": 1.0}, {"food": "", "quantity": 0.25}, {"food": "sugar", "quantity": 0.5}, {"food": "healthy request microwavable bowl", "quantity": 4.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.5}, {"food": "potato flour", "quantity": 2.75}, {"food": "salt", "quantity": 0.75}, {"food": "nutmeg", "quantity": 0.5}, {"food": "", "quantity": 1}, {"food": "butter oil", "quantity": 12.0}, {"food": "sugar", "quantity": 0.5}, {"food": "cinnamon", "quantity": 3.0}, {"food": "sugar", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 0.3333333333333333}, {"food": "butter oil", "quantity": 4.0}], "title": "\nAlmost-Famous Cinnamon Buns\n"}, {"directions": "\nSpecial equipment: Food decorating pens, for writing\n\n              Whisk the gelatin, corn syrup, vanilla, salt and 1/2 cup boiling water in a stand mixer bowl until the gelatin dissolves. Using the paddle attachment, beat in the confectioners' sugar on medium-low speed, 1 cup at a time, to make a stiff, sticky dough.\n            \n\n              Transfer the dough to a clean surface and knead, adding more confectioners' sugar as needed (up to 1 cup), until the dough is smooth, pliable and slightly tacky, about 5 minutes.\n            \n\n              Divide the dough into 4 pieces. Flatten 1 piece into a disk. (Cover the rest with plastic wrap.) Add a few drops each of food coloring and extract to the center of the dough; fold in the sides and pinch closed, then knead until the color is distributed.\n            \n\n              Lightly coat a large piece of parchment paper with cooking spray. Roll out the colored dough on the parchment until 1/8 to 1/4 inch thick. Cut into hearts using 1-inch cookie cutters; transfer to a parchment-lined baking sheet. Repeat with the remaining dough, using different colors and extracts. Let the hearts sit at room temperature, uncovered, until dry and hard, about 24 hours, flipping them halfway through. Write messages on the hearts using food decorating pens. Store in an airtight container for up to 1 week.\n            \n\n              Photograph by Sam Kaplan\n            \n", "ingredients": [{"food": "onion powder", "quantity": 1.25}, {"food": "silk light vanilla", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "salt", "quantity": 0.125}, {"food": "sugar", "quantity": 2.0}, {"food": "", "quantity": 1}, {"food": "silk strawberry soy yogurt", "quantity": 1}, {"food": "", "quantity": 1}], "title": "\nAlmost-Famous Conversation Hearts\n"}, {"directions": "\n\n              Preheat a grill to medium high. Brush the poblano with 1 teaspoon olive oil and grill, skin-side down, until charred but still firm, about 5 minutes. Cool slightly; peel and finely chop.\n            \n\n              If using fresh corn, bring a small pot of salted water to a boil. Add the corn and cook until tender, 2 to 3 minutes; drain.\n            \n\n              Mix the corn (if using frozen, add it here), poblano, jalapeno, cilantro and red onion in a bowl. Stir in the remaining 2 teaspoons olive oil, the lime juice, sugar and 1/2 teaspoon salt.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [{"food": "pepper", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "corn bran", "quantity": 1.0}, {"food": "pepper", "quantity": 1.0}, {"food": "", "quantity": 2.0}, {"food": "onion powder", "quantity": 2.0}, {"food": "lime juice", "quantity": 2.0}, {"food": "sugar", "quantity": 0.5}], "title": "\nAlmost-Famous Corn Salsa\n"}, {"directions": "\n\n              Finely grate the zest of half of the orange into a medium saucepan, then squeeze in all of the juice. Add the cranberries, sugar and walnuts and cook over medium heat, stirring occasionally, until the mixture thickens and the cranberries start to pop, about 10 minutes. Let cool.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [{"food": "orange", "quantity": 1.0}, {"food": "frozen yogurt", "quantity": 2.0}, {"food": "sugar", "quantity": 0.75}, {"food": "", "quantity": 0.25}], "title": "\nAlmost-Famous Cranberry Walnut Relish\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Make the sauce: Mix the mayonnaise, horseradish, ketchup and Cajun seasoning in a bowl; set aside.\n            \n\n              Fry the pickles: Heat 1 inch peanut oil in a pot over medium-high heat until a deep-fry thermometer registers 375 degrees F. Meanwhile, whisk the flour, Cajun seasoning, Italian seasoning, cayenne pepper, 1/2 teaspoon salt and 1/2 cup water in a large bowl until smooth. Spread the pickles on paper towels and pat dry.\n            \n\n              Add half of the pickles to the batter and toss to coat. Remove from the batter using a slotted spoon, letting the excess drip off, and add to the oil one at a time. Fry until golden brown, 1 to 2 minutes; remove with a slotted spoon and drain on paper towels. Return the oil to 375 degrees F and repeat with the remaining pickles and batter. Serve immediately with the prepared sauce.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [{"food": "mayonnaise dressing", "quantity": 0.25}, {"food": "horseradish", "quantity": 1.0}, {"food": "", "quantity": 2.0}, {"food": "seasoning mix", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 1}, {"food": "potato flour", "quantity": 0.5}, {"food": "seasoning mix", "quantity": 1.75}, {"food": "seasoning mix", "quantity": 0.5}, {"food": "pepper", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}], "title": "\nAlmost-Famous Fried Pickles\n"}, {"directions": "\n\n              Whisk both yogurts, the sugar and corn syrup in a bowl until combined. Pour into an ice cream maker and freeze according to the manufacturer's instructions.\n            \n\n              For a soft consistency, serve right out of the ice cream maker. For a firmer texture, transfer the frozen yogurt to a covered container and freeze for up to 2 hours. Serve with assorted toppings.\n            \n\n              Photograph by Kana Okada\n            \n", "ingredients": [{"food": "silk plain soy yogurt", "quantity": 2.0}, {"food": "silk plain soy yogurt", "quantity": 2.0}, {"food": "sugar", "quantity": 0.5}, {"food": "silk light vanilla", "quantity": 3.0}, {"food": "fruit cocktail", "quantity": 1}], "title": "\nAlmost-Famous Frozen Yogurt\n"}, {"directions": "\n\n              Combine all the dressing ingredients and 1 to 2 tablespoons water in a blender or food processor; puree until smooth.\n            \n\n              Place the salad blend in a large bowl and top with the remaining salad ingredients. Drizzle with the dressing.\n            \n\n              Photography by Kate Sears\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.25}, {"food": "vinegar", "quantity": 2.0}, {"food": "", "quantity": 3.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "parmesan cheese", "quantity": 2.0}, {"food": "garlic powder", "quantity": 0.25}, {"food": "seasoning mix", "quantity": 0.5}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.25}, {"food": "peppers", "quantity": 4.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "croutons", "quantity": 0.5}, {"food": "parmesan cheese", "quantity": 1.0}], "title": "\nAlmost-Famous Garden Salad\n"}, {"directions": "\n\n              Make the dip: Puree the dressing, cucumber, horseradish, milk, vinegar, wasabi powder, cayenne pepper, and salt to taste in a blender until smooth. Cover and refrigerate until ready to serve.\n            \n\n              Prepare the beans: Fill a large bowl with ice water. Bring the broth to a boil in a saucepan over high heat. Add the green beans and cook until tender, about 5 minutes. Remove the beans with a slotted spoon and transfer to the ice water to stop the cooking. Let cool in the water, then drain and pat dry.\n            \n\n              Whisk the egg and milk in a shallow bowl. Put 1/2 cup flour in another shallow bowl. Combine the breadcrumbs, the remaining 1/2 cup flour, the onion powder, garlic powder, cayenne, and salt and pepper to taste in another bowl.\n            \n\n              Line a baking sheet with parchment paper. Toss the green beans in the flour and shake off the excess. One at a time, dip the beans in the egg mixture, dredge in the breadcrumb mixture and lay on the prepared baking sheet. Freeze until the coating is set, about 30 minutes.\n            \n\n              Heat 3 inches oil in a deep pot over medium heat until a deep-fry thermometer registers 350 degrees F. Fry the green beans in batches until golden brown, 1 to 2 minutes. Transfer the beans with tongs or a skimmer to a rack or paper towels to drain. Serve with the dip.\n            \n\n              Photograph by Yunhee Kim\n            \n", "ingredients": [{"food": "dressing", "quantity": 0.5}, {"food": "cucumber", "quantity": 0.5}, {"food": "horseradish", "quantity": 1.0}, {"food": "milk", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 2.0}, {"food": "fava beans", "quantity": 0.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "milk", "quantity": 0.5}, {"food": "potato flour", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.25}, {"food": "hearts of palm", "quantity": 1}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 1}], "title": "\nAlmost-Famous Green Bean Fries\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F with a rack positioned in the middle of the oven. Lightly coat a rimmed baking sheet with cooking spray.\n            \n\n              Combine the sugar, honey, 3 tablespoons water, the vanilla and 1/2 teaspoon salt in a large heavy-bottomed pot. Cook over medium heat, stirring with a wooden spoon, until the sugar dissolves completely. Add the peanuts and cook, stirring occasionally, until the mixture begins simmering, about 1 minute. Increase the heat to medium high and continue cooking, stirring constantly, until the sugar mixture starts to dry out and clings to the nuts, 2 to 4 more minutes. Pour onto the prepared baking sheet and spread in an even layer.\n            \n\n              Bake the nuts until the sugar coating begins melting, about 5 minutes. Continue baking, stirring occasionally, until the nuts are golden brown and glazed in spots, 6 to 8 more minutes. Remove the baking sheet from the oven and stir the nuts to distribute the caramel. Let cool on the baking sheet. Store, covered, at room temperature for up to 1 week.\n            \n\n              Photograph by Sam Kaplan\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "sugar", "quantity": 0.75}, {"food": "honey smoked ham", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "peanuts", "quantity": 2.0}], "title": "\nAlmost-Famous Honey-Roasted Peanuts\n"}, {"directions": "\n\n              Combine the onion, flour, cornmeal, baking powder, salt, sugar and onion powder in a bowl. Whisk the egg and milk in another bowl. Whisk the egg mixture into the flour mixture until smooth. Cover and chill 30 minutes.\n            \n\n              Heat 2 inches vegetable oil in a large pot over medium heat until a deep-fry thermometer registers 350 degrees F. Working in batches, carefully drop heaping tablespoonfuls of batter into the hot oil. Fry, stirring occasionally, until golden, about 8 minutes per batch (return the oil to 350 degrees F between batches). Transfer to a paper towel-lined baking sheet using a slotted spoon. Sprinkle with salt. Let rest a few minutes before serving.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [{"food": "onion powder", "quantity": 0.3333333333333333}, {"food": "potato flour", "quantity": 1.5}, {"food": "yellow rice", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 1.5}, {"food": "sugar", "quantity": 1.5}, {"food": "onion powder", "quantity": 2.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "whole milk", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1}], "title": "\nAlmost-Famous Hushpuppies\n"}, {"directions": "\n\n              Make the blondies: Preheat the oven to 350 degrees F. Line a 9-by-13-inch baking pan with foil, leaving an overhang on two sides; butter the foil. Pulse 1/2 cup walnuts in a food processor until almost fine (do not overprocess). Whisk the ground nuts, flour, baking powder, baking soda and salt in a medium bowl.\n            \n\n              Beat 10 tablespoons butter and the brown sugar with a mixer on medium speed until fluffy, about 2 minutes. Beat in the eggs, one at a time, scraping down the bowl with a rubber spatula. Beat in the vanilla. Gradually beat in the dry ingredients until just combined. Fold in the white chocolate and the remaining 1/2 cup walnuts.\n            \n\n              Spread the batter in the prepared pan and bake until the blondies are light brown around the edges and spring back when pressed, about 30 minutes. Cool slightly on a rack.\n            \n\n              Meanwhile, make the topping: Place the maple syrup and butter in a small saucepan over medium heat and cook until the mixture bubbles and thickens, swirling the pan, about 6 minutes. Add the cream and continue to cook until the mixture is the consistency of caramel.\n            \n\n              Use the foil to lift the blondies out of the pan, then cut into large bars. Serve warm topped with ice cream, the maple-butter sauce and the walnuts.\n            \n\n              Photograph by Kana Okada\n            \n", "ingredients": [{"food": "butter oil", "quantity": 10.0}, {"food": "pan dulce", "quantity": 1}, {"food": "", "quantity": 1.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 1.0}, {"food": "sugar", "quantity": 1.5}, {"food": "eggs", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 6.0}, {"food": "syrup", "quantity": 0.3333333333333333}, {"food": "butter oil", "quantity": 6.0}, {"food": "ice cream swich", "quantity": 0.25}, {"food": "ice cream swich", "quantity": 1}, {"food": "", "quantity": 0.5}], "title": "\nAlmost-Famous Maple-Butter Blondies\n"}, {"directions": "\n\n              Scoop the ice cream into 8 to 10 balls and arrange in a shallow dish in a single layer; return to the freezer until firm, about 20 minutes.\n            \n\n              Put the evaporated milk and vanilla syrup in a blender, then put the blender jar and 2 large glasses in the freezer with the ice cream; chill at least 20 minutes.\n            \n\n              When ready to serve, remove the ice cream and blender jar from the freezer. Add half of the ice cream to the blender and blend on high until smooth. Add the remaining ice cream and blend until smooth. Remove the glasses from the freezer and fill with the shake; serve immediately.\n            \n\n              Photograph by Paul Sirisalee\n            \n", "ingredients": [{"food": "ice cream swich", "quantity": 1.5}, {"food": "milk", "quantity": 0.5}, {"food": "syrup", "quantity": 0.3333333333333333}], "title": "\nAlmost-Famous Milkshakes\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Make the coffee ice: Stir the sugar into the coffee until dissolved, then let cool. Pour into a 16-cube ice-cube tray and freeze until solid, about 3 hours.\n            \n\n              Make the chocolate syrup: Combine the sugar and cocoa powder in a saucepan and slowly whisk in 2/3 cup hot water. Bring to a simmer over medium heat, whisking, until the sugar dissolves, 3 to 5 minutes; do not boil. Remove from the heat and stir in the chocolate, honey and vanilla until smooth. Transfer to a bowl and refrigerate until cool.\n            \n\n              Make the frappes: Puree 8 coffee ice cubes, 1/2 cup milk, 1/3 to 1/2 cup chocolate syrup and 1 cup plain ice in a blender until smooth. Pour into 2 glasses, then repeat to make 2 more drinks. Top with whipped cream and more chocolate syrup.\n            \n\n              Photograph by Andrew Mccaul\n            \n", "ingredients": [{"food": "sugar", "quantity": 3.0}, {"food": "silk coffee", "quantity": 2.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "onion powder", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "honey smoked ham", "quantity": 1.5}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "milk", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1}], "title": "\nAlmost-Famous Mocha Frappes\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Make the cakes: Brush four 1 1/4-cup brioche molds (or use 10-ounce ramekins or jumbo muffin cups) with the 2 tablespoons melted butter. Dust the molds with cocoa powder and tap out the excess.\n            \n\n              Whisk the flour, baking soda, baking powder and salt in a small bowl. Bring the milk and 3/4 cup water to a simmer in a saucepan over medium heat; set aside.\n            \n\n              Combine the vegetable oil, 4 tablespoons room-temperature butter and the sugar in a stand mixer and beat with the paddle attachment on medium-high speed until fluffy, about 4 minutes, scraping down the bowl and beater as needed. Add 1/2 cup cocoa powder and the vanilla; beat 1 minute on medium speed. Scrape down the bowl. Add 1 egg and beat 1 minute on medium-low speed, then add the remaining egg and beat 1 more minute.\n            \n\n              With the mixer on low speed, gradually beat in the flour mixture, then the hot milk mixture. Finish mixing the batter with a rubber spatula until combined. Divide the batter evenly among the molds, filling each slightly more than three-quarters of the way.\n            \n\n              Transfer the molds to a baking sheet and bake until the tops of the cakes are domed and the centers are just barely set, 25 to 30 minutes. Transfer the baking sheet to a rack; let the cakes cool until they pull away from the molds, about 30 minutes.\n            \n\n              How To Assemble the Cake:\n            \n\n              Make the Filling: Microwave the chocolate, cream, butter and corn syrup in a microwave-safe bowl in 30-second intervals, stirring each time, until the chocolate starts to melt, 1 minute, 30 seconds. Let sit 3 minutes, then whisk until smooth. Reheat before using, if necessary.\n            \n\n              Use the tip of a paring knife to gently loosen the cakes from the molds, then invert the cakes onto a cutting board.\n            \n\n              Use the knife to cut a 1 1/2-inch circle on the top of each cake, cutting almost to the bottom.\n            \n\n              Hollow out the cake with a spoon; save the scraps. Wrap the cakes with plastic wrap and microwave until steaming, 1 minute.\n            \n\n              Drizzle plates with caramel, then unwrap the cakes and place on top. Pour about 3 tablespoons filling into each cake.\n            \n\n              Plug the hole with a cake scrap. Save or discard any remaining scraps.\n            \n\n              Top each cake with a scoop of ice cream. Spoon more chocolate sauce on top, spreading it thin so it hardens into a shell.\n            \n\n              Photograph by Jacob Snavely\n            \n", "ingredients": [{"food": "", "quantity": 6.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "potato flour", "quantity": 1.3333333333333333}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "milk", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "sugar", "quantity": 1.3333333333333333}, {"food": "vanilla extract", "quantity": 1.5}, {"food": "eggs", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 8.0}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "butter oil", "quantity": 4.0}, {"food": "silk light vanilla", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1}, {"food": "ice cream swich", "quantity": 1.0}], "title": "\nAlmost-Famous Molten Chocolate Cake\n"}, {"directions": "\n\n              Mix the orange juice concentrate with 1 cup water in a large measuring cup or bowl. (You can also use 2 cups orange juice instead of this mixture.)\n            \n\n              Transfer the orange juice to a blender. Add the milk, vanilla, both sugars and 1 cup ice and blend until smooth and frothy. Divide among 4 chilled glasses.\n            \n\n              Photograph by Stephanie Foley\n            \n", "ingredients": [{"food": "orange juice", "quantity": 1.0}, {"food": "whole milk", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "sugar", "quantity": 0.25}, {"food": "sugar", "quantity": 0.25}], "title": "\nAlmost-Famous Orange Milkshake\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Spread the pecans on a baking sheet; bake until toasted, 5 to 7 minutes. Let cool, then chop. Reduce the oven temperature to 200 degrees F.\n            \n\n              Whisk the flour, sugar, salt, baking powder and baking soda in a large bowl. Whisk the egg, milk, buttermilk and vanilla in a separate bowl until combined. Stir the egg mixture, melted butter and shortening into the dry ingredients until just combined. (The batter will be lumpy.)\n            \n\n              Preheat a waffle iron and brush with melted butter. Ladle some batter into the iron (about 1/2 cup, depending on your waffle iron); sprinkle with 2 tablespoons toasted pecans. Cook until golden brown, then transfer the waffle to a baking sheet and keep warm in the oven. Repeat with the remaining batter. Top the waffles with butter and maple syrup.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [{"food": "pecans", "quantity": 0.75}, {"food": "potato flour", "quantity": 1.5}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "salt", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "whole milk", "quantity": 1.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "syrup", "quantity": 1}], "title": "\nAlmost-Famous Pecan Waffles\n"}, {"directions": "\n\n              Line a 9-by-13-inch baking dish with aluminum foil, shiny-side up; smooth out any wrinkles. Heat 1 inch of water in a saucepan over low heat until steaming. Put all but 3/4 cup of the semisweet chocolate in a heatproof bowl. Set the bowl over the saucepan of steaming water (do not let the bowl touch the water) and stir until one-third of the chocolate is melted. Remove the bowl from the saucepan; keep the steaming water over low heat. Gradually stir the reserved 3/4 cup semisweet chocolate into the bowl, a few pieces at a time, until all of the chocolate is melted.\n            \n\n              Return the bowl to the saucepan, 5 to 10 seconds at a time, to help melt the chocolate, if needed. Do not rush this step: It may take up to 10 minutes to melt the chocolate. Wipe off any moisture from the bottom of the bowl. Stir 3/4 teaspoon peppermint extract into the chocolate, then quickly pour into the prepared baking dish and spread in an even layer. Firmly tap the dish against the counter to remove any air bubbles. Set aside at room temperature until almost set, about 10 minutes.\n            \n\n              Meanwhile, put all but 1 cup of the white chocolate in a large heatproof bowl and repeat the melting process over the steaming water; dry off the bottom of the bowl. Stir in the remaining 3/4 teaspoon peppermint extract; pour over the semisweet chocolate and spread in an even layer. Sprinkle immediately with the crushed candy canes, gently pressing them into the white chocolate. Set aside at room temperature until firm, about 1 hour. Lift the bark out of the pan using the foil and break it into pieces. Store in an airtight container at room temperature for up to 2 weeks.\n            \n\n              Photograph by Lisa Shin\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 12.5}, {"food": "vanilla extract", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 1.5}, {"food": "peppermint", "quantity": 3.0}], "title": "\nAlmost-Famous Peppermint Bark\n"}, {"directions": "\n\n              Mix 3 cups ice water, the granulated sugar and 1 teaspoon salt in a medium bowl. Add the shrimp and set aside 15 minutes, then drain well and pat dry. Dry the bowl; return the shrimp to the bowl and toss with 1/2 teaspoon Cajun seasoning.\n            \n\n              Whisk the flour, cornstarch, confectioners' sugar, the remaining 1 1/2 teaspoons Cajun seasoning and the beer in a large bowl to make a smooth batter. Add the shrimp, pepperoncini and roasted peppers and stir until evenly coated.\n            \n\n              Heat 2 inches of vegetable oil in a Dutch oven over medium-high heat until a deep-fry thermometer registers 350 degrees F. Working in batches, remove the shrimp, pepperoncini and roasted peppers from the batter with a slotted spoon, transfer to the hot oil and fry until golden, about 3 minutes. Remove and drain on paper towels; season with salt. Serve with lemon wedges, cocktail sauce and/or tartar sauce.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [{"food": "sugar", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "shrimp", "quantity": 1.0}, {"food": "seasoning mix", "quantity": 2.0}, {"food": "potato flour", "quantity": 0.75}, {"food": "cornstarch", "quantity": 2.0}, {"food": "sugar", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "", "quantity": 8.0}, {"food": "ruby red grapefruit juice blend", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "Worcestershire sauce", "quantity": 1}], "title": "\nAlmost-Famous Popcorn Shrimp\n"}, {"directions": "\n\n              Position a rack in the center of the oven and preheat to 325 degrees Fahrenheit.\n            \n\n              Brush a 10-inch springform pan with some of the butter. Stir the remaining butter with the crumbs, 1/4 cup of the sugar and a pinch of salt in a bowl. Press the crumb mixture into the bottom and up the sides of the pan, packing it tightly and evenly. Bake until golden brown, 15 to 20 minutes. Cool on a rack, then wrap the outside of the springform pan with foil and place in a roasting pan.\n            \n\n              Bring a medium pot of water to a boil. Meanwhile, beat the cream cheese with a mixer until smooth. Add the remaining 2 1/2 cups sugar and beat until just light, scraping down the sides of the bowl and beaters as needed. Beat in the sour cream, then add the pumpkin, eggs, vanilla, 1 teaspoon salt and the spices and beat until just combined. Pour into the cooled crust.\n            \n\n              Gently place the roasting pan in the oven (don't pull the rack out) and pour the boiling water into the roasting pan until it comes about halfway up the side of the springform pan. Bake until the outside of the cheesecake sets but the center is still loose, about 1 hour 45 minutes. Turn off the oven and open the door briefly to let out some heat. Leave the cheesecake in the oven for 1 more hour, then carefully remove from the roasting pan and cool on a rack. Run a knife around the edges, cover and refrigerate at least 8 hours or overnight.\n            \n\n              Bring the cheesecake to room temperature 30 minutes before serving. Unlock and remove the springform ring. To finish, place a dollop of the whipped cream on each slice and sprinkle with the toasted pecans.\n            \n\n              Photograph by Ellie Miller\n            \n", "ingredients": [{"food": "butter oil", "quantity": 12.0}, {"food": "cracker barrel", "quantity": 2.5}, {"food": "sugar", "quantity": 2.75}, {"food": "", "quantity": 1}, {"food": "macaroni cheese", "quantity": 2.0}, {"food": "sour cream", "quantity": 0.25}, {"food": "pumpkin flowers", "quantity": 1.0}, {"food": "eggs", "quantity": 6.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "cinnamon", "quantity": 2.5}, {"food": "ginger", "quantity": 1.0}, {"food": "cloves", "quantity": 0.25}, {"food": "whipped cream substitute", "quantity": 2.0}, {"food": "pecans", "quantity": 0.3333333333333333}], "title": "\nAlmost-Famous Pumpkin Cheesecake\n"}, {"directions": "\n\n              Stir the yeast, sugar and 1/4 cup warm water in a large bowl (or in the bowl of a stand mixer). Let sit until foamy, about 5 minutes.\n            \n\n              Add 1 tablespoon olive oil, the flour, 1 1/2 tablespoons rosemary, the fine salt and 3/4 cup warm water; stir with a wooden spoon (or with the dough hook if using a mixer) until a dough forms.\n            \n\n              Turn the dough out onto a lightly floured surface and knead, dusting lightly with flour if necessary, until smooth and elastic, about 10 minutes. (Or knead with the dough hook on medium-high speed, adding a little flour if the dough sticks to the bowl, about 8 minutes.)\n            \n\n              Brush a large bowl with olive oil. Add the dough, cover with plastic wrap and let stand at room temperature until more than doubled, about 2 hours.\n            \n\n              Brush 2 baking sheets with olive oil. Generously flour a work surface; turn the dough out onto the flour and divide into 4 pieces. Working with one piece at a time, sprinkle some flour on the dough, then fold the top and bottom portions into the middle. Fold in the sides to make a free-form square. Use a spatula to turn the dough over, then tuck the corners under to form a ball. Place seam-side down on a prepared baking sheet. Repeat with the remaining dough, putting 2 balls on each baking sheet. Let stand, uncovered, until more than doubled, about 2 hours.\n            \n\n              Preheat the oven to 400 degrees F. Bake the loaves 10 minutes; brush with the remaining 1 tablespoon olive oil and sprinkle with the kosher salt and the remaining 1/2 tablespoon rosemary. Continue baking until golden brown, about 10 more minutes. Transfer to a rack to cool. Serve with olive oil seasoned with pepper.\n            \n\n              Photograph by Lisa Shin\n            \n", "ingredients": [{"food": "yeast extract spread", "quantity": 1.25}, {"food": "sugar", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "potato flour", "quantity": 2.5}, {"food": "rosemary", "quantity": 2.0}, {"food": "salt", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}], "title": "\nAlmost-Famous Rosemary Bread\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Make the pretzels: Warm the milk in a saucepan until it's about 110 degrees; pour into a medium bowl and sprinkle in the yeast. Let the yeast soften, about 2 minutes; stir in the brown sugar and 1 cup flour with a wooden spoon. Dice 2 tablespoons butter and soften; stir into the mix. Add the remaining 1 1/4 cups flour and the fine salt to make a sticky dough. Turn the dough out onto a lightly floured surface and knead, adding more flour if needed, until smooth but still slightly tacky, about 5 minutes. Shape into a ball, place in a lightly greased bowl and cover with plastic wrap. Let rise in a warm spot until doubled in size, about 1 hour.\n            \n\n              Preheat the oven to 450 degrees and grease a large baking sheet. Punch the dough to deflate it, then turn out onto a lightly floured surface. (If the dough seems tight, cover and let rest until it relaxes.) Divide the dough into 6 pieces. Roll and stretch each piece with the palms of your hands into a 30-inch rope, holding the ends and slapping the middle of the rope on the counter as you stretch. Form each rope into a pretzel shape.\n            \n\n              Dissolve the baking soda in 3 cups warm water in a shallow baking dish. Gently dip each pretzel in the soda solution, then arrange on the prepared baking sheet and sprinkle with the coarse salt. Bake until golden, 10 to 12 minutes.\n            \n\n              Prepare the sauce: Combine the mayonnaise, mustard, brown sugar and vinegar in a bowl. Cover and refrigerate.\n            \n\n              Melt the remaining 8 tablespoons butter in a shallow dish. Dip the hot pretzels in the butter, turning to coat; place on a wire rack to let excess butter drip off. Serve the pretzels warm with the sweet mustard sauce.\n            \n\n              Photograph by Lara Robby/Studio D\n            \n\n              Illustration by Jason Lee\n            \n", "ingredients": [{"food": "milk", "quantity": 1.0}, {"food": "yeast extract spread", "quantity": 1.0}, {"food": "sugar", "quantity": 3.0}, {"food": "potato flour", "quantity": 2.25}, {"food": "butter oil", "quantity": 10.0}, {"food": "salt", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.3333333333333333}, {"food": "salt", "quantity": 2.0}, {"food": "mayonnaise dressing", "quantity": 0.25}, {"food": "mustard spinach", "quantity": 0.25}, {"food": "sugar", "quantity": 3.0}, {"food": "vinegar", "quantity": 0.5}], "title": "\nAlmost-Famous Soft Pretzels\n"}, {"directions": "\n\n              Make the sauce: Mix the mayonnaise, chili sauce, honey, 1/4 teaspoon salt and 1 tablespoon water in a large bowl; set aside.\n            \n\n              Prepare the shrimp: Heat about 2 inches of vegetable oil in a heavy-bottomed pot or Dutch oven over medium heat until a deep-fry thermometer registers 350 degrees. Meanwhile, whisk the eggs in a shallow bowl. Whisk the flour, cornstarch and 1 teaspoon each salt and pepper in another shallow bowl.\n            \n\n              Working in batches, dredge the shrimp in the flour mixture, shaking off any excess, dip in the beaten eggs, then return to the flour mixture, turning to form a thick crust. Fry the shrimp in the hot oil until lightly golden, 1 to 2 minutes, adjusting the heat as needed to maintain the oil temperature. Transfer to a paper-towel-lined plate with a slotted spoon.\n            \n\n              Toss the shrimp with the prepared sauce. Arrange the lettuce in a shallow serving bowl or on individual plates. Top with the shrimp and garnish with scallions.\n            \n\n              Photograph by Stephanie Foley\n            \n", "ingredients": [{"food": "mayonnaise dressing", "quantity": 0.5}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "honey smoked ham", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1}, {"food": "eggs", "quantity": 2.0}, {"food": "potato flour", "quantity": 0.75}, {"food": "cornstarch", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "shrimp", "quantity": 1.25}, {"food": "chrysanthemum leaves", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1}], "title": "\nAlmost-Famous Spicy Fried Shrimp\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Stir in the spinach and cook until bright green, about 30 seconds. Drain and rinse under cold water; squeeze out the excess moisture, then finely chop.\n            \n\n              Melt the butter in a large saucepan over medium heat. Add the onion, garlic and 1/2 teaspoon salt and cook until the onion is soft, about 2 minutes. Add the flour and cook, stirring, until lightly toasted, about 1 minute. Whisk in the milk and cook, whisking constantly, until thickened, about 1 minute. Remove from the heat. Stir in the lemon juice, Worcestershire sauce, parmesan and sour cream.\n            \n\n              Return the pot to medium heat. Add the spinach, cheddar and artichokes and stir until the cheese melts and the dip is heated through. Serve warm with tortilla chips, salsa and sour cream.\n            \n\n              Photograph by Andrew Mccaul\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "onion powder", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "whole milk", "quantity": 1.25}, {"food": "lemon juice", "quantity": 0.5}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "parmesan cheese", "quantity": 1.25}, {"food": "sour cream", "quantity": 0.25}, {"food": "cheddar cheese", "quantity": 0.5}, {"food": "artichoke hearts", "quantity": 0.5}, {"food": "potato chips", "quantity": 1}], "title": "\nAlmost-Famous Spinach-Artichoke Dip\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Make the tortilla bowls: Position a rack in the lower third of the oven; preheat to 450 degrees F. Put 4 empty cans (labels removed) or small ovenproof bowls upside down on a baking sheet. Drape a square of foil over each can and coat with cooking spray.\n            \n\n              Fill a shallow bowl with 1/2 inch warm water; whisk in the olive oil. Soak each tortilla in the water until soft, about 5 seconds, then drape over the prepared cans, pleating as needed. Bake until golden, about 5 minutes. Remove from the oven and invert the tortilla bowls onto the baking sheet; remove the cans and foil. Spray the inside of the tortilla bowls with cooking spray, season with salt and continue baking until crisp, 4 to 5 more minutes; let cool.\n            \n\n              Meanwhile, make the steak: Whisk the dried garlic, onion and oregano, the cumin, chile powder, scallions, Worcestershire sauce, olive oil, 1 1/2 teaspoons salt and 1 teaspoon pepper in a bowl. Put the steak in a shallow dish and rub with 2 tablespoons of the spice mixture (reserve the rest for the dressing). Add the bell pepper and sliced onion and toss. Cover and refrigerate 30 minutes or up to 4 hours.\n            \n\n              Heat a large cast-iron skillet over high heat. Add the steak and scatter the bell pepper and onion around it. Sear the steak about 5 minutes per side, then transfer to a cutting board. Continue cooking the pepper and onion until just tender, about 3 more minutes. Thinly slice the steak against the grain, then cut into 1-inch pieces.\n            \n\n              Assemble the salad: Whisk the mayonnaise, buttermilk and the reserved spice mixture in a large bowl until smooth. Add the cucumber, lettuce, beans and olives and toss. Divide the salad among the tortilla bowls. Top with the steak, bell pepper, onion, cheese and salsa.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "potato flour", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "garlic powder", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "cumin seed", "quantity": 2.0}, {"food": "onion powder", "quantity": 2.0}, {"food": "", "quantity": 3.0}, {"food": "Worcestershire sauce", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 0.75}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "mayonnaise dressing", "quantity": 0.25}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.6666666666666666}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 2.0}, {"food": "fava beans", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "barley flour or meal", "quantity": 4.0}, {"food": "dessert topping", "quantity": 1}], "title": "\nAlmost-Famous Steak Taco Salad\n"}, {"directions": "\n\n              Make the lemon syrup: Bring the lemon zest, 1 1/2 cups sugar and 1 1/2 cups water to a boil in a medium saucepan, stirring, until the sugar dissolves; let cool to room temperature.\n            \n\n              Meanwhile, make the strawberry syrup: Toss the strawberries and the remaining 1/2 cup sugar in a bowl and let sit at room temperature until the sugar dissolves, about 45 minutes. Strain the strawberry mixture; reserve the strawberry syrup and berries separately.\n            \n\n              Make the lemonade: Combine the lemon juice, lemon syrup, salt and 2 cups cold water in a pitcher. For each drink, put about 1 tablespoon of the strawberry syrup in a tall glass. Fill with ice, then top with the lemonade and some of the reserved strawberries.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [{"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "strawberries", "quantity": 2.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "salt", "quantity": 0.25}], "title": "\nAlmost-Famous Strawberry Lemonade\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Make the dough: Whisk the sugar and 3/4 cup warm water (about 105 degrees F) in a bowl. Sprinkle the yeast on top and set aside until foamy, about 10 minutes. Stir in the vegetable oil. Whisk the flour and salt in a large bowl. Make a well in the center, pour in the yeast mixture and stir with a wooden spoon to make a shaggy dough. Turn out onto a generously floured surface and knead until smooth and elastic, about 5 minutes, dusting with more flour as needed. Form into a ball. Brush a large bowl with vegetable oil; add the dough, turning to coat with the oil. Cover tightly with plastic wrap and set aside at room temperature until doubled in size, about 1 hour, 30 minutes.\n            \n\n              Make the filling and topping: Toss 1/2 cup mozzarella, the cheddar, pecorino, garlic salt, granulated garlic and dried parsley in a bowl. Preheat the oven to 450 degrees F. Put an inverted baking sheet in the oven; preheat for 10 minutes. Line another inverted baking sheet with parchment paper and sprinkle with the cornmeal. Cut the dough in half; transfer 1 piece to the parchment-lined baking sheet and stretch into an 8-inch square (keep the other piece of dough covered). Sprinkle 1 side of the square with 1/2 cup of the remaining mozzarella, then fold the dough in half to enclose the cheese, pressing to seal. Slice the dough crosswise at 1-inch intervals, stopping just before the folded edge. Sprinkle with half of the cheese-garlic mixture. Move the dough to 1 side of the baking sheet. Repeat with the remaining dough, mozzarella and cheese-garlic mixture on the other side of the baking sheet. Slide the bread on the parchment onto the hot baking sheet in the oven. Bake until the dough is cooked through and the cheese is golden brown, 12 to 14 minutes. Let cool slightly, then pull apart into breadsticks.\n            \n\n              Photograph by Sam Kaplan\n            \n", "ingredients": [{"food": "sugar", "quantity": 2.0}, {"food": "", "quantity": 1.25}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "salt", "quantity": 0.75}, {"food": "cornmeal", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 1.5}, {"food": "cheddar cheese", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "parsley", "quantity": 0.5}], "title": "\nAlmost-Famous Stuffed Cheesy Bread\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Make the meatballs: Put the breadcrumbs in a large bowl. Heat the butter in a skillet over medium heat. Add the onion, garlic, allspice, 2 teaspoons salt and 1/4 teaspoon white pepper and cook, stirring, until soft, about 5 minutes. Add the milk and Worcestershire sauce and bring to a simmer. Pour the milk mixture over the breadcrumbs and stir to make a thick paste; let cool. Add the beef, pork, egg and egg white to the bowl and mix until combined.\n            \n\n              Brush a baking sheet with vegetable oil. Roll the meat into 1-inch balls and arrange on the prepared baking sheet. Cover with plastic wrap and refrigerate at least 1 hour.\n            \n\n              Preheat the oven to 400 degrees F. Bake the meatballs until cooked through, about 20 minutes.\n            \n\n              Make the gravy: Melt the butter in a large skillet over medium heat. Add the flour and cook, whisking, until smooth. Whisk in the beef broth and Worcestershire sauce and bring to a simmer. Add the cream and meatballs. Reduce the heat to medium low and simmer until the gravy thickens, about 10 minutes. Season with salt and black pepper. Transfer to a serving dish; sprinkle with the parsley and serve with lingonberry jam, if desired.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [{"food": "", "quantity": 1.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.3333333333333333}, {"food": "garlic powder", "quantity": 2.0}, {"food": "allspice", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "milk", "quantity": 0.5}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "frankfurter beef", "quantity": 0.75}, {"food": "pork skins", "quantity": 0.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "butter oil", "quantity": 2.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "frankfurter beef", "quantity": 1.5}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 0.25}, {"food": "black bean mango", "quantity": 1}, {"food": "parsley", "quantity": 2.0}, {"food": "jam", "quantity": 1}], "title": "\nAlmost-Famous Swedish Meatballs\n"}, {"directions": "\n\n              Make the flatbread: Stir the yeast, sugar and 1 1/2 cups warm water (about 110 degrees F) in a bowl. Let sit until foamy, about 5 minutes. Whisk the flour and 1 1/2 teaspoons salt in a large bowl. Add the yeast mixture and olive oil and mix with your hands into a smooth dough. Cover the bowl with plastic wrap; set aside in a warm place until the dough doubles in size, about 1 hour.\n            \n\n              Turn the dough out onto a lightly floured surface and knead until slightly elastic, dusting with more flour if the dough is too sticky to handle, about 5 minutes. Return the dough to the bowl, cover and set aside again until doubled in size, about 1 hour.\n            \n\n              Brush 2 baking sheets with olive oil. Turn the dough out onto a lightly floured surface and knead until smooth and elastic, dusting with more flour if needed. Cut the dough in half and form into 2 balls. Roll out each ball into a 12-by-3-inch rectangle, about 1/2 inch thick. Transfer each dough rectangle to one of the prepared baking sheets and let rest, uncovered, until a dry crust forms on top, 1 hour, 30 minutes to 2 hours.\n            \n\n              Meanwhile, position racks in the middle and lower thirds of the oven. Place a pizza stone or inverted baking sheet on the bottom rack and preheat to 475 degrees F for at least 40 minutes.\n            \n\n              Press your fingertips through the dry crust on top of the dough to create a spotted pattern. Gently stretch each piece of dough into a 14-by-4-inch rectangle, then brush the tops with olive oil and sprinkle with salt. Put 1 baking sheet of dough on the pizza stone and bake until the bottom of the bread is golden brown, about 7 minutes. Transfer to the middle rack and continue baking until golden all over, about 5 more minutes. Remove from the oven and immediately brush the top of the bread with olive oil and sprinkle with salt; let cool on the baking sheet on a rack. Repeat with the remaining dough.\n            \n\n              Make the dressing: Whisk the vinegar, mustard and dried basil in a bowl. Add the sugar and 1/4 teaspoon each salt and pepper. Slowly whisk in the olive oil.\n            \n\n              Assemble the sandwiches: Slice each flatbread in half horizontally and brush with the dressing. Top the bread bottoms with the tomatoes, mozzarella and basil leaves. Season with salt and pepper and cover with the bread tops. Cut into pieces.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [{"food": "yeast extract spread", "quantity": 1.25}, {"food": "sugar", "quantity": 1}, {"food": "potato flour", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "vinegar", "quantity": 3.0}, {"food": "mustard spinach", "quantity": 3.0}, {"food": "basil", "quantity": 0.25}, {"food": "sugar", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.5}, {"food": "chrysanthemum leaves", "quantity": 16.0}, {"food": "salt", "quantity": 1}], "title": "\nAlmost-Famous Tomato, Basil and Mozzarella Flatbread Sandwiches\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F and line a baking sheet with parchment paper. Whisk the flour, baking powder, cinnamon and salt in a medium bowl. Beat the butter and sugar in a large bowl with a mixer on medium-high speed until light and fluffy, 3 to 5 minutes. Beat in the eggs, liqueur, and almond and vanilla extracts until combined. Reduce the mixer speed to low; add the flour mixture and beat until just incorporated. Fold in the raw and chocolate-covered almonds.\n            \n\n              Dust your hands and the dough with flour; divide in half and shape into two 3-by-12-inch logs on the prepared baking sheet, about 3 inches apart. Bake until puffed and set, about 25 minutes. Let cool 10 minutes on the baking sheet, then transfer to a cutting board.\n            \n\n              Reduce the oven temperature to 250 degrees F. Slice the logs crosswise into 1-inch-thick pieces; arrange cut-side down on the baking sheet. Return to the oven and bake, flipping halfway through, until dry and golden, about 45 minutes. Let cool completely on the baking sheet.\n            \n\n              Place the white chocolate and semisweet chocolate in 2 small microwave-safe bowls; microwave in 30-second intervals, stirring after each, until melted. Drizzle on the biscotti; let set 30 minutes.\n            \n\n              Photograph by Andrew Purcell\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.25}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "cinnamon", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 5.0}, {"food": "sugar", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "almonds", "quantity": 1.0}, {"food": "almonds", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 2.0}], "title": "\nAmaretto Biscotti\n"}, {"directions": "\n\n              Bring the heavy cream, butter, brown sugar, corn syrup and salt to a simmer in a small saucepan over medium heat, whisking occasionally, until the butter melts and the sugar dissolves, about 3 minutes. Whisk in the chocolate and cocoa powder until smooth. Remove from the heat and whisk in the liqueur and vanilla.\n            \n\n              Transfer the sauce to a small bowl. Serve warm or at room temperature with cookies for dipping.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "ice cream swich", "quantity": 0.5}, {"food": "butter oil", "quantity": 2.0}, {"food": "sugar", "quantity": 2.0}, {"food": "corn bran", "quantity": 2.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "baking chocolate", "quantity": 4.0}, {"food": "onion powder", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "chocolate chip cookies", "quantity": 1}], "title": "\nAmaretto Chocolate Dip\n"}, {"directions": "\n\n              Make the dough: Pulse the flour, cookies and salt in a food processor until the cookies are finely ground. Add the butter and pulse until the mixture looks like coarse meal with pea-size bits of butter. Drizzle in 1/4 cup ice water and pulse until the dough begins to come together. Turn out into a 9-inch glass pie plate (not deep dish) and press into the bottom and up the sides about 1/4 inch above the rim. Pierce all over with a fork and chill until firm, about 30 minutes.\n            \n\n              Preheat the oven to 350 degrees F. Line the crust with foil, then fill with pie weights or dried beans. Bake until the edges are golden, 20 to 25 minutes. Remove the foil and weights and continue baking until the crust is golden all over, 10 to 15 more minutes. Cool completely on a rack.\n            \n\n              Make the filling: Whisk the pumpkin, cream, sugar, eggs, liqueur, nutmeg, vanilla and salt in a bowl. Pour into the crust and bake until the edges are set but the center still quivers, 50 to 60 minutes. Cool completely on a rack.\n            \n\n              Meanwhile, make the praline: Line a baking sheet with a silicone mat or parchment paper and brush with vegetable oil. Stir the sugar and 1 tablespoon water in a small saucepan. Bring to a boil over medium-high heat and cook, swirling the pan but not stirring, until amber, 6 to 7 minutes. Stir in the almonds and salt. Pour the mixture onto the prepared baking sheet, spreading it as thinly as possible with a rubber spatula. Cool completely.\n            \n\n              Coarsely chop or break the praline and sprinkle over the pie right before serving.\n            \n\n              Photographs by Con Poulos\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.0}, {"food": "chocolate chip cookies", "quantity": 0.75}, {"food": "salt", "quantity": 0.125}, {"food": "butter oil", "quantity": 4.5}, {"food": "pumpkin flowers", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "eggs", "quantity": 2.0}, {"food": "", "quantity": 2.5}, {"food": "nutmeg", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "salt", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 1}, {"food": "sugar", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}, {"food": "salt", "quantity": 0.125}], "title": "\nAmaretto Pumpkin Pie With Almond Praline\n"}, {"directions": "\n\n              1. Bring pineapple juice to a simmer in a small saucepan over medium heat. Whisk eggs, yolks, sugar and cornstarch in a small bowl. Slowly pour hot juice into egg mixture, while whisking constantly. Return mixture to pan and cook, stirring constantly, until it boils and coats back of a spoon. Continue cooking about 1 more minute. Remove from heat, stir in butter, lemon juice, and salt. Strain mixture into a small bowl set over ice. Place a piece of plastic wrap directly onto surface of curd and set aside to cool. 2. Finely grate zest from 1 orange and reserve. Trim and discard peel from remaining orange and cut out segments. Chop and toss with zest. Whip cream and confectioners' sugar together until soft peaks form and fold into chopped orange. \n            \n\n              3. Juice zested orange into a bowl and stir in sherry. Lightly brush ladyfingers with this liquid and press into bottom and along sides of 6 ramekins. Evenly divide pineapple curd among ramekins. Top each with orange-whipped cream and toasted coconut. Refrigerate until set, at least 2 hours or overnight. Release cakes from ramekins to serve.\n            \n", "ingredients": [{"food": "grape juice", "quantity": 0.5}, {"food": "eggs", "quantity": 3.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "cornstarch", "quantity": 2.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "oranges", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "soft tofu", "quantity": 18.0}, {"food": "coconut water", "quantity": 0.5}], "title": "\nAmbrosia Icebox Cakes\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: 12- by -17 1/2-inch wooden cutting board, pastry bag fitted with a small star tip\n\n              Cook the potatoes in generously salted boiling water until fork-tender but not falling apart, about 20 minutes. Drain well and allow to cool completely. Cut in half crosswise.\n            \n\n              Fill a pastry bag, fitted with a small star tip, with the herbed cheese spread. Cut a piece of parchment large enough to fit a 12- by -17 1/2-inch wooden cutting board. Put a dab of cheese spread on the underside of each corner of the parchment to help it adhere to the cutting board. \n            \n\n              Pipe and spread a thin layer of cheese spread in to a 6 1/2- by -9 1/2-inch rectangle in the upper left corner of the parchment. Arrange the potatoes in rows, cut-side-up, on top of the cheese. Pipe the remaining cheese in between the potatoes to make stars for the flag. \n            \n\n              Drizzle the remaining empty portion of parchment with half of the oil then sprinkle all over with the basil. Starting from the top, make a line of tomato halves, cut-side-up, followed by a line of mozzarella halves, cut-side-down. Repeat with the remaining tomatoes and mozzarella. Drizzle everything with the remaining olive oil and sprinkle with salt.\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 18.0}, {"food": "salt", "quantity": 1}, {"food": "ham cheese spread", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "chrysanthemum leaves", "quantity": 0.3333333333333333}, {"food": "silk black cherry soy yogurt", "quantity": 26.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 24.0}], "title": "\nAmerican Flag Caprese Salad\n"}, {"directions": "\n\n              In a large bowl combine the macaroni, celery, onion, parsley and tomato, if using. In a small bowl, whisk together the mayonnaise, mustard, sugar, vinegar, sour cream and salt. Pour the dressing over the salad and stir to combine. Season with salt and pepper to taste. Serve. Store covered in the refrigerator, for up to 3 days.\n            \n", "ingredients": [{"food": "macaroni cheese", "quantity": 2.0}, {"food": "diced chicken", "quantity": 0.3333333333333333}, {"food": "onion powder", "quantity": 0.25}, {"food": "parsley", "quantity": 1.0}, {"food": "diced chicken", "quantity": 0.5}, {"food": "mayonnaise dressing", "quantity": 0.5}, {"food": "mustard spinach", "quantity": 0.75}, {"food": "sugar", "quantity": 1.5}, {"food": "vinegar", "quantity": 1.5}, {"food": "sour cream", "quantity": 3.0}, {"food": "salt", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}], "title": "\nAmerican Macaroni Salad\n"}, {"directions": "\n\n              Heat the olive oil in a large pot or Dutch oven over medium heat. Add the onion and cook, stirring occasionally, until the onion becomes translucent but does not get any color, about 10 minutes. Increase the heat to medium-high, add the bell pepper, celery, garlic, a generous pinch of salt and a few grinds of pepper and cook, stirring occasionally, until tender, about 10 minutes.\n            \n\n              Add the beef, a generous pinch of salt and a few grinds of pepper to the pot and cook, stirring to break the meat into small bits, until browned, about 10 minutes. Stir in the tomato paste and oregano and cook, stirring, for 3 minutes.\n            \n\n              Add the Worcestershire sauce, tomatoes with their juices, sugar and bay leaf. Bring to a boil, reduce to a simmer and cook, stirring occasionally, until thickened, about 45 minutes.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "black bean mango", "quantity": 1}, {"food": "frankfurter beef", "quantity": 1.5}, {"food": "pasta with tomato sauce", "quantity": 6.0}, {"food": "", "quantity": 0.5}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "whole milk", "quantity": 28.0}, {"food": "sugar", "quantity": 1.0}, {"food": "corier leaf", "quantity": 1.0}], "title": "\nAmerican Meat Sauce\n"}, {"directions": "\n\n              Soak the onions in a small bowl of cold water for 15 minutes. Drain. \n            \n\n              Put the potatoes in a medium saucepan with cold water to cover by about 2 inches and season generously with salt. Bring to a boil, lower the heat, and simmer until fork tender, about 8 minutes. Drain, transfer the potatoes to a large bowl, and mix with the onions and celery. Set aside to cool.\n            \n\n              Place the eggs in a medium saucepan and cover with cold water. Bring to a boil over medium-high heat. Reduce the heat to a simmer and continue to cook for 7 minutes. Drain and transfer the eggs to a bowl of ice water until cool, about 5 minutes. Peel and roughly chop the eggs.\n            \n\n              Meanwhile, in a small bowl, whisk together the mayonnaise, parsley, relish, mustard, lemon juice, and 1 teaspoon salt. Carefully mix the mayonnaise into the potatoes with a rubber spatula. Add the eggs, taking care not to break them up too much. Season the salad with pepper to taste. Serve.\n            \n", "ingredients": [{"food": "onion powder", "quantity": 0.5}, {"food": "sweet potatoes", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "eggs", "quantity": 2.0}, {"food": "mayonnaise dressing", "quantity": 1.0}, {"food": "parsley", "quantity": 0.25}, {"food": "pickle relish", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "lemon juice", "quantity": 0.5}, {"food": "pepper", "quantity": 1}], "title": "\nAmerican-Style Potato Salad\n"}, {"directions": "\n\n              In a small bowl soak the onions in cold water, for 15 minutes. Drain.\n            \n\n              In a medium saucepan cover the potatoes with cold water by about 2 inches. Stir in 2 tablespoons of the salt. Bring to a boil, lower the heat, and simmer until fork tender, about 6 minutes. Drain, transfer potatoes to a large bowl, and mix with the onions and celery. Set aside to cool.\n            \n\n              In a small bowl, whisk together the remaining 1 teaspoon salt, mayonnaise, parsley, relish, and mustard.\n            \n\n              When the potatoes have cooled, carefully fold them with the mayonnaise mixture. Gently mix in the eggs and season with pepper to taste. Transfer to a serving bowl and serve.\n            \n", "ingredients": [{"food": "onion powder", "quantity": 0.5}, {"food": "sweet potatoes", "quantity": 2.0}, {"food": "salt", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "mayonnaise dressing", "quantity": 0.5}, {"food": "parsley", "quantity": 2.0}, {"food": "pickle relish", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nAmerican-Style Potato Salad\n"}, {"directions": "\n\n              Mix equal parts Campari and sweet vermouth in a tall ice-filled glass. Top with seltzer and garnish with an orange wedge.\n            \n\n              Photograph by Anna Williams\n            \n", "ingredients": [], "title": "\nAmericano\n"}, {"directions": "\n\n              Combine 1 cup water, the cornmeal, molasses and 4 tablespoons butter in a saucepan. Bring to a simmer over medium-high heat, whisking constantly, until the mixture thickens and starts to bubble, about 3 minutes. Transfer to the bowl of a stand mixer and let cool until lukewarm (105 degrees F to 110 degrees F), stirring occasionally, about 20 minutes.\n            \n\n              Sprinkle the yeast over 1/2 cup lukewarm water (105 degrees F to 110 degrees F) in a small bowl and let stand until foamy, about 5 minutes. Add to the cornmeal mixture along with 1 cup flour and the dry milk; mix with a wooden spoon. Cover with a kitchen towel and set aside in a warm place until the dough increases slightly in volume and is bubbly, about 30 minutes.\n            \n\n              Mix the dough with the dough hook attachment on medium-low speed, then mix in the salt and the remaining 3 to 4 cups flour, 1/2 cup at a time, scraping down the bowl after each addition, until the dough comes together into a firm, tacky ball. Increase the speed to medium high; knead the dough until it pulls away from the bowl, about 2 minutes. Turn out onto a lightly floured surface and knead by hand until smooth and pliable, adding more flour as needed, about 5 minutes. Brush a large bowl with vegetable oil; add the dough, cover with a kitchen towel and set aside in a warm place until doubled in size, 1 hour to 1 hour, 30 minutes.\n            \n\n              Brush a 9-by-5-inch loaf pan with vegetable oil. Punch down the dough and turn out onto a clean surface. Shape into a smooth 4-by-8-inch loaf, then transfer to the pan. Cover loosely with oiled plastic wrap and set aside in a warm place until the loaf rises above the pan by 1/2 inch, 30 minutes to 1 hour. Meanwhile, preheat the oven to 375 degrees F.\n            \n\n              Uncover the pan and transfer to the oven. Reduce the temperature to 350 degrees F and bake until the bread is golden and sounds hollow when tapped, 35 to 45 minutes. (Cover loosely with foil if it is browning too quickly.) Brush with melted butter and let rest in the pan, 10 minutes. Turn out onto a rack and let cool before slicing or freezing.\n            \n\n              MAKE IT AHEAD Let the bread cool completely, wrap in plastic wrap and foil, and freeze for up to 2 weeks. To serve, unwrap and thaw at room temperature for 2 hours. Reheat, wrapped in foil, at 300 degrees F until warmed through, 30 minutes.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "yellow rice", "quantity": 0.6666666666666666}, {"food": "molasses", "quantity": 0.5}, {"food": "butter oil", "quantity": 4.0}, {"food": "", "quantity": 1.25}, {"food": "potato flour", "quantity": 4.0}, {"food": "milk", "quantity": 0.3333333333333333}, {"food": "salt", "quantity": 1.25}, {"food": "vegetable oil", "quantity": 1}], "title": "\nAnadama Bread\n"}, {"directions": "\n\n              Make the brownies: Preheat the oven to 325 degrees F. Butter a 10-inch ovenproof skillet; set aside. Combine the butter and chocolate in a medium saucepan over medium heat. Cook, stirring occasionally, until melted and smooth, 3 to 5 minutes. Whisk in the brown sugar and granulated sugar until incorporated. Set aside to cool slightly, then whisk in the eggs and vanilla. Whisk in the flour, chile powder, cinnamon, salt, orange zest and cloves until smooth. Pour the batter into the prepared skillet and bake until a toothpick inserted into the center comes out clean, 35 minutes. Let cool slightly.\n            \n\n              Meanwhile, make the chocolate sauce: Combine the heavy cream, butter, brown sugar, corn syrup and salt in a medium saucepan. Cook, whisking, until melted and barely simmering, 3 to 4 minutes. Whisk in the chocolate, cocoa powder, espresso powder and cayenne until smooth and slightly thickened. Let cool slightly.\n            \n\n              Cut the brownies into wedges. Top with ice cream and the chocolate sauce.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 12.0}, {"food": "sugar", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "eggs", "quantity": 4.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "cinnamon", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "orange", "quantity": 0.25}, {"food": "hearts of palm", "quantity": 1}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "butter oil", "quantity": 2.0}, {"food": "sugar", "quantity": 2.0}, {"food": "silk light vanilla", "quantity": 2.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "baking chocolate", "quantity": 4.5}, {"food": "onion powder", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "pepper", "quantity": 0.25}, {"food": "ice cream swich", "quantity": 1}], "title": "\nAncho Brownie Sundae\n"}, {"directions": "\n\n              Toast 2 seeded dried ancho chiles in a skillet, 1 minute; soak in 1/2 cup hot water until soft, 20 minutes. Puree the chiles and liquid with 2 tablespoons toasted almonds, the juice of 1 orange, 1 tablespoon honey and 3 tablespoons mayonnaise until smooth.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [], "title": "\nAncho Mayo\n"}, {"directions": "\n\n              Heat the olive oil in a large pot over medium-low heat. Add the ancho and cook, turning, until toasted, about 1 minute. Add the shallots and cook, stirring occasionally, until softened, about 3 minutes. Add the squash, cumin and 1 teaspoon salt, stirring to coat. Add 6 cups water and bring to a boil; reduce the heat to medium low and simmer until the squash is tender, 25 to 30 minutes.\n            \n\n              Working in batches, transfer the soup to a blender and puree until smooth (or puree in the pot with an immersion blender). Return the soup to the pot; stir in the agave and lime juice. Season with salt and thin with water as needed. Top each serving with pepitas and sprinkle with cayenne.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "", "quantity": 1.0}, {"food": "shallots", "quantity": 2.0}, {"food": "squash", "quantity": 1.0}, {"food": "cumin seed", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "tamarind nectar", "quantity": 2.0}, {"food": "", "quantity": 0.5}, {"food": "chili powder", "quantity": 1}], "title": "\nAncho-Butternut Squash Soup\n"}, {"directions": "\n\n              Toast the chiles in a dry medium saucepan over medium heat, turning occasionally, about 5 minutes. Add 2 cups water and the baking soda. Remove from the heat and let stand 10 minutes. Transfer the chiles and liquid to a blender and puree until smooth. Strain through a fine-mesh sieve into the saucepan, pressing the mixture through with a rubber spatula.\n            \n\n              Add the cranberries, sugar, maple syrup and 1/4 teaspoon salt to the pan. Bring to a simmer and cook, stirring occasionally, until the cranberries burst and the sauce thickens, 15 to 20 minutes. Remove from the heat and stir in the raisins. Let cool.\n            \n\n              Transfer the cranberry sauce to a bowl and refrigerate at least 3 hours or overnight.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "peppers", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1}, {"food": "frozen yogurt", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "syrup", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "raisins", "quantity": 0.5}], "title": "\nAncho-Maple Cranberry Sauce\n"}, {"directions": "\n\n              Cook the ancho chiles, sesame seeds and cumin seeds in a small dry skillet over medium heat, stirring, until the seeds are toasted and the anchos are pliable, 3 minutes. Transfer the anchos to a bowl; transfer the seeds to a food processor. Cover the anchos with hot water and let soften, 5 to 10 minutes; drain, then remove the stems and seeds. Add the anchos to the food processor. Add the Fresno chile, garlic, scallions, parsley and cilantro leaves, olive oil, raisins and 1 tablespoon salt to the food processor. Pulse to make a paste.\n            \n\n              Remove the neck and giblets from the turkey; set aside for the gravy. Pat the turkey dry with paper towels. Work your fingers between the skin and the meat on the breast and the top of the legs. Rub the chile paste under the skin and on the outside. Stuff the parsley and cilantro stems into the cavity. Season inside and out with 1 tablespoon salt and a few grinds of pepper. Tie the legs together with kitchen twine. Put the turkey on a rack set in a large roasting pan; tuck the wings under the body. Cover with plastic wrap; refrigerate at least 4 hours and up to 24 hours.\n            \n\n              Position an oven rack in the lowest position (remove the other racks); preheat to 350 degrees F. Uncover the turkey and let stand at room temperature 30 minutes. Roast until a thermometer inserted into the thigh registers 165 degrees F, 2 1/2 to 3 hours, tenting any parts that brown too quickly with foil. Meanwhile, start your gravy (or serve this turkey with defatted pan drippings).\n            \n\n              Transfer the turkey to a cutting board and let rest 30 minutes before carving. Serve with the gravy or pan drippings.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "peppers", "quantity": 2.0}, {"food": "sesame seeds", "quantity": 1.0}, {"food": "seeds", "quantity": 1.5}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "garlic powder", "quantity": 6.0}, {"food": "", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 0.25}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "raisins", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "smoked turkey roll", "quantity": 1.0}, {"food": "pepper", "quantity": 1}], "title": "\nAncho-Rubbed Turkey\n"}, {"directions": "\n\n              Heat 2 tablespoons olive oil in a large pot over medium-high heat. Add the sausage and cook, stirring occasionally, until browned, about 3 minutes. Add the celery, onion and bell pepper, season with salt and cook, stirring occasionally, until the vegetables soften, 3 to 5 minutes. Add the tomato paste and Cajun seasoning and cook, stirring occasionally, until the vegetables are coated, about 1 minute. Add the rice and cook, stirring, until coated, about 1 minute.\n            \n\n              Add the diced tomatoes and 5 cups water to the pot. Increase the heat to high and bring to a boil. Reduce the heat to a simmer, cover and cook until the rice is tender and the sauce thickens, 10 to 15 minutes.\n            \n\n              Stir the beans and chicken into the pot and cook until warmed through, about 1 minute. Top each serving with celery leaves and drizzle with olive oil.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "pepper", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "pasta with tomato sauce", "quantity": 2.0}, {"food": "seasoning mix", "quantity": 1.0}, {"food": "crisped rice bar", "quantity": 0.75}, {"food": "diced chicken", "quantity": 1.0}, {"food": "fava beans", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.5}], "title": "\nAndouille and Chicken Jambalaya\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the pasta and cook as the label directs. Reserve 1 1/2 cups cooking water, then drain the pasta. Meanwhile, put the carrots, walnuts, garlic, oregano, lemon zest, 1/4 teaspoon salt and the red pepper flakes in a food processor and pulse until finely chopped. Heat the olive oil in a large nonstick skillet over medium-high heat. Add the walnut-carrot mixture and the raisins and cook, stirring frequently, until the carrots soften and begin to brown, about 5 minutes. Add the reserved cooking water and bring to a simmer, then add the pasta, pecorino, lemon juice, parsley, and salt to taste and toss. Divide among bowls and top with more cheese. \n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "italian veg medley pasta", "quantity": 10.0}, {"food": "carrots", "quantity": 2.0}, {"food": "walnuts", "quantity": 0.3333333333333333}, {"food": "garlic powder", "quantity": 2.0}, {"food": "", "quantity": 0.5}, {"food": "lemon juice", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.5}, {"food": "parmesan cheese", "quantity": 0.5}, {"food": "", "quantity": 0.5}, {"food": "parsley", "quantity": 3.0}], "title": "\nAngel Hair Pasta With Walnut-Carrot Sauce\n"}, {"directions": "\n\n              1. Set a pot of water for the pasta on high heat and bring to a boil. In a large mixing bowl, grate the tomatoes on a large box grater, leaving behind the skins. Toss the tomatoes together with the ground almonds, basil, parsley, and garlic. Stir in the Parmesan, olive oil, and lemon zest. Season with 1 teaspoon salt and pepper. Set aside 1 cup sauce.\n            \n\n              2. When the water is boiling, cook the pasta according to package directions. Drain the pasta, reserving one-third cup pasta water, and toss with the remaining sauce. Add the pasta water.\n            \n\n              3. Divide the pasta among 4 bowls, top with the reserved sauce, and garnish with additional freshly grated Parmesan. Serve with crusty bread.\n            \n", "ingredients": [{"food": "italian veg medley pasta", "quantity": 12.0}, {"food": "tomatoes", "quantity": 1.25}, {"food": "almonds", "quantity": 0.3333333333333333}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 0.25}, {"food": "garlic powder", "quantity": 2.0}, {"food": "", "quantity": 0.75}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "lemon juice", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "garlic bread", "quantity": 1}], "title": "\nAngel Hair Pasta with Trapani-Style Pesto\n"}, {"directions": "\n\n              Combine the flour, sour cream, egg yolks, honey, lemon zest and salt in a stand mixer fitted with the dough hook attachment. Mix on medium-high speed until the dough comes together and begins to pull away from the bowl, 3 to 4 minutes. Turn out onto a floured surface and knead until smooth, about 5 minutes. Divide into 2 balls, loosely cover with plastic wrap and let sit at room temperature, 1 hour.\n            \n\n              Roll out each ball on a floured surface into a 12-inch square, about 1/8 inch thick. Cut each square into 7 strips, then cut each strip crosswise into thirds (you will have 42 rectangles). One at a time, make a 1-inch slit lengthwise down the center of each rectangle; lift a short end and thread it through the slit, then pull out; twist in the middle so it looks like a bow.\n            \n\n              Heat about 3 inches of vegetable oil in a pot over medium heat until a deep-fry thermometer registers 350 degrees F. Fry 5 to 7 cookies at a time, turning, until deep golden brown, 2 to 3 minutes. Remove with a slotted spoon and drain on paper towels. Toss in the confectioners' sugar. Store in an airtight container for up to 3 days.\n            \n\n              Photograph by Johnny Miller\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.0}, {"food": "sour cream", "quantity": 0.5}, {"food": "egg substitute", "quantity": 4.0}, {"food": "honey smoked ham", "quantity": 2.0}, {"food": "lemon juice", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 1}, {"food": "sugar", "quantity": 2.0}], "title": "\nAngel Wings\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F. Line a cookie sheet with parchment paper or a silicone sheet.\n            \n\n              Pulse the granulated sugar and lemon zest in a food processor until fine and fragrant.\n            \n\n              Lay 1 of the puff pastry sheets on a lightly floured work surface. Brush the sheet with about half of the butter and sprinkle with half of the lemon-sugar. Lightly press sugar into the pastry with a rolling pin. Place the other pastry sheet on top, brush with the remaining butter and sprinkle with remaining sugar. Carefully roll the pastry out into a 12-inch square, about 1 1/8-inch thick. Trim uneven edges with a pizza cutter or a knife to make a perfect square.\n            \n\n              Starting on the closest edge, roll the pastry up into a cylinder but stop at the mid point of the dough. Roll the pastry up on the opposite side so it looks like an old-fashioned scroll. Adjust the rolls so they are even and meet in the center. Wrap tightly in plastic wrap and freeze until firm, 20 minutes.\n            \n\n              Slice the roll, crosswise, with a serrated knife into 1/4-inch thick pieces and lay on the prepared baking sheet. Bake until the cookies soften, about 10 minutes. Working quickly and efficiently, remove the cookies from the oven--if they have lost their shape, gently roll them back together. Let cool on the pan for a minute to set. Turn them with a spatula (take care to keep the shape) sprinkle with the yellow sugar and return to the oven. Continue to bake until golden brown, about 15 more minutes. Transfer cookies to a rack, sugary sides up, to cool. Serve.\n            \n\n              Store cookies in a tightly sealed container for up to 3 days.\n            \n", "ingredients": [{"food": "sugar", "quantity": 0.75}, {"food": "lemon juice", "quantity": 2.0}, {"food": "puff pastry", "quantity": 2.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "barley flour or meal", "quantity": 0.5}], "title": "\nAngel Wings\n"}, {"directions": "\nSpecial equipment: White cupcake liners, 2 pastry bags, no. 4 round pastry tip\n\n              For the cupcakes: Position an oven rack in the center of the oven, and preheat to 350 degrees F. Line a 12-cup muffin tin with cupcake liners, and lightly coat with cooking spray.\n            \n\n              Sift the flour, confectioners' sugar and 1/4 teaspoon salt through a fine sieve into a medium bowl; set aside.\n            \n\n              Combine the egg whites in a bowl and beat with an electric mixer on medium speed until frothy, about 2 minutes. Add the cream of tartar, and beat until soft peaks form, about 2 minutes. Gradually add the granulated sugar, about 1 tablespoon at a time. Increase the speed to medium-high, and continue beating until the peaks are stiff and very shiny, about 5 minutes. Beat in the vanilla and lemon zest. Remove the bowl from the stand.\n            \n\n              Sprinkle 1/4 of the flour mixture on top of the eggs, and gently fold in with a rubber spatula. Evenly fold in the remaining flour mixture in 3 additions.\n            \n\n              Divide the batter evenly among the lined muffin cups in messy mounds taller than the liners, and bake until the cupcakes spring back when gently pressed and a toothpick inserted in the center comes out clean, 14 to 16 minutes. Let cool in the pan for a few minutes, then transfer to a rack to cool completely.\n            \n\n              For the halo decorations: Cut 12 sticks 1 inch long and about 1/8 inch thick out of the crystallized ginger. Trim the ends so they are straight across.\n            \n\n              Trace 12 circles on a piece of parchment with a 1-inch round cookie cutter. Turn the paper over; set aside. Fit one of the pastry bags with the tip.\n            \n\n              Microwave the candy coating in a small bowl, uncovered, at 40 percent power in 30-second increments, stirring in between, until melted and completely smooth. Transfer the candy coating to the pastry bag, and pipe it into 12 circles, using the parchment template as a guide. Set aside to let harden slightly. Pipe 1 small dollop of the candy coating directly onto each circle, and push a ginger stick into each so it is standing straight up. Let the halos harden completely.\n            \n\n              For the frosting: Bring a few inches of water to a boil in a saucepan that can hold a stand mixer's heatproof bowl above the water (or a large heatproof bowl if using a handheld mixer). Whisk the egg whites, granulated sugar, cream of tartar and a pinch of salt together in the bowl; set the bowl above the boiling water and whisk until the mixture is warm to the touch and the sugar dissolves, 1 to 2 minutes. Beat the egg white mixture with an electric mixer at medium-high speed until it is cool and forms stiff peaks, about 5 minutes.\n            \n\n              Decorate the cupcakes: Transfer the frosting to the remaining pastry bag, and pipe generous swirls on top of each cupcake, lifting the bag up quickly to make a peak. Push the ginger stem of a halo into each, and serve right away.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 0.5}, {"food": "sugar", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "egg substitute", "quantity": 5.0}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "sugar", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "lemon juice", "quantity": 0.5}, {"food": "ginger", "quantity": 1.0}, {"food": "martha white foods", "quantity": 0.25}, {"food": "egg substitute", "quantity": 4.0}, {"food": "sugar", "quantity": 0.75}, {"food": "ice cream swich", "quantity": 0.25}, {"food": "salt", "quantity": 1}], "title": "\nAngel's Food Cupcakes\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Bring a large pot of salted water to a boil. Add the pasta and cook as the label directs, adding the greens to the water. Drain and rinse under cold water; transfer to a large bowl.\n            \n\n              Combine the shrimp, red pepper flakes, 1/2 teaspoon salt and a few grinds of pepper in a medium bowl. Heat the olive oil in a large skillet over medium-high heat. Add the garlic and cook until golden, about 1 minute. Add the shrimp and cook until pink, about 3 minutes per side. Add the tomatoes and cook, stirring often, until slightly softened, about 2 minutes.\n            \n\n              Add the shrimp mixture to the bowl with the pasta along with the basil and lemon zest and juice; toss to combine.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "silk black cherry soy yogurt", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "italian veg medley pasta", "quantity": 8.0}, {"food": "escarole", "quantity": 8.0}, {"food": "shrimp", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "pepper", "quantity": 1}, {"food": "basil", "quantity": 0.5}, {"food": "grape juice", "quantity": 0.5}], "title": "\nAngel-Hair Pasta with Shrimp and Greens\n"}, {"directions": "\n\n              Thinly slice a baguette; arrange in a single layer on a baking sheet. Brush with softened butter and sprinkle with salt and sugar. Bake at 425 degrees F until lightly golden, about 7 minutes. Let cool slightly.\n            \n\n              Simmer 1/4 cup water, some thin strips of lemon zest, 1/2 teaspoon anise seeds and 2 tablespoons sugar in a saucepan until syrupy. Spread lemon curd on the toast rounds. Top with the candied zest and anise seeds.\n            \n\n              Photograph by Andrew McCaul\n            \n", "ingredients": [], "title": "\nAnise-Lemon Bruschetta\n"}, {"directions": "\n\n              Heat 3 tablespoons olive oil in a large skillet over medium heat. Add the garlic and cook until fragrant, about 1 minute. Increase the heat to high; add the bread in batches and toast until golden on both sides. Set aside and season with salt.\n            \n\n              Whisk the vinegar, the remaining 5 tablespoons oil, 1/2 teaspoon salt and pepper to taste in a large bowl. Add the radicchio, celery, salami, basil, mozzarella and olives; toss to coat.\n            \n\n              Place 1 romaine half on each plate. Drizzle with olive oil and season with salt and pepper. Spoon the salad onto each wedge, drizzling any remaining dressing on top; serve with the toasts.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.5}, {"food": "garlic powder", "quantity": 2.0}, {"food": "garlic bread", "quantity": 8.0}, {"food": "salt", "quantity": 1}, {"food": "vinegar", "quantity": 2.0}, {"food": "pepper", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "salami", "quantity": 6.0}, {"food": "chrysanthemum leaves", "quantity": 10.0}, {"food": "melon balls", "quantity": 8.0}, {"food": "black bean mango", "quantity": 20.0}, {"food": "hearts of palm", "quantity": 2.0}], "title": "\nAntipasti Dinner Salad\n"}, {"directions": "\n\n              Bring a medium pot of water to a boil, add the pasta and cook according to package instructions; drain, reserving 1/2 cup of the pasta water. Return the pasta to the pot.\n            \n\n              Meanwhile, heat the olive oil in a large nonstick skillet over medium-high heat. Add the soppressata and cook, stirring, until blistered and the oil turns reddish, about 3 minutes. Add the artichoke hearts and olives and stir to coat. Add the tomatoes, the reserved pasta water, basil leaves and 2 tablespoons of olive brine. Bring to a simmer and cook until most of the water evaporates and the sauce thickens slightly, 8 to 10 minutes.\n            \n\n              Add the sauce and mozzarella to the pasta in the pot and stir to combine. Divide among 4 bowls and garnish with more basil.\n            \n", "ingredients": [{"food": "", "quantity": 12.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "salami", "quantity": 3.5}, {"food": "artichoke hearts", "quantity": 14.0}, {"food": "hot pockets ham cheese stuffed swich", "quantity": 6.0}, {"food": "diced chicken", "quantity": 14.0}, {"food": "chrysanthemum leaves", "quantity": 4.0}, {"food": "pineapple chunks", "quantity": 1.0}], "title": "\nAntipasti Penne\n"}, {"directions": "\n\n              Soak the red onion in a small bowl of ice water, 10 minutes; drain and pat dry.\n            \n\n              Meanwhile, put the potatoes in a large saucepan; cover with cold water and season with 1 teaspoon salt. Bring to a simmer and cook until tender, 10 to 12 minutes. Drain and transfer to a large bowl. Add 1/4 cup olive oil, 2 tablespoons vinegar, the sugar, 1/2 teaspoon salt and a few grinds of pepper; toss until the potatoes absorb most of the dressing.\n            \n\n              Add the giardiniera, provolone, salami, artichoke hearts, olives and red onion to the bowl with the potatoes; toss. Let cool to room temperature.\n            \n\n              Drizzle the potato salad with the remaining 3 tablespoons olive oil and 1 tablespoon vinegar. Add the basil and season with salt and pepper. Toss again just before serving.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "onion powder", "quantity": 0.5}, {"food": "sweet potatoes", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "vinegar", "quantity": 3.0}, {"food": "sugar", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "vegetables", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "sliced salami", "quantity": 0.5}, {"food": "artichoke hearts", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}, {"food": "basil", "quantity": 0.5}], "title": "\nAntipasti Potato Salad\n"}, {"directions": "\n\n              For the salad: To mellow the minced onion, soak it in cold water for 10 minutes, then drain well, pat dry, and put in a serving bowl.\n            \n\n              Meanwhile, make the dressing: Smash the garlic clove, sprinkle with 1/2 teaspoon of the salt, and, with the side of a large knife, mash and smear the mixture to a coarse paste. Put the paste in a bowl and add the orange zest, vinegar, remaining 1 teaspoon salt, and black pepper, to taste. Gradually whisk in the olive oil, starting with a few drops and then adding the rest in a steady stream to make a smooth, slightly thick dressing.\n            \n\n              Using a handheld mandoline or a knife, cut the fennel lengthwise into long, thin slices. Add to the onion and toss with the chickpeas, peppers, artichoke hearts, arugula, parsley, and dressing. Scatter the olives and shave the Parmigiano-Reggiano over the top.\n            \n", "ingredients": [{"food": "onion powder", "quantity": 0.25}, {"food": "fennel seed", "quantity": 0.5}, {"food": "chickpeas", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 4.75}, {"food": "artichoke hearts", "quantity": 1.0}, {"food": "arugula", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "olives", "quantity": 0.25}, {"food": "", "quantity": 0.5}, {"food": "garlic powder", "quantity": 1.0}, {"food": "salt", "quantity": 1.5}, {"food": "orange", "quantity": 1.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.3333333333333333}], "title": "\nAntipasti Salad\n"}, {"directions": "\n\n              For the salad: To mellow the minced onion, soak it in cold water for 10 minutes, then drain well, pat dry, and put in a serving bowl.\n            \n\n              Meanwhile, make the dressing: Smash the garlic clove, sprinkle with 1/2 teaspoon of the salt, and, with the side of a large knife, mash and smear the mixture to a coarse paste. Put the paste in a bowl and add the orange zest, vinegar, remaining 1 teaspoon salt, and black pepper, to taste. Gradually whisk in the olive oil, starting with a few drops and then adding the rest in a steady stream to make a smooth, slightly thick dressing.\n            \n\n              Using a handheld mandoline or a knife, cut the fennel lengthwise into long, thin slices. Add to the onion and toss with the chickpeas, peppers, artichoke hearts, arugula, parsley, and dressing. Scatter the olives and shave the Parmigiano-Reggiano over the top.\n            \n", "ingredients": [{"food": "garlic powder", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "orange", "quantity": 1.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 13.0}, {"food": "onion powder", "quantity": 14.0}, {"food": "fennel seed", "quantity": 12.0}, {"food": "chickpeas", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 4.0}, {"food": "artichoke hearts", "quantity": 1.0}, {"food": "arugula", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "olives", "quantity": 14.0}, {"food": "macaroni cheese", "quantity": 12.0}], "title": "\nAntipasti Salad\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: a meat mallet, butcher's twine and an instant-read thermometer\n\n              For the flank steak: Set the flank steak on a cutting board. Starting at the thin, narrow end of the steak, slice it in half horizontally to within 2 inches of the opposite wide end. Open it up like a book so you have one long piece. Pound the steak with a mallet to an even thickness of about 1/2 inch.\n            \n\n              Whisk together the oil, vinegar, honey, red pepper, garlic and 1/2 teaspoon each salt and pepper in a medium bowl. Combine the marinade with the meat in a large resealable plastic bag and flip over several times to make sure the meat is well coated. Marinate in the refrigerator for 2 hours, flipping several times.\n            \n\n              For the herb paste and sauce: Combine the basil, parsley, red pepper, garlic and 1 teaspoon salt in a food processor and pulse until finely chopped. With the motor running, slowly pour in 1/4 cup of the oil. Remove 2 tablespoons of the herb paste from the processor and mix with the remaining 1/4 cup oil in a small bowl; reserve this sauce for finishing.\n            \n\n              Prepare an outdoor grill for direct and indirect grilling. (If your grill has a thermometer, aim to keep the temperature at about 350 degrees F throughout grilling.)\n            \n\n              Remove the steak from the marinade and pat dry. Spread it flat on a work surface. Cover the steak with the remaining herb paste, leaving a 1-inch border along the edges. Layer with the ham, mozzarella and salami, then sprinkle with the mushrooms and roasted peppers. Arrange the hot peppers in a line along the edge of one of the short ends (when you roll up the steak they will be in the middle). Roll up the steak like a jelly roll, starting at the short end with the hot peppers. Tie the roll closed around the circumference with butcher's twine at 2-inch intervals. Tie one more piece of twine lengthwise around the meat.\n            \n\n              Put the steak on the direct heat side of the grill and cook, turning, to brown all 4 sides, about 2 minutes per side. Move the steak to the indirect heat side of the grill, cover and cook, turning occasionally, until the very center reads 115 degrees F on an instant-read thermometer for a steak that is well done on the outside and medium rare in the center, 25 to 30 minutes more. (Test frequently; the time will vary based on the temperature of your grill.) Let the steak rest 5 to 6 minutes.\n            \n\n              Untie the steak and cut it into 6 thick slices. Serve with the reserved herb sauce for drizzling.\n            \n", "ingredients": [{"food": "", "quantity": 1.5}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "vinegar", "quantity": 2.0}, {"food": "honey smoked ham", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "garlic powder", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "ham", "quantity": 4.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "sliced salami", "quantity": 4.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.5}, {"food": "ruby red grapefruit juice blend", "quantity": 4.333333333333333}, {"food": "hot pockets ham cheese stuffed swich", "quantity": 8.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "garlic powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.5}], "title": "\nAntipasti-Stuffed Flank Steak\n"}, {"directions": "\n\n              Put the eggs in a medium saucepan and cover with water by 2 inches; bring to a simmer and cook 10 minutes. Remove the eggs with a slotted spoon and transfer to a bowl of ice water to cool. Meanwhile, put the potatoes in a pot of salted water, bring to a simmer and cook until tender, about 10 minutes. Drain and keep warm. Whisk the vinegar, mustard, 1/4 teaspoon salt, and pepper to taste in a large bowl. Drizzle in the olive oil, whisking, until the dressing is creamy. Add the potatoes, giardiniera, salami, olives, chives and kale, and toss. Peel and quarter the eggs. Add to the salad and gently toss. \n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [{"food": "eggs", "quantity": 4.0}, {"food": "sweet potatoes", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "vinegar", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "vegetables", "quantity": 2.0}, {"food": "salami", "quantity": 2.0}, {"food": "olives", "quantity": 0.25}, {"food": "chives", "quantity": 0.25}, {"food": "turnip greens", "quantity": 4.0}], "title": "\nAntipasto Chef's Salad\n"}, {"directions": "\n\n              1. Assemble the meats and cheeses on a large cutting board or flat platter to come to room temperature at least 30 minutes before serving. \n            \n\n              2. Place cheese knives next to each kind of cheese, small forks for the meats, and a small bowl for anything like olive pits or used toothpicks. \n            \n\n              3. If time permits, serve with at least one simple homemade item like: Honey Ricotta Pears, Wine-Poached Figs, or Warm Mediterranean Olives. \n            \n\n              4. Place the bread and crackers in a basket on the side or directly on the board. Arrange the fruits and nuts on the board or in small decorative bowls. Serve with red and white wine.\n            \n\nHoney-Ricotta Pear:\n\n\n              1. Halve and core the pear, then cut into slices, leaving the stem-end intact and not cutting through to separate the slices. Squeeze the lemon juice over the cut side of the pear halves. \n            \n\n              2. Season the ricotta with 1/4 teaspoon salt and 1/4 teaspoon pepper, then place in 2 mounds on a plate. Top the ricotta mounds with the sliced pear halves, gently fanning out the slices. Drizzle the pears with honey and sprinkle with the pine nuts.\n            \n\nWine-Poached Figs:\n\n\n              Trim and halve the figs, place in a saucepan with the wine, sugar, salt and pepper and bring to a boil. Reduce to a simmer and cook until the wine is reduced by half and slightly thickened, about 10 minutes. Remove from the heat and stir in the thyme sprigs. Serve on top of an assertive cheese, such as blue, Taleggio, or a triple cream, spread over the bread slices.\n            \n\nWarm Mediterranean Olives:\n\n\n              Heat the oil in a heavy saucepan over medium heat. Add the shallots and garlic and cook until softened, about 5 minutes. Remove from the heat and stir in the sugar, vinegar, cinnamon stick, orange peel, and olives. Season with salt and pepper.\n            \n", "ingredients": [{"food": "sliced salami", "quantity": 1.5}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 6.0}, {"food": "", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "garlic bread", "quantity": 1}, {"food": "crackers", "quantity": 1}, {"food": "fruit cocktail", "quantity": 1}, {"food": "mixed nuts", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1}, {"food": "pear nectar", "quantity": 1.0}, {"food": "lemon juice", "quantity": 0.5}, {"food": "whole milk", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "pine nuts", "quantity": 1.0}, {"food": "figs", "quantity": 8.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "sugar", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "thyme", "quantity": 2.0}, {"food": "garlic bread", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "sugar", "quantity": 3.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "orange peel", "quantity": 1.0}, {"food": "mixed nuts", "quantity": 2.0}, {"food": "salt", "quantity": 1}], "title": "\nAntipasto Platter\n"}, {"directions": "\nSpecial equipment: Four 12-inch skewers\n\n              Prepare a grill for medium-high heat. Push 1 lemon piece to the bottom of a skewer. Lay 2 slices of salami on top of each other, fold in half, then push onto the skewer snugly against the lemon. Wrap a basil leaf around a piece of the cheese, and push them onto the skewer, catching both sides of the leaf if possible. Fold a red pepper strip in half, and add it to the skewer, followed by an artichoke piece and an olive. Repeat from salami to olive twice on the skewer, and top with a lemon piece. Repeat with the remaining skewers. Transfer to a rimmed baking sheet.\n            \n\n              Lightly oil the grill grates. Brush the skewered food with the marinade from the artichoke. Lightly drizzle the bread with oil, and season with salt and black pepper. Grill the bread on both sides until browned and crisp, about 3 minutes total; transfer to a serving tray.\n            \n\n              Grill the skewers until grill marks appear and the edges of the artichoke pieces are beginning to brown, about 1 minute per side. If the cheese sticks to the grill, use a metal spatula to loosen. Serve the skewers with the grilled bread, and squeeze with lemon before serving.\n            \n", "ingredients": [{"food": "lemon juice", "quantity": 4.0}, {"food": "salami", "quantity": 24.0}, {"food": "chrysanthemum leaves", "quantity": 12.0}, {"food": "hearts of palm", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 8.0}, {"food": "whole milk", "quantity": 6.0}, {"food": "olives", "quantity": 12.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "barbecue loaf", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nAntipasto Skewers\n"}, {"directions": "\n\n              Combine the bourbon, 1 cup cold water, the vermouth, Aperol and cherry syrup in a resealable plastic container. Freeze at least 1 hour.\n            \n\n              Pour into glasses and add the cherries. Garnish with the orange slices.\n            \n\n              Photograph by Ryan Liebe\n            \n", "ingredients": [{"food": "", "quantity": 2.0}, {"food": "sweet potatoes", "quantity": 0.5}, {"food": "", "quantity": 0.25}, {"food": "fruit cocktail", "quantity": 8.0}, {"food": "luncheon slices", "quantity": 1}], "title": "\nAperol Manhattans\n"}, {"directions": "\n\n              In a large, non-reactive, saucepan over medium-low heat, melt the butter. Add the onions, cook until softened but not browned, about 10 minutes. Add the apple and continue cooking until cooked, but still slightly firm, about 10 minutes more.\n            \n\n              Sift the flour over the onions. Add the nutmeg. Cook and stir with a wooden spoon until the mixture is lightly browned and fragrant, about 4 to 5 minutes. Add the Calvados, if using, and cook to reduce by three-quarters.\n            \n\n              Gradually whisk in the broth until well blended. Bring to a boil, reduce heat, cover, and simmer, stirring occasionally for 10 minutes. Add the milk, return to just a boil, whisk in cheeses until completely melted. Season with pepper to taste.\n            \n\n              Serve hot, with crumbled bacon on top, and a crusty bread and chutney on the side.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 6.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "apples", "quantity": 2.25}, {"food": "potato flour", "quantity": 0.75}, {"food": "nutmeg", "quantity": 0.125}, {"food": "barley flour or meal", "quantity": 2.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "milk", "quantity": 1.0}, {"food": "cheddar cheese", "quantity": 1.0}, {"food": "cheddar cheese", "quantity": 1.0}, {"food": "salt", "quantity": 2.5}, {"food": "black bean mango", "quantity": 1}, {"food": "bacon", "quantity": 1}], "title": "\nApple Cheese Soup\n"}, {"directions": "\n\n              Core and coarsely chop the apples (do not peel). Combine with 1 1/2 cups cider in a medium saucepan over medium heat; cover and cook until softened, about 8 minutes. Uncover and continue cooking until the apples are tender and the cider is almost completely reduced, about 5 minutes. Puree with an immersion blender or in a food processor until smooth. Measure the sauce; you should have 1 cup. (Boil to reduce further, if necessary.) Let cool slightly.\n            \n\n              Whisk the flour, baking powder, baking soda, 1 1/2 teaspoons cinnamon, salt and nutmeg in a medium bowl.\n            \n\n              Beat 2/3 cup granulated sugar and the shortening in another bowl with a mixer on medium speed until sandy. Beat in the egg and yolk, then gradually mix in the applesauce, scraping the bowl. Beat in half of the flour mixture, then the buttermilk and vanilla, and then the remaining flour mixture. Mix to make a sticky dough; do not overmix.\n            \n\n              Scrape the dough onto a lightly floured sheet of parchment paper and pat into a 7-by-11-inch rectangle, about 1/2 inch thick. Cover with plastic wrap and refrigerate for at least 2 hours or overnight.\n            \n\n              Meanwhile, make the glaze: Simmer the remaining 1 cup cider in a small saucepan over medium heat until reduced to 1/4 cup. Whisk in the confectioners' sugar until smooth and glossy, then set aside. Mix the remaining 1 cup granulated sugar and 2 teaspoons cinnamon in a shallow bowl; set aside for the topping.\n            \n\n              Heat 2 inches of vegetable oil in a large heavy-bottomed pot over medium-high heat until a deep-fry thermometer registers 350 degrees. Line a baking sheet with paper towels. Cut the chilled dough into 12 rounds, using a floured 2 1/2- or 3-inch biscuit cutter, then cut out the middles with a 1-inch cutter (or use a doughnut cutter). Slip 2 or 3 doughnuts at a time into the hot oil and fry until golden brown, 1 to 2 minutes per side, adjusting the heat as needed. Transfer to the paper towels to drain.\n            \n\n              Dip one side of each doughnut in the cider glaze, letting the excess drip off; dip just the glazed side in the cinnamon-sugar or roll all over in cinnamon-sugar, if desired. Serve warm.\n            \n\n              Photograph by Kate Mathis\n            \n", "ingredients": [{"food": "ruby red grapefruit juice blend", "quantity": 2.0}, {"food": "apple", "quantity": 2.5}, {"food": "potato flour", "quantity": 3.5}, {"food": "baking chocolate", "quantity": 4.0}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "cinnamon", "quantity": 3.5}, {"food": "salt", "quantity": 1.0}, {"food": "nutmeg", "quantity": 0.25}, {"food": "sugar", "quantity": 1.6666666666666665}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.25}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "sugar", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 1}], "title": "\nApple Cider Doughnuts\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 400 degrees F. \n            \n\n              Heat the cider in a medium skillet over medium-high heat until it comes to a boil. Continue to cook until syrupy and reduced to about 2 tablespoons, 12 to 14 minutes. Set aside to cool slightly. \n            \n\n              Whisk the flour, cream of tartar, baking soda, cinnamon and salt in a medium bowl until smooth. Beat the butter with 1/2 cup of the granulated sugar and the light brown sugar in a separate bowl on medium-high speed until fluffy and smooth, 2 to 3 minutes. Beat in the reduced cider and the egg (the mixture may look slightly curdled). Stir in the flour mixture and 1/4 cup of the chopped apple chips until combined. \n            \n\n              Stir together the remaining 3 tablespoons of granulated sugar, 2 tablespoons of chopped apple chips and the apple pie spice in a small bowl. Roll heaping tablespoons of dough into balls, using lightly moistened hands if the dough is too sticky, and then roll in the spiced sugar mixture. Place the dough balls 3 inches apart on ungreased baking sheets and top with a few pieces of whole apple chips. Bake until the edges are just set but centers are still soft, 11 to 13 minutes, rotating pans halfway through the baking time. Cool 2 to 3 minutes on the baking sheet, and then transfer to a wire rack to cool completely.\n            \n", "ingredients": [{"food": "apple", "quantity": 1.25}, {"food": "potato flour", "quantity": 1.5}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "cinnamon", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 0.5}, {"food": "sugar", "quantity": 0.5}, {"food": "sugar", "quantity": 0.25}, {"food": "egg substitute", "quantity": 1.0}, {"food": "potato chips", "quantity": 0.25}, {"food": "pumpkin pie spice", "quantity": 2.0}], "title": "\nApple Cider Snickerdoodles\n"}, {"directions": "\nSpecial equipment: Two 6-ounce, 3 1/2-inch ramekins\n\n              For the filling: Preheat the oven to 400 degrees F. Toss the apples with 2 heaping tablespoons of the sugar, the flour, cinnamon and nutmeg. Add the butter, and toss. Divide the filling between two 6-ounce, 3 1/2-inch ramekins, tent each loosely with foil and bake until the apples are tender and the juice is bubbling, about 35 minutes. Remove the ramekins from the oven, remove the foil, give the apples barely a stir with a fork and press the top into the juices.\n            \n\n              For the topping: Whisk together the flour, the baking powder, salt and 1 teaspoon of the sugar in a small bowl. Quickly stir in the heavy cream, then work the dough with your fingers as if you were working butter into pie dough, to make moist, slightly flattened chunks of dough.\n            \n\n              Top each ramekin with dough, dividing evenly. Sprinkle each with 1/2 teaspoon of the remaining sugar, and bake until the topping is browned and crisp, 12 to 15 minutes. Let cool slightly, top with ice cream and serve.\n            \n", "ingredients": [{"food": "apples", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "cinnamon", "quantity": 0.25}, {"food": "nutmeg", "quantity": 0.125}, {"food": "butter oil", "quantity": 1.0}, {"food": "potato flour", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "sugar", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 3.0}, {"food": "ice cream swich", "quantity": 2.0}], "title": "\nApple Cobbler for Two\n"}, {"directions": "\n\n              For the crust: Whisk the flour, sugar and salt together in a medium bowl. Using your fingers, work the butter into the dry ingredients until it resembles coarse cornmeal mixed with pea-sized bits of cold butter. (If the butter gets too soft, refrigerate the mixture for 10 minutes before proceeding.) Use a fork to stir in the egg and water mixture until the dough just comes together. (If the dough is dry, add up to 1 tablespoon more cold water.) Divide the dough into two equal-sized disks, wrap in plastic wrap and refrigerate until thoroughly chilled, at least 1 hour.\n            \n\n              For the filling: Peel, halve and core the apples. Cut each half into 4 wedges and place in a bowl with the lemon juice and cranberries, tossing to combine. Add the sugar and toss again to combine evenly.\n            \n\n              Melt the butter over medium-high heat in a large skillet. Add the apple mixture and cook, stirring occasionally, until the sugar dissolves and the mixture begins to simmer, about 2 minutes. Cover the pan and reduce the heat to medium-low, cooking until the apples soften and release most of their juices and the cranberries have burst, about 7 minutes.\n            \n\n              Strain the apple mixture into a colander set over the bowl, shaking it to collect as much of the juice as possible. Pour the liquid back into the skillet, add the cinnamon and ginger, and simmer over medium heat until thickened and lightly caramelized, about 10 minutes. Return the reduced juice and the apple mixture to the bowl and toss to recombine. Chill the filling until it cools completely, at least an hour and up to 2 days.\n            \n\n              To assemble the pie: On a lightly floured surface, roll each disk into an 11- to 12-inch circle. Lay each dough circle between two pieces of parchment or wax paper on a baking sheet and refrigerate for at least 10 minutes.\n            \n\n              Place a baking sheet on a rack positioned in the lower third of the oven and preheat to 375 degrees F. Line the bottom of a 9-inch pie dish with one of the dough discs and trim it to leave a 1/2-inch overhang on all sides. Stir the cornstarch into the filling and add it to the pan.\n            \n\n              Use a chef's knife, pizza cutter or fluted dough cutter to cut the second round into 1/2-inch thick strips. Lay strips of dough, evenly spaced, across the entire pie. Weave more strips of dough perpendicular through the previous strips to make a lattice or basket weave design across the entire pie. Trim the excess ends from the strips of dough. Pinch the bottom crust edge and lattice edge together, and flute the edge as desired. Brush the surface of the dough with egg and then sprinkle with sugar. Refrigerate for at least 30 minutes.\n            \n\n              Bake the pie on the preheated baking sheet until the crust is golden, 50 to 60 minutes. If the edges begin to brown too fast, cover them with strips of aluminum foil. Let the pie cool 1 hour before serving. Once completely cooled, the pie keeps well at room temperature (covered) for 24 hours, or refrigerated for up to 4 days.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.5}, {"food": "sugar", "quantity": 4.0}, {"food": "salt", "quantity": 0.25}, {"food": "diced chicken", "quantity": 14.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 2.5}, {"food": "lemon juice", "quantity": 2.0}, {"food": "frozen yogurt", "quantity": 2.0}, {"food": "sugar", "quantity": 0.75}, {"food": "butter oil", "quantity": 4.5}, {"food": "cinnamon", "quantity": 0.25}, {"food": "ginger", "quantity": 0.25}, {"food": "cornstarch", "quantity": 2.0}, {"food": "egg substitute", "quantity": 1.0}], "title": "\nApple Cranberry Pie\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F. Lightly butter 6 (6-ounce) ramekins.\n            \n\n              Whisk the oats, flour, brown sugar, pecans, and salt in a medium bowl. Rub in the butter with your fingertips until it is in even, pea-size pieces. Peel, core, and coarsely chop the apples and divide evenly among the ramekins. Scatter the crisp topping evenly over the fruit in each ramekin.\n            \n\n              Transfer the ramekins to a baking sheet and cook until the fruit bubbles around the sides and the top is golden, about 30 minutes.\n            \n\n              Preheat a broiler. Place the crisps about 4 inches from the broiler and cook until golden brown, about 30 seconds. Let cool about 15 minutes before serving. Serve warm with whipped cream, if using.\n            \n\n              In our diabetic-friendly desserts, we use small amounts of sweeteners in accordance with guidelines set up by the American Diabetic Association. As with all sweets, moderation is important.\n            \n", "ingredients": [{"food": "oats", "quantity": 0.6666666666666666}, {"food": "potato flour", "quantity": 0.3333333333333333}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "pecans", "quantity": 0.3333333333333333}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 6.0}, {"food": "baking chocolate", "quantity": 4.0}, {"food": "whipped cream substitute", "quantity": 1}], "title": "\nApple Crisp\n"}, {"directions": "\n\n              Fill a martini shaker with a scoop of ice. Add the apple juice, rum, apple butter, caramel sauce and apple pie spice. Shake vigorously until thoroughly mixed and chilled, about 30 seconds. Strain the rum mixture into 4 shot glasses. Top with whipped cream and a drizzle of caramel sauce. Serve immediately.\n            \n", "ingredients": [{"food": "apple juice", "quantity": 0.25}, {"food": "", "quantity": 0.25}, {"food": "butter oil", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "pumpkin pie spice", "quantity": 0.25}, {"food": "ice cream swich", "quantity": 1}], "title": "\nApple Crisp Rum Shooter\n"}, {"directions": "\n\n              For the base and streusel topping: Preheat the oven to 350 degrees F. Butter the bottom of an 8-inch-square baking pan.\n            \n\n              Put the flour, oats, sugars, baking soda and salt in the bowl of a food processor fitted with a metal blade. Pulse 6 times, about 3 seconds per pulse, until some of the oatmeal is finely chopped and some still large or whole. Drizzle in the melted butter, toss with a fork and then pulse until the mixture comes together, about 8 times.\n            \n\n              Press two-thirds of the oat mixture into the prepared pan. Squeeze spoonfuls of the remaining mixture in your palm to make chunks — some larger, some smaller — and place in a small bowl. Cover with plastic wrap. Refrigerate both the base and the chunks for 30 minutes.\n            \n\n              For the filling: Put the apple butter, dried fruit, cinnamon and 2 tablespoons water in the cleaned bowl of the food processor and pulse to a chunky paste.\n            \n\n              Spread the filling over the chilled base. Scatter the streusel topping over the filling, leaving some of the filling showing through. Bake until the streusel is toasty and crisp, about 30 minutes. Cool completely on a rack, about 2 hours, before slicing into 16 squares.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 10.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "oats", "quantity": 1.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "sugar", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "sea lion", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "butter oil", "quantity": 0.5}, {"food": "apples", "quantity": 4.0}, {"food": "fruit cocktail", "quantity": 4.0}, {"food": "cinnamon", "quantity": 0.25}], "title": "\nApple Crumble Bars\n"}, {"directions": "\n\n              For the base and streusel topping: Preheat the oven to 350 degrees F. Butter the bottom of an 8-inch-square baking pan. \n            \n\n              Put the flour, oats, sugars, baking soda and salt in the bowl of a food processor fitted with a metal blade. Pulse 6 times, about 3 seconds per pulse, until some of the oatmeal is finely chopped and some still large or whole. Drizzle in the melted butter, toss with a fork and then pulse until the mixture comes together, about 8 times. \n            \n\n              Press two-thirds of the oat mixture into the prepared pan. Squeeze spoonfuls of the remaining mixture in your palm to make chunks - some larger, some smaller - and place in a small bowl. \n            \n\n              Cover with plastic wrap. Refrigerate both the base and the chunks for 30 minutes. \n            \n\n              For the filling: Put the apple butter, dried fruit, cinnamon and 2 tablespoons water in the cleaned bowl of the food processor and pulse to a chunky paste. Spread the filling over the chilled base. Scatter the streusel topping over the filling, leaving some of the filling showing through. Bake until the streusel is toasty and crisp, about 30 minutes. Cool completely on a rack, about 2 hours, before slicing into 16 squares.\n            \n\n              From Food Network Kitchen\n            \n", "ingredients": [{"food": "butter oil", "quantity": 10.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "oats", "quantity": 1.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "sugar", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "sea lion", "quantity": 1}, {"food": "butter oil", "quantity": 0.5}, {"food": "apples", "quantity": 4.0}, {"food": "fruit cocktail", "quantity": 4.0}, {"food": "cinnamon", "quantity": 0.25}], "title": "\nApple Crumble Bars\n"}, {"directions": "\n\n              For the dough: Pulse the flour, granulated sugar and salt in a food processor until combined. Add the butter and pulse until the mixture resembles yellow cornmeal mixed with pea-sized bits of butter. Add the egg mixture and pulse until the dough just comes together. (If the dough is very dry, add up to 1 extra tablespoon cold water.) Remove the dough, gently pat it into a round, wrap it in plastic wrap and refrigerate until thoroughly chilled, at least 1 hour and up to 2 days.\n            \n\n              For the filling: Meanwhile, put the lemon juice in a medium bowl. Peel and core the apples; cut each in half, and cut each half into 4 wedges. Add the apples and brown sugar to the bowl with the lemon juice, and toss.\n            \n\n              Melt the butter over medium-high heat in a large skillet. Add the sugared apples and cook, stirring, until the sugar dissolves and the mixture begins to simmer, about 2 minutes. Cover, reduce the heat to medium-low and cook until the apples soften and release most of their juices, about 7 minutes.\n            \n\n              Strain the apples in a colander set over a medium bowl to catch all the juices. Shake the colander to extract as much liquid as possible. Return the juice to the skillet and simmer over medium heat until it has thickened and lightly caramelized, about 10 minutes.\n            \n\n              Toss the apples with the thickened juice, cinnamon, salt, cloves, ginger and nutmeg in a medium bowl. Set aside to cool completely. (The cooled filling can be refrigerated for up to 2 days or frozen for up to 6 months.)\n            \n\n              For the streusel topping: Whisk the flour, sugar and salt together in a medium bowl. Add the butter and rub it into the flour mixture with your fingers until it has been absorbed. Mix in the almonds.\n            \n\n              To assemble and bake the pie: Position a rack in the lower third of the oven and place a baking sheet on it. Preheat the oven to 375 degrees F. On a lightly floured work surface, roll the dough into a 12-inch circle. Layer it between pieces of parchment or wax paper on a baking sheet, and refrigerate for at least 10 minutes.\n            \n\n              Ease the dough round into a 9-inch pie pan. Fold and crimp the edges as desired. Add the filling, and spread it out to make an even layer. Squeeze handfuls of the streusel topping, and drop clumps of it on top of the filling to completely cover it.\n            \n\n              Bake the pie on the preheated baking sheet until the crust and streusel are golden brown, about 1 hour. Let it cool on a cooling rack for at least 3 hours before serving. (The pie keeps well, covered, at room temperature for 24 hours or refrigerated for up to 4 days.)\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.5}, {"food": "sugar", "quantity": 4.0}, {"food": "salt", "quantity": 0.5}, {"food": "diced chicken", "quantity": 14.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 3.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "butter oil", "quantity": 4.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "cloves", "quantity": 0.25}, {"food": "ginger", "quantity": 0.25}, {"food": "nutmeg", "quantity": 0.25}, {"food": "potato flour", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 6.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}], "title": "\nApple Crumble Pie\n"}, {"directions": "\nSpecial equipment: 2 (12-cup) muffin pans\n\n              1. Preheat the oven to 350 degrees F. Line 24 muffin tins with paper liners.\n            \n\n              Using an electric mixer, cream the butter and vanilla sugar together until fluffy, about 2 to 3 minutes. Add the eggs, one at a time, and vanilla extract, beating until smooth.\n            \n\n              2. Combine the flour, baking soda, nutmeg, and salt in a medium bowl. Add half the flour mixture to the creamed butter, then add the sour cream, and then the rest of the flour. Beat until combined, taking care not to over mix. Gently fold in the chopped apples.\n            \n\n              3. Divide batter between prepared muffin tins, filling each liner about half way with batter. Bake until a toothpick inserted into the center of the cupcakes comes out clean and the tops spring back when pressed gently, about 20 minutes. Cool the cupcakes in the tin on a rack, for 10 minutes then remove from the tin and cool completely.\n            \n\n              4. Put apple butter into a small pastry bag with an open tip. Squeeze about a teaspoon into the center of each cupcake.\n            \n\n              5. To make the frosting: Beat the cream cheese and butter together in a bowl with an electric mixer until fluffy, about 2 minutes. Add in vanilla and lemon juice. On low speed, gradually add in confectioners' sugar and beat until well combined. Top cupcakes with frosting. Serve.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "eggs", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 1.5}, {"food": "potato flour", "quantity": 2.25}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "nutmeg", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "sour cream", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "butter oil", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "butter oil", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 1.5}, {"food": "lemon juice", "quantity": 1.0}, {"food": "sugar", "quantity": 4.0}], "title": "\nApple Cupcakes\n"}, {"directions": "\nSpecial equipment: 2 (12-cup) muffin pans\n\n              For the cake: Preheat oven to 350 degrees F. Line 24 muffin tins with paper liners.\n            \n\n              Using a hand mixer or standing mixer, cream the butter and vanilla sugar together until fluffy, about 2 to 3 minutes. Add eggs, one at a time and vanilla extract, beating until smooth.\n            \n\n              Combine the flour, nutmeg, baking soda and salt in a medium bowl. Add half the flour mixture to the creamed butter, then add the sour cream, and then the rest of the flour. Beat until well combined, taking care not to over mix. Gently fold in the chopped apples.\n            \n\n              Divide batter between prepared muffin tins, filling them 1/2 way full. Bake until a toothpick inserted into the center of the cupcakes comes out clean and the tops spring back when pressed gently, about 20 minutes. Cool the cupcakes in the tin on a rack for 10 minutes then remove from the tin and cool completely.\n            \n\n              Put apple butter into a small pastry bag with an open tip Squeeze a small amount into the center of each cupcake. Continue cooling completely. Then frost with icing.\n            \n\n              For the frosting: Using a hand or standing mixer, beat cream cheese and butter together, at medium speed, until fluffy, about 2 minutes. Add in vanilla and lemon juice. On low speed, gradually add in confectioners' sugar and beat until well combined. Frost as desired.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "eggs", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 1.5}, {"food": "potato flour", "quantity": 2.25}, {"food": "nutmeg", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "sour cream", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "butter oil", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.5}, {"food": "lemon juice", "quantity": 1.0}, {"food": "sugar", "quantity": 4.0}], "title": "\nApple Cupcakes\n"}, {"directions": "\n\n              Melt the butter in a medium saucepan over medium heat, and the apple and cook until lightly brown and soft, 2 minutes. Add cinnamon and sugar and cook until dissolved. Add the water and bring to a boil. Add the oats, wheat germ, flax, dried apples and raisins. Stir constantly for 2 minutes until oats are cooked and dried fruit is slightly plumped. Divide into 4 bowls, sprinkle each bowl with more brown sugar, a drizzle of milk and a dried apple ring.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 2.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "coconut water", "quantity": 3.0}, {"food": "oats", "quantity": 2.0}, {"food": "wheat germ", "quantity": 0.5}, {"food": "barley flour or meal", "quantity": 0.25}, {"food": "apples", "quantity": 0.25}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.25}, {"food": "milk", "quantity": 0.75}], "title": "\nApple Harvest Oatmeal\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Line a 9-inch pie plate with the dough; crimp the edges. Pierce the bottom all over with a fork, then refrigerate 15 minutes. Line the crust with foil and fill with pie weights or dried beans. Place on a baking sheet and bake until set, about 7 minutes. Remove the foil and weights; continue baking until golden, about 6 more minutes. Transfer to a rack to cool.\n            \n\n              Meanwhile, spread the almonds on a baking sheet and bake until golden, about 8 minutes. Combine the apples, 5 tablespoons sugar, the butter, lemon juice and vanilla in a saucepan; cover and cook over medium heat until the apples are tender, about 12 minutes. Uncover and cook, mashing and stirring with a potato masher, until saucy and starting to caramelize, about 12 more minutes; let cool 15 minutes. Transfer the apples to the pie crust and sprinkle with the toasted almonds.\n            \n\n              Beat the egg whites and salt with a mixer on medium speed until foamy, about 2 minutes. Gradually add the remaining 6 tablespoons sugar and beat until stiff, 2 to 3 more minutes. Transfer the meringue to a pastry bag fitted with a 1/2-inch star tip. Pipe around the edge of the pie, then pipe in a lattice pattern. Bake until the meringue is golden, 15 to 20 minutes. Let cool completely.\n            \n\n              Photograph by Andrew Purcell\n            \n", "ingredients": [{"food": "pie fillings", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.25}, {"food": "apples", "quantity": 6.0}, {"food": "sugar", "quantity": 11.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "egg substitute", "quantity": 3.0}, {"food": "hearts of palm", "quantity": 1}], "title": "\nApple Meringue Pie\n"}, {"directions": "\n\n              Slice an apple into crescents. Spread with peanut or almond butter and press granola on top.\n            \n", "ingredients": [], "title": "\nApple Moons\n"}, {"directions": "\n\n              Preheat the oven to 200 degrees F. Set a wire rack on a baking sheet and place in the oven.\n            \n\n              Whisk 1 3/4 cups flour, the sugar, baking powder, salt and nutmeg in a large bowl. In small bowl or liquid measuring cup, whisk the eggs with the milk and vanilla extract. Melt 3 tablespoons butter in a large well-seasoned cast-iron or non-stick skillet over medium heat. Whisk the butter into the milk mixture. Add the liquid ingredients to the dry mixture, and whisk just long enough to make a thick batter, (if there are a couple lumps that's okay).\n            \n\n              Using a melon baller or an apple corer, peel and core the apples keeping them whole. Slice the apples crosswise to make 1/4-inch rounds. Put some flour on a plate and dredge the apple slices until lightly coated, shaking off any excess flour.\n            \n\n              In the same skillet over medium to medium-low heat, place 3 apple slices about 3-inches apart in the skillet. Cook without turning until browned, about 3 minutes. Ladle about 2 tablespoons of the batter over each apple ring. Cook, until bubbles break the surface of the pancakes, and the undersides are golden brown, about 2 to 3 minutes. Add a nut-sized bit of butter to the skillet, as needed, and flip the pancakes, cook until golden on the underside, about 1 minute more.\n            \n\n              Serve immediately or transfer to oven to keep warm. Repeat with the remaining apples and batter. Serve with warm maple syrup.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.75}, {"food": "sugar", "quantity": 3.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 0.25}, {"food": "nutmeg", "quantity": 0.125}, {"food": "eggs", "quantity": 2.0}, {"food": "milk", "quantity": 1.25}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "butter oil", "quantity": 3.0}, {"food": "apples", "quantity": 4.0}, {"food": "syrup", "quantity": 1}], "title": "\nApple Pancakes\n"}, {"directions": "\n\n              Make the dough by hand. In a medium bowl, whisk together the flour, sugar, and salt. Using your fingers, work the butter into the dry ingredients until it resembles yellow corn meal mixed with bean sized bits of butter. (If the flour/butter mixture gets warm, refrigerate it for 10 minutes before proceeding.) Add the egg and stir the dough together with a fork or by hand in the bowl. If the dough is dry, sprinkle up to a tablespoon more of cold water over the mixture.\n            \n\n              Make the dough in a food processor. With the machine fitted with the metal blade, pulse the flour, sugar, and salt until combined. Add the butter and pulse until it resembles yellow corn meal mixed with bean size bits of butter, about 10 times. Add the egg and pulse 1 to 2 times; don't let the dough form into a ball in the machine. (If the dough is very dry add up to a tablespoon more of cold water.) Remove the bowl from the machine, remove the blade, and bring the dough together by hand.\n            \n\n              Form the dough into a disk, wrap in plastic wrap and refrigerate until thoroughly chilled, at least 1 hour.\n            \n\n              Make the filling. Put the lemon juice in a medium bowl. Peel, halve, and core the apples. Cut each half into 4 wedges. Toss the apple with the lemon juice. Add the sugar and toss to combine evenly.\n            \n\n              In a large skillet, melt the butter over medium-high heat. Add the apples, and cook, stirring, until the sugar dissolves and the mixture begins to simmer, about 2 minutes. Cover, reduce heat to medium-low, and cook until the apples soften and release most of their juices, about 7 minutes.\n            \n\n              Strain the apples in a colander over a medium bowl to catch all the juice. Shake the colander to get as much liquid as possible. Return the juices to the skillet, and simmer over medium heat until thickened and lightly caramelized, about 10 minutes.\n            \n\n              In a medium bowl, toss the apples with the reduced juice and spices. Set aside to cool completely. (This filling can be made up to 2 days ahead and refrigerated or frozen for up to 6 months.)\n            \n\n              Cut the dough in half. On a lightly floured surface, roll each half of dough into a disc about 11 to 12 inches wide. Layer the dough between pieces of parchment or wax paper on a baking sheet, and refrigerate for at least 10 minutes.\n            \n\n              Place a rack in the lower third of the oven and preheat the oven to 375 degrees F.\n            \n\n              Line the bottom of a 9-inch pie pan with one of the discs of dough, and trim it so it lays about 1/2 inch beyond the edge of the pan. Put the apple filling in the pan and mound it slightly in the center. Brush the top edges of the dough with the egg. Place the second disc of dough over the top. Fold the top layer of dough under the edge of the bottom layer and press the edges together to form a seal. Flute the edge as desired. Brush the surface of the dough with egg and then sprinkle with sugar. Pierce the top of the dough in several places to allow steam to escape while baking. Refrigerate for at least 15 minutes.\n            \n\n              Bake the pie on a baking sheet until the crust is golden, about 50 minutes. Cool on a rack before serving. The pie keeps well at room temperature (covered) for 24 hours, or refrigerated for up to 4 days.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.5}, {"food": "sugar", "quantity": 4.0}, {"food": "salt", "quantity": 0.25}, {"food": "diced chicken", "quantity": 14.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 3.0}, {"food": "pie fillings", "quantity": 0.6666666666666666}, {"food": "butter oil", "quantity": 0.25}, {"food": "cinnamon", "quantity": 0.25}, {"food": "hearts of palm", "quantity": 1}, {"food": "egg substitute", "quantity": 1.0}], "title": "\nApple Pie\n"}, {"directions": "\n\n              Prepare the filling: Peel, halve and core the apples. Cut each half into 6 wedges and toss with the sugar and lemon juice in a bowl. Melt 4 tablespoons butter in a large skillet over medium-high heat. Add the apple mixture and cook, stirring occasionally, until the firmer apples begin to soften but still hold their shape, 8 to 9 minutes. Sprinkle with the flour, cinnamon, cloves and nutmeg and toss until the juices begin to thicken, about 1 minute. Remove from the heat and cool completely. (The filling can be made up to 2 days ahead; cover and refrigerate.)\n            \n\n              Make the dough: Pulse the flour, sugar and salt in a food processor until combined. Add the shortening and pulse until it disappears, about 30 seconds. Add the butter and pulse until the mixture looks like coarse meal with pea-size bits of butter. Beat 1 egg with 1/4 cup ice water in a bowl, then add to the processor and pulse once or twice. (Stop before the dough gathers into a ball.) Lay out 2 sheets of plastic wrap; divide the dough between the sheets and pat each into a disk. Wrap the disks tightly and refrigerate until firm, at least 1 hour.\n            \n\n              Roll 1 disk of dough into a 12-inch round on a floured surface (or between 2 pieces of floured parchment paper). Ease into a 9 1/2-inch deep-dish glass pie plate. Add the filling, mounding it slightly, and dot with the remaining 2 tablespoons butter. Chill the pie while you roll the remaining dough into a 12-inch round.\n            \n\n              Lay the dough over the filling and press the 2 crusts together around the edges. Fold the overhanging dough under itself and crimp with your fingers. Beat the remaining egg in a bowl and brush over the top crust; sprinkle with sugar. Pierce the top with a knife a few times to let steam escape. Chill 30 minutes.\n            \n\n              Preheat the oven to 375 degrees F. Place the pie on a baking sheet; bake until the crust is golden and the filling is bubbly, 55 to 60 minutes. (Cover the edges with foil if they brown too quickly.) Transfer to a rack and cool until set, 2 hours.\n            \n\n              Photographs by Con Poulos\n            \n", "ingredients": [{"food": "mixed nuts", "quantity": 3.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "lemon juice", "quantity": 2.0}, {"food": "butter oil", "quantity": 6.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "cinnamon", "quantity": 0.5}, {"food": "hearts of palm", "quantity": 1}, {"food": "hearts of palm", "quantity": 1}, {"food": "potato flour", "quantity": 2.5}, {"food": "sugar", "quantity": 0.25}, {"food": "salt", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "butter oil", "quantity": 1.5}, {"food": "eggs", "quantity": 2.0}], "title": "\nApple Pie\n"}, {"directions": "\n\n              Make the dough by hand. In a medium bowl, whisk together the flour, sugar, and salt. Using your fingers, work the butter into the dry ingredients until it resembles yellow corn meal mixed with bean sized bits of butter. (If the flour/butter mixture gets warm, refrigerate it for 10 minutes before proceeding.) Add the egg and stir the dough together with a fork or by hand in the bowl. If the dough is dry, sprinkle up to a tablespoon more of cold water over the mixture.\n            \n\n              Make the dough in a food processor. With the machine fitted with the metal blade, pulse the flour, sugar, and salt until combined. Add the butter and pulse until it resembles yellow corn meal mixed with bean size bits of butter, about 10 times. Add the egg and pulse 1 to 2 times; don't let the dough form into a ball in the machine. (If the dough is very dry add up to a tablespoon more of cold water.) Remove the bowl from the machine, remove the blade, and bring the dough together by hand.\n            \n\n              Form the dough into a disk, wrap in plastic wrap and refrigerate until thoroughly chilled, at least 1 hour.\n            \n\n              Make the filling. Put the lemon juice in a medium bowl. Peel, halve, and core the apples. Cut each half into 4 wedges. Toss the apple with the lemon juice. Add the sugar and toss to combine evenly.\n            \n\n              In a large skillet, melt the butter over medium-high heat. Add the apples, and cook, stirring, until the sugar dissolves and the mixture begins to simmer, about 2 minutes. Cover, reduce heat to medium-low, and cook until the apples soften and release most of their juices, about 7 minutes.\n            \n\n              Strain the apples in a colander over a medium bowl to catch all the juice. Shake the colander to get as much liquid as possible. Return the juices to the skillet, and simmer over medium heat until thickened and lightly caramelized, about 10 minutes.\n            \n\n              In a medium bowl, toss the apples with the reduced juice and spices. Set aside to cool completely. (This filling can be made up to 2 days ahead and refrigerated or frozen for up to 6 months.)\n            \n\n              Cut the dough in half. On a lightly floured surface, roll each half of dough into a disc about 11 to 12 inches wide. Layer the dough between pieces of parchment or wax paper on a baking sheet, and refrigerate for at least 10 minutes.\n            \n\n              Place a rack in the lower third of the oven and preheat the oven to 375 degrees F.\n            \n\n              Line the bottom of a 9-inch pie pan with one of the discs of dough, and trim it so it lays about 1/2 inch beyond the edge of the pan. Put the apple filling in the pan and mound it slightly in the center. Brush the top edges of the dough with the egg. Place the second disc of dough over the top. Fold the top layer of dough under the edge of the bottom layer and press the edges together to form a seal. Flute the edge as desired. Brush the surface of the dough with egg and then sprinkle with sugar. Pierce the top of the dough in several places to allow steam to escape while baking. Refrigerate for at least 15 minutes.\n            \n\n              Bake the pie on a baking sheet until the crust is golden, about 50 minutes. Cool on a rack before serving. The pie keeps well at room temperature (covered) for 24 hours, or refrigerated for up to 4 days.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.5}, {"food": "sugar", "quantity": 4.0}, {"food": "salt", "quantity": 0.25}, {"food": "diced chicken", "quantity": 14.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 3.0}, {"food": "pie fillings", "quantity": 0.6666666666666666}, {"food": "butter oil", "quantity": 0.25}, {"food": "cinnamon", "quantity": 0.25}, {"food": "hearts of palm", "quantity": 1}, {"food": "egg substitute", "quantity": 1.0}], "title": "\nApple Pie\n"}, {"directions": "\nSpecial equipment: A pastry bag or a large resealable plastic bag\n\n              For the filling: Toss the apples, granulated sugar, lemon juice, cinnamon and salt together in a medium bowl. Melt the butter in a medium skillet over medium heat. Add the apples, and cook, stirring frequently, until the apples are tender but still pliable and the liquid is simmering, about 6 minutes. Add the flour, and stir until it dissolves and the liquid thickens. Remove the skillet from the heat, and let the filling cool completely. Divide the filling evenly into 12 little packed mounds; set aside.\n            \n\n              For the cupcakes: Position an oven rack in the center of the oven, and preheat to 350 degrees F. Line a 12-cup muffin tin with paper liners, and coat the liners and the top of the tin with cooking spray.\n            \n\n              Whisk the flour, baking powder, cinnamon, nutmeg and salt together in a medium bowl. Beat the sugar and eggs in another medium bowl with an electric mixer on medium-high speed until light and creamy, about 2 minutes. While continuing to beat, gradually pour in the butter, then add the vanilla. Adjust the mixer to medium-low, and add half the flour mixture. Add the milk, then the remaining flour mixture, taking care not to overmix the batter. It will be thin, like pancake batter; transfer it to a liquid measuring cup to make filling the muffin cup easier.\n            \n\n              Divide the batter evenly among the cups of the prepared muffin tin. Top each with a mound of apple filling. Bake for 15 minutes (the cupcakes will spread quite a bit). Remove the tin from the oven, gently brush the tops with melted butter and sprinkle with granulated sugar. Continue to bake until the tops of the cupcakes, which bake and puff around the apple filling, spring back when pressed, 6 to 8 minutes more. Let the cupcakes cool in the tin for a few minutes, then transfer to a rack to cool completely.\n            \n\n              For the whipped topping: Beat the cream, confectioners' sugar and sour cream in a medium bowl with an electric mixer on medium-high speed until the mixture forms soft peaks. Transfer it to a pastry bag or a resealable plastic bag (snip off the tip). Pipe a dollop of whipped topping onto each cupcake (don't completely hide the cupcake), and sprinkle with cinnamon.\n            \n", "ingredients": [{"food": "luncheon slices", "quantity": 3.125}, {"food": "sugar", "quantity": 3.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "cinnamon", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 2.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 1.5}, {"food": "cinnamon", "quantity": 1.0}, {"food": "nutmeg", "quantity": 0.25}, {"food": "salt", "quantity": 0.25}, {"food": "sugar", "quantity": 0.75}, {"food": "eggs", "quantity": 2.0}, {"food": "butter oil", "quantity": 1.5}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "milk", "quantity": 0.5}, {"food": "ice cream swich", "quantity": 0.75}, {"food": "sugar", "quantity": 2.0}, {"food": "sour cream", "quantity": 1.0}, {"food": "cinnamon", "quantity": 1}], "title": "\nApple Pie Cupcakes\n"}, {"directions": "\n\n              Make the filling: Melt the butter in a medium saucepan over medium heat. Stir in the apples, brown sugar, flour, bourbon, water and cinnamon. Cover and cook, stirring often, until the apples are soft and the sauce is thick, about 10 minutes. (Add a splash more water if the apples are sticking.) Remove from the heat; set aside.\n            \n\n              Make the cupcakes: Preheat the oven to 350 degrees F. Line a 12-cup muffin pan with liners. Whisk the flour, cinnamon, baking powder, baking soda and salt in a medium bowl. Whisk the melted butter, granulated sugar, brown sugar, sour cream, eggs and vanilla in a large bowl. Add the flour mixture and whisk until just combined.\n            \n\n              Divide the batter among the prepared muffin cups, filling each about two-thirds of the way. Bake 12 minutes and remove from the oven. Drop 1 tablespoon of the apple filling on top of each cupcake, then continue baking until the cupcakes are golden around the edges, about 8 more minutes (it¿s OK if they still look a bit wet). Let cool 5 minutes in the pan, then transfer the cupcakes to a rack to cool completely.\n            \n\n              Make the lattice crusts: Line a baking sheet with parchment paper. Unroll the pie dough on a cutting board. Cut into 1/4- to 1/2-inch strips and arrange in a lattice pattern. Cut out twelve 2-inch rounds from the lattice using a cookie cutter; place on the prepared baking sheet. Brush with the beaten egg and sprinkle with the coarse sugar. Bake until golden, about 15 minutes. Let cool completely on the baking sheet.\n            \n\n              Make the frosting: Beat the heavy cream, sour cream and confectioners' sugar in a large bowl with a mixer on medium-high speed until stiff peaks form, 4 minutes. Spread on the cupcakes; top each with a lattice crust.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "sugar", "quantity": 2.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "coconut water", "quantity": 1.0}, {"food": "coconut water", "quantity": 1.0}, {"food": "cinnamon", "quantity": 0.5}, {"food": "potato flour", "quantity": 1.25}, {"food": "cinnamon", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "sugar", "quantity": 0.5}, {"food": "sour cream", "quantity": 0.5}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "pie fillings", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "sour cream", "quantity": 0.5}, {"food": "sugar", "quantity": 0.5}], "title": "\nApple Pie Cupcakes\n"}, {"directions": "\n\n              Position an oven rack in the center of the oven, and preheat to 325 degrees F. Whisk together the butter, brown sugar, maple syrup, vanilla, apple pie spice and salt in a large bowl. Add the oats, and toss until evenly coated. Spread out on a rimmed baking sheet.\n            \n\n              Bake the mixture until golden and toasted, 30 to 35 minutes, stirring about halfway through. Let cool completely on the baking sheet. Stir in the pita chips and apple chips. (The granola can be stored in an airtight container at room temperature for up to 5 days.)\n            \n", "ingredients": [{"food": "butter oil", "quantity": 4.0}, {"food": "salt", "quantity": 0.5}, {"food": "oats", "quantity": 1.75}, {"food": "potato chips", "quantity": 1.5}, {"food": "sugar", "quantity": 3.0}, {"food": "syrup", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "pumpkin pie spice", "quantity": 0.5}, {"food": "apple", "quantity": 1.0}], "title": "\nApple Pie Granola\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: a 2 1/2-inch round biscuit cutter about 20 wooden ice-pop or lollipop sticks a pastry brush\n\n              For the pie crust: Pulse the flour, shortening, sugar, vinegar and salt in a food processor until it looks like fine meal. Add the butter and pulse until it is in pea-size pieces. Sprinkle in 1/4 cup ice water and pulse until the dough begins to come together. Pinch the dough with your fingers; if it doesn't hold together, add up to 4 more tablespoons ice water 1 tablespoon at a time, pulsing and checking the dough after each addition. Divide the dough between 2 sheets of plastic wrap and pat each into a disk. Wrap tightly and refrigerate until firm, at least 1 hour or preferably overnight.\n            \n\n              For the apple pie filling: Peel and core the apples; slice 1/4 inch thick. Transfer to a bowl and toss with the sugar and lemon juice.\n            \n\n              Melt the butter in a medium skillet over medium-high heat. Add the apple mixture and cook, stirring occasionally and breaking up with a wooden spoon, until very soft, 12 to 15 minutes. Add the flour, cinnamon and salt and cook, stirring, until the juices thicken, about 2 minutes. Let cool completely.\n            \n\n              Position 2 oven racks in the top and bottom third of the oven and preheat to 400 degrees F. Line 2 large baking sheets with parchment paper and set aside. Put the sugar in a shallow bowl and set aside.\n            \n\n              To assemble: Roll out 1 disk of dough on a lightly floured surface to 1/8 inch thick. Cut into about 20 rounds with a 2 1/2-inch biscuit cutter, keeping the dough and rounds cool and rerolling scraps once if neccessary. Repeat with the second disk, for a total of about 40 dough rounds.\n            \n\n              Divide half of the dough rounds (about 20) between the baking sheets, leaving 1 inch of space around each. Dip the top 1 inch of a wooden ice-pop stick in the beaten egg and lay it on one of the rounds, positioning the tip in the center of the round. Repeat with the remaining sticks and dough rounds on the baking sheets. Dollop a generous teaspoonful of the cold apple filling in the center of each round, covering the tip of each stick. Brush the edges of the rounds with the beaten egg using a pastry brush. Put the remaining dough rounds over the rounds with the filling. Press the edges together gently to seal. Use a fork to crimp the rounds closed completely, making pops. Brush the tops with the remaining beaten egg and dust each pop with a generous pinch of sugar. Using a paring knife, make 5 small slits around the centers of each pop (they'll look like apple seeds).\n            \n\n              Bake, reversing the baking sheets top to bottom halfway through, until the dough is golden brown, 18 to 22 minutes. Let the pops cool on the baking sheets until cool enough to touch, about 5 minutes. Transfer to a wire rack to cool. Serve the pops warm or at room temperature.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.5}, {"food": "vegetable oil", "quantity": 4.0}, {"food": "sugar", "quantity": 2.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 12.0}, {"food": "ice cream swich", "quantity": 0.75}, {"food": "mixed nuts", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "potato flour", "quantity": 1.5}, {"food": "pumpkin pie spice", "quantity": 0.25}, {"food": "hearts of palm", "quantity": 1}, {"food": "sugar", "quantity": 0.25}, {"food": "potato flour", "quantity": 1}, {"food": "egg substitute", "quantity": 1.0}], "title": "\nApple Pie Pops\n"}, {"directions": "\n\n              Blend the apple slices, ice, cottage cheese, cashews, apple pie spice, vanilla extract and 1/4 cup water in a blender on high speed until smooth and thick, about 5 minutes. Pour into a tall glass, sprinkle with more apple pie spice and serve immediately.\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 0.5}, {"food": "", "quantity": 2.0}, {"food": "pumpkin pie spice", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 0.5}], "title": "\nApple Pie Protein Shake\n"}, {"directions": "\n\n              Make the dough: Beat the butter and cream cheese in a large bowl with a mixer on medium-high speed until creamy, about 5 minutes. Reduce the mixer speed to low and beat in the confectioners? sugar and salt until fluffy, about 1 more minute. Gradually beat in the flour until the dough comes together.\n            \n\n              Turn out the dough onto a floured surface and knead a few times until smooth. Divide the dough in half and roll each half into a 12-inch-long rope. Cut each rope into 12 pieces. Roll the pieces into balls and put the balls in a 24-cup mini-muffin tin. Use your thumb to press the dough into the bottom and up the sides of the cups, making the bottom slightly thinner than the sides. Refrigerate until firm, about 1 hour.\n            \n\n              Meanwhile, make the filling: Toss the apples, lemon juice, granulated sugar, apple pie spice and vanilla in a medium bowl. Melt the butter in a medium skillet over medium heat. Add the apple mixture and stir to coat. Cover and cook, stirring occasionally, until tender, about 20 minutes. There should be some liquid left in the skillet; if not, stir in 1/4 cup water.\n            \n\n              Mix the cornstarch and 1 teaspoon water in a small bowl; stir into the apple mixture and bring to a boil. Cook until thick and bubbling, 30 seconds to 1 minute. Transfer to a bowl to cool, about 20 minutes.\n            \n\n              Preheat the oven to 350 degrees F. Divide the apple mixture evenly among the muffin cups. Bake, rotating the pan halfway through, until the tassies are golden, about 30 minutes. Let cool 5 minutes in the pan, then use an offset spatula to remove the tassies and transfer to a rack to cool completely. They will crisp as they cool.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "butter oil", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 6.0}, {"food": "sugar", "quantity": 0.25}, {"food": "salt", "quantity": 0.5}, {"food": "potato flour", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "pumpkin pie spice", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 0.25}, {"food": "butter oil", "quantity": 2.0}, {"food": "coconut water", "quantity": 0.25}, {"food": "cornstarch", "quantity": 1.0}], "title": "\nApple Pie Tassies\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Toss together the apples, lemon juice, apple pie spice, vanilla and 1/3 cup of the sugar in a medium bowl. Melt 2 tablespoons of the butter in a medium skillet over medium heat. Add the apple mixture and stir to coat with the butter. Cover and cook, stirring occasionally and adding about 1/4 cup water if the mixture becomes too dry or begins to brown, until the apples are tender and shiny, about 20 minutes. When the apples are tender, there should be some liquid left in the skillet; if not, add 1/4 cup water and stir. Mix the cornstarch with 1 teaspoon water in a small bowl and pour it into the apple mixture. Stir well and bring the mixture to a boil to activate the starch. Cook until thick and bubbly, 30 seconds to 1 minute more. Transfer to a bowl and refrigerate for 15 minutes.\n            \n\n              Whisk together the flour and salt in a bowl. In another bowl, beat the remaining 8 tablespoons butter and 2/3 cup sugar with an electric mixer on medium-high speed until fluffy, about 5 minutes. Beat in the egg until just combined. Turn the mixer to low and gradually beat in the dry ingredients in 2 additions, beating until just incorporated. \n            \n\n              Line 2 baking sheets with parchment. Scoop 1-tablespoon portions of dough and roll between your hands to form 1-inch balls. Place about 2 inches apart on the prepared baking sheets. Gently press a thumbprint into the center of each ball about 1/2 inch deep, being careful not to crack the edges. Fill each indentation with 1 teaspoon of the filling, then chill the cookies 15 minutes in the freezer. \n            \n\n              Position oven racks in the top and bottom thirds of the oven and preheat to 350 degrees F.\n            \n\n              Bake, rotating the baking sheets from top to bottom and front to back about halfway through, until the cookies are set, about 30 minutes. Cool the cookies completely on the baking sheets. Store the cookies in an airtight container in the refrigerator for up to 5 days.\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.5}, {"food": "pumpkin pie spice", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 0.25}, {"food": "sugar", "quantity": 1.0}, {"food": "butter oil", "quantity": 10.0}, {"food": "cornstarch", "quantity": 1.0}, {"food": "potato flour", "quantity": 1.75}, {"food": "salt", "quantity": 0.5}, {"food": "egg substitute", "quantity": 1.0}], "title": "\nApple Pie Thumbprint Cookies\n"}, {"directions": "\n\n              Toss together the lemon juice, apple pie spice, apples and 1/3 cup of the sugar in a medium bowl.\n            \n\n              Melt 2 tablespoons of the butter over high heat in a medium skillet. Add the apple mixture and stir to coat with the butter. Lower the heat to medium, cover and cook, stirring occasionally, until the apples are tender and translucent, about 20 minutes; if the mixture becomes too dry and begins to brown before that, add 1/4 cup water and continue to cook. \n            \n\n              Mix the cornstarch with 1 teaspoon water in a small bowl and pour into the apple mixture. Bring the mixture to a boil to activate the starch and cook until the thick and bubbly, about 1 minute more. Transfer to a bowl and reserve. \n            \n\n              Position racks in the upper and lower thirds of the oven and preheat to 350 degrees F. Line 2 baking sheets with parchment paper. \n            \n\n              Whisk the flour, baking powder and salt together in a bowl. In another bowl, whip the remaining 12 tablespoons butter and 2/3 cup sugar with a hand-held mixer until fluffy, about 5 minutes. Beat in the egg until just combined, then mix in the vanilla. Slowly beat in the dry ingredients in 2 additions, mixing just until incorporated. \n            \n\n              Scoop 1 tablespoon of the dough for each cookie and roll into a ball. Place about 2 inches apart on the prepared baking sheets and press down into flat discs about 1/4 inch thick. Bake the cookies until just set on top but still pale, about 15 minutes. Cool the cookies on the baking sheets. \n            \n\n              When the cookies are cool, flip them over. On half of the cookies, spread each with 1 teaspoon apple filling. On the other half of the cookies, spread each with 1 tablespoon vanilla ice cream. Sandwich each apple filling-topped cookie with an ice cream-topped cookie and press together gently.\n            \n\n              Serve immediately or store in the freezer for up to 3 months. Let soften 5 minutes before serving from frozen.\n            \n", "ingredients": [{"food": "lemon juice", "quantity": 1.5}, {"food": "pumpkin pie spice", "quantity": 0.5}, {"food": "apples", "quantity": 2.0}, {"food": "sugar", "quantity": 1.0}, {"food": "butter oil", "quantity": 14.0}, {"food": "cornstarch", "quantity": 1.0}, {"food": "potato flour", "quantity": 1.75}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.25}, {"food": "ice cream swich", "quantity": 1.0}], "title": "\nApple Pie a la Mode Sandwich Cookies\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: a small round cutter or apple corer, 4 inch round cookie cutter\n\n              Preheat oven to 375 degrees F. Line 2 baking sheets with parchment. Microwave the butter, brown sugar and cinnamon in a medium microwave-safe bowl until melted, about 1 minute.\n            \n\n              Cut the apples, crosswise, into slices between 1/4-and-1/2-inch thick, using only full size slices from the center of the apple. You should get 4 slices from each apple, each about 2 inches in diameter. Remove the cores from the apples with a small round cutter or apple corer to make rings. Add the apples to the butter mixture and turn to coat well, taking care not to break the slices.\n            \n\n              Unroll the pie crusts and roll each on a floured surface into 13-inch rounds. Use a 4 inch round cutter to cut 8 rounds from each piece of dough (gathering the scraps and rerolling the dough as needed). (See Cook's Note.) Arrange half of the rounds on the prepared baking sheets and brush all over with the egg. Center an apple slice on each round and spoon any juices left in the bowl in the center of the slice. Place a caramel piece in the center of each slice. \n            \n\n              Lay the remaining dough rounds over each apple slice and press the edges gently to seal, then crimp the edges with a fork. Cut small slits in the dough for air vents. Brush the tops with beaten egg and sprinkle generously with granulated sugar. \n            \n\n              Bake, rotating the trays from top to bottom halfway through baking time, until the crust is golden brown and crisp,18 to 20 minutes. Cool on the baking sheet at least 15 minutes before serving.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 4.0}, {"food": "sugar", "quantity": 0.25}, {"food": "cinnamon", "quantity": 1.0}, {"food": "apples", "quantity": 2.0}, {"food": "pie fillings", "quantity": 14.0}, {"food": "potato flour", "quantity": 1}, {"food": "egg substitute", "quantity": 1.0}, {"food": "soft tofu", "quantity": 2.0}, {"food": "sugar", "quantity": 1}], "title": "\nApple Ring Pies\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: 8 wooden ice-pop sticks and a toothpick\n\n              Line a baking sheet with parchment or a silicon baking mat.\n            \n\n              Cut the apples lengthwise (stem to bottom) into 4 thick slices each. Remove any visible seeds and keep the core intact. The end slices will be rounded; cut a thin slice off so they lay flat. Poke a small hole in the bottom of each slice with a wooden ice-pop stick and push halfway into the apple. \n            \n\n              Combine the bittersweet chocolate and 1 teaspoon of the coconut oil in a medium microwave-safe bowl and microwave at 50 percent power for 30-second increments, stirring in between, until melted and smooth. Add the white chocolate and remaining 1 teaspoon coconut oil to another medium microwave-safe bowl and microwave at 50 percent power for 30-second increments, stirring in between, until melted and smooth.\n            \n\n              Dip half of the apple slices completely in the bittersweet chocolate, letting the excess drip back into the bowl, and place on the prepared baking sheet. Dip the remaining apple slices in the white chocolate. Let sit at room temperature so the chocolate thickens a bit, 10 to 15 minutes. \n            \n\n              Transfer the leftover dark and white chocolate to 2 separate small resealable plastic bags and snip a small corner off each bag. Pipe 3 to 4 dark chocolate concentric circles on the white chocolate-dipped apples and visa-versa. Drag a toothpick through the circles, starting the center and working your way out to create a spider web design. Refrigerate until hardened, 15 to 20 minutes.\n            \n", "ingredients": [{"food": "apples", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 4.0}], "title": "\nApple Spider Web Pops\n"}, {"directions": "\n\n              Combine all ingredients together in a blender and pulse until ice is incorporated. Then puree until smooth.\n            \n\n              Copyright © 2004 Television Food Network, G.P., All Rights Reserved.\n            \n", "ingredients": [{"food": "apple", "quantity": 1.0}, {"food": "avocado", "quantity": 0.5}, {"food": "apple juice", "quantity": 0.5}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "chrysanthemum leaves", "quantity": 3.0}, {"food": "lime juice", "quantity": 1.0}], "title": "\nApple and Avocado Smoothie\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Roll out 1 piece of dough into a 12-inch round on a lightly floured surface. Ease into a 9-inch pie plate; chill until ready to use.\n            \n\n              Make the filling: Peel and chop the apples. Pulse the apples, raisins, and dried plums, figs and cherries in a food processor until chunky. Transfer to a large bowl and toss with the sugar, tapioca, orange liqueur, lemon zest, cinnamon, salt and allspice. Spoon into the crust and dot with the butter.\n            \n\n              Roll out the second piece of dough into a 12-inch round on a lightly floured surface. Cut into 1/2-inch-wide strips with a knife. Arrange half of the strips in parallel rows over the filling, about 1/2 inch apart. Working with 1 strip at a time, arrange the remaining strips perpendicular to the first ones, weaving the strips over and under, to form a lattice. Fold the overhanging dough under itself and crimp the edge with your fingers. Brush the lattice crust with the beaten egg.\n            \n\n              Put the pie on a rimmed baking sheet and transfer to the oven; bake until the crust is golden and the filling is bubbly, about 1 hour. (Cover the edge with foil if it is browning too quickly.) Transfer to a rack and let cool until set, about 3 hours.\n            \n\n              Photograph by Johnny Miller\n            \n", "ingredients": [{"food": "allspice", "quantity": 0.25}, {"food": "butter oil", "quantity": 2.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "pie fillings", "quantity": 1.0}, {"food": "potato flour", "quantity": 1}, {"food": "apples", "quantity": 2.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.5}, {"food": "plums", "quantity": 1.0}, {"food": "figs", "quantity": 1.0}, {"food": "maraschino cherries", "quantity": 0.5}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "tapioca", "quantity": 1.0}, {"food": "apple", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "cinnamon", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}], "title": "\nApple and Dried Fruit Lattice Pie\n"}, {"directions": "\n\n              Whisk together the marmalade, almond extract, salt and 2 teaspoons water in a medium bowl. Set aside.\n            \n\n              Set the apples on a cutting board. Cut the flesh away from the cores, making 4 apple \"cheeks\" from each apple. Discard the cores. Cut the flesh into very thin slices and add it to the bowl with marmalade; toss to coat. Divide the apples among 4 small plates and sprinkle each serving with cherries and crushed cookie.\n            \n", "ingredients": [{"food": "orange", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "apple", "quantity": 1.0}, {"food": "apple", "quantity": 1.0}, {"food": "maraschino cherries", "quantity": 1.0}, {"food": "", "quantity": 1.0}], "title": "\nApple and Orange Marmalade Salad\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F and butter a 3-quart baking dish. Melt 2 tablespoons butter in a large skillet over medium heat. Add the sausage and cook, breaking up the meat with a wooden spoon, until browned and cooked through, 6 to 8 minutes. Remove with a slotted spoon and transfer to a plate.\n            \n\n              Melt the remaining 6 tablespoons butter in the skillet, then add the onion, celery, apples, sage, thyme, 1 teaspoon salt and a few grinds of pepper. Cook, stirring, until the vegetables are tender, about 5 minutes. Add the cider. Bring to a boil, scraping up any browned bits, and cook until reduced by half, about 5 minutes. Add the broth and return to a boil, then remove from the heat.\n            \n\n              Whisk the eggs and parsley in a large bowl. Add the bread, sausage and vegetable-broth mixture and stir until combined. Transfer to the prepared baking dish; sprinkle with the walnuts and drizzle with the turkey drippings (or dot with butter).\n            \n\n              Cover the dish with foil and bake 30 minutes, then uncover and bake until golden, about 30 more minutes.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "celery seed", "quantity": 5.0}, {"food": "apples", "quantity": 2.0}, {"food": "sage", "quantity": 1.0}, {"food": "thyme", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 1.0}, {"food": "diced chicken", "quantity": 2.5}, {"food": "eggs", "quantity": 2.0}, {"food": "parsley", "quantity": 0.5}, {"food": "garlic bread", "quantity": 12.5}, {"food": "walnuts", "quantity": 1.0}, {"food": "low fat big franks", "quantity": 2.0}], "title": "\nApple and Sausage Stuffing\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the noodles, and cook according to package directions. Strain into a colander, and toss with oil. Drape the noodles over and around the side of the colander to cool.\n            \n\n              Process the cream cheese, ricotta, eggs, egg yolk and granulated sugar in a food processor until combined and smooth.\n            \n\n              Microwave the preserves, butter and lemon juice in a microwavable medium bowl until the butter melts, about 1 minute. Stir to combine.\n            \n\n              Brush the bottom and sides of a 9-by-13-inch baking dish with melted butter. Spread 3 tablespoons of the preserves mixture over the bottom. Arrange 4 slightly overlapping noodles to cover the bottom of the dish. Spread 1/3 of the remaining preserves mixture over the noodles. Top with 1/2 the ricotta mixture. Scatter 1/2 the apricots and apple rings over the ricotta, then dust the entire layer with 1/4 teaspoon of the cinnamon. Repeat with another layer of 4 noodles, 1/2 the remaining preserves mixture and the remaining ricotta mixture, apricots and apple rings and 1/4 teaspoon cinnamon. Finish with the remaining 4 noodles, and spread with the remaining preserves mixture. Cover the top with plastic wrap, and refrigerate overnight.\n            \n\n              Meanwhile, swirl the almonds in a small skillet over medium heat until browned and toasted in spots.\n            \n\n              Preheat the oven to 350 degrees F. Remove the plastic wrap from the baking dish, and cover with foil. Bake until the lasagna is very hot and the layers are set, about 40 minutes. Remove the foil, and bake for 10 minutes more. Top with the toasted almonds, and dust with confectioners' sugar. Let sit 10 minutes before cutting and serving. The lasagna can also be eaten at room temperature.\n            \n", "ingredients": [{"food": "lasagna", "quantity": 12.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "macaroni cheese", "quantity": 12.0}, {"food": "", "quantity": 1.5}, {"food": "egg substitute", "quantity": 2.0}, {"food": "sugar", "quantity": 2.0}, {"food": "apricot nectar", "quantity": 0.6666666666666666}, {"food": "baking chocolate", "quantity": 3.0}, {"food": "lemon juice", "quantity": 3.0}, {"food": "apricots", "quantity": 1.0}, {"food": "apple", "quantity": 1.0}, {"food": "cinnamon", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.25}, {"food": "sugar", "quantity": 1}], "title": "\nApple-Apricot Breakfast Lasagna\n"}, {"directions": "\n\n              Make the crust: Cook the bacon in a large skillet over medium heat, turning occasionally, until golden but still soft, about 6 minutes; remove to paper towels. Reserve 1 tablespoon of the drippings in a small bowl; refrigerate until cold, about 15 minutes.\n            \n\n              Pulse 2 slices of the bacon in a food processor until finely ground. Add 1 1/2 cups flour and 2 tablespoons sugar and pulse to combine. Add the chilled bacon drippings and pulse to combine. Add the butter and pulse until the mixture looks like coarse meal with some pea-size pieces. Drizzle in 4 tablespoons cold water and pulse until the dough just comes together. Turn out onto a piece of plastic wrap; use the plastic to help form the dough into a disk. Wrap and chill until firm, at least 1 hour.\n            \n\n              Line a baking sheet with parchment paper. Roll out the dough into a 13-inch round between 2 sheets of lightly floured parchment. Peel off the top sheet of parchment, then invert the dough onto the prepared baking sheet. Peel off the sheet of parchment. Refrigerate the dough until ready to use.\n            \n\n              Preheat the oven to 375 degrees F. Make the filling: Peel the apples and slice 1/4 inch thick. Toss with the lemon juice, cinnamon, 3 tablespoons sugar and the remaining 1 tablespoon flour in a large bowl. Arrange the apples in the center of the dough, leaving a 2-inch border. Fold the edge of the dough over the filling, pleating as needed. Cut the remaining 4 slices bacon into bite-size pieces and sprinkle over the filling.\n            \n\n              Brush the crust with the egg and sprinkle the remaining 3 tablespoons sugar over the whole galette. Bake until the apples are tender and the crust is golden brown, about 50 minutes. (Tent loosely with foil if the filling gets too brown.) Remove from the oven and brush the filling with maple syrup while still hot. Transfer to a rack to cool slightly before serving.\n            \n\n              Photograph by Yunhee Kim\n            \n", "ingredients": [{"food": "bacon", "quantity": 6.0}, {"food": "potato flour", "quantity": 1.5}, {"food": "sugar", "quantity": 0.5}, {"food": "butter oil", "quantity": 5.0}, {"food": "apples", "quantity": 4.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "cinnamon", "quantity": 0.25}, {"food": "egg substitute", "quantity": 1.0}, {"food": "syrup", "quantity": 1}], "title": "\nApple-Bacon Galette\n"}]