[{"directions": "\n\n              Cook 8 ounces elbow macaroni as the label directs; drain and rinse under cold water. Whisk 1/3 cup each mayonnaise, sour cream and barbecue sauce, 2 tablespoons relish, 1 tablespoon yellow mustard and 1 teaspoon sugar in a large bowl. Add the macaroni, 2 cups cubed barbecue-flavored rotisserie chicken, 1 diced red bell pepper, 3 chopped celery stalks, 1/2 diced red onion and 1/4 cup chopped parsley. Season with salt and pepper and toss. Refrigerate at least 1 hour.\n            \n\n              Photograph by Bobbi Lin\n            \n", "ingredients": [], "title": "\nBBQ Chicken Macaroni Salad\n"}, {"directions": "\n\n              Grill hot dogs, brushing with barbecue sauce. Serve on toasted buns with coleslaw and more sauce.\n            \n", "ingredients": [], "title": "\nBBQ Dogs\n"}, {"directions": "\n\nCorn Cakes: \n\n\n              Preheat the oven to 250 degrees F. Set a rack on a sheet pan in the oven. Whisk the flour, cornmeal, baking powder, sugar, paprika and salt together in a medium bowl. Set aside. Shear the corn kernels from the cob with a knife. Working over a bowl, run a knife along the cob to press out the milky liquid. Puree half the corn with the milk in a small food processor. Add the 2 tablespoons butter and the egg yolk and pulse until evenly combined. Whisk the wet ingredients into the dry. Whip the egg white in a medium bowl until it almost holds a medium-stiff peak. Lightly fold the egg white into the batter. Heat a griddle or well-seasoned cast-iron skillet over medium heat. Add 1 teaspoon of the remaining butter. Drop heaping tablespoons of the batter into the pan and cook until golden brown on the bottom and little bubbles break the surface of each pancake, about 2 to 3 minutes. Flip and cook the corn cakes on the other side until lightly brown. Serve immediately or transfer to the oven to keep warm. Repeat with the remaining batter. To assemble: Toss the duck confit in the BBQ Sauce to coat. Top each corn cake with about 1 tablespoon BBQ'd Duck Confit. Serve. Copyright 2005 Television Food Network, G.P. All rights reserved.\n            \n\nKC Style BBQ Sauce:\n\n\n              Heat the oil in a medium saucepan over medium heat. Stir in the garlic, tomato paste, chili powder, paprika, red pepper flakes, allspice, and cloves, and cook, stirring, until paste is dark brick red, about 3 minutes. Add the ketchup, water, vinegar, molasses, sugar, salt, soy sauce, Worcestershire, mustard, black pepper, and bay leaf. Adjust the heat to maintain a gentle simmer and cook until the flavors come together, about 30 minutes. Remove from the heat and discard the garlic and bay leaf. Cool if not using immediately. Reheat before using. Yield: 1 quart sauce Recipe from Food Network Kitchens Get Grilling, Meredith Books, 2005.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 0.5}, {"food": "cornmeal", "quantity": 0.3333333333333333}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "sugar", "quantity": 1.0}, {"food": "paprika", "quantity": 0.25}, {"food": "salt", "quantity": 0.5}, {"food": "corn bran", "quantity": 1.0}, {"food": "milk", "quantity": 0.5}, {"food": "butter oil", "quantity": 2.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "meat drippings ", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 6.0}, {"food": "pasta with tomato sauce", "quantity": 2.0}, {"food": "chili powder", "quantity": 1.0}, {"food": "paprika", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "ground turkey", "quantity": 0.25}, {"food": "cloves", "quantity": 1}, {"food": "", "quantity": 2.0}, {"food": "coconut water", "quantity": 2.0}, {"food": "vinegar", "quantity": 0.5}, {"food": "molasses", "quantity": 0.25}, {"food": "sugar", "quantity": 0.25}, {"food": "salt", "quantity": 1.0}, {"food": "soy sauce", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1.0}, {"food": "corier leaf", "quantity": 1.0}], "title": "\nBBQ Duck on Corn Cakes\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Combine the coleslaw mix, cider vinegar, 1/2 teaspoon salt and several grinds of black pepper in a medium bowl. Cover with plastic wrap and refrigerate until ready to serve.\n            \n\n              Combine the jackfruit with the chili powder and 1/2 teaspoon each salt and pepper in a large bowl. Heat 2 tablespoons oil in a large skillet over medium high heat until shimmering. Add the jackfruit and cook, tossing occasionally, until the spices are fragrant 2 to 3 minutes. \n            \n\n              Add the barbecue sauce to the skillet along with 3 cups water, stir, cover and reduce the heat to low. Cook, stirring occasionally, until tender, 45 to 50 minutes. Uncover the skillet, turn the heat to high and simmer until the color has deepened and the sauce is thick, 4 to 5 minutes. Remove from the heat. \n            \n\n              Using a potato masher or wooden spoon, smash the jackfruit until it resembles a pulled pork consistency and season to taste with salt, pepper and light brown sugar if you would like it sweeter. Serve on the potato buns topped with the coleslaw.\n            \n", "ingredients": [{"food": "cheesecake mix", "quantity": 8.0}, {"food": "vinegar", "quantity": 4.0}, {"food": "black bean mango", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 20.0}, {"food": "chili powder", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 0.75}, {"food": "sugar", "quantity": 1.0}, {"food": "potato flour", "quantity": 8.0}], "title": "\nBBQ Pulled Jackfruit Sandwiches\n"}, {"directions": "\n\n              Combine the peppers, celery, onion, parsley, 1 tablespoon lemon juice and 1/2 teaspoon salt in a medium bowl. Let sit for 30 minutes to marinate and soften.\n            \n\n              Whisk together the chili sauce, Worcestershire, the remaining lemon juice, hot sauce, oregano, paprika, onion powder and garlic powder in a small bowl; set aside.\n            \n\n              Pat the shrimp dry on a plate, and season with 1/2 teaspoon salt and a few grinds of black pepper. Melt the butter in a large skillet over medium heat, then add the shrimp. Cook until they turn pink on the bottom, about 2 minutes, then flip and cook until they are totally pink and start to curl, about 2 minutes more; transfer the shrimp to a clean plate. Add the chili-sauce mixture to the skillet, and simmer until it is reduced and thickened, 2 to 3 minutes. Remove the pan from the heat to cool.\n            \n\n              Roughly chop the shrimp, add to the cooled sauce and stir to combine. Cover and refrigerate until ready to use.\n            \n\n              Put a slice of bread between 2 pieces of plastic wrap, and roll with a rolling pin to flatten. Spread a heaping teaspoon of mayonnaise over the bread. Arrange 2 tablespoons of the BBQ shrimp in a neat row along the bottom edge of the bread. Top with some of the vegetable mixture. Use the plastic wrap to help roll the bread up into a tight cylinder. Wrap it tightly in a fresh piece of plastic wrap, and refrigerate for at least 2 hours and up to overnight. Repeat with the remaining ingredients to make 8 roll-ups total.\n            \n\n              When you're ready to serve, unwrap the roll-ups, cut each into 4 pieces.\n            \n", "ingredients": [{"food": "chrysanthemum leaves", "quantity": 0.25}, {"food": "lemon juice", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "Worcestershire sauce", "quantity": 0.25}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "paprika", "quantity": 0.5}, {"food": "onion powder", "quantity": 0.5}, {"food": "garlic powder", "quantity": 0.25}, {"food": "shrimp", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "butter oil", "quantity": 2.0}, {"food": "mayonnaise dressing", "quantity": 3.0}, {"food": "potato flour", "quantity": 8.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "celery seed", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.5}], "title": "\nBBQ Shrimp Roll-ups\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Line a baking sheet with parchment paper. Combine the flour, baking powder, sugar and 1 teaspoon salt in a food processor and pulse until combined. Add the butter; pulse until it is in pea-size pieces. Add the cheddar and scallions and pulse 2 or 3 times to incorporate. Add the buttermilk and pulse a couple of times until the dough just comes together.\n            \n\n              Turn out the dough onto a lightly floured surface. Pat into a 6-by-7-inch rectangle (1/2 to 3/4 inch thick). Cut out biscuits with a floured 2-inch biscuit cutter and transfer to the prepared baking sheet. Pat the scraps together and repeat to make 16 biscuits total. Brush the tops with buttermilk. Bake until lightly golden and puffed, 12 to 15 minutes. Transfer to a rack and let cool.\n            \n\n              Meanwhile, working in batches, cook the bacon in a large skillet over medium heat, turning, until crisp, about 5 minutes. Drain on paper towels. Break each slice into thirds.\n            \n\n              Mash the avocado in a small bowl with the lime juice and jalapeno brine; stir in the chopped jalapenos and season with salt. Season the tomatoes with salt.\n            \n\n              Split the biscuits; spread the top halves with the mashed avocado. Fill with the bacon, lettuce and tomatoes.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 6.0}, {"food": "cheddar cheese", "quantity": 0.75}, {"food": "", "quantity": 3.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.75}, {"food": "bacon", "quantity": 16.0}, {"food": "avocado", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "", "quantity": 2.0}, {"food": "plum", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}], "title": "\nBLT Biscuit Sliders\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Soak the onion in a bowl of cold water while you prepare the salad.\n            \n\n              Working in batches, cook the pancetta in a single layer in a large skillet over medium heat until crisp, about 4 minutes per side. Transfer to paper towels to drain; reserve the drippings.\n            \n\n              Combine 1 tablespoon each olive oil and pancetta drippings in a small bowl. Toss with the bread cubes on a baking sheet and sprinkle with 1/4 teaspoon each salt and pepper; spread in an even layer. Bake, stirring once, until lightly toasted, about 15 minutes.\n            \n\n              Drain the onion and chop all but 6 slices pancetta. Add to a large bowl with the tomatoes, arugula, basil, olives, bread, vinegar and the remaining 3 tablespoons olive oil. Toss and season with salt and pepper.\n            \n\n              Divide the salad among bowls. Top each with some ricotta salata and a piece of reserved pancetta.\n            \n\n              Photograph by Jonathan Kantor\n            \n", "ingredients": [{"food": "onion powder", "quantity": 0.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 6.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "barbecue loaf", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "mixed nuts", "quantity": 2.0}, {"food": "arugula", "quantity": 3.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "olives", "quantity": 0.25}, {"food": "vinegar", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 2.0}], "title": "\nBLT Bread Salad\n"}, {"directions": "\n\n              Mix 1/3 cup each mayonnaise and finely chopped cooked bacon; season with pepper. Spread on toasted white bread. Sandwich with deli-sliced turkey, sliced cherry tomatoes and baby greens. Make a double-decker sandwich. Trim the crusts and cut into pieces.\n            \n", "ingredients": [], "title": "\nBLT Club Tea Sandwich\n"}, {"directions": "\n\n              1. Soak four 6-inch bamboo skewers in water for 30 minutes and preheat grill to medium. \n            \n\n              2. Cut escarole lengthwise, through core, into 4 wedges. Season with salt and pepper. Wrap each wedge tightly with 2 slices of bacon; secure with skewers and brush with 1/4 cup olive oil. Place bundles skewered side down and covered with a disposable aluminum pan on grill. Cook, turning occasionally until bacon is crisp, about 12 minutes. \n            \n\n              3. Lightly brush bread with additional olive oil, season with salt and black pepper to taste and char on grill, about 1 minute per side. Remove and rub bread with cut side of tomato halves until toasts are saturated with tomato's juices. \n            \n\n              4. Top each crostini with an escarole bundle and serve with a lemon wedge.\n            \n", "ingredients": [{"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "bacon", "quantity": 8.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "garlic bread", "quantity": 4.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "lemon juice", "quantity": 4.0}], "title": "\nBLT Crostini\n"}, {"directions": "\n\n              Fry thick bacon strips until crisp, then fry hot dogs in the drippings. Serve on toasted buns with mayonnaise, shredded lettuce, diced tomato and the bacon.\n            \n\n              Photograph by Karl Juengel/Studio D\n            \n", "ingredients": [], "title": "\nBLT Dogs\n"}, {"directions": "\n\n              Fill a large pot with about 2 inches of water. Add 1 tablespoon salt and bring to a boil. Add the lobsters, cover and cook until the shells are bright red, about 10 minutes. Remove to a colander using tongs, then rinse under cold water to cool slightly.\n            \n\n              Remove the meat from each lobster: Twist off the claws and tail. Remove the flippers at the end of the tail and insert your thumb to force out the meat. Crack the claws with the flat side of a knife or a lobster cracker; remove the meat. Roughly chop the lobster meat, transfer to a bowl and chill 15 minutes.\n            \n\n              Meanwhile, preheat the oven to 400 degrees F. Lay the bacon on a foil-lined baking sheet and bake until browned and crisp, about 15 minutes; drain on paper towels. Combine the mayonnaise, chopped celery, basil and lemon juice in a large bowl; set aside.\n            \n\n              Melt the butter in a large skillet over medium heat; add the buns and toast about 2 minutes per side. Spread about 1 tablespoon of the herbed mayonnaise in each roll. Stir the lobster meat into the remaining mayonnaise and season with salt and pepper. Fill each roll with a lettuce leaf, 1 slice of bacon, some lobster salad and a few tomato slices. Sprinkle with the celery leaves and chives. Crumble the remaining bacon slice and sprinkle on top.\n            \n\n              Photograph by Kana Okada\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "", "quantity": 2.0}, {"food": "bacon", "quantity": 5.0}, {"food": "mayonnaise dressing", "quantity": 0.3333333333333333}, {"food": "celery seed", "quantity": 1.0}, {"food": "basil", "quantity": 2.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "hot pockets ham cheese stuffed swich", "quantity": 4.0}, {"food": "pepper", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 4.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "chives", "quantity": 1.0}], "title": "\nBLT Lobster Rolls\n"}, {"directions": "\n\n              Cook the pasta in a large pot of salted boiling water as the label directs. Drain and toss with the milk in a large bowl; set aside.\n            \n\n              Meanwhile, cook the bacon in a large skillet over medium-high heat until crisp. Drain on paper towels. Discard all but 3 tablespoons drippings from the pan. Add the tomatoes, thyme and garlic to the pan and toss until warmed through; season with salt and pepper. Crumble the bacon into bite-size pieces; set aside 1/4 cup for garnish. Toss the remaining bacon and the tomato mixture with the pasta.\n            \n\n              Mix the mayonnaise, sour cream and 3 tablespoons chives with the pasta until evenly combined. Season with salt and pepper. Add the lettuce; toss again to coat. Garnish with the reserved bacon and the remaining 1 tablespoon chives. Serve at room temperature.\n            \n\n              Photography by Antonis Achilleos\n            \n", "ingredients": [{"food": "italian veg medley pasta", "quantity": 12.0}, {"food": "milk", "quantity": 0.5}, {"food": "bacon", "quantity": 12.0}, {"food": "pineapple chunks", "quantity": 3.0}, {"food": "thyme", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "mayonnaise dressing", "quantity": 0.5}, {"food": "sour cream", "quantity": 0.25}, {"food": "turnip greens", "quantity": 4.0}, {"food": "hearts of palm", "quantity": 5.0}], "title": "\nBLT Pasta Salad\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 400 degrees F. Bring a large pot of salted water to a boil. Cook the pasta according to the package directions. Drain and reserve 1/2 cup of the pasta water. \n            \n\n              Meanwhile, lay the bacon in a large ovenproof skillet and cook over medium heat until brown and slightly crispy, 4 to 5 minutes per side. Remove the skillet from the heat, transfer the bacon to a paper-towel-lined plate and pour off all but 1 tablespoon of the drippings. Break up the bacon into bite-size pieces. \n            \n\n              Return the skillet to medium heat, add the garlic and cook, stirring frequently, until soft, about 1 minute. Add the tomatoes and juices, reserved pasta water, crushed red pepper, basil, escarole and 1/2 teaspoon salt. Bring to a simmer and cook until the sauce thickens and the escarole wilts, 15 to 20 minutes. \n            \n\n              Mix together the ricotta and Parmesan. Add the cooked pasta and mozzarella to the sauce and stir to thoroughly coat. Drop spoonfuls of the ricotta-Parmesan mixture on top. Sprinkle with the bacon pieces and bake until bubbly and the cheese melts, 15 to 20 minutes. Let rest for a few minutes before serving. Garnish with additional basil if using.\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "italian veg medley pasta", "quantity": 8.0}, {"food": "bacon", "quantity": 3.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "pasta with tomato sauce", "quantity": 28.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "chrysanthemum leaves", "quantity": 4.0}, {"food": "escarole", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 0.5}, {"food": "", "quantity": 0.25}, {"food": "", "quantity": 8.5}], "title": "\nBLT Pasta Skillet\n"}, {"directions": "\n\n              Cook the quinoa as the label directs; set aside. Meanwhile, toss the tomatoes with the parsley, vinegar, 1/2 teaspoon salt and a few grinds of pepper. Set aside until juicy, about 20 minutes.\n            \n\n              Meanwhile, cook the bacon in a large nonstick skillet over medium heat, stirring occasionally, until crisp, about 10 minutes; remove 2 teaspoons drippings and set aside. Add the broccoli to the bacon in the skillet and cook until crisp-tender, about 3 minutes. Stir in the corn and garlic and cook until the corn is tender, 2 minutes. Stir in the spinach in two batches and cook until just wilted. Stir the vegetable mixture and scallions into the quinoa; season with salt.\n            \n\n              Wipe out the skillet and return to medium-high heat. Add the reserved bacon drippings. Crack the eggs into the skillet; season with salt and pepper and cook until the whites are set but the yolks are still runny, about 3 minutes. Divide the quinoa mixture among bowls. Top with the tomato mixture and fried eggs.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "quinoa", "quantity": 1.25}, {"food": "tomatoes", "quantity": 2.0}, {"food": "parsley", "quantity": 2.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "bacon", "quantity": 4.5}, {"food": "tender bits", "quantity": 1.0}, {"food": "sunflower seed kernels", "quantity": 1.5}, {"food": "garlic powder", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "eggs", "quantity": 4.0}], "title": "\nBLT Quinoa Bowls\n"}, {"directions": "\n\n              Hollow out 4 tomatoes, . Season with salt and pepper and invert to drain. Cook 2 bacon slices with 1 garlic clove; chop, then toss with 1/2 cup chopped lettuce, 1/2 cup chopped stale bread cubes, 2 tablespoons mayonnaise and salt and pepper. Stuff into the tomatoes, then brush with the bacon drippings. Bake 20 to 30 minutes at 425 degrees F.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nBLT Tomatoes\n"}, {"directions": "\n\n              Cook the bacon in a skillet over medium heat until crisp, about 10 minutes. Transfer with a slotted spoon to a paper towel-lined plate. Reserve the drippings.\n            \n\n              Make the dressing: Combine the tomato paste, vinegar, sour cream, shallot, tarragon, sugar and 1 tablespoon bacon drippings in a medium bowl; whisk well. Add the olive oil in a slow stream, whisking until emulsified. Whisk in 2 to 3 tablespoons water to make the dressing thin enough to drizzle. Season with salt and pepper.\n            \n\n              Arrange the iceberg wedges on a platter and drizzle with the dressing. Top with the tomatoes and bacon.\n            \n\n              Photograph by Jonny Valiant\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 4.0}, {"food": "pasta with tomato sauce", "quantity": 3.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "sour cream", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "salt", "quantity": 1}, {"food": "lettuce", "quantity": 1.0}, {"food": "silk black cherry soy yogurt", "quantity": 1.0}], "title": "\nBLT Wedges\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: a 10-inch nonstick springform pan\n\n              For the ribs: Combine the coriander, peppercorns, thyme, brown sugar and 1 tablespoon salt in a small bowl. Sprinkle the mixture all over the ribs, rubbing it in well. Put on a rimmed baking sheet, cover with plastic wrap and refrigerate for 8 hours or up to overnight.\n            \n\n              Preheat the oven to 350 degrees F and line a rimmed baking sheet with foil. Put the bottom of a 10-inch nonstick springform pan in the middle of the baking sheet. Unlock the collar of the springform pan and put it on top of the base. Stand up the ribs along the inside of the collar with the bone sides touching the metal to form a circle. (The collar should look like a corset around the ribs.) \n            \n\n              For the filling: Spread the corn in an even layer in the center of the crown of ribs. \n            \n\n              Whisk together the cornmeal, flour, granulated sugar, baking powder, baking soda and 1 1/2 teaspoons salt in a medium bowl. Whisk together the sour cream, milk and 2 egg yolks in another medium bowl. Stir the sour cream mixture into the cornmeal mixture until well combined. Stir in the chives, thyme and butter. Beat the 4 egg whites with an electric mixer until stiff peaks form. Fold the egg whites into the cornmeal batter until just combined.\n            \n\n              Spoon the batter on top of the corn in the middle of the ribs and tighten the springform pan collar by closing the clasp. Roast until the ribs are cooked through and the batter is set, about 1 hour 50 minutes. \n            \n\n              For the cranberry topping: Meanwhile, combine the cranberries, granulated sugar and 1/4 cup water in a small saucepan. Bring to a boil over high heat, reduce to a very low simmer and cook until the liquid is reduced to about 1 tablespoon and the cranberries are glossy and translucent, about 20 minutes.\n            \n\n              Wearing oven mitts, unclasp the springform side and carefully work it up over the top of the roast to remove it. Using a large spatula, remove the roast from the springform pan base and transfer it to a serving platter. Spread a pat of butter over the cornbread and top with the cranberries and some thyme sprigs. \n            \n", "ingredients": [{"food": "watermelon seed krnls", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 1.5}, {"food": "sunflower seed kernels", "quantity": 15.0}, {"food": "yellow rice", "quantity": 1.25}, {"food": "potato flour", "quantity": 0.5}, {"food": "sugar", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "sour cream", "quantity": 1.0}, {"food": "milk", "quantity": 0.25}, {"food": "egg substitute", "quantity": 2.0}, {"food": "chives", "quantity": 0.25}, {"food": "chrysanthemum leaves", "quantity": 3.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "frozen yogurt", "quantity": 0.5}, {"food": "sugar", "quantity": 0.25}], "title": "\nBaby Back Rib Crown Roast\n"}, {"directions": "\n\n              Pierce 8 unpeeled baby bananas in a few spots with a knife. Roast on a baking sheet at 375 degrees F until brown and soft, 12 to 15 minutes. Let cool slightly. Split open the bananas, slicing through the peel. Top with coconut ice cream and chopped peanuts. \n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [], "title": "\nBaby Banana Splits\n"}, {"directions": "\n\n              Preheat a grill to high. Toss 1 pound baby bell peppers or quartered regular peppers with 2 tablespoons olive oil; season with salt and red pepper flakes. Grill, turning, until blistered, about 10 minutes. Transfer to a bowl and toss with 1 tablespoon olive oil, some chopped mint and the juice of 1/2 lemon. Top with crumbled feta.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nBaby Bell Peppers With Feta and Mint\n"}, {"directions": "\n\n              Add the bacon to a large skillet and cook over medium heat, stirring occasionally, until brown and crisp, about 6 minutes. While the bacon cooks, cut the stems from the bok choy into 1-inch pieces and the leafy tops into 3-inch pieces.\n            \n\n              Add the onion to the bacon and cook, stirring, until softened slightly, 4 to 5 minutes. Toss in the beans and stir until heated through, about 2 minutes. Transfer the vegetables with a slotted spoon to a bowl, leaving the fat in the pan.\n            \n\n              Add the bok choy stems to the pan, increase the heat to medium-high and cook, stirring, until slightly softened, about 2 minutes. Add the bok choy leaves and cook, stirring, until wilted, about 1 minute. Remove the pan from the heat and stir in the vinegar. Return the onion-bean mixture back to the pan and season with salt. Serve warm or at room temperature.\n            \n", "ingredients": [{"food": "bacon", "quantity": 4.25}, {"food": "", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "fava beans", "quantity": 15.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "salt", "quantity": 1}], "title": "\nBaby Bok Choy with Bacon, Onion and Butter Beans\n"}, {"directions": "\n\n              Steam 2 bunches baby broccoli until bright green and tender, 5 minutes. Drizzle with 1 teaspoon sesame oil. Whisk 2 tablespoons oyster sauce with a splash of water and lemon juice and serve with the broccoli for dipping.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nBaby Broccoli with Oyster Sauce\n"}, {"directions": "\n\n              For the eyes: Arrange the white sprinkles on the work surface. Attach a mini chocolate chip as a pupil to each sprinkle by gluing with a little buttercream. Set aside.\n            \n\n              For the wings and tails: Cut each yellow gumdrop fruit slice in half horizontally to make 2 thinner slices. Take 4 of these slices and cut each into 3 triangles to make the tails. Set aside.\n            \n\n              For the feet: Cut each orange gumdrop fruit slice in half horizontally to make 2 thinner slices, and then cut each slice in half crosswise. Using scissors, snip and remove 2 triangles from each foot to form the toes.\n            \n\n              For the beaks: Place the small orange gumdrops on the work surface standing upright. Snip each gumdrop with scissors straight down three-quarters of the way through the candy to make the open mouth. Snip either side of the gumdrop to narrow the overall size and shape into a tapered beak.\n            \n\n              To assemble: Frost each cupcake with about 2 tablespoons buttercream. Place the yellow sanding sugar in a small bowl. Invert each cupcake and press gently into the sugar to adhere.\n            \n\n              Attach the eyes by pressing gently into position. Insert the beak just below eye level. Push the wings and feet into the sides of the cupcake and the tail into the back. Repeat steps for all cupcakes.\n            \n", "ingredients": [{"food": "martha white foods", "quantity": 24.0}, {"food": "baking chocolate", "quantity": 24.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "fruit cocktail", "quantity": 14.0}, {"food": "fruit cocktail", "quantity": 6.0}, {"food": "orange", "quantity": 12.0}, {"food": "vanilla extract", "quantity": 12.0}, {"food": "sugar", "quantity": 34.0}], "title": "\nBaby Chick Cupcakes\n"}, {"directions": "\n\n              Combine the lettuce, arugula, radishes, cucumbers and sunflower seeds in a large bowl. Add the dressing, season with salt and pepper, and gently toss.\n            \n\nGreen Goddess Dressing\n\n\n              Combine 1/2 cup each mayonnaise and sour cream, 1/3 cup each chopped parsley and chives, and 1/4 cup chopped tarragon in a blender. Add 2 anchovy fillets, 1 minced garlic clove, 1 tablespoon capers, the juice of 1 lemon, 1/2 teaspoon kosher salt and a few grinds of pepper; puree until smooth. \n            \n", "ingredients": [{"food": "lettuce", "quantity": 6.0}, {"food": "arugula", "quantity": 4.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 8.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "sunflower seed kernels", "quantity": 0.25}, {"food": "dressing", "quantity": 0.75}, {"food": "salt", "quantity": 1}], "title": "\nBaby Greens with Radishes and Sunflower Seeds\n"}, {"directions": "\n\n              Combine the garlic, lemons, olive oil, mint and rosemary in a large bowl. Sprinkle the lamb chops with the paprika, and salt and pepper to taste; add to the bowl and toss to coat. Cover and let marinate at room temperature, turning occasionally, about 1 hour.\n            \n\n              Heat a large cast-iron skillet over high heat. Working in batches, cook the chops and lemons until browned, 3 to 4 minutes per side. Serve the chops topped with the lemons.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "garlic powder", "quantity": 3.0}, {"food": "lemons", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "chrysanthemum leaves", "quantity": 6.0}, {"food": "chrysanthemum leaves", "quantity": 4.0}, {"food": "lamb", "quantity": 16.0}, {"food": "paprika", "quantity": 2.0}, {"food": "salt", "quantity": 1}], "title": "\nBaby Lamb Chops With Lemon\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F.\n            \n\n              To make the potatoes: In a medium saucepan combine the vermouth, water, parsley, tarragon, lemon zest, and salt. Set aside.\n            \n\n              Cut the potatoes in half horizontally. Slice a small portion off of the rounded ends-- so the potatoes stand up without rolling around -- and discard. Add the halved potatoes to the saucepan. Bring to a boil over medium heat; adjust the heat to maintain a gentle simmer and cook until just fork tender, about 8 minutes. Set the potatoes aside to cool in the liquid for 5 minutes.\n            \n\n              Drain the potatoes, reserving 2 teaspoons of the cooking liquid. Discard the herbs and lemon zest. With a small spoon or melon baller, scoop out a little of each potato, to make a little \"bowl\" for the cheese.\n            \n\n              Toss the potatoes with the oil in a small bowl, and stand them up on a baking sheet. Bake until lightly browned, about 15 minutes.\n            \n\n              Meanwhile, make the filling: In a medium bowl, cream the cheese with the creme fraiche and the 2 teaspoons of reserved cooking liquid. Fold in the minced parsley, tarragon, chives, and chervil. Season with pepper, to taste.\n            \n\n              Remove the potatoes from the oven and let cool slightly. While the potatoes are still warm, spoon a dollop of the cheese mixture into each potato. Set the potatoes on a platter and top off with the chive segments to garnish. Serve.\n            \n", "ingredients": [{"food": "martha white foods", "quantity": 1.0}, {"food": "coconut water", "quantity": 3.0}, {"food": "parsley", "quantity": 4.0}, {"food": "", "quantity": 3.0}, {"food": "hearts of palm", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 6.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 3.0}, {"food": "sour cream", "quantity": 2.0}, {"food": "parsley", "quantity": 1.0}, {"food": "", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "dill seed", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nBaby Potatoes with Creamy Goat Cheese and Fine Herbs\n"}, {"directions": "\n\n              Preheat oven to 350 degrees F.\n            \n\n              Slice the onion into thin wedges, through the root end. Toss with the olive oil, season with salt, to taste, and spread out on a baking sheet. Roast until just soft and brown, about 20 minutes. Set aside to cool.\n            \n\n              Put the spinach and onions in a large bowl. Drizzle with some of the dressing and toss. Add more dressing as needed; spinach should just be lightly coated. Divide salad among 4 chilled plates. Top with pecans, goat cheese, and dried cranberries. Serve immediately.\n            \n\nCitrus Dressing:\n\n\n              Whisk the lemon zest, lemon juice, orange juice, Dijon, honey, thyme, and salt in a medium bowl until well combined. Gradually whisk in the oil, starting with a few drops and then adding the rest in a steady stream, to make a smooth, slightly thick dressing.\n            \n", "ingredients": [{"food": "onion powder", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "mustard spinach", "quantity": 8.0}, {"food": "pecans", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 0.3333333333333333}, {"food": "cranberries", "quantity": 0.5}, {"food": "lemon juice", "quantity": 1.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "orange juice", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "honey smoked ham", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 0.25}, {"food": "salt", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 0.25}], "title": "\nBaby Spinach Salad with Roasted Red Onions, Pecans, Dried Cranberries, Crumbled Goat Cheese and Citrus Dressing\n"}, {"directions": "\n\n              Preheat oven to 350 degrees F.\n            \n\n              Slice the onion into thin wedges, through the root end. Toss with the olive oil, season with salt, to taste, and spread out on a baking sheet. Roast until just soft and brown, about 20 minutes. Set aside to cool.\n            \n\n              Put the spinach and onions in a large bowl. Drizzle with some of the dressing and toss. Add more dressing as needed; spinach should just be lightly coated. Divide salad among 4 chilled plates. Top with pecans, goat cheese, and dried cranberries. Serve immediately.\n            \n\nCitrus Dressing:\n\n\n              Whisk the lemon zest, lemon juice, orange juice, Dijon, honey, thyme, and salt in a medium bowl until well combined. Gradually whisk in the oil, starting with a few drops and then adding the rest in a steady stream, to make a smooth, slightly thick dressing.\n            \n", "ingredients": [{"food": "onion powder", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "mustard spinach", "quantity": 8.0}, {"food": "pecans", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 0.3333333333333333}, {"food": "cranberries", "quantity": 0.5}, {"food": "lemon juice", "quantity": 1.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "orange juice", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "honey smoked ham", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 0.25}, {"food": "salt", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 0.25}], "title": "\nBaby Spinach Salad with Roasted Red Onions, Pecans, Dried Cranberries, Crumbled Goat Cheese and Citrus Dressing\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Spread the almonds out on a rimmed baking sheet and toast until light brown and fragrant, about 8 minutes. Set aside.\n            \n\n              Cook the bacon in a large skillet over medium heat until brown and crispy, about 5 minutes. Remove the skillet from the heat and transfer the cooked bacon with a slotted spoon to a small bowl, leaving the drippings in the skillet.\n            \n\n              Return the skillet to medium heat, add the shallots and 1 tablespoon water and cook, stirring, until soft, about 3 minutes. Add the vinegar and cook until it is reduced and the shallots are glazed, about 3 minutes more. Add the spinach in batches, stirring to wilt before adding more. When all the spinach has been added, raise the heat to high, add the paprika, red pepper flakes, 1/4 teaspoon salt and a few grinds of pepper and cook, covered, for 2 minutes. Remove the lid, stir in the raisins, toasted almonds, reserved bacon and butter and serve.\n            \n", "ingredients": [{"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "bacon", "quantity": 2.5}, {"food": "", "quantity": 1.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 1.5}, {"food": "sweet potatoes", "quantity": 0.25}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "black bean mango", "quantity": 1}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.25}, {"food": "butter oil", "quantity": 1.0}], "title": "\nBaby Spinach with Almonds and Golden Raisins\n"}, {"directions": "\n\n              Trim the membrane off the back of the ribs and rub ribs all over with spice blend. Cover and refrigerate for 2 to 24 hours. Soak wood chips in water for at least 30 minutes before grilling.\n            \n\n              Prepare an outdoor grill with a medium fire for indirect grilling. Place a drip pan, half-filled with water, under the cooler side of the grill grate. Open bottom vents of the grill.\n            \n\n              Set the ribs over the drip pan. (If you have a rib rack, use it.) Toss 1 cup of the drained wood chips onto the coals and cover the grill. Rotate the lid so that the vent holes are directly over the ribs. Add about 1 cup of hardwood charcoals to the fire about every hour during the cooking time to maintain a medium to medium-low fire (a temperature of about 250 degrees F to 275 degrees F is ideal). After 3 hours the meat should pull back from the bones and will have turned a reddish brown. Baste the ribs with some of the barbecue sauce of your choice and cook over direct heat until lightly glazed. Cut the racks into ribs and serve with extra sauce on the side.\n            \n\nMemphis Shake:\n\n\n              Whisk paprika, brown sugar, oregano, garlic, ancho powder, salt, and celery salt in a small bowl. Store in an airtight container in a cool, dry place for up to 2 months.\n            \n\n              Makes about 3/4 cup\n            \n\nCajun Rub:\n\n\n              Mix brown sugar, oregano, parsley, garlic, onion powder, paprika, thyme, black pepper, salt, celery salt, white pepper, cayenne, and bay leaves in a bowl. Pulse in a spice grinder in two batches to a medium-fine grind. Seal in an airtight container and store in a cool, dry place for up to 2 months.\n            \n\n              Makes 1 cup\n            \n\nKansas City-Style BBQ Sauce:\n\n\n              Heat the oil in a medium saucepan over medium heat. Stir in the garlic, tomato paste, chili powder, paprika, red pepper, allspice, and cloves and cook, stirring, until paste is dark brick red, about 3 minutes. Add the ketchup, water, vinegar, molasses, brown sugar, salt, soy sauce, Worcestershire, mustard, black pepper, and bay leaf. Adjust the heat to maintain a gentle simmer and cook until the flavors come together, about 30 minutes. Remove and discard bay leaf before using.\n            \n\n              Makes about 1 quart\n            \n\nChile-Coffee BBQ Sauce:\n\n\n              Split, stem, and seed the chiles. Toast the chiles in a dry skillet over medium-high heat, turning and flattening with a spatula, until fragrant, about 3 minutes. Put the chiles in a heatproof bowl, cover with very hot water, and set aside until soft, about 30 minutes. Drain, reserve soaking liquid, chop chiles roughly, and set aside.\n            \n\n              While the chiles soak, char the onion and garlic in the same dry skillet over medium heat until the onion blackens slightly and garlic softens in the skin, about 8 minutes. Cool, squeeze the garlic out of the skin, and put in a blender with chiles and onion. Puree to a paste, adding soaking liquid as needed (about 3/4 cup) to help the mixture break down.\n            \n\n              Heat the oil in the skillet over medium-high heat. Add the chile mixture and cook, stirring, until thick and fragrant, about 4 minutes. Add the tomato puree, coffee, sugar, 1 tablespoon salt, oregano, cloves, and cumin. Adjust the heat to maintain a gentle simmer and cook, stirring occasionally, until slightly thickened, about 15 minutes.\n            \n\n              Stir in vinegar and season with salt to taste.\n            \n\n              Makes 1 quart\n            \n", "ingredients": [{"food": "pork skins", "quantity": 2.0}, {"food": "barley flour or meal", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "hearts of palm", "quantity": 2.0}, {"food": "sweet potatoes", "quantity": 0.25}, {"food": "sugar", "quantity": 3.0}, {"food": "", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "chili powder", "quantity": 1.0}, {"food": "salt", "quantity": 2.0}, {"food": "celery seed", "quantity": 1.0}, {"food": "sugar", "quantity": 0.25}, {"food": "", "quantity": 2.0}, {"food": "parsley", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "onion powder", "quantity": 2.0}, {"food": "sweet potatoes", "quantity": 2.0}, {"food": "thyme", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1.0}, {"food": "salt", "quantity": 2.0}, {"food": "celery seed", "quantity": 1.0}, {"food": "martha white foods", "quantity": 1.0}, {"food": "pepper", "quantity": 0.75}, {"food": "chrysanthemum leaves", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 6.0}, {"food": "pasta with tomato sauce", "quantity": 2.0}, {"food": "chili powder", "quantity": 1.0}, {"food": "paprika", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "allspice", "quantity": 0.25}, {"food": "cloves", "quantity": 1}, {"food": "", "quantity": 2.0}, {"food": "coconut water", "quantity": 2.0}, {"food": "vinegar", "quantity": 0.5}, {"food": "molasses", "quantity": 0.25}, {"food": "sugar", "quantity": 0.25}, {"food": "salt", "quantity": 1.0}, {"food": "soy sauce", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1.0}, {"food": "corier leaf", "quantity": 1.0}, {"food": "", "quantity": 3.0}, {"food": "", "quantity": 3.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "garlic powder", "quantity": 6.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1.0}, {"food": "sugar", "quantity": 0.25}, {"food": "seasoning mix", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "cloves", "quantity": 1}, {"food": "cumin seed", "quantity": 1}, {"food": "vinegar", "quantity": 2.0}], "title": "\nBackyard BBQ'd Spareribs\n"}, {"directions": "\nSpecial equipment: 3 cups wood chips, soaked in water for at least 30 minutes and drained\n\n              1. Rub ribs all over with Memphis Shake. Cover and refrigerate for 2 to 24 hours. Soak wood chips in water for at least 30 minutes before grilling.\n            \n\n              2. Soak 3 cups hardwood chips in water for 30 minutes or up to one day. Build a charcoal fire on an outdoor grill to medium heat. Place a pan, half-filled with water, under cooler side grill grate. Open bottom vents grill. \n            \n\n              3. Place ribs over drip pan. Drain wood chips and place half directly over hot coals. Rotate lid so vent holes are directly over ribs. Add about 1 cup hardwood charcoals to fire about every hour during cooking time to maintain a medium to medium-low fire (a temperature about 250 degrees F to 275 degrees F is ideal). Cook until meat is reddish brown and pulls back from bones, about 3 hours. Baste ribs with barbecue sauce and cook over direct heat until lightly glazed. Cut racks into ribs and serve with extra sauce on side.\n            \n\nCola Barbecue Sauce:\n\n\n              1. Rub ribs all over with Memphis Shake. Cover and refrigerate for 2 to 24 hours. Soak wood chips in water for at least 30 minutes before grilling.\n            \n\n              2. Soak 3 cups hardwood chips in water for 30 minutes or up to one day. Build a charcoal fire on an outdoor grill to medium heat. Place a pan, half-filled with water, under cooler side grill grate. Open bottom vents grill. \n            \n\n              3. Place ribs over drip pan. Drain wood chips and place half directly over hot coals. Rotate lid so vent holes are directly over ribs. Add about 1 cup hardwood charcoals to fire about every hour during cooking time to maintain a medium to medium-low fire (a temperature about 250 degrees F to 275 degrees F is ideal). Cook until meat is reddish brown and pulls back from bones, about 3 hours. Baste ribs with barbecue sauce and cook over direct heat until lightly glazed. Cut racks into ribs and serve with extra sauce on side\n            \n\nMemphis Shake:\n\n\n              Whisk paprika, brown sugar, oregano, garlic, ancho powder, 2 teaspoons salt, and celery salt in a small bowl. Store in an airtight container in a cool, dry place for up to 2 months.\n            \n", "ingredients": [{"food": "pork skins", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "", "quantity": 0.5}, {"food": "garlic powder", "quantity": 4.0}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 3.0}, {"food": "", "quantity": 11.0}, {"food": "vinegar", "quantity": 0.25}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "chili powder", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 12.0}, {"food": "allspice", "quantity": 0.25}, {"food": "lime juice", "quantity": 11.0}, {"food": "sweet potatoes", "quantity": 0.25}, {"food": "sugar", "quantity": 3.0}, {"food": "", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "celery seed", "quantity": 1.0}], "title": "\nBackyard BBQ'd Spareribs\n"}, {"directions": "\n\n              Preheat the oven broiler. \n            \n\n              Mash the avocados in a medium bowl until slightly chunky. Stir in the scallions, lemon juice, 1/2 teaspoon salt and a few grinds of pepper and set aside. \n            \n\n              Arrange the bacon in a large nonstick skillet over medium heat and cook until brown and crisp, about 4 minutes per side. Transfer to a paper towel-lined plate and reserve the drippings in the skillet. Brush each slice of bread with some bacon drippings. Arrange the bread on a baking sheet, bacon dripping side-up, and broil until lightly toasted. \n            \n\n              Spread each toast with 1/4 of the mashed avocado, break each piece of bacon in half and top each toast with 2 halves.\n            \n", "ingredients": [{"food": "avocados", "quantity": 2.0}, {"food": "", "quantity": 3.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "smoked turkey roll", "quantity": 4.0}, {"food": "garlic bread", "quantity": 4.75}], "title": "\nBacon Avocado Toasts\n"}, {"directions": "\n\n              Put bacon strips on a parchment-line baking sheet; put another pan on top. Bake at 400 degrees, 10 minutes, then uncover and back 10 more minutes.\n            \n\n              Lightly mix 6 ounces ground beef chuck with a big pinch of kosher salt. Form into a ball, then into a 3/4-inch-thick patty; make an indentation in the center. Heat a cast-iron skillet over medium-high heat; sprinkle the skillet with salt.\n            \n\n              Cook the burger 4 to 5 minutes per side; top with 2 slices cheddar in the last minute of cooking (cover to melt). Serve on a sesame bun with the bacon.\n            \n", "ingredients": [], "title": "\nBacon Cheese Burger\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F and line a baking sheet with parchment paper.\n            \n\n               Heat a large skillet over medium heat. Add the beef and cook, stirring to break it up into small crumbles, until cooked through, 8 to 10 minutes. Meanwhile, roughly chop half of the cheese, leaving other half as slices. Set aside. \n            \n\n              Using a slotted spoon, remove the beef from the skillet and transfer to a large bowl; discard the fat and liquid in the pan. Let the beef cool completely in the bowl, then stir in the chopped cheese.\n            \n\n              On a lightly floured work surface, roll the dough into a 20-by-14-inch rectangle. Arrange the beef and cheese mixture evenly on one half of the dough, starting on the shorter end and leaving a 1-inch border on the sides. Drizzle 2 tablespoons ketchup evenly over the beef mixture and the uncovered half of the dough; repeat with all the mustard, and then the red onion. Lay down the remaining cheese slices evenly over the half of the dough with no beef mixture, leaving a 1-inch border on the sides. Arrange the bacon pieces and 24 dill pickle chips just over the beef mixture. \n            \n\n              Working from the short side with the beef mixture, tightly roll up the dough into a log, jelly-roll style. Pinch the open ends together to seal, then tuck them underneath the log. Transfer the log, seam side-down, to the prepared baking sheet, brush all over with water and sprinkle with sesame seeds. Bake, rotating the pan halfway through, until the bread is golden brown, about 40 minutes.\n            \n\n              While the bread bakes, whisk together the mayonnaise, onion flakes, sugar, a pinch of salt and pepper and the remaining 3 tablespoons ketchup, 2 tablespoons finely chopped dill pickle chips and 1 teaspoon pickle brine in a small bowl. Taste, and season the special sauce with additional salt if needed. Let the bread cool for 10 minutes. Slice into 8 pieces and serve warm with the special sauce.\n            \n", "ingredients": [{"food": "frankfurter beef", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 12.0}, {"food": "potato flour", "quantity": 1}, {"food": "pizza rolls", "quantity": 1.5}, {"food": "", "quantity": 5.0}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "bacon", "quantity": 12.0}, {"food": "pickle loaf", "quantity": 32.0}, {"food": "seeds", "quantity": 1}, {"food": "mayonnaise dressing", "quantity": 0.5}, {"food": "onion powder", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nBacon Cheeseburger Garbage Bread\n"}, {"directions": "\n\n              Preheat a grill to medium high. Cook the bacon in a large nonstick skillet over medium-high heat, turning, until browned and crisp, about 7 minutes. Transfer to a paper towel-lined plate to drain; break each slice in half.\n            \n\n              Meanwhile, combine the ground beef, Worcestershire sauce, 1 1/2 teaspoons salt and a few grinds of pepper in a large bowl. Mix with your hands until just combined. Form the mixture into four 3/4-inch-thick patties. Press your thumb into the center of each patty to make a 1/2-inch-deep indentation.\n            \n\n              Combine the mayonnaise, Sriracha and ketchup in a bowl. Brush the grill with vegetable oil. Grill the patties until marked and cooked through, about 3 minutes per side; top each with a slice of cheese during the last minute of cooking and cover to melt.\n            \n\n              Toast the buns cut-side down on the grill. Serve the patties on the buns; top with the spicy mayonnaise, bacon and lettuce.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "bacon", "quantity": 4.0}, {"food": "frankfurter beef", "quantity": 1.5}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "mayonnaise dressing", "quantity": 0.5}, {"food": "", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "cheddar cheese", "quantity": 4.0}, {"food": "sesame meal", "quantity": 4.0}, {"food": "lettuce", "quantity": 1}], "title": "\nBacon Cheeseburgers with Spicy Mayonnaise\n"}, {"directions": "\nSpecial equipment: 1 50-inch-wide roll butcher paper 2 1-inch-thick pieces white foam, 12 inches wider and 10 inches longer than the child (available at crafts stores) Masking tape 1 can red or maroon spray paint Hot-glue gun and sticks\n\n              Have the child lie on butcher paper. Trace a rectangle around the child that's 6 inches wider than the shoulders on each side and runs lengthwise from below the knees to 13 inches higher than the top of the head. Trace around the child's head for the face opening. Using scissors, cut out the pattern and trace the shape onto two pieces of white foam, then cut the foam shapes. Cut a face opening on one piece of foam. Create red and white stripes on each piece of foam: Cut and tape down butcher paper to cover the areas you want to remain white, making curved stripes to resemble bacon. Apply red spray paint to the exposed foam. Dry overnight, then remove the paper. Hot-glue the two pieces of foam together, along the top and sides only; allow 10 inches for armholes and leave the portion from the knees down unglued. Dry for 1 hour before wearing.\n            \n", "ingredients": [], "title": "\nBacon Costume\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: a deep-frying thermometer\n\n              Sandwich the potato peels in an even layer between paper towels. Press down to blot and remove any excess moisture from them.\n            \n\n              Attach a deep-frying thermometer to the side of a large, wide pot. Fill with about 2 inches of oil and add the bacon fat. Heat over medium-high heat to 350 degrees F. Line a baking sheet with paper towels.\n            \n\n              Fry handfuls of the potato peels at a time, stirring them around with a slotted spoon to keep them from sticking to each other and to help them brown more evenly, until golden brown and crispy, 3 to 5 minutes per batch. Transfer them with the slotted spoon to the prepared baking sheet. Sprinkle generously with salt right away (you have 10 seconds!). Repeat with the remaining potato peels. Serve hot with ketchup, mayonnaise or equal parts mixed together for dipping.\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "low fat big franks", "quantity": 0.75}, {"food": "salt", "quantity": 1}, {"food": "mixed nuts", "quantity": 1}], "title": "\nBacon Fat-Fried Potato Peels\n"}, {"directions": "\n\n              Lay the bacon pieces on a baking sheet and freeze until hard, about 30 minutes. Meanwhile, preheat the oven to 350 degrees F. Bring a large pot of salted water to a boil. \n            \n\n              Using a sharp knife, make crosswise cuts in each potato, about 1/8 inch apart, stopping about 1/4 inch from the bottom. \n            \n\n              Add the potatoes to the boiling water and cook 4 minutes. Remove with a slotted spoon and carefully transfer to a baking sheet; let cool slightly. Pat the potatoes dry, then insert 3 pieces of the frozen bacon into the cuts of each potato, spacing the bacon evenly and letting it poke out of the top. Melt 5 tablespoons butter and brush generously over the potatoes and in the cuts. Reserve any excess butter for basting. Season the potatoes with salt and pepper. \n            \n\n              Transfer the potatoes to the oven and bake until the outsides are browned and crisp, about 2 hours, basting halfway through with the reserved melted butter. \n            \n\n              When the potatoes are almost done, melt the remaining 3 tablespoons butter and mix with the scallions, parsley and garlic. Spoon over the potatoes and roast 5 more minutes. Transfer to a platter and season with salt and pepper. \n            \n\n              Photograph by Gentl & Hyers\n            \n", "ingredients": [{"food": "bacon", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "sweet potatoes", "quantity": 12.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 2.0}, {"food": "parsley", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}], "title": "\nBacon Hasselback Potatoes\n"}, {"directions": "\n\n              Guacamole: Coarsely mash the avocado in a large bowl. Add the tomato, scallions, lime juice, cilantro, jalapeno, and garlic until blended. Cover and chill until ready to serve.\n            \n\n              Quesadillas: Preheat oven to 450 degrees F. Spray a large baking sheet with cooking spray.\n            \n\n              Lightly spray a medium nonstick skillet with cooking spray and set over medium-high heat. Add the bacon and cook, turning occasionally, until browned, 3 to 4 minutes. Transfer the bacon to paper towels to drain. Crumble and set aside.\n            \n\n              To the same skillet, add the scallions, jalapeno, garlic, cumin, and coriander. Cook, stirring often, over medium heat, until the scallions are soft, 2 to 3 minutes. Remove from the heat.\n            \n\n              Place the tortillas on the baking sheet; sprinkle 1/3 of the cheese, 1/3 of the scallion mixture, and 1/3 of the bacon over half of each tortilla. Fold the unfilled half of each tortilla over the filling. Lightly spray the quesadillas with cooking spray. Bake until lightly browned and crisp, 8 to 10 minutes.\n            \n\n              Cut each quesadilla into 4 wedges and serve with the guacamole and sour cream, if using. Garnish with cilantro.\n            \n", "ingredients": [{"food": "avocado", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "", "quantity": 2.0}, {"food": "lime juice", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "", "quantity": 1}, {"food": "turkey bacon", "quantity": 4.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 6.0}, {"food": "", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "cumin seed", "quantity": 0.25}, {"food": "ground turkey", "quantity": 0.25}, {"food": "multigrain cutlets", "quantity": 3.0}, {"food": "macaroni cheese", "quantity": 0.75}, {"food": "sour cream", "quantity": 0.25}, {"food": "", "quantity": 1}], "title": "\nBacon Jack and Jalapeno Quesadillas\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F and line a baking sheet with parchment paper.\n            \n\n              Combine the apples flour, apple pie spice, lemon zest, 1/2 cup of the sugar and 1 tablespoon of the maple syrup in a large bowl. Mix together to thoroughly coat the apples.\n            \n\n              Transfer the apple mixture into the pie crust. It will be mounded slightly above the edge. Pack the apples down to create an even layer for the bacon lattice.\n            \n\n              Place 6 slices of bacon horizontally across the pie. The edges of each slice should touch, but not overlap. Working with the remaining 6 slices, weave the bacon in an over-under pattern to evenly cover the top of the pie. This should be done by lifting alternating slices of the horizontal bacon and vertically placing a slice of bacon over or under as needed to create a woven design. Use kitchen shears to trim the bacon that hangs over the edge of the pie tin, making sure the bacon covers the rim of the pastry because it will pull back as it bakes.\n            \n\n              Cover the pie with aluminum foil, place it on the prepared baking sheet and bake for 25 minutes.\n            \n\n              Meanwhile, whisk the remaining 2 tablespoons sugar and 1 tablespoon maple syrup in a small bowl. Stir in the vinegar and sprinkle with a generous pinch of black pepper. Set aside.\n            \n\n              After the pie has baked 25 minutes, remove the foil and gently brush the bacon lattice with the maple glaze. Return the pie to the oven and continue baking, uncovered, until the bacon is brown and crispy and the apple mixture is bubbly, about 35 minutes more. Allow the pie to cool completely before slicing. Serve with whipped cream if using.\n            \n", "ingredients": [{"food": "pie crust", "quantity": 9.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 6.0}, {"food": "potato flour", "quantity": 0.25}, {"food": "pumpkin pie spice", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "syrup", "quantity": 2.0}, {"food": "", "quantity": 12.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "ice cream swich", "quantity": 1}], "title": "\nBacon Lattice Pie\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: A 10-inch nonstick Bundt pan\n\n              Position a rack in the lower third of the oven and preheat to 350 degrees F. Put the butter in a medium bowl. Brush the Bundt pan with some of the butter to lightly coat.\n            \n\n              Cut the biscuits into quarters. Combine the Cheddar and powdered cheese mix in a large bowl and stir together.\n            \n\n              Working in batches, toss one-third of the biscuits in the melted butter, roll them in the cheese mixture to lightly coat and add them to the Bundt pan so they are nestled together in an even layer; sprinkle with one-third of the bacon. Repeat to make 2 more layers of biscuits rolled in cheese and the bacon. Sprinkle the top with any leftover cheese mixture and drizzle with any leftover butter.\n            \n\n              Cover the pan with foil and bake for 35 minutes. Remove the foil and bake until puffed and golden brown, 10 to 15 minutes more. Loosen the bread from the sides of the pan with a knife or offset spatula. Carefully invert the pan onto a serving plate, remove the pan and serve hot.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.5}, {"food": "biscuit", "quantity": 16.0}, {"food": "", "quantity": 3.5}, {"food": "mac cheese", "quantity": 1.0}, {"food": "bacon", "quantity": 6.0}], "title": "\nBacon Mac and Cheese Monkey Bread\n"}, {"directions": "\n\n              Put the beans in a large wide pot or Dutch oven and cover with cold water by 1 inch. Bring to a boil, then remove from the heat and let soak 30 minutes; drain and rinse.\n            \n\n              Return the beans to the pot and add the bacon, onion, chili powder, Worcestershire sauce, chicken broth and 4 cups water. Bring to a simmer over medium-high heat, then reduce the heat to medium and simmer 30 minutes.\n            \n\n              Add 1 teaspoon salt and reduce the heat to medium low. Cover and simmer, stirring occasionally, 1 1/2 more hours. Partially uncover the pot and continue simmering, stirring occasionally, until the beans are creamy and the liquid is thick, about 30 more minutes. Add the vinegar and chives and season with salt.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "fava beans", "quantity": 1.0}, {"food": "bacon", "quantity": 0.5}, {"food": "onion powder", "quantity": 1.0}, {"food": "chili powder", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "vinegar", "quantity": 1.0}, {"food": "chives", "quantity": 2.0}], "title": "\nBacon Pinto Beans\n"}, {"directions": "\n\n              Make the dough: Put the flour in a food processor. With the motor running, pour in the beaten eggs and pulse until the dough gathers around the blades. Turn out the dough and pat into a rectangle. Wrap in plastic wrap and set aside 30 minutes at room temperature.\n            \n\n              Meanwhile, make the filling: Pulse the leeks, bacon and carrots in a food processor until finely chopped. Transfer to a skillet; add 1 cup water and cook over medium heat, stirring, until evaporated, about 7 minutes. Add the nutmeg, 1/2 teaspoon salt and 1/4 teaspoon pepper. Increase the heat to medium high; cook until the vegetables start to brown, about 4 minutes. Transfer to a bowl, stir in the parsley and let cool. Mix in the ricotta, gruyere and egg yolks; cover and chill until ready to make the ravioli.\n            \n\n              Dust the dough with flour and cut into 6 pieces. Pat 1 piece of dough into a 4-by-2-inch rectangle (keep the rest covered with plastic wrap). Feed a wide side through a pasta machine at the thickest setting. Continue to feed the dough through the machine, reducing the thickness setting each time, until the pasta is about /16 inch thick. Lay the pasta sheet on cornmeal-dusted parchment paper and cover with a kitchen towel. Repeat with the remaining dough.\n            \n\n              Line a baking sheet with parchment and dust with cornmeal. Uncover 1 sheet of dough; lay out with a long side facing you (keep the remaining sheets covered). Place small mounds of filling, about 2 inches apart, in a line along the bottom edge. Brush the top half of the sheet with water and fold the dough over to cover the filling; press around each mound to seal. Cut into squares with a pizza wheel or chef's knife; transfer to the baking sheet. Repeat with the remaining dough and filling. If not using immediately, wrap the baking sheet in plastic and freeze for up to 3 days.\n            \n\n              Make the sauce: Melt 3 tablespoons butter in a large skillet over medium-high heat. Add the mushrooms, season with salt and cook, stirring, until tender, about 4 minutes. Add the scallions and garlic; cook, stirring, 1 more minute. Add the tomatoes and cook 4 more minutes. Remove from the heat and stir in the basil and parsley.\n            \n\n              Cook the ravioli: Bring 3 inches of salted water to a boil in a large pot. Add the ravioli in batches and cook until tender, 8 to 10 minutes. Remove with a slotted spoon and transfer to a baking sheet (reserve the cooking water). Cover the ravioli loosely with foil to keep warm.\n            \n\n              Add 1 1/2 cups of the ravioli cooking water to the sauce, bring to a simmer and cook until slightly thickened, 2 to 3 minutes. Swirl in the remaining 2 tablespoons butter and season with salt and pepper. Divide the ravioli among plates; top with the sauce.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "potato flour", "quantity": 4.0}, {"food": "eggs", "quantity": 6.0}, {"food": "", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "bacon", "quantity": 8.0}, {"food": "carrots", "quantity": 4.0}, {"food": "nutmeg", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "parsley", "quantity": 1.75}, {"food": "macaroni cheese", "quantity": 0.3333333333333333}, {"food": "macaroni cheese", "quantity": 3.0}, {"food": "egg substitute", "quantity": 2.0}, {"food": "butter oil", "quantity": 5.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 4.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "grape juice", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 4.0}, {"food": "parsley", "quantity": 2.0}, {"food": "pepper", "quantity": 1}], "title": "\nBacon Ravioli With Mushrooms\n"}, {"directions": "\n\n              Cover the eggs with about 1 inch of water in a small saucepan. Bring to a high simmer, cover and remove from heat. Let stand for 8 minutes. Run under cold water; peel and quarter each.\n            \n\n              Meanwhile, arrange the bacon in a large skillet and cook over medium heat until golden brown and crisp, about 4 minutes per side. Remove the bacon from the skillet and chop into bite-size pieces.\n            \n\n              Whisk together the chicken broth, soy sauce, vinegar, brown sugar, 3/4 teaspoon salt and a few grinds of pepper in a large microwave-safe bowl. Add the rice, broccoli and scallion whites and toss to combine. Cover and microwave on high, stirring occasionally, until the broccoli is crisp-tender and the rice is warmed through, about 6 minutes.\n            \n\n              Divide the rice-broccoli mixture among four bowls. Top each with a quartered egg, bacon, carrot and scallion greens. Drizzle each with sesame oil.\n            \n", "ingredients": [{"food": "eggs", "quantity": 4.0}, {"food": "bacon", "quantity": 4.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "soy sauce", "quantity": 2.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "sugar", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "crisped rice bar", "quantity": 5.0}, {"food": "broccoli raab", "quantity": 4.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "carrot juice", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}], "title": "\nBacon and Broccoli Rice Bowl\n"}, {"directions": "\n\n              Place the rice in a medium saucepan with 2 1/2 cups water. Bring to a boil over medium-high heat, then cover, reduce the heat to medium and simmer until most of the water has been absorbed, about 6 minutes. Reduce the heat to low and cook 12 more minutes. Remove from the heat and let stand, covered, until ready to serve. Meanwhile, cook the bacon in a large nonstick skillet over medium heat until crisp, about 10 minutes. Transfer to a paper towel-lined plate. Pour out all but about 1 tablespoon of the bacon drippings from the pan and increase the heat to medium high. Add the broccoli and cook, stirring occasionally, until charred in spots. Add 3/4 cup water and simmer until the broccoli is crisp-tender and only a few tablespoons of water remain, about 3 minutes. Stir in the soy sauce and 1/2 teaspoon sesame oil. Divide the rice and broccoli among bowls and drizzle with the pan juices. Heat the remaining 1 teaspoon sesame oil in the skillet over medium-high heat. Crack the eggs into the skillet, season with salt and fry as desired. Place an egg in each bowl and top with the bacon, cilantro, scallions and pickled jalapenos.\n            \n\n              Photograph by Andrew Purcell\n            \n", "ingredients": [{"food": "crisped rice bar", "quantity": 2.0}, {"food": "bacon", "quantity": 6.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "soy sauce", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1.5}, {"food": "eggs", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "", "quantity": 2.0}], "title": "\nBacon and Broccoli Rice Bowl\n"}, {"directions": "\n\n              Cook the bacon in a large nonstick skillet over medium-high heat, stirring, until browned and the fat has rendered, about 4 minutes. Add the green beans and 1/4 teaspoon each salt and pepper and cook, stirring, until the beans are just bright green. Add 2 tablespoons water and continue to cook, stirring occasionally, until crisp-tender, about 6 minutes. \n            \n\n              Transfer the beans to a serving dish and toss in the chives. Zest the lemon directly over the beans and season to taste with salt and pepper.\n            \n", "ingredients": [{"food": "bacon", "quantity": 4.0}, {"food": "fava beans", "quantity": 1.5}, {"food": "black bean mango", "quantity": 1}, {"food": "chives", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}], "title": "\nBacon and Chive Green Bean Coins\n"}, {"directions": "\n\n              Make the candied bacon: Cook the bacon in a large nonstick skillet over medium heat, stirring occasionally, until crisp, about 10 minutes; remove with a slotted spoon and drain on paper towels. Pour the drippings into a small bowl and set aside; wipe out the skillet.\n            \n\n              Cook the sugar with 1 teaspoon water in a small saucepan over medium heat, swirling the pan occasionally, until dark amber, about 5 minutes. Stir in the vinegar and star anise; simmer 1 more minute. Stir in the bacon until coated, then spread out in a single layer on a baking sheet to cool; discard the star anise.\n            \n\n              Make the stir-fry: Whisk the eggs with the wine and a pinch each of salt and pepper in a large bowl until frothy. Heat 2 tablespoons of the reserved bacon drippings in the skillet over medium-high heat, swirling to coat. Add the scallions and cook, stirring, until just tender, about 15 seconds.\n            \n\n              Pour the egg mixture into the skillet and tilt to spread evenly. Cook until the edges just start setting, then stir rapidly with a rubber spatula until the eggs are almost set, about 1 more minute. Transfer to a plate and wipe out the skillet.\n            \n\n              Add 1 more tablespoon of the reserved bacon drippings to the skillet, swirling to coat. Add the tomatoes, sprinkle with the sugar and season with salt and pepper. Cook, stirring occasionally, until the tomatoes start breaking down, about 2 minutes. Add the cornstarch and cook, stirring, until the liquid thickens, 1 minute.\n            \n\n              Fold the scrambled eggs into the tomato mixture. Sprinkle with the candied bacon and more scallions; serve over rice.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "bacon", "quantity": 6.5}, {"food": "sugar", "quantity": 2.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "anise seed", "quantity": 1.0}, {"food": "eggs", "quantity": 8.0}, {"food": "barley flour or meal", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "pineapple chunks", "quantity": 3.0}, {"food": "sugar", "quantity": 0.5}, {"food": "cornstarch", "quantity": 1.0}, {"food": "crisped rice bar", "quantity": 1}], "title": "\nBacon and Egg Stir-Fry\n"}, {"directions": "\n\n              1. Toss the cabbage in a colander with 1 tablespoon salt. Set aside in the sink to drain, about 1 hour. Rinse, drain well, and pat dry. \n            \n\n              2. Whisk the mayonnaise, vinegar, mustard, sugar, celery seeds, cayenne and 1 teaspoon salt in a large bowl. Add the drained cabbage, carrots, apples, and scallions to the dressing. Cover and refrigerate 30 minutes. \n            \n\n              3. Meanwhile, cook the bacon in a skillet over medium heat, turning until crisp and golden, 6 to 8 minutes. Transfer to a paper towel-lined plate to cool. Crumble and stir into the coleslaw before serving.\n            \n", "ingredients": [{"food": "swamp cabbage", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "mayonnaise dressing", "quantity": 0.3333333333333333}, {"food": "vinegar", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "celery seed", "quantity": 0.25}, {"food": "pepper", "quantity": 0.125}, {"food": "carrot juice", "quantity": 1.0}, {"food": "apple", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "bacon", "quantity": 4.0}], "title": "\nBacon and Scallion Coleslaw\n"}, {"directions": "\n\n              For the dough: Warm the milk and 1/2 cup water in a medium saucepan over low heat until it is about 100 degrees F (but no more than 110 degrees F). Remove the saucepan from the heat, and sprinkle the yeast over the the liquid. Sprinkle a pinch of the sugar over the top, and set aside without stirring until foamy, about 5 minutes. Then whisk in the butter and egg yolk.\n            \n\n              Whisk together the flour, remaining sugar and salt in a large bowl. Make a well in the center, and stir in the yeast mixture with a wooden spoon until you have a thick and slightly sticky dough. Turn the dough onto a floured work surface, and knead until soft and elastic, about 6 minutes. Shape the dough into a ball.\n            \n\n              Brush the inside of a large bowl with butter. Add the dough ball, turning to coat lightly. Cover the bowl with plastic wrap, trace a circle the size of the dough ball on the plastic and note the time. Let the dough rise in a warm place until doubled in size, about 1 hour 30 minutes.\n            \n\n              Turn the dough out of the bowl, and knead briefly to release excess air; re-form it into a ball, and return it to the bowl. Lightly butter a large piece of plastic wrap, and lay it on the dough. Cover the entire bowl tightly with the rest of the plastic, and refrigerate for 4 hours or overnight to let the dough proof.\n            \n\n              For the filling: Cook the bacon in a large nonstick skillet over medium heat until browned and crisp, about 5 minutes. Transfer the bacon to a small bowl, and remove all but 1 tablespoon of the fat from the skillet. Return the skillet to medium heat. Whisk the flour into the bacon fat, and cook, whisking, until light brown, about 1 minute. Slowly whisk in the milk, and continue whisking until thickened, about 1 minute more. Transfer the mixture to a medium bowl, add the egg yolk, Cheddar, chives, cooked bacon, 1/2 teaspoon salt and a few grinds of pepper and stir to combine. Let cool completely. (The filling will firm up a bit, but if it's too warm, it will be difficult to form the buns.)\n            \n\n              To fill and form the buns: Butter a 9-by-13-inch baking pan with 2 tablespoons softened butter. Turn the dough onto a floured work surface, and press it flat. Roll it into a 10-by-18-inch rectangle, with a long edge facing you. Spread the filling evenly over the dough, leaving a 1-inch border on the side opposite you. Starting from the side facing you, roll the dough up into a tight roll. Lightly brush the 1-inch border with water, and continue rolling to seal the roll. Fold the ends in just a bit, and if any spots look thicker than others, even out the roll with your hands.\n            \n\n              Cut the roll every 1 1/2 inches with a serrated knife, to make 12 buns. Place the buns cut-side down (except for the end pieces) in the prepared pan, spacing them 1 inch apart. Cover the buns loosely with plastic wrap, and set aside in a warm place to rise until the buns double in size, leaving no gaps in between, 1 hour 30 minutes to 2 hours.\n            \n\n              For the topping: Stir the butter, chives and Parmesan in a small bowl; set aside.\n            \n\n              Position an oven rack in the center of the oven, and preheat to 350 degrees F. Bake the buns until they're golden brown and the tops spring back when pressed lightly, 25 to 30 minutes. Spread the topping evenly over the buns, and return them to the oven for 5 minutes more. Let them cool in the pan for 10 minutes before serving.\n            \n", "ingredients": [{"food": "whole milk", "quantity": 0.5}, {"food": "yeast extract spread", "quantity": 2.25}, {"food": "sugar", "quantity": 2.0}, {"food": "healthy request microwavable bowl", "quantity": 4.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "potato flour", "quantity": 2.75}, {"food": "salt", "quantity": 1.0}, {"food": "bacon", "quantity": 5.25}, {"food": "potato flour", "quantity": 2.0}, {"food": "milk", "quantity": 0.75}, {"food": "egg substitute", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "chives", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "butter oil", "quantity": 2.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "chives", "quantity": 2.0}, {"food": "", "quantity": 2.0}], "title": "\nBacon, Cheese and Chive Buns\n"}, {"directions": "\n\n              For the crust: Pulse the flour, shortening, sugar, vinegar and fine salt in a food processor until the mixture looks like a fine meal. Add the butter, and pulse until it is in pea-sized pieces. With the motor running, stream in 1/4 cup ice water, and continue processing until the dough begins to come together, about 15 seconds. If there's still unincorporated flour, add up to 2 more tablespoons ice water 1 tablespoon at a time, running the processor continuously until the dough forms a smooth satiny ball, about 30 seconds more. Remove the dough ball, and place it on a piece of plastic wrap. Use the wrap to mold the dough into a brick shape, approximately 8 by 2 inches by 1 inch thick. Wrap the dough in the plastic, and refrigerate for at least 1 hour or overnight.\n            \n\n              For the filling: Cook the bacon in a large nonstick skillet over medium heat until browned and crisp, about 5 minutes. Transfer the bacon to a medium bowl. Drain off all but 1 tablespoon of the fat from the skillet, and return the skillet to medium heat. Whisk in the flour, and cook, whisking constantly, until light brown, about 1 minute. Slowly whisk in the milk, and cook, whisking constantly, until thickened, about 1 minute more. Transfer the flour-milk mixture to the bowl with the cooked bacon. Add the egg yolk, Cheddar-Jack, Parmesan, 1/2 teaspoon kosher salt and a few grinds of pepper, and stir to combine.\n            \n\n              To assemble: Position 2 oven racks in the top and bottom third of the oven, and preheat to 400 degrees F. Line 2 large baking sheets with parchment paper; set aside.\n            \n\n              Cut the dough crosswise into sixteen 1/2-inch-wide rectangles. Flour a work surface and a rolling pin. Working with one rectangle at a time, roll the dough to about 4 1/2 inches by 2 1/2 inches by 1/8 inch (1 roll lengthwise with the pin and 1 roll crosswise ought to do it, then use hands to shape the dough into a rectangle).\n            \n\n              Divide the 16 dough rectangles between the 2 prepared baking sheets. Place about 2 teaspoons of filling at the center of each of 8 rectangles, and spread with an offset spatula, leaving a 1/2-inch border. Top with the remaining 8 rectangles. Crimp the edges together with a fork to seal. Brush the top of each tart with the beaten egg, prick with the fork 8 times and sprinkle with a pinch of flaky sea salt.\n            \n\n              Bake the tarts until the dough is golden brown, 22 to 24 minutes, reversing the baking sheets top to bottom halfway through. Let the tarts cool on the baking sheets until cool enough to touch, about 5 minutes, then transfer to a wire rack. Serve warm or at room temperature.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.5}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "sugar", "quantity": 2.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "butter oil", "quantity": 8.0}, {"food": "ice cream swich", "quantity": 0.25}, {"food": "bacon", "quantity": 4.25}, {"food": "potato flour", "quantity": 2.0}, {"food": "milk", "quantity": 0.75}, {"food": "egg substitute", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 0.75}, {"food": "", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nBacon, Egg and Cheese \"Toaster Tarts\"\n"}, {"directions": "\n\n              Position an oven rack in the center of the oven and preheat to 375 degrees F.\n            \n\n              Remove 1/4 inch of the crust from the ends of the loaf, then cut the loaf crosswise into 4 even pieces. Use a fork to score one cut end and gently dig a square hole into each piece of bread to make a box, leaving a 1/2-inch layer of bread around the walls and bottom (see Cook's Note). Save the removed crumbs for another use. \n            \n\n              Microwave the butter and a large pinch of salt in a small microwave-safe bowl until melted, about 1 minute. Brush the bread boxes inside and out with the melted butter. Put 1 slice of cheese at the bottom of each bread box. Put the boxes open-side up on a baking sheet and bake until the cheese melts and the inside of the bread is lightly browned and crispy in parts, about 10 minutes.\n            \n\n              Meanwhile, heat a large non-stick skillet over medium heat and add the bacon. Cook, stirring occasionally, until the bacon is crispy, 12 to 15 minutes. Use a slotted spoon to transfer the bacon onto a paper-towel lined plate. Reserve the bacon fat in the skillet and adjust the heat to low. Whisk the milk and eggs with a large pinch of salt and pepper and add to the skillet. Continue stirring the eggs, scraping the sides of the skillet as needed, until small curds form and the eggs are just set, 6 to 8 minutes.  \n            \n\n              Divide the hot eggs between the 4 boxes and top with the remaining cheese. Return to the oven and bake until the cheese is melts, about 5 minutes. Top with the crispy bacon and serve hot with hot sauce and additional salt and pepper.\n            \n", "ingredients": [{"food": "barbecue loaf", "quantity": 1.0}, {"food": "butter oil", "quantity": 6.0}, {"food": "black bean mango", "quantity": 1}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 8.5}, {"food": "whole milk", "quantity": 0.3333333333333333}, {"food": "eggs", "quantity": 12.0}, {"food": "Worcestershire sauce", "quantity": 1}], "title": "\nBacon, Egg and Cheese Bread Boxes\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Position a rack in the center of the oven and preheat to 375 degrees F.\n            \n\n              Roll each piece of bread to thinly flatten. \n            \n\n              Microwave the butter with a large pinch of salt in a small microwave-safe bowl until melted, about 1 minute. Brush both sides of each slice of bread with the butter. \n            \n\n              Make the toast bowls: Gently press a slice of bread inside a cup of a 12-cup muffin tin. The bottom and sides of the bread should be flush against the cup; pleat the sides of the bread as needed to fit. Repeat with the remaining bread, filling every other muffin cup so that the bread bowls do not touch. Bake, rotating about halfway through, until lightly browned and crispy in spots, 12 to 15 minutes.\n            \n\n              Meanwhile, whisk together the milk, eggs, a large pinch of salt and a few grinds of pepper in a large bowl.\n            \n\n              Put the bacon in a medium nonstick skillet over medium heat. Cook, stirring occasionally, until the bacon is crispy, 12 to 15 minutes. Use a slotted spoon to transfer to a paper-towel-lined plate. Keep the bacon drippings in the skillet and adjust the heat to low. \n            \n\n              Pour the egg mixture into the skillet. Cook the eggs, stirring and scraping the sides of the skillet as needed, until small curds form and the eggs are just set, 8 to 10 minutes. Remove from the heat and fold in the cheese until almost completely melted.\n            \n\n              Divide the hot eggs among the toast bowls and top with the crispy bacon. Serve with hot sauce.\n            \n", "ingredients": [{"food": "garlic bread", "quantity": 6.0}, {"food": "butter oil", "quantity": 6.0}, {"food": "black bean mango", "quantity": 1}, {"food": "whole milk", "quantity": 3.0}, {"food": "eggs", "quantity": 10.0}, {"food": "bacon", "quantity": 4.5}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "Worcestershire sauce", "quantity": 1}], "title": "\nBacon, Egg and Cheese Toast Bowls\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 375 degrees F. Lay the bacon slices on a rack set over a baking sheet. Bake until the fat starts to render, about 10 minutes.\n            \n\n              Baste the bacon on both sides with the maple syrup and continue to bake until caramelized and the edges just start to brown, 10 to 15 minutes more. Let cool on the rack, about 5 minutes. When cool, cut them in half.\n            \n\n              Melt 1 tablespoon of the butter in a large nonstick skillet over medium heat. Crack the eggs into the skillet and fry until thoroughly set, 3 to 4 minutes. Transfer to a plate.\n            \n\n              Put 4 slices of the bread on a work surface. Layer each with 1 whole slice of the cheese, 3 pieces of the bacon, 1/4 slice of the cheese and 1 egg and another whole slice of cheese. Close the sandwiches with the remaining bread. Thinly and evenly spread the remaining butter on both sides of the bread using about 1 1/2 tablespoons for each sandwich.\n            \n\n              Place 2 sandwiches into the same skillet over medium heat. Cover the skillet with a lid and cook until the bread is evenly golden brown, about 2 minutes. Flip and cook, uncovered, until the bread is golden brown and cheese is visibly melted, about 2 minutes more. Repeat with the remaining sandwiches.\n            \n", "ingredients": [{"food": "bacon", "quantity": 6.0}, {"food": "syrup", "quantity": 2.0}, {"food": "butter oil", "quantity": 7.0}, {"food": "eggs", "quantity": 4.0}, {"food": "hearts of palm", "quantity": 9.0}, {"food": "garlic bread", "quantity": 0.8333333333333333}], "title": "\nBacon, Egg and Maple Grilled Cheese\n"}, {"directions": "\n\n              Cook the bacon in a large skillet over medium heat, turning a few times until crisp, about 8 minutes. Transfer to a paper towel-lined plate to drain, then cut each slice in half. While the bacon is cooking, pulse the basil, olive oil, lemon juice, 1 tablespoon water, 1/4 teaspoon salt, and pepper to taste in a mini food processor (or finely chop the basil and whisk with the other ingredients) until smooth. Add the mayonnaise and pulse until just combined. Toast the bread and spread evenly with the basil mayonnaise. Divide the peaches, bacon and arugula among half of the bread slices; top with the remaining bread slices. Serve with cornichons.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "bacon", "quantity": 8.0}, {"food": "basil", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "mayonnaise dressing", "quantity": 3.0}, {"food": "garlic bread", "quantity": 8.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "arugula", "quantity": 1}, {"food": "barley flour or meal", "quantity": 1}], "title": "\nBacon, Peach and Arugula Sandwiches\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Melt 4 tablespoons butter in a large deep skillet over medium heat. Add the bacon and cook, stirring, until browned, 10 to 12 minutes. Add the celery, onions, prunes, chestnuts, rosemary, 1 tablespoon salt and a few grinds of pepper. Cook, stirring occasionally, until the mixture softens and starts browning, 6 to 8 minutes. Stir in the chicken broth and bring to a simmer.\n            \n\n              Combine the bread and broth mixture in a large bowl and gently mix until all the bread is moistened. Stir in the beaten eggs.\n            \n\n              Butter a 3-quart baking dish. Add the stuffing and dot with the remaining 4 tablespoons butter. Cover with foil and bake 30 minutes. Uncover and continue to bake until golden brown, about 20 more minutes.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.0}, {"food": "bacon", "quantity": 6.0}, {"food": "celery seed", "quantity": 5.0}, {"food": "onions", "quantity": 2.0}, {"food": "prunes", "quantity": 2.0}, {"food": "chestnuts", "quantity": 1.0}, {"food": "rosemary", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 4.0}, {"food": "garlic bread", "quantity": 16.0}, {"food": "eggs", "quantity": 3.0}], "title": "\nBacon, Prune and Chestnut Stuffing\n"}, {"directions": "\n\n              1. Preheat the oven to 425 degrees F. Remove the stems from the mushrooms and set aside. Place the caps, stem-side down on a baking sheet and brush the outsides with the oil. Bake until soft, but still holding their shape, 15 minutes.\n            \n\n              2. Meanwhile, crisp the bacon in a medium skillet over medium heat. Transfer bacon to a paper towel-lined plate and reserve the skillet and drippings. Finely chop reserved mushroom stems and add to the bacon drippings along with the shallot and thyme. Season with salt and pepper and cook, stirring, until mushrooms are dry, about 5 minutes. Add spinach and continue to cook until the spinach wilts,1 minute.\n            \n\n              3. Transfer mixture to a bowl and add the bread cubes and lemon zest. Chop the cooked bacon, and combine with the mushroom mixture. Place the caps stem side-up on a separate baking sheet and evenly fill each cap with the stuffing. Bake until the mushrooms are hot and lightly browned, about 5 minutes. Place a piece of blue cheese on each mushroom and continue to bake until the cheese just begins to melt, about 3 minutes. Serve.\n            \n", "ingredients": [{"food": "pasta with sliced franks in tomato sauce", "quantity": 12.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "luncheon slices", "quantity": 4.0}, {"food": "", "quantity": 1.5}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "garlic bread", "quantity": 2.0}, {"food": "lemon juice", "quantity": 0.25}, {"food": "macaroni cheese", "quantity": 2.0}], "title": "\nBacon-Blue Cheese Stuffed Mushrooms\n"}, {"directions": "\n\n              Simmer 2 pounds small potatoes in salted water until tender, about 20 minutes; drain. Cool slightly, then peel. Heat 1 cup milk with 1/2 stick butter. Mash the potatoes with the hot milk and stir in 1 cup shredded cheddar. Top with crumbled cooked bacon and sliced scallions.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nBacon-Cheddar Mashed Potatoes\n"}, {"directions": "\n\n              Cook 1/2 pound chopped bacon until crisp. Make Classic Mash; replace half of the butter with 2 to 4 tablespoons bacon drippings. Fold in some bacon; sprinkle the rest on top.\n            \n\n              Add 1/2 pound grated sharp cheddar and 1/4 cup each minced parsley and scallions.\n            \n\n              Classic Mash: Cover 2 pounds whole russet or Yukon gold potatoes with cold salted water; simmer 45 minutes. Drain, peel and mash with 1/2 to 1 stick butter. Add 1 cup hot milk, and salt and pepper; mash until smooth and fluffy.\n            \n\n              Photograph by Kana Okada\n            \n", "ingredients": [], "title": "\nBacon-Cheddar Mashed Potatoes\n"}, {"directions": "\n\n              Preheat oven to 400 degrees F.\n            \n\n              Cook bacon in a medium nonstick skillet over medium-low heat, until crispy and fat renders, about 10 minutes. Remove bacon with a slotted spoon to a paper towel-lined plate, reserving renderings in the skillet. Cook the onions and garlic in the pan drippings until brown, about 15 minutes. Let cool.\n            \n\n              Meanwhile, in a large bowl whisk the eggs, mustard, hot sauce, Worcestershire, cream, salt, and pepper. Add the meat, cheese, parsley, and cooked onion. Chop and add the bacon. Mix with a fork until evenly blended. Whisk the glaze ingredients together in a bowl.\n            \n\n              Dampen hands with water and on a foil-lined cookie sheet, pat mixture into a loaf shape. Bake until an instant-read thermometer inserted into the center of the loaf registers 155 degrees F, about 1 hour. Spread the glaze onto the meatloaf after about 50 minutes. Let loaf rest for at least 10 minutes before serving.\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "egg substitute", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 0.5}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "salt", "quantity": 1.0}, {"food": "black bean mango", "quantity": 0.5}, {"food": "frankfurter beef", "quantity": 1.0}, {"food": "pork skins", "quantity": 8.0}, {"food": "veal", "quantity": 8.0}, {"food": "cheddar cheese", "quantity": 8.0}, {"food": "parsley", "quantity": 0.3333333333333333}, {"food": "pasta with tomato sauce", "quantity": 2.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "coconut water", "quantity": 2.0}], "title": "\nBacon-Cheddar Meatloaf\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Cook the bacon in a skillet over medium heat until crisp. Drain on paper towels and reserve 2 tablespoons drippings. Finely chop the bacon.\n            \n\n              Whisk the flour, baking powder, baking soda, salt, chopped bacon and chives in a medium bowl. Using a pastry blender or your fingers, work the butter into the flour mixture until it is in pea-size pieces. Stir in the cheese with a wooden spoon. Add the buttermilk and reserved bacon drippings and gently mix until just moistened. The dough will be loose.\n            \n\n              Turn the dough out onto a lightly floured surface and knead 3 to 5 times, just until it comes together. (Don't overknead or the biscuits will be tough.) Roll out to 1/2 inch thick, then cut out biscuits using a floured 2-inch-round cutter. Arrange on an ungreased baking sheet. Reroll the scraps and cut out more biscuits. Brush the tops with melted butter.\n            \n\n              Bake the biscuits until golden brown, 12 to 15 minutes. Serve warm.\n            \n\n              Photograph by Yunhee Kim\n            \n", "ingredients": [{"food": "bacon", "quantity": 4.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 1.0}, {"food": "chives", "quantity": 1.0}, {"food": "butter oil", "quantity": 6.0}, {"food": "cheddar cheese", "quantity": 1.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 1.0}], "title": "\nBacon-Cheese Biscuits\n"}, {"directions": "\n\n              Finely grind 1/4 cup dried porcini mushrooms in a spice grinder. Cook 8 slices chopped bacon in a large skillet over medium heat, stirring, until almost crisp, about 10 minutes. Pour off most of the drippings; add 1/2 finely chopped red onion, the ground mushrooms and the kernels from 2 ears of corn to the skillet. Cook, stirring, until the corn is tender, about 3 minutes; stir in some chopped parsley.\n            \n\n              Photograph by David Malosh\n            \n", "ingredients": [], "title": "\nBacon-Corn Relish\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Combine the sausage and bacon in a large nonstick skillet over medium-high heat and cook until the bacon is crisp and the sausage is browned and cooked through, about 8 minutes. Using a slotted spoon, transfer the sausage and bacon to paper towels to drain and cool.\n            \n\n              Whisk the flour, cornstarch, confectioners' sugar, baking powder, baking soda and 1/4 teaspoon salt together in a large bowl. Whisk the milk, butter and 2 of the eggs together in a medium bowl. Add the milk mixture to the flour mixture and stir until ingredients are just incorporated and batter is thick (it¿s okay if there are some lumps). Stir in the cheese and let the batter rest for 5 minutes. \n            \n\n              Wipe out the skillet and heat over medium-low. Crack 2 eggs in the skillet, sprinkle with salt and pepper, and cook until the whites are almost set, about 3 minutes. Taking care not to burst the yolks, ladle 1/4 cup of the pancake batter over each egg to cover it completely; sprinkle each pancake with 2 heaping tablespoons of the bacon-sausage mixture and cook until bubbles break at the edges, 1 minute and 30 seconds. \n            \n\n              Gently flip each batter-covered egg and cook until the underside of the pancake is golden brown, the egg whites are fully cooked and the yolks are still runny, about 1 minute and 30 seconds more. \n            \n\n              Serve the finished pancakes immediately as they are ready with maple syrup, ketchup and hot sauce on the side. Repeat with the remaining eggs, batter and sausage mixture to make more pancakes. Reduce heat if pancakes are browning too quickly.\n            \n", "ingredients": [{"food": "pork sausage links", "quantity": 12.0}, {"food": "bacon", "quantity": 8.5}, {"food": "potato flour", "quantity": 1.6666666666666665}, {"food": "cornstarch", "quantity": 0.25}, {"food": "sugar", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "black bean mango", "quantity": 1}, {"food": "milk", "quantity": 1.25}, {"food": "butter oil", "quantity": 3.0}, {"food": "eggs", "quantity": 14.0}, {"food": "", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1}], "title": "\nBacon-Egg-And-Cheese-Stuffed Pancakes\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F.\n            \n\n              Cook the bacon in a nonstick skillet over medium heat, stirring occasionally, until crisp, about 8 minutes. Transfer to a paper towel-lined plate with a slotted spoon. Reserve 1 tablespoon of the drippings.\n            \n\n              Mix together the cream cheese, Cheddar, sour cream, milk, vinegar, jalapenos, bacon and reserved drippings in a medium bowl. Spread the mixture in a baking dish and bake until golden and bubbly, about 30 minutes. Sprinkle with the scallions before serving. \n            \n", "ingredients": [{"food": "bacon", "quantity": 4.0}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "", "quantity": 2.0}, {"food": "sour cream", "quantity": 0.5}, {"food": "milk", "quantity": 0.25}, {"food": "vinegar", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}], "title": "\nBacon-Jalapeno Dip\n"}, {"directions": "\n\n              In a large deep skillet, saute 1/4 pound diced bacon in 2 tablespoons butter for 5 minutes; transfer to paper towels.\n            \n\n              Season with salt and pepper and add 1 chopped onion, 3 chopped celery stalks, 1 diced jalapeno, 1 tablespoon thyme and 3/4 teaspoon chili powder; cook 5 minutes.\n            \n\n              Pour in 3 cups chicken broth. Simmer until step 5.\n            \n\n              In a large bowl, mix 2 eggs, 1 cup diced pepper jack cheese and the bacon.\n            \n\n              Add to the bowl 8 cups toasted white bread cubes, 6 cups crumbled cornbread and the hot broth mixture.\n            \n\n              Gently toss the stuffing, then spread in a buttered 9-by-13-inch baking dish. Dot the top with butter or turkey pan drippings, cover and bake 30 minutes at 350. Uncover and bake until golden, 20 more minutes.\n            \n\n              Photograph by Karl Juengel/Studio D\n            \n", "ingredients": [], "title": "\nBacon-Jalapeno Stuffing\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Coat a 9-inch-square baking dish or a 9-inch cast-iron skillet with cooking spray. Whisk the cornmeal, flour, sugar, baking powder, baking soda and 1/4 teaspoon salt in a large bowl. In a separate bowl, whisk the egg, milk, sour cream and melted butter; whisk into the dry ingredients until combined. Fold in the onion, kale and bacon.\n            \n\n              Pour the batter into the prepared dish or skillet. Bake until the cornbread springs back when pressed in the center, 25 to 35 minutes. Let cool 15 minutes in the dish, then loosen the edges and slice.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "yellow rice", "quantity": 1.5}, {"food": "potato flour", "quantity": 0.25}, {"food": "sugar", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "egg substitute", "quantity": 1.0}, {"food": "milk", "quantity": 1.0}, {"food": "silk plain soy yogurt", "quantity": 1.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "kale", "quantity": 0.5}, {"food": "bacon", "quantity": 0.5}], "title": "\nBacon-Kale Cornbread\n"}, {"directions": "\n\n              Cook 3 slices diced bacon until crisp; remove and reserve. Add 2 sliced onions to the pan. Season with salt and pepper and cook over low heat, covered, 10 minutes. Uncover and cook until golden, 30 more minutes. Stir in 2 tablespoons chopped parsley and the bacon.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [], "title": "\nBacon-Onion Relish\n"}, {"directions": "\n\n              Cook 4 slices bacon in a skillet over medium heat, turning, until crisp, about 7 minutes. Drain on paper towels, then crumble. Combine 1 cup ketchup, 1/2 finely chopped onion, 1/2 cup relish and 1/4 cup finely chopped pickled jalapenos (drained) in a bowl. Stir in the bacon.\n            \n\n              Photograph by David Malosh\n            \n", "ingredients": [], "title": "\nBacon-Pickle Ketchup\n"}, {"directions": "\n\n              Mix 2/3 cup mayonnaise, 1/4 cup buttermilk, 2 tablespoons cider vinegar, 1 minced garlic clove, 1/2 cup chopped celery, 2 chopped scallions, 1 teaspoon sugar, and salt and pepper. Toss with 2 pounds boiled cubed red potatoes. Top with 6 slices cooked bacon, crumbled.\n            \n\n              Photograph by Kana Okada\n            \n", "ingredients": [], "title": "\nBacon-Ranch Potato Salad\n"}, {"directions": "\n\n              Combine 8 cups cooked brown rice, 1 pound chopped cooked bacon, 1 1/2 pounds chopped roasted parsnips, 1 cup chopped chestnuts and 1/2 cup chopped parsley. Bake as directed for Herbed Rice Stuffing.\n            \n\n              Herbed Rice Stuffing: Brown 2 cups each chopped onions and celery in 6 tablespoons butter. Toss with 8 cups al dente cooked white rice, 1/4 cup each chopped parsley and chives, and\n            \n\n              1 tablespoon chopped thyme; add salt and pepper. Transfer to a buttered baking dish, drizzle with 1/4 cup chicken or turkey broth and dot with butter. Cover and bake at 375 degrees F, 50 minutes.\n            \n\n              Photographs by Charles Masters\n            \n", "ingredients": [], "title": "\nBacon-Rice Stuffing\n"}, {"directions": "\n\n              Cook 3 slices diced bacon until crisp; remove and reserve. Add 2 sliced onions to the pan. Season with salt and pepper and cook over low heat, covered, 10 minutes. Uncover and cook until golden, 30 more minutes. Stir in 1/4 cup each mayonnaise and grated Swiss cheese, 2 tablespoons chopped parsley and the bacon.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [], "title": "\nBacon-Swiss Relish\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees. Core the tomatoes and thinly slice. Place in a colander in the sink and sprinkle with 1/2 teaspoon salt; let drain for at least 15 minutes.\n            \n\n              Meanwhile, cook the bacon in a large skillet over medium heat until crisp, about 10 minutes; transfer to a paper-towel-lined plate. Pour off and reserve the drippings, leaving 1 tablespoon in the skillet; toast the bread on one side in the drippings until golden (do this in batches, adding more drippings as needed). Place the bread, toasted-side down, on a baking sheet.\n            \n\n              Combine the cheeses with the mayonnaise, scallions and parsley in a bowl. Spread the cheese mixture on the toasts, reserving about 1/3 cup. Crumble the bacon on top. Shake any excess liquid from the tomatoes; distribute the zucchini and tomatoes among the toasts. Dot with the reserved cheese mixture and season with pepper. Bake until golden brown, 15 to 20 minutes. Serve warm.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "tomatoes", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "bacon", "quantity": 8.0}, {"food": "garlic bread", "quantity": 4.0}, {"food": "cheddar cheese", "quantity": 0.75}, {"food": "macaroni cheese", "quantity": 0.75}, {"food": "mayonnaise dressing", "quantity": 0.75}, {"food": "", "quantity": 5.0}, {"food": "parsley", "quantity": 0.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}, {"food": "pepper", "quantity": 1}], "title": "\nBacon-Tomato Cheese Toasts\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Bring a large pot of salted water to a boil. Add the pasta and cook as the label directs. Reserve 1 1/4 cups cooking water, then drain the pasta; set aside.\n            \n\n              Meanwhile, cook the bacon in a large nonstick skillet over medium-high heat until crisp, about 5 minutes. Add the tomatoes and shallot and cook until the tomatoes are starting to burst, about 5 minutes. Pour off all but 2 tablespoons of the drippings from the skillet.\n            \n\n              Whisk the eggs, cheese, lemon zest and 1 teaspoon pepper in a medium bowl. Slowly whisk in 1 cup of the reserved cooking water; set aside.\n            \n\n              Reduce the heat under the skillet to medium low. Add the pasta and toss well. Slowly pour in the egg mixture, tossing, to make a creamy sauce, about 1 minute. Season with salt and add the remaining 1/4 cup cooking water as needed to loosen. Stir in the basil. Top each serving with more cheese and season with pepper.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "", "quantity": 12.0}, {"food": "bacon", "quantity": 6.5}, {"food": "grape juice", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "parmesan cheese", "quantity": 0.3333333333333333}, {"food": "lemon juice", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "basil", "quantity": 1.0}], "title": "\nBacon-Tomato Linguine\n"}, {"directions": "\n\n              Cook the bacon in a large skillet over medium-high heat until crisp, 8 to 10 minutes. Transfer to a paper towel-lined plate to drain.\n            \n\n              Meanwhile, segment the oranges: Cut the ends off, then cut away the peel and white pith. Working over a bowl, cut along both sides of each membrane with a paring knife to remove the segments, allowing them to drop into the bowl. Discard any seeds.\n            \n\n              Put the garlic on a cutting board and sprinkle with 1/4 teaspoon salt, then mash into a paste with the flat side of a large knife. Whisk the vinegar and garlic paste in a large bowl and season with salt and pepper, then whisk in the olive oil. Add the watercress, parsley and escarole and toss to coat. Divide the salad among plates and crumble the bacon on top. Sprinkle with the oranges, hazelnuts, dates and blue cheese. Serve with cornbread, if desired.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "bacon", "quantity": 6.0}, {"food": "oranges", "quantity": 3.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "vinegar", "quantity": 2.0}, {"food": "pepper", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "watercress", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "hazelnuts or filberts", "quantity": 0.3333333333333333}, {"food": "dates", "quantity": 0.3333333333333333}, {"food": "macaroni cheese", "quantity": 0.3333333333333333}, {"food": "", "quantity": 1}], "title": "\nBacon-Watercress Salad\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Combine the preserves, 1 tablespoon vinegar, the mustard, thyme and 1/2 teaspoon each salt and pepper in a small bowl. Poke the pork in a few spots with a paring knife, then rub with the garlic; season with salt and pepper. Rub the pork all over with the preserves mixture, then transfer to a large resealable bag and refrigerate at least 2 hours or overnight.\n            \n\n              About 20 minutes before roasting, remove the pork from the refrigerator and preheat the oven to 325 degrees F. Put the red onions in a metal roasting pan and set a rack on top. Wrap the pork with the bacon (see below), then set on the rack. Roast until the bacon is crisp and a thermometer inserted into the center of the pork registers 145 degrees F, about 1 1/2 hours. Transfer the pork to a cutting board; let rest 10 minutes.\n            \n\n              Meanwhile, make the gravy: Discard all but 2 tablespoons of the drippings from the pan. Place the roasting pan over 2 burners over medium-low heat and whisk in the flour until incorporated. Add the chicken broth and whisk until thickened, about 5 minutes. Add the remaining 2 tablespoons vinegar and season with salt and pepper.\n            \n\n              Remove the twine and slice the pork. Serve with the onions and gravy.\n            \n\n              How to wrap pork:\n            \n\n              Lay the bacon slices over the pork, overlapping them slightly and tucking them under.\n            \n\n              Tie a piece of kitchen twine around each slice to secure it.\n            \n\n              Photo by Con Poulos\n            \n", "ingredients": [{"food": "blackberry juice", "quantity": 0.25}, {"food": "vinegar", "quantity": 3.0}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "thyme", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "pork loin", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "onions", "quantity": 2.0}, {"food": "bacon", "quantity": 8.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "diced chicken", "quantity": 3.0}], "title": "\nBacon-Wrapped Blackberry Pork Roast\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 400 degrees F. Trim the stem ends from the Brussels sprouts, and halve lengthwise. Put them in a medium bowl, and toss with 1 teaspoon salt.\n            \n\n              Lay the bacon strips next to each other on a work surface. Brush liberally with about 1/2 the maple syrup, then halve crosswise. Wrap each Brussels sprout half with 1 strip of bacon, syrup-side out, so the seam is on the flat side. Place the sprouts seam-side down on a rimmed baking sheet, leaving a bit of space between them. Brush them with a bit more syrup, and grind a little black pepper on top. Roast, rotating the baking sheet halfway through, until the bacon is crisp and the sprouts are tender when pierced with the tip of a knife, about 30 minutes.\n            \n\n              Meanwhile, mix the mayonnaise, most of the lemon zest and all the lemon juice in a small serving dish. Sprinkle the remaining lemon zest on top. Put about 1/2 cup maple syrup in a second small serving dish, and stir in as much black pepper and crushed red pepper flakes as you like.\n            \n\n              Transfer the sprouts to a platter, and serve with the lemon mayonnaise and peppered maple syrup, for dipping.\n            \n", "ingredients": [{"food": "brussels sprouts", "quantity": 18.0}, {"food": "black bean mango", "quantity": 1}, {"food": "bacon", "quantity": 12.0}, {"food": "syrup", "quantity": 0.75}, {"food": "mayonnaise dressing", "quantity": 0.5}, {"food": "grape juice", "quantity": 0.5}, {"food": "ruby red grapefruit juice blend", "quantity": 1}], "title": "\nBacon-Wrapped Brussels Sprouts with Creamy Lemon Dip\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 375 degrees F. Heat the olive oil in a medium skillet over medium heat. Add the onion and cook, stirring, until golden brown, about 6 minutes. Stir in the garlic and cook 30 seconds more. Remove the pan from the heat and add the cream cheese, chives and Worcestershire sauce and stir until evenly combined. Season the filling with salt and pepper.\n            \n\n              Halve each chicken breast horizontally, leaving it attached at one side so it opens like a book. Sprinkle the chicken with salt and pepper, then divide the filling among the breasts, spreading it evenly on the inside of each. Close the chicken breasts and sprinkle the outsides lightly with salt and pepper.\n            \n\n              Lay 3 strips of bacon side-by-side on a cutting board and position a chicken breast right-side-up at the end of the strips. Tuck the thinner \"tail\" of the chicken breast underneath for even cooking, then roll the breast up in the bacon. Repeat with the remaining bacon strips and chicken breasts. \n            \n\n              Set a cooling rack in a rimmed baking sheet and transfer the chicken breasts with the bacon seam-side down to the rack. Bake until the chicken is almost cooked through and an instant-read thermometer inserted in the middle of each breast reads 155 degrees F, about 35 minutes. Heat the broiler and broil the breasts until the bacon turns golden brown and crisp, about 5 minutes. Serve hot.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "garlic powder", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 6.0}, {"food": "chives", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 1.5}, {"food": "black bean mango", "quantity": 1}, {"food": "diced chicken", "quantity": 6.0}, {"food": "bacon", "quantity": 12.0}], "title": "\nBacon-Wrapped Chicken Breasts\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 400 degrees F and set a wire rack on a rimmed baking sheet. Cut the cheddar into 24 small sticks that will fit inside the jalapenos. Stuff 1 cheese stick into each jalapeno half.\n            \n\n              Wrap the bacon tightly around the jalapenos, slightly overlapping. Arrange 1 inch apart on the rack, cheese-side up. Bake until the bacon is crisp, about 25 minutes.\n            \n\n              You can make these poppers up to 2 hours ahead and keep at room temperature. Reheat at 350 degrees F until hot, about 20 minutes.\n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [{"food": "cheddar cheese", "quantity": 5.0}, {"food": "peppers", "quantity": 12.0}, {"food": "bacon", "quantity": 12.0}], "title": "\nBacon-Wrapped Jalapeno Poppers\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Pat dry the pork tenderloin and sprinkle with 1/2 teaspoon salt and 1/2 teaspoon pepper, then wrap with the bacon, overlapping the slices. \n            \n\n              Heat the oil in a large nonstick skillet over medium-high heat until hot, then brown the pork and shallots, 6 to 8 minutes. Flip the pork tenderloin browned-side up and transfer the skillet to the oven. Roast until the pork reaches 145 degrees F in the center, 15 to 18 minutes.\n            \n\n              When the pork is done, transfer to a cutting board, leaving the shallots in the skillet. Add the cherries and stock to the skillet and bring to a simmer. Stir together the cornstarch and 1 tablespoon water, then add to the skillet, bring to a boil, whisking until sauce is thickened, about 2 minutes. Season the sauce with salt and pepper. Slice the pork into 8 pieces, divide among 4 plates with the sauce, and sprinkle with dill, if desired.\n            \n", "ingredients": [{"food": "pork skins", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "bacon", "quantity": 8.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "shallots", "quantity": 8.0}, {"food": "whiskey sour mix", "quantity": 0.5}, {"food": "diced chicken", "quantity": 0.75}, {"food": "cornstarch", "quantity": 1.0}, {"food": "dill seed", "quantity": 1}], "title": "\nBacon-Wrapped Pork Tenderloin with Sour Cherry Sauce\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Position a rack 3 to 4 inches from the heat source and preheat the broiler. Whisk the lemon juice, garlic, paprika, thyme, olive oil and 1/2 teaspoon salt in a shallow baking dish. Add the shrimp and toss to coat; marinate in the refrigerator, 20 minutes.\n            \n\n              Turn the shrimp in the marinade to coat well. One at a time, remove each shrimp and wrap with a piece of bacon; secure with a toothpick if desired. Place seam-side down on a baking sheet. Spoon any remaining marinade over the shrimp. Broil, turning the shrimp once, until the bacon is slightly crisp and the shrimp are cooked through, about 5 minutes.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "paprika", "quantity": 1.0}, {"food": "thyme", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "shrimp", "quantity": 1.0}, {"food": "bacon", "quantity": 12.0}], "title": "\nBacon-Wrapped Shrimp\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 425 degrees F. Toss the bacon with the brown sugar in a medium bowl until evenly coated. Arrange the bacon on a baking sheet and bake until light golden around the edges but still very soft, about 7 minutes. Transfer to a plate. Wipe the baking sheet clean, then spray with cooking spray.\n            \n\n              Stir together the spinach, cream cheese, Parmesan, mayonnaise, garlic and 1/4 teaspoon pepper in a medium bowl.\n            \n\n              Spoon 1 tablespoon of the spinach mixture onto each slice of bread and wrap it with a piece of bacon so that the ends are tucked under the bread (it should look a bit like a belt). Arrange the crostini on the prepared baking sheet and bake until the bacon is dark golden, about 15 minutes. These are best served warm.\n            \n", "ingredients": [{"food": "bacon", "quantity": 12.0}, {"food": "sugar", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1}, {"food": "mustard spinach", "quantity": 9.0}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "meat drippings ", "quantity": 1.0}, {"food": "mayonnaise dressing", "quantity": 0.25}, {"food": "garlic powder", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "luncheon slices", "quantity": 24.25}], "title": "\nBacon-Wrapped Spinach Dip Crostini\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Position an oven rack in the center of the oven, and preheat the broiler. Slice the figs about 3/4 of the way down the center lengthwise, and open each like a book; set aside.\n            \n\n              Combine the goat cheese, pesto, lemon juice and zest and 1/4 teaspoon each salt and pepper in a small bowl with a rubber spatula. Fill each fig with about 1 teaspoon of the cheese-pesto mixture.\n            \n\n              Wrap each stuffed fig with a slice of bacon, and secure with a toothpick. Put the figs, seam-side down, on a rimmed baking sheet.\n            \n\n              Broil, turning once, until the bacon is cooked through and crispy, about 4 to 5 minutes per side.\n            \n", "ingredients": [{"food": "figs", "quantity": 24.0}, {"food": "macaroni cheese", "quantity": 3.0}, {"food": "pesto pasta primavera", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "bacon", "quantity": 12.0}], "title": "\nBacon-Wrapped Stuffed Figs\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: kitchen twine and an instant-read thermometer\n\n              Preheat the oven to 400 degrees F. Set a wire rack on a baking sheet.\n            \n\n              Lay 1 turkey breast smooth-side down on a cutting board. There will be a thin side and a thick side. At about the midway point between them, slice horizontally into the thick side to within 2 inches of the outer edge so that you can open that side like a book and have 1 long piece. Pound the turkey with a mallet to an even thickness of about 1 inch. Repeat with the remaining breast.\n            \n\n              Place a large piece of parchment on a work surface. Arrange 12 slices of bacon horizontally on the parchment in 6 lines, with 2 slices of bacon slightly overlapping per line. Arrange the 6 lines so they are touching but not overlapping, with the ends lining up to form a rectangle. Working with the remaining 9 slices, weave the bacon in an over-under pattern by lifting alternating slices of the horizontal bacon lines and vertically placing a slice of bacon over or under as needed to create a woven lattice design. \n            \n\n              Place the turkey breasts horizontally on the bacon, overlapping slightly. Scoop the stuffing into the center of the turkey. Holding the bacon and turkey, roll them up away from you, making sure the roll ends up seam-side down. (Use the parchment to help you keep the bacon and turkey together as you roll.) Tie with twine in 3 spots across the roll and once lengthwise. Transfer to the prepared baking sheet. \n            \n\n              Bake until the internal temperature registers 155 degrees F on an instant-read thermometer, 1 hour 40 minutes to 1 hour 45 minutes. Let rest for 10 to 15 minutes. \n            \n\n              Slice and serve with the gravy and cranberry sauce. \n            \n", "ingredients": [{"food": "smoked turkey roll", "quantity": 2.0}, {"food": "bacon", "quantity": 21.0}, {"food": "bread stuffing", "quantity": 3.0}, {"food": "gravy", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 0.5}], "title": "\nBacon-Wrapped Turkey Roll\n"}, {"directions": "\n\n              Combine the water chestnuts and soy sauce in a resealable plastic bag and let marinate at room temperature, tossing and massaging the bag occasionally, for 30 minutes.\n            \n\n              Preheat the oven to 400 degrees F. Wrap each water chestnut in a piece of bacon and secure with a toothpick. Set a cooling rack into a rimmed baking sheet and arrange the bacon-wrapped water chestnuts on top. Bake until the bacon renders its fat and is crisp, about 30 minutes.\n            \n\n              Meanwhile, stir together the ketchup, brown sugar, Worcestershire sauce and 1/3 cup water in a bowl to make a sauce.\n            \n\n              Remove the baking sheet from the oven and carefully lift the cooling rack off the baking sheet. Drain away any fat in the baking sheet and wipe dry with paper towels. Line the baking sheet with foil and lightly spray the foil with nonstick cooking spray. Carefully transfer the bacon-wrapped water chestnuts to the bowl with the sauce, swirling to fully coat, then spread out on the baking sheet.\n            \n\n              Return the baking sheet to the oven and bake, tossing every few minutes, until the sauce is reduced to a sticky glaze, about 15 minutes. Immediately transfer the bacon-wrapped water chestnuts to a warm serving platter. Sprinkle with pepper and serve while hot.\n            \n", "ingredients": [{"food": "coconut water", "quantity": 8.0}, {"food": "soy sauce", "quantity": 2.0}, {"food": "bacon", "quantity": 14.0}, {"food": "", "quantity": 0.3333333333333333}, {"food": "Worcestershire sauce", "quantity": 0.3333333333333333}, {"food": "", "quantity": 1}, {"food": "black bean mango", "quantity": 1}], "title": "\nBacon-Wrapped Water Chestnuts\n"}, {"directions": "\n\n              Put the potatoes in a large saucepan and cover with cold water by 1 inch. Season generously with salt and bring to a boil. Reduce the heat to medium and simmer until very tender, about 15 minutes.\n            \n\n              Meanwhile, cook the bacon in a large skillet over medium heat until crisp, 7 to 8 minutes; transfer to a paper towel-lined plate.\n            \n\n              Drain the potatoes and return to the saucepan over low heat; cook until any remaining water evaporates, about 2 minutes. Add the butter, then gradually mash in the sour cream with a potato masher. Stir in the bacon and chives, reserving 1 tablespoon of each. Transfer to a serving dish; top with cheddar and the remaining bacon and chives.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "", "quantity": 2.5}, {"food": "salt", "quantity": 1}, {"food": "bacon", "quantity": 4.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "sour cream", "quantity": 1.4166666666666665}, {"food": "chives", "quantity": 2.0}, {"food": "cheddar cheese", "quantity": 1}], "title": "\nBacon-and-Cheese Smashed Potatoes\n"}, {"directions": "\n\n              Put the Parmesan, oil, lemon juice, sun-dried tomatoes, 3 tablespoons water, vinegar, 1/2 teaspoon salt and a few grinds of pepper in a jar or other container with a lid. Secure the lid, and shake vigorously to combine. (The dressing can be made a day ahead; shake well before serving.)\n            \n\n              Lay the bacon in a large nonstick skillet, and cook over medium heat until golden and crispy, about 5 minutes per side. Drain on paper towels, then finely chop.\n            \n\n              Wipe out the skillet, coat with cooking spray and heat over medium heat. Crack the eggs into the skillet, and cook until the whites are set but the yolks are still runny, 4 to 5 minutes. Sprinkle the eggs with salt and pepper. Remove from heat.\n            \n\n              Meanwhile, toast the bread, then rub one side of each slice with the garlic. Cut each slice in half. Put 2 toast halves on a plate, and top each set with a romaine heart half. Drizzle with the dressing, top with an egg and sprinkle with bacon. Repeat with the remaining toast, romaine, dressing, eggs and bacon.\n            \n", "ingredients": [{"food": "", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "tomatoes", "quantity": 3.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "bacon", "quantity": 3.0}, {"food": "", "quantity": 1}, {"food": "eggs", "quantity": 4.0}, {"food": "garlic bread", "quantity": 4.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 2.0}], "title": "\nBacon-and-Egg Breakfast Caesar Salad\n"}, {"directions": "\n\n              Preheat the oven to 375. Cook the bacon in a medium pot over medium heat until crisp, about 7 minutes. Transfer to a paper-towel-lined plate with a slotted spoon, then discard all but 2 tablespoons drippings from the pot. While the bacon cooks, toss the bread cubes with the olive oil on a baking sheet and season with salt and pepper. Bake until golden and crisp, about 8 minutes.\n            \n\n              Add the garlic to the bacon drippings and cook until slightly golden, 1 to 2 minutes. Add the broth, 1 1/2 cups water, the parmesan rind and 2 tablespoons parsley; season with salt and pepper. Cover and bring to a boil, then reduce to a simmer and cook 10 minutes.\n            \n\n              Adjust the heat so the broth is barely boiling. One at a time, crack each egg into a small bowl and gently slip into the broth. Poach until just set, about 2 minutes. Transfer the eggs with a slotted spoon to individual soup bowls. Stir 1 cup parmesan and the remaining 2 tablespoons parsley into the broth and season with salt and pepper. Ladle the broth into the bowls and top with the croutons, bacon and the remaining 1/4 cup parmesan.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "bacon", "quantity": 0.75}, {"food": "garlic bread", "quantity": 4.5}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "garlic powder", "quantity": 2.0}, {"food": "diced chicken", "quantity": 3.0}, {"food": "parmesan cheese", "quantity": 1.25}, {"food": "parsley", "quantity": 4.0}, {"food": "eggs", "quantity": 4.0}], "title": "\nBacon-and-Egg Soup\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Position a rack in the center of the oven and preheat to 350 degrees F. Grease a 9-by-13-inch baking dish with butter or cooking spray.\n            \n\n              Whisk together the milk, half-and-half, cayenne, eggs, 3/4 teaspoon salt and 1/2 teaspoon pepper in a large bowl. Fold in the sausage, spinach, bagels and 3/4 cup of the provolone, then pour into the prepared baking dish. Dot the top with the cream cheese and sprinkle all over with the everything bagel seasoning and remaining provolone (see Cook's Note).\n            \n\n              Cover with foil and bake for 45 minutes. Uncover and bake until the casserole is puffed, golden brown at the edges and set in the center, about 45 minutes more. Let cool 15 minutes before serving. \n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 1}, {"food": "whole milk", "quantity": 2.0}, {"food": "", "quantity": 0.75}, {"food": "hearts of palm", "quantity": 1}, {"food": "eggs", "quantity": 8.0}, {"food": "black bean mango", "quantity": 1}, {"food": "breakfast tart", "quantity": 1.3333333333333333}, {"food": "mustard spinach", "quantity": 1.3333333333333333}, {"food": "split pea soup", "quantity": 2.0}, {"food": "", "quantity": 1.3333333333333333}, {"food": "macaroni cheese", "quantity": 8.5}, {"food": "seasoning mix", "quantity": 2.0}], "title": "\nBagel Breakfast Casserole\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Mix together the cream cheese and scallions. Schmear on the bagel chip. Top with the smoked salmon, micro greens and a squeeze of lemon.\n            \n", "ingredients": [{"food": "macaroni cheese", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "chocolate chip cookies", "quantity": 1.0}, {"food": "smoked turkey roll", "quantity": 3.5}, {"food": "turnip greens", "quantity": 1}, {"food": "lemon juice", "quantity": 1.0}], "title": "\nBagel and Lox\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Heat about 3 inches vegetable oil in a medium pot over medium-low heat until a deep-fry thermometer registers 375 degrees F. Meanwhile, toss the cabbage, cilantro, lime juice, honey and mayonnaise in a bowl. Season the slaw with salt. \n            \n\n              Warm the tortillas in a skillet over medium-low heat or wrap in a damp cloth and microwave 25 seconds. Wrap in a towel to keep warm. \n            \n\n              Mix the flour, chili powder, and salt and pepper to taste in a shallow bowl. Dredge the fish in the flour mixture, then fry in batches until golden and just cooked through, 2 to 3 minutes. Transfer with a slotted spoon to a paper-towel-lined plate to drain. Season with salt. \n            \n\n              Halve, pit and slice the avocado. Fill the tortillas with the fish, avocado, slaw and salsa. Serve with lime wedges. \n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1}, {"food": "swamp cabbage", "quantity": 0.25}, {"food": "", "quantity": 0.5}, {"food": "", "quantity": 1.0}, {"food": "tamarind nectar", "quantity": 2.0}, {"food": "mayonnaise dressing", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "corn bran", "quantity": 12.0}, {"food": "potato flour", "quantity": 0.75}, {"food": "chili powder", "quantity": 0.5}, {"food": "pepper", "quantity": 1}, {"food": "halibut", "quantity": 1.25}, {"food": "avocado", "quantity": 1.0}, {"food": "", "quantity": 0.5}], "title": "\nBaja Fish Tacos\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 350 degrees F. Cut a piece of foil 9 by 23-inches. Butter the corners and sides of a 9 by 9-inch baking pan. Line the pan with the foil, leaving an overhang on two sides. Fold the overhanging foil to make them doubly thick. (This will make it easier to lift the bar out of the pan.)\n            \n\n              For the topping: Whisk the coconut cream with the egg white and vanilla in a medium bowl. Toss the shredded coconut with the flour in another medium bowl. Stir the shredded coconut mixture into the coconut cream mixture. Set aside.\n            \n\n              For the base: Whisk the flour with the cocoa powder and salt in a small bowl. Put the cookie dough on a clean work surface and dump the flour mixture on top. Knead the flour mixture and dough together until it is dark and homogenous. Sprinkle a little extra flour on the work surface, and use a rolling pin to gently press and roll the dough into a 7-or-8-inch square-don't worry if it cracks a bit. Put the dough in the prepared pan, using your fingers to press it evenly into the sides and corners.\n            \n\n              Scatter the coconut topping evenly over the base, making sure you cover the edges well and being sure not to press down so that the coconut mixture lies on top of the dough. Scatter the chocolate on top and press it lightly into the coconut. Bake until the coconut is a toasted golden brown, the topping seems dry and a toothpick inserted in the center comes out clean, about 30 minutes. Cool completely on a rack before gently lifting out of the pan by the overhanging foil, about 20 minutes. Slice into 16 square bars.\n            \n", "ingredients": [{"food": "pan dulce", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "coconut cream", "quantity": 0.3333333333333333}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "coconut water", "quantity": 1.5}, {"food": "potato flour", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 4.0}, {"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 0.25}, {"food": "onion powder", "quantity": 0.3333333333333333}, {"food": "sea lion", "quantity": 0.25}, {"food": "sugar", "quantity": 1.0}], "title": "\nBake Sale Chocolate-Coconut Bars\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Line a 9-by-13-inch baking pan with aluminum foil and spray with nonstick cooking spray.\n            \n\n              Stir together the sugar, butter, vanilla and eggs in a medium bowl. Add the flour, cocoa powder, salt and baking powder all at once and stir until just combined. Stir in half of the semisweet chocolate chips and spread the mixture in the prepared pan.\n            \n\n              Bake until the brownies begin to pull away from the edge of the pan and set in the center, 30 to 35 minutes. Immediately sprinkle with the remaining semisweet chocolate chips and let stand until the chips are melted, about 5 minutes. Spread the melted chips evenly over the top of the brownies with a spatula. Let the chocolate cool for about 10 minutes and then sprinkle with whatever combination of toppings you choose, pressing the toppings gently into the chocolate to adhere. Lift the brownies out of the pan with the foil and cool completely on a rack. Cut into 16 squares and serve.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "sugar", "quantity": 1.5}, {"food": "butter oil", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "eggs", "quantity": 3.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "salt", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 12.0}, {"food": "crackers", "quantity": 1}], "title": "\nBake-Sale Brownies\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat oven to 350 degrees F. Line 2 baking sheets with parchment paper or silicon mats.\n            \n\n              Whisk the flour, baking powder, and salt together in a bowl.\n            \n\n              In another bowl, whip the butter and the sugar with a hand-held mixer until fluffy, about 5 minutes. Beat in the egg and vanilla until just combined. Slowly beat in the dry ingredients, in 2 additions, mixing just until incorporated.\n            \n\n              Scoop the dough into 1-inch balls with a cookie or ice cream scoop and roll in sugar. Place about 2 inches apart on the prepared baking sheets. Press a thumbprint into the center of each ball, about 1/2-inch deep. Fill each print with about 3/4 teaspoon of jam.\n            \n\n              Bake cookies until the edges are golden, about 15 minutes. (Rotate the pans, from top to bottom, about halfway through baking for even color.) Cool cookies on the baking sheets. Serve.\n            \n\n              Store cookies in a tightly sealed container for up to 5 days.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.75}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "", "quantity": 0.75}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.625}, {"food": "silk strawberry soy yogurt", "quantity": 0.3333333333333333}], "title": "\nBake-Sale Thumbprints\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Butter a shallow 2-quart baking dish; set aside. Bring a large pot of salted water to a boil. Add the pasta and cook as the label directs for al dente. Drain and transfer to a medium bowl; add the butter and toss until melted.\n            \n\n              Whisk the half-and-half, eggs, paprika, 1 teaspoon salt and a few grinds of pepper in a large bowl until smooth. Add the pasta, 1 1/2 cups cheddar, the muenster, provolone and mozzarella; toss.\n            \n\n              Transfer the pasta mixture to the prepared baking dish and sprinkle with the remaining 1/2 cup cheddar. Bake until bubbling around the edges and no longer jiggly, 30 to 35 minutes. Let cool about 30 minutes before slicing.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "", "quantity": 2.0}, {"food": "eggs", "quantity": 3.0}, {"food": "paprika", "quantity": 0.5}, {"food": "pepper", "quantity": 1}, {"food": "cheddar cheese", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 0.5}], "title": "\nBake-and-Slice Macaroni and Cheese\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Make the ice cream cake: Brush a 3-quart metal bowl with vegetable oil; line with plastic wrap. Fill the bowl with scoops of the sorbet, vanilla ice cream and half of the chocolate ice cream, alternating small and large scoops to create a mosaic of colors and shapes. Place a piece of plastic wrap on top of the ice cream; press down to close the gaps between scoops and even out the surface. Remove the plastic wrap, sprinkle the ice cream with the wafer crumbs and re-cover with the plastic wrap, pressing gently. Freeze until set, about 30 minutes. \n            \n\n              Remove the wrap and spread the remaining chocolate ice cream in an even layer on top of the crumbs. Cut the pound cake into 1/2-inch-thick slices; completely cover the ice cream with the slices, trimming as needed (you'll use about two-thirds of the cake). Cover with fresh plastic wrap and freeze until firm, at least 2 hours or up to 2 days. \n            \n\n              Make the meringue: Whip the egg whites and cream of tartar in a large bowl with a mixer on medium-high speed until foamy, about 2 minutes. Gradually beat in the sugar on high speed until the whites are glossy and hold stiff peaks. \n            \n\n              Remove the top layer of plastic wrap, then invert the cake onto a parchment-lined baking sheet. (If necessary, let the cake stand overturned until it slips out.) Remove the rest of the plastic wrap and cover the ice cream completely with the meringue, making the dome-shaped top slightly thicker than the sides. Form swirly peaks in the meringue using the back of a spoon. Freeze for at least 3 more hours. \n            \n\n              Preheat the oven to 500 degrees. Bake the cake until the meringue peaks are golden, about 4 minutes, or brown the meringue with a blowtorch. Let the cake soften at room temperature for 5 to 10 minutes before slicing. Freeze any leftovers. \n            \n\n              Photograph by Steve Giralt\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1}, {"food": "fruit cocktail", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "barbecue loaf", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "sugar", "quantity": 1.0}], "title": "\nBaked Alaska\n"}, {"directions": "\n\n              Line a loaf pan with plastic wrap. Spread 1 pint softened vanilla ice cream in the pan; freeze until hard, 1 hour. Spread with 1 pint softened orange sherbet; freeze 1 more hour. Top with a layer of pound cake slices; freeze at least 1 more hour. Beat 4 egg whites and 1/2 teaspoon lemon juice with a mixer until frothy, then beat in 1/3 cup sugar until stiff. Invert the ice cream loaf onto a baking sheet, remove the plastic wrap and cover completely with the meringue. Bake at 500 degrees F until browned in spots, 3 minutes.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [], "title": "\nBaked Alaska\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F.\n            \n\n              Slice off about 1/4-inch of the top of each apple. (The apple tops are perfect for snacking.) Scoop out the seeds and core of the apple with a melon-baller to make a pocket. Peel off about a 1/2-inch band of the apple's skin along the upper half of the apple with a vegetable peeler. Brush the peeled part and the interior of the apple with lemon juice.\n            \n\n              In a small mixing bowl, combine the butter, lemon zest, and sugar. Add the currants and nuts. Place some of the butter mixture and a cinnamon stick in each of the apples. Place the apples in an ovenproof baking dish just large enough to hold the apples upright. Pour in the cider and rum, bake until the apple is tender, about 30 minutes. Baste the apples with the cider/rum mixture with a bulb baster, 2 or 3 times, during baking.\n            \n\n              Serve warm or at room temperature with softly whipped cream or vanilla or cinnamon ice cream.\n            \n\n              Serving suggestions: Whipped cream, or vanilla or cinnamon ice cream.\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 6.0}, {"food": "", "quantity": 1.0}, {"food": "butter oil", "quantity": 3.0}, {"food": "sugar", "quantity": 3.0}, {"food": "currants", "quantity": 0.25}, {"food": "", "quantity": 0.25}, {"food": "cinnamon", "quantity": 3.0}, {"food": "apple", "quantity": 0.5}, {"food": "coconut water", "quantity": 0.5}], "title": "\nBaked Apples\n"}, {"directions": "\n\n              Mix 4 tablespoons softened butter with 1 tablespoon fennel seeds, 2 teaspoons sugar, and salt and pepper to taste; use some of the mixture to grease a baking dish. Rub 4 cored apples inside and out with the remaining butter mixture. Place 4 thick onion rounds in the dish and top with the buttered apples. Add a quartered fennel bulb to the dish. Bake at 425 degrees until the apples are soft, 1 hour.\n            \n\n               Per serving: Calories: 157; Total Fat: 8 grams; Saturated Fat: 5 grams; Protein: 1 gram; Total carbohydrates: 23 grams; Sugar: 15 grams; Fiber: 5 grams; Cholesterol: 20 milligrams; Sodium: 140 milligrams \n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nBaked Apples with Fennel\n"}, {"directions": "\n\n              Combine 2 pounds chopped peeled McIntosh apples, 2 tablespoons each apple cider and butter, 4 thyme sprigs and 1/4 teaspoon kosher salt in a baking dish. Cover and bake at 400 degrees F until softened, 30 minutes. Discard the thyme and add 2 teaspoons cider vinegar; mash. Top with more thyme.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [], "title": "\nBaked Applesauce with Thyme\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Bring a large pot of salted water to a boil. Add the broccolini; cook until tender, about 3 minutes. Drain, then blot dry with paper towels and let cool, 5 minutes.\n            \n\n              Transfer the broccolini to a food processor and pulse until finely chopped. Add the cream cheese, mayonnaise, sour cream, 1/2 cup parmesan, the lemon zest, hot sauce and garlic; pulse until smooth. Transfer the mixture to a bowl and fold in the artichoke hearts, havarti, dill and all but 1 tablespoon of the scallions. Transfer to a 1-quart baking dish and top with the remaining 1/4 cup parmesan.\n            \n\n              Bake until lightly browned and bubbling, 25 to 30 minutes. Top with more dill and the reserved scallions.\n            \n\n              Serve with pita chips or tortilla chips.\n            \n\n              Photograph by Kana Okada\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "mayonnaise dressing", "quantity": 0.5}, {"food": "sour cream", "quantity": 0.25}, {"food": "parmesan cheese", "quantity": 0.75}, {"food": "", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 0.5}, {"food": "garlic powder", "quantity": 1.0}, {"food": "artichoke hearts", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "dill seed", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}], "title": "\nBaked Artichoke-Broccolini Dip\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F. Cook the pancetta and about two-thirds of the bacon in a large skillet over medium heat, stirring occasionally, until crisp, about 10 minutes. Transfer the bacon and pancetta to a bowl using a slotted spoon. Reserve the drippings in the skillet.\n            \n\n              Add the onion to the skillet and cook, stirring occasionally, until soft and golden, about 8 minutes. Add the ginger, garlic and chili powder and cook, stirring, 1 minute. Add the tomatoes and their juice, the molasses, Worcestershire sauce, vinegar, mustard powder, 1/2 teaspoon salt, and pepper to taste. Increase the heat to medium high, bring to a simmer and cook until slightly thickened, about 5 minutes. Add the pinto beans, then add the navy beans and their liquid and return to a simmer. Stir in the pancetta-bacon mixture. Transfer to a 2-quart baking dish.\n            \n\n              Pulse the buns with the remaining uncooked bacon in a food processor until finely ground. Sprinkle the crumbs evenly over the bean mixture. Cover and bake 45 minutes, then uncover and bake until the crumbs are golden brown, about 20 more minutes.\n            \n\n              Photograph by Tina Rupp\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 3.0}, {"food": "diced chicken", "quantity": 5.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "ginger", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "chili powder", "quantity": 2.5}, {"food": "whole milk", "quantity": 1.0}, {"food": "molasses", "quantity": 3.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "fava beans", "quantity": 2.0}, {"food": "fava beans", "quantity": 1.0}, {"food": "garlic bread", "quantity": 2.0}], "title": "\nBaked Beans With Bacon\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F. Cook the pancetta and about two-thirds of the bacon in a large skillet over medium heat, stirring occasionally, until crisp, about 10 minutes. Transfer the bacon and pancetta to a bowl using a slotted spoon. Reserve the drippings in the skillet.\n            \n\n              Add the onion to the skillet and cook, stirring occasionally, until soft and golden, about 8 minutes. Add the ginger, garlic and chili powder and cook, stirring, 1 minute. Add the tomatoes and their juice, the molasses, Worcestershire sauce, vinegar, mustard powder, 1/2 teaspoon salt, and pepper to taste. Increase the heat to medium high, bring to a simmer and cook until slightly thickened, about 5 minutes. Add the pinto beans, then add the navy beans and their liquid and return to a simmer. Stir in the pancetta-bacon mixture. Transfer to a 2-quart baking dish.\n            \n\n              Pulse the buns with the remaining uncooked bacon in a food processor until finely ground. Sprinkle the crumbs evenly over the bean mixture. Cover and bake 45 minutes, then uncover and bake until the crumbs are golden brown, about 20 more minutes.\n            \n\n              Photograph by Anne Disrude\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 3.0}, {"food": "diced chicken", "quantity": 5.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "ginger", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "chili powder", "quantity": 2.5}, {"food": "whole milk", "quantity": 1.0}, {"food": "molasses", "quantity": 3.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "fava beans", "quantity": 2.0}, {"food": "fava beans", "quantity": 1.0}, {"food": "garlic bread", "quantity": 2.0}], "title": "\nBaked Beans With Bacon\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F. Heat the olive oil in a large skillet over medium heat. Add the onion, celery, carrot, garlic and 1/4 teaspoon each salt and pepper; cook, stirring occasionally, until the vegetables are soft and golden, about 7 minutes.\n            \n\n              Add the chard, turkey and 1/4 cup water to the skillet; cook, stirring, until the chard wilts slightly, about 3 minutes. Add the tomatoes with their juice, increase the heat to medium high and simmer until slightly reduced, about 5 minutes. Add the pinto beans, then add the navy beans and their liquid. Add the parsley, thyme and oregano and return to a simmer.\n            \n\n              Coarsely mash about one-quarter of the beans in the skillet with a potato masher or fork to thicken the mixture; season with salt. Transfer to a 2-quart baking dish. Cover and bake 45 minutes, then uncover and bake 10 more minutes.\n            \n\n              Photograph by Anne Disrude\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "celery seed", "quantity": 1.0}, {"food": "carrot juice", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "mustard greens", "quantity": 1.0}, {"food": "smoked turkey roll", "quantity": 0.5}, {"food": "whole milk", "quantity": 1.0}, {"food": "fava beans", "quantity": 2.0}, {"food": "fava beans", "quantity": 1.0}, {"food": "parsley", "quantity": 0.25}, {"food": "thyme", "quantity": 1.0}, {"food": "", "quantity": 1.0}], "title": "\nBaked Beans With Swiss Chard\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F. Heat the olive oil in a large skillet over medium heat. Add the onion, celery, carrot, garlic and 1/4 teaspoon each salt and pepper; cook, stirring occasionally, until the vegetables are soft and golden, about 7 minutes.\n            \n\n              Add the chard, turkey and 1/4 cup water to the skillet; cook, stirring, until the chard wilts slightly, about 3 minutes. Add the tomatoes with their juice, increase the heat to medium high and simmer until slightly reduced, about 5 minutes. Add the pinto beans, then add the navy beans and their liquid. Add the parsley, thyme and oregano and return to a simmer.\n            \n\n              Coarsely mash about one-quarter of the beans in the skillet with a potato masher or fork to thicken the mixture; season with salt. Transfer to a 2-quart baking dish. Cover and bake 45 minutes, then uncover and bake 10 more minutes.\n            \n\n              Photograph by Yunhee Kim\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "celery seed", "quantity": 1.0}, {"food": "carrot juice", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "mustard greens", "quantity": 1.0}, {"food": "smoked turkey roll", "quantity": 0.5}, {"food": "whole milk", "quantity": 1.0}, {"food": "fava beans", "quantity": 2.0}, {"food": "fava beans", "quantity": 1.0}, {"food": "parsley", "quantity": 0.25}, {"food": "thyme", "quantity": 1.0}, {"food": "", "quantity": 1.0}], "title": "\nBaked Beans With Swiss Chard\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 325 degrees F. Lay the bacon in a large skillet, then cook over medium heat until golden and crisp, 4 to 5 minutes per side. Drain the bacon on paper towels, let cool, then finely chop.\n            \n\n              Combine the bacon, pecans, cranberries, apricots, rosemary, vinegar, pinch of salt and a few grinds of pepper in a small bowl.\n            \n\n              Remove the Brie from its packaging. Cut off the top rind of the round of Brie, leaving a 1/4-inch border around the edges (use a sharp knife and go in from above at a slight angle). Discard the rind you have removed. Put the Brie in a small baking dish. Top with some of the cranberry-pecan-bacon crumble, and scatter the rest around the Brie. Cover the dish with foil, and bake until the cheese is warm and gooey, 30 to 35 minutes.\n            \n\n              Serve with bread, crackers and apple and/or pear slices for dipping.\n            \n", "ingredients": [{"food": "bacon", "quantity": 4.0}, {"food": "walnuts", "quantity": 2.0}, {"food": "cranberries", "quantity": 2.0}, {"food": "apricots", "quantity": 6.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 7.0}, {"food": "apple", "quantity": 1}], "title": "\nBaked Brie with Cranberry-Pecan-Bacon Crumble\n"}, {"directions": "\n\n              Combine the figs, orange zest, thyme, brandy, sugar, vinegar, a few grinds of pepper and 1/4 cup water in a small saucepan. Bring to a boil, then reduce the heat and simmer until the liquid is syrupy and the figs are softened, 15 to 20 minutes. Transfer to a small bowl, discard the zest and thyme and let cool, about 20 minutes. Transfer to a food processor or mini chopper and pulse until mostly smooth.\n            \n\n              Preheat the oven to 375 degrees F. Unroll the pie dough onto a lightly floured work surface. Roll out the outer 2 inches of dough with a rolling pin to make the edge slightly thinner than the rest of the dough. Put the cheese in the center of the dough and top with the fig compote. Trim about 1 inch off the outer edge of the dough. Pull the dough up and over the cheese, folding and pleating the dough all the way around until the cheese is covered. Pinch the dough together at the top to seal.\n            \n\n              Transfer the wrapped cheese to a parchment-lined baking sheet. Brush the dough with the beaten egg and bake until golden brown, 30 to 35 minutes. Let cool about 10 minutes, then transfer to a cutting board to slice. Serve warm or at room temperature.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "figs", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "thyme", "quantity": 2.0}, {"food": "", "quantity": 3.0}, {"food": "sugar", "quantity": 2.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "pepper", "quantity": 1}, {"food": "pie fillings", "quantity": 1.0}, {"food": "potato flour", "quantity": 1}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}], "title": "\nBaked Brie with Fig Compote\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: Cheesecloth\n\n              For the blue cheese sauce: Whisk together the yogurt, mayonnaise, lemon juice, milk, Worcestershire and cayenne in a medium bowl until smooth. Gently stir in the blue cheese. Season with 1/2 teaspoon salt and pepper to taste. Refrigerate overnight or up to 3 days, covered, to let the flavors develop.\n            \n\n              For the cauliflower tots: Position an oven rack at the top of the oven, and preheat to 450 degrees F. Set a cooling rack on a rimmed baking sheet.\n            \n\n              Heat the oil in a large skillet over medium-high heat. Add the onion, and cook, stirring frequently, until browned and soft, about 5 minutes. Remove from the heat, and let cool in the skillet.\n            \n\n              Remove and discard the outer leaves and core of the cauliflower. Separate the heads into large florets, and trim away most of the stems. Process half the florets in a food processor until very finely chopped, almost a paste. Transfer to a large bowl. Repeat with the remaining florets.\n            \n\n              Lay out a large double layer of cheesecloth, and put the cauliflower paste in the middle. Gather up the sides into a bundle. Hold the bundle over the sink, and squeeze out as much of the liquid as you possibly can (there will be a fair amount). Put the remaining cauliflower back into the bowl (it should be fairly dry now).\n            \n\n              Add the browned onion, almond meal, egg whites, hot sauce, 2 teaspoons salt and cayenne to the cauliflower, and work together with your hands until combined and the mixture holds together when squeezed.\n            \n\n              Scoop out even tablespoonfuls of the cauliflower mixture. Roll each into a ball, shape into a squared-off tot shape and place on a baking sheet. (The tots can be covered loosely with plastic wrap and refrigerated up to overnight.)\n            \n\n              Pulse the rice cereal in the food processor until finely ground, then transfer it to a small dish. Whisk the egg yolks with 1/4 cup water in a medium bowl. Line up the tots, egg wash, ground cereal and prepared baking sheet (with rack) on your work surface. Dip each tot in the egg wash, letting the excess liquid drip off, then roll in the cereal to fully coat and place on the baking sheet. (To avoid a mess, designate one hand for the dipping and retrieving in the egg and the other for rolling in the cereal.) Spray each tot all over with the cooking spray, turning as needed. (The unsprayed breaded tots can be frozen on a parchment-lined baking sheet until solid, about 2 hours, then transferred to a large freezer bag and frozen for up to 1 month.)\n            \n\n              Bake the tots on the prepared baking sheet until golden brown outside and hot inside, 15 to 20 minutes. Let cool for a few minutes, then transfer to a serving platter. Shake some hot sauce on top. Serve with the blue cheese sauce. (If baking the tots from frozen, coat with cooking spray and bake for until golden brown outside and hot inside, 15 to 20 minutes.)\n            \n", "ingredients": [{"food": "silk plain soy yogurt", "quantity": 0.5}, {"food": "mayonnaise dressing", "quantity": 0.25}, {"food": "lemon juice", "quantity": 1.0}, {"food": "milk", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 0.25}, {"food": "pepper", "quantity": 1}, {"food": "macaroni cheese", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "cauliflower", "quantity": 2.0}, {"food": "barley flour or meal", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "pepper", "quantity": 0.25}, {"food": "crisped rice bar", "quantity": 2.0}, {"food": "", "quantity": 1}], "title": "\nBaked Buffalo Cauliflower Tots\n"}, {"directions": "\n\n              Make the dip: Pulse the yogurt, blue cheese, mayonnaise, garlic, milk and lemon juice in a food processor until combined but still chunky. Season with salt and pepper. Cover and refrigerate until ready to serve.\n            \n\n              Make the wings: Preheat the oven to 425 degrees F. Coat a rimmed baking sheet with cooking spray. Put the chicken wings in a deep skillet; add 3 pieces of celery, 3 pieces of carrot, the bay leaves, chicken broth, hot sauce, paprika, butter, honey and 1/2 cup water and bring to a simmer over medium heat. Simmer until the chicken is almost cooked through, about 18 minutes. Transfer the wings to the prepared baking sheet and arrange in a single layer; reserve the sauce in the skillet.\n            \n\n              Bake the wings, turning once, until the skin is golden and crisp, 30 to 35 minutes. Meanwhile, simmer the reserved sauce over medium-low heat until slightly thickened, about 15 minutes. Discard the celery, carrot and bay leaves. Reserve one-quarter of the sauce for serving. Return the wings to the skillet and toss with the remaining sauce. Serve the wings with the blue cheese dip and reserved sauce; cut the remaining celery and carrot into sticks to serve on the side.\n            \n", "ingredients": [{"food": "silk plain soy yogurt", "quantity": 0.75}, {"food": "macaroni cheese", "quantity": 0.25}, {"food": "mayonnaise dressing", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "milk", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "baking chocolate", "quantity": 1}, {"food": "diced chicken", "quantity": 3.0}, {"food": "celery seed", "quantity": 4.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1.5}, {"food": "paprika", "quantity": 2.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "honey smoked ham", "quantity": 1.0}], "title": "\nBaked Buffalo Wings With Blue Cheese-Yogurt Dip\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Combine the pecans, dried cranberries, brown sugar, curry powder and a pinch of salt in a medium bowl.\n            \n\n              Put the cheese in a 1-quart baking dish and top with the pecan mixture. Bake until the cheese melts and the nuts are toasted, about 12 minutes. Serve with sliced pears and/or crackers.\n            \n\n              Photograph by Andrew Purcell\n            \n", "ingredients": [{"food": "pecans", "quantity": 0.5}, {"food": "cranberries", "quantity": 0.5}, {"food": "sugar", "quantity": 2.0}, {"food": "curry powder", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "prickly pears", "quantity": 1}], "title": "\nBaked Cambozola with Pecans and Cranberries\n"}, {"directions": "\nSpecial equipment: Cheesecloth\n\n              Position an oven rack in the top position of the oven, and preheat to 450 degrees F. Set a cooling rack on a rimmed baking sheet.\n            \n\n              Heat the oil in a large skillet over medium-high heat. Add the onions, and cook, stirring frequently, until browned and soft, about 5 minutes. Remove from the heat, and let cool in the skillet.\n            \n\n              Remove the outer leaves and core of the cauliflower heads. Separate the heads into large florets, and trim away most of the remaining smaller stems. In 2 batches, process the florets in a food processor until very finely chopped, almost a paste, then transfer the paste to a large bowl. Wipe out the food processor.\n            \n\n              Put the cauliflower in the middle of a double layer of cheesecloth, and gather up the sides into a bundle. Squeeze out as much liquid as you can over the sink, then put the cauliflower back in the bowl. Add the browned onion, almond meal, egg whites and 2 teaspoons salt, and work together with your hands until combined and the mixture holds together when squeezed. Scoop out even tablespoonfuls, roll each into a ball and shape into a squared-off tot shape, and line them up on a baking sheet. (The tots can be covered loosely with plastic wrap and refrigerated overnight.)\n            \n\n              Pulse the rice cereal in the food processor until finely ground, and transfer to a small dish. Whisk the egg yolks with 1/4 cup water in a medium bowl. Line up the tots, egg wash, ground cereal and prepared baking sheet with the rack on your work surface. Dip the tots in the egg wash (let the excess drip off), roll them in the cereal to fully coat and place on the rack. (To avoid a mess, designate one hand for dipping and retrieving in the egg and the other for rolling in the cereal.) Spray each tot all over with the cooking spray, turning as needed. (Unsprayed breaded tots can be placed on a parchment-lined baking sheet, frozen until solid, about 2 hours, then transferred to a large freezer bag for up to 1 month. Coat with cooking spray before baking.)\n            \n\n              Bake the tots on the prepared baking sheet until golden brown outside and hot inside, 15 to 20 minutes. Let cool for a few minutes, then transfer to a serving platter. Serve with desired dipping sauces.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "cauliflower", "quantity": 2.0}, {"food": "soy meal", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "crisped rice bar", "quantity": 2.0}, {"food": "", "quantity": 1}, {"food": "mustard spinach", "quantity": 1}], "title": "\nBaked Cauliflower Tots\n"}, {"directions": "\n\n              Preheat the oven to 450 degrees F. Bring a large pot of salted water to a boil. Cook the cavatappi until very al dente, 2 to 3 minutes less than the label directs; drain.\n            \n\n              Heat the olive oil in a large skillet over medium heat. Add the garlic and red pepper flakes and cook until the garlic is golden. Crush the plum tomatoes into the skillet with your hands; rinse out each can with 1/2 cup water and add the water to the skillet. Add the basil; simmer, uncovered, until the sauce is thickened, about 15 minutes. Discard the basil; season the sauce with salt. (Alternatively, heat 4 cups prepared tomato sauce.)\n            \n\n              Stir the ricotta into the sauce, then add the artichoke hearts and fennel.\n            \n\n              Brush a 3-to-4-quart baking dish with olive oil. Toss the cooked pasta with the sauce and half of each cheese. Spread in the prepared baking dish. Sprinkle the remaining cheese over the pasta. Bake, uncovered, until browned, about 15 minutes. Let rest 15 minutes before serving.\n            \n\n              Photograph by Lisa Shin\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "plum", "quantity": 1.0}, {"food": "plum", "quantity": 1.0}, {"food": "basil", "quantity": 4.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "artichoke hearts", "quantity": 1.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.5}, {"food": "macaroni cheese", "quantity": 3.0}, {"food": "macaroni cheese", "quantity": 1.0}], "title": "\nBaked Cavatappi With Artichokes and Fennel\n"}, {"directions": "\n\n              Whisk the eggs, 1/4 cup sugar, the milk, orange zest, orange juice and vanilla in a large bowl. Put the croissants in an 8-inch-square baking dish, squeezing them in to fit in a single layer. Pour the egg mixture over the croissants, then put a plate on top and press down to keep them submerged. Let soak in the refrigerator, at least 30 minutes and up to 1 hour.\n            \n\n              Preheat the oven to 350 degrees F. Remove the plate from the croissants, cover the baking dish with aluminum foil and bake until set, about 40 minutes. Remove from the oven and turn on the broiler. Uncover the baking dish, sprinkle with the remaining 1 tablespoon sugar and broil until the sugar is bubbling in spots, about 2 minutes.\n            \n\n              Meanwhile, mix the marmalade with 1/4 cup water in a small microwave-safe bowl; microwave until warm, 1 to 2 minutes. Serve on the side.\n            \n\n              Photograph by Andrew Purcell\n            \n", "ingredients": [{"food": "eggs", "quantity": 3.0}, {"food": "sugar", "quantity": 0.25}, {"food": "whole milk", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "orange juice", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "croissants", "quantity": 4.0}, {"food": "orange", "quantity": 0.5}], "title": "\nBaked Croissant French Toast With Orange Syrup\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F. Heat 1 1/2 tablespoons olive oil in a large ovenproof skillet over medium-high heat. Add the onion and cook, stirring, until golden, about 5 minutes. Add the tomato paste and cook, stirring, 1 more minute. Stir in the vinegar, honey mustard, Worcestershire sauce, 1/2 cup water, and salt and pepper to taste. Bring to a simmer, then add the beans, plus the liquid from one of the cans. Cook until the beans are soft, about 5 more minutes.\n            \n\n              Make eight indentations in the bean mixture and crack an egg into each. Sprinkle with salt and pepper and transfer to the oven. Bake until the egg whites are set, 10 to 14 minutes.\n            \n\n              Meanwhile, heat a large skillet over medium-high heat. Brush the bread with olive oil on both sides and toast in the skillet, 1 minute per side. Toss the tomatoes, parsley, the remaining 1/2 tablespoon olive oil, and salt and pepper to taste in a bowl. Divide the toast among plates; top each with 2 eggs, some beans and the tomato salad.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 2.0}, {"food": "eggs", "quantity": 8.0}, {"food": "garlic bread", "quantity": 4.0}, {"food": "grape juice", "quantity": 2.0}, {"food": "parsley", "quantity": 0.25}], "title": "\nBaked Eggs and Beans on Toast\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Melt the butter in a large ovenproof skillet over medium-high heat. Add the tomatoes and cook until softened, 2 to 3 minutes. Add the lentils, curry sauce, 1/2 cup water and 1/4 teaspoon salt; stir well to coat. Bring to a simmer and cook, stirring occasionally, until the lentils are tender, about 8 minutes. Gradually add the spinach, stirring until wilted.\n            \n\n              Reduce the heat to medium. Make 4 wells in the lentil mixture and crack an egg into each; spoon the heavy cream over the eggs. Continue cooking until the whites begin to set, 3 to 4 minutes.\n            \n\n              Transfer the skillet to the oven and bake until the egg whites are just set but the yolks are still runny, about 10 minutes. (The eggs will continue cooking after you remove them from the oven.) Let rest, 5 minutes.\n            \n\n              Meanwhile, wrap the naan in foil and warm in the oven, about 5 minutes. Cut into wedges and serve with the eggs. Photograph by Ryan Dausch\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.0}, {"food": "tomatoes", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "mustard spinach", "quantity": 10.0}, {"food": "eggs", "quantity": 4.0}, {"food": "ice cream swich", "quantity": 0.25}, {"food": "garlic bread", "quantity": 2.0}], "title": "\nBaked Eggs with Curried Spinach\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F.\n            \n\n              Melt the butter in a large, well-seasoned cast iron skillet over medium heat. Add the potatoes and cook, stirring occasionally until tender and brown, about 15 minutes. Stir in the parsley, garlic, salt, and pepper, and remove from the heat.\n            \n\n              Push the potatoes aside to make 4 evenly spaced shallow nests and break 2 eggs into each. Bake until the egg whites are cooked and the yolks are still runny, about 10 minutes. Sprinkle the cheese over the eggs and continue baking until it just melts, about 1 minute more. Serve immediately.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 3.0}, {"food": "sweet potatoes", "quantity": 1.5}, {"food": "chrysanthemum leaves", "quantity": 0.25}, {"food": "garlic powder", "quantity": 2.0}, {"food": "salt", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "eggs", "quantity": 8.0}, {"food": "cheddar cheese", "quantity": 1.0}], "title": "\nBaked Eggs with Farmhouse Cheddar and Potatoes\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F.\n            \n\n              Lightly oil a medium nonstick skillet with an ovenproof handle. Spoon a heaping 1/3 cup of salsa into the pan. Lightly press down the salsa to make 4 evenly spaced shallow nests and break an egg into each. Season with salt and pepper. Bake until the egg whites are cooked and the yolks are still runny, about 15 minutes. Sprinkle the cheese over the eggs and continue baking until just melted, about 1 minute more. Top with the cilantro. Serve immediately.\n            \n\nSalsa Verde:\n\n\n              Put the tomatillos in a medium saucepan with water to cover. Bring to a boil and cook until tender, about 7 minutes. Drain.\n            \n\n              Puree the garlic, onion, jalapeno, and salt in a blender until smooth. Add the tomatillos and cilantro sprigs and puree until smooth.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1}, {"food": "", "quantity": 0.3333333333333333}, {"food": "eggs", "quantity": 4.0}, {"food": "black bean mango", "quantity": 1}, {"food": "macaroni cheese", "quantity": 0.75}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "tomatillos", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.25}, {"food": "pasta with tomato sauce", "quantity": 0.25}, {"food": "salt", "quantity": 1.0}, {"food": "", "quantity": 4.0}], "title": "\nBaked Eggs with Salsa Verde\n"}, {"directions": "\n\n              1. Position a rack in the center of the oven and preheat the oven to 350°F.\n            \n\n              2. Select a roasting pan large enough to accommodate three 11.5 ounce mini-bakers without letting them touch. Coat the bottoms and the sides of the bakers with the butter. Bring 4 to 5 quarts of water to a boil.\n            \n\n              3. Cook the bacon in a small skillet over medium heat until crisp, about 8 minutes. Transfer to a plate lined with a paper towel to drain, then crumble. Add the onions to the skillet and cook until softened, about 5 minutes. Add the spinach and nutmeg and cook, stirring occasionally, until warmed through, about 1 minute.\n            \n\n              4. Divide the cream, bacon and onions evenly among the bakers and crack 2 eggs into each. Sprinkle the tops with the Parmesan and cover with the lids.\n            \n\n              5. Place the bakers in a roasting pan and place the pan into the oven. Fill the pan with enough boiling water to come two-thirds up the sides of the bakers. Bake for 10 minutes. Remove the lids from the bakers, and bake for 12 minutes longer, then turn the oven up to broil. Broil until the whites are set but still jiggle a little and the tops start to brown, about 2 minutes longer. Serve with the buttered toast.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.0}, {"food": "bacon", "quantity": 4.0}, {"food": "onion powder", "quantity": 0.25}, {"food": "mustard spinach", "quantity": 0.5}, {"food": "nutmeg", "quantity": 0.25}, {"food": "ice cream swich", "quantity": 0.3333333333333333}, {"food": "eggs", "quantity": 6.0}, {"food": "", "quantity": 0.3333333333333333}, {"food": "black bean mango", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}], "title": "\nBaked Eggs with Spinach and Cheese\n"}, {"directions": "\n\n              Preheat the oven to 450 degrees F. Bring a large pot of salted water to a boil. Cook the farfalle until very al dente, 2 to 3 minutes less than the label directs; drain.\n            \n\n              Meanwhile, make the sauce: Heat the olive oil in a large skillet over medium heat. Add the garlic and red pepper flakes and cook until the garlic is golden. Crush the plum tomatoes into the skillet with your hands; rinse out each can with 1/2 cup water and add the water to the skillet. Add the basil sprigs; simmer, uncovered, until the sauce is thickened, 15 minutes. Discard the basil; season the sauce with salt. (Alternatively, heat 4 cups prepared tomato sauce.)\n            \n\n              Stir the chopped basil and parsley into the sauce, then add the escarole and zucchini.\n            \n\n              Brush a 3-to-4-quart baking dish with olive oil. Toss the cooked pasta with the sauce and half of each cheese. Spread in the prepared baking dish. Sprinkle the remaining cheese over the pasta. Bake, uncovered, until browned, about 15 minutes. Let rest 15 minutes before serving.\n            \n\n              Photograph by Lisa Shin\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "plum", "quantity": 1.0}, {"food": "plum", "quantity": 1.0}, {"food": "basil", "quantity": 4.0}, {"food": "parsley", "quantity": 1.0}, {"food": "escarole", "quantity": 1.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.5}, {"food": "macaroni cheese", "quantity": 3.0}, {"food": "parmesan cheese", "quantity": 1.0}], "title": "\nBaked Farfalle With Escarole and Zucchini\n"}, {"directions": "\n\n              Position racks in the upper and lower thirds of the oven and preheat to 450 degrees F using the convection setting, if available. Place a baking sheet on one of the racks to preheat.\n            \n\n              Prepare the chips: Cut the potatoes into 1/4-inch-thick sticks. Toss with the olive oil and cayenne in a bowl. Carefully remove the hot baking sheet from the oven, add the potatoes and spread in an even layer. Use a rubber spatula to scrape any oil from the bowl over the potatoes. Bake on the top oven rack, turning once, until browned and crisp, 25 to 30 minutes. Season with salt.\n            \n\n              Meanwhile, make the fish: Set a wire rack on a baking sheet and coat with cooking spray. Lightly crush the cereal in a bowl with your fingers. Add 2 teaspoons salt, and black pepper to taste. In another bowl, whisk the egg whites and a pinch of salt until frothy.\n            \n\n              Dip the fish in the egg whites, then roll in the cereal crumbs to coat. Place the fish pieces on the rack (position them on their sides so that the majority of the crust is exposed) and mist with cooking spray.\n            \n\n              Bake the fish on the bottom oven rack until crisp and just cooked through, about 12 minutes. Season with salt and black pepper. Serve the fish and chips with tartar sauce and/or malt vinegar, if desired.\n            \n", "ingredients": [{"food": "", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "hearts of palm", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1}, {"food": "crisped rice bar", "quantity": 2.75}, {"food": "black bean mango", "quantity": 1}, {"food": "egg substitute", "quantity": 3.0}, {"food": "fish oil", "quantity": 1.5}, {"food": "Worcestershire sauce", "quantity": 1}], "title": "\nBaked Fish and Chips\n"}, {"directions": "\n\n              Preheat the oven to 450 degrees F and set a wire rack on a rimmed baking sheet; coat the rack with cooking spray. Combine the mayonnaise, lemon zest and 1 tablespoon lemon juice in a shallow dish; season with salt and pepper. Combine the panko, parsley and capers in another shallow dish; season with salt and pepper.\n            \n\n              Pat the fish dry with paper towels. Dip the fish in the mayonnaise mixture, flesh-side down, then dredge in the panko mixture, pressing to coat. Transfer to the prepared rack, crumb-side up. Coat the fish with cooking spray. Bake until golden and crisp, about 15 minutes.\n            \n\n              Meanwhile, whisk the remaining lemon juice with the mustard in a large bowl. Gradually whisk in the olive oil until smooth; season with salt and pepper. Add the mesclun greens, beets, cucumber and apple and toss well to coat; season with salt and pepper. Serve with the fish and lemon wedges.\n            \n\n              Photographs by Charles Masters\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "silk light vanilla", "quantity": 0.25}, {"food": "lemon juice", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 1.0}, {"food": "parsley", "quantity": 0.25}, {"food": "capers", "quantity": 2.0}, {"food": "ocean perch", "quantity": 4.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "turnip greens", "quantity": 6.0}, {"food": "beets", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "apple", "quantity": 1.0}], "title": "\nBaked Fish with Apple-Beet Salad\n"}, {"directions": "\n\n              Position a rack in the upper third of the oven and preheat to 425 degrees F. Heat the olive oil in a deep ovenproof skillet over medium-high heat. Add the mushrooms, season with salt and pepper and cook, stirring occasionally, until lightly browned, about 4 minutes. Transfer to a plate and wipe out the skillet.\n            \n\n              Melt the butter in the skillet over medium heat; add the flour and cook, whisking, 3 minutes. Whisk in the milk and chicken broth until smooth; simmer, whisking constantly, until slightly thickened, about 5 minutes. Whisk in 1/2 teaspoon salt and the nutmeg.\n            \n\n              Add the chicken, mushrooms, gnocchi and spinach to the sauce and stir until coated and the spinach wilts. Sprinkle with the parmesan, transfer the skillet to the oven and bake until bubbling, about 20 minutes. Turn on the broiler; broil until lightly browned on top, about 3 more minutes.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 8.0}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 2.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "whole milk", "quantity": 1.5}, {"food": "diced chicken", "quantity": 1.0}, {"food": "nutmeg", "quantity": 0.25}, {"food": "diced chicken", "quantity": 0.5}, {"food": "potato flour", "quantity": 1.0}, {"food": "mustard spinach", "quantity": 1.5}, {"food": "parmesan cheese", "quantity": 0.25}], "title": "\nBaked Gnocchi with Chicken\n"}, {"directions": "\n\n              Toss one 17.5-ounce package gnocchi with 1 bunch chopped broccoli rabe or kale, 1/2 cup chicken broth, 1/4 cup grated parmesan, 3 tablespoons olive oil, 1 grated garlic clove, and salt and pepper to taste in a 1 1/2-quart baking dish. Cover and bake at 400 degrees F until the gnocchi is cooked through, 30 minutes. Uncover; sprinkle with more parmesan and broil until golden.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [], "title": "\nBaked Gnocchi with Greens\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Combine the goat cheese, cream cheese, parmesan and 2 tablespoons olive oil in a food processor and season with pepper; puree until smooth. Brush a 1-quart baking dish with olive oil, then spread the cheese mixture in the dish, mounding it slightly higher around the edge than in the middle. Bake until golden and heated through, about 15 minutes.\n            \n\n              Meanwhile, combine the tomatoes, chives, vinegar, garlic, the remaining 2 tablespoons olive oil and 1/2 teaspoon salt in a medium bowl. Spoon the tomato mixture on top of the dip. Serve with baguette slices.\n            \n\n              Photograph by Andrew Purcell\n            \n", "ingredients": [{"food": "macaroni cheese", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "parmesan cheese", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "pepper", "quantity": 1}, {"food": "fruit cocktail", "quantity": 8.0}, {"food": "chives", "quantity": 2.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "luncheon slices", "quantity": 1}], "title": "\nBaked Goat Cheese Dip\n"}, {"directions": "\n\n              Preheat oven to 450 degrees F.\n            \n\n              In a medium gratin dish or baking dish, make a bed of herbs with the thyme, parsley and bay leaves, scatter the garlic on top. Reserve 4 parsley sprigs, for garnish. Season both sides of the fish with salt and pepper and lay on top of the herbs. Add in the vermouth, and drizzle 2 tablespoons of the oil over the fish, cover loosely with foil. Bake until the fish is opaque, about 20 to 22 minutes.\n            \n\n              Carefully, pour the pan juices into a small saucepan and set the fish aside. Keep the garlic and 4 thyme sprigs for garnish. Bring the sauce to a boil, over high heat, reduce by about 1/2, about 5 minutes. Whisk in the remaining 2 tablespoons olive oil and the lemon juice. Season with salt and pepper, to taste. Set aside. De-bone the fish; running a spoon handle along each side of the center bone, then lift the bone out. Peel side off and discard. Divide fish steaks in half crosswise, among 4 serving plates. Pour sauce over fish and serve with a dollop of tapenade, if using, on top and garnish with the thyme sprigs, garlic, and tomatoes.\n            \n\nTapenade:\n\n\n              To make the tapenade: Combine the olives, oil, thyme, and lemon zest, stir to combine. Season with pepper and set aside.\n            \n", "ingredients": [{"food": "thyme", "quantity": 4.0}, {"food": "parsley", "quantity": 8.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "garlic powder", "quantity": 8.0}, {"food": "hearts of palm", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 0.75}, {"food": "vegetable oil", "quantity": 4.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 12.0}, {"food": "", "quantity": 1}, {"food": "olives", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nBaked Halibut with Wine and Herbs\n"}, {"directions": "\n\n              Preheat oven to 450 degrees F.\n            \n\n              In a medium gratin dish or baking dish, make a bed of herbs with the thyme, parsley and bay leaves, scatter the garlic on top. Reserve 4 parsley sprigs, for garnish. Season both sides of the fish with salt and pepper and lay on top of the herbs. Add in the vermouth, and drizzle 2 tablespoons of the oil over the fish, cover loosely with foil. Bake until the fish is opaque, about 20 to 22 minutes.\n            \n\n              Carefully, pour the pan juices into a small saucepan and set the fish aside. Keep the garlic and 4 thyme sprigs for garnish. Bring the sauce to a boil, over high heat, reduce by about 1/2, about 5 minutes. Whisk in the remaining 2 tablespoons olive oil and the lemon juice. Season with salt and pepper, to taste. Set aside. De-bone the fish; running a spoon handle along each side of the center bone, then lift the bone out. Peel side off and discard. Divide fish steaks in half crosswise, among 4 serving plates. Pour sauce over fish and serve with a dollop of tapenade, if using, on top and garnish with the thyme sprigs, garlic, and tomatoes.\n            \n\nTapenade:\n\n\n              To make the tapenade: Combine the olives, oil, thyme, and lemon zest, stir to combine. Season with pepper and set aside.\n            \n", "ingredients": [{"food": "thyme", "quantity": 4.0}, {"food": "parsley", "quantity": 8.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "garlic powder", "quantity": 8.0}, {"food": "hearts of palm", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 0.75}, {"food": "vegetable oil", "quantity": 4.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 12.0}, {"food": "", "quantity": 1}, {"food": "olives", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nBaked Halibut with Wine and Herbs\n"}, {"directions": "\n\n              Remove the ham from the refrigerator 1 hour before baking. Trim off any skin, leaving an even layer of fat (about 1/2 inch thick). Use a sharp paring knife to score through the fat in a diagonal crosshatch pattern without cutting through to the meat. Place the ham, flat-side down, on a roasting rack set in a large roasting pan.\n            \n\n              Position a rack in the lower third of the oven; preheat to 350 degrees F. Combine the orange juice, 1 cup chicken broth and the melted butter in a measuring cup. Pour over the ham and tent with foil. Bake, basting with the pan juices every 30 minutes, until a thermometer inserted into the thickest part of the ham registers 130 degrees F, 2 to 2 1/2 hours.\n            \n\n              Make the glaze: Remove the ham from the oven, spoon out about 1/4 cup of the pan juices and transfer to a medium bowl. Whisk the pepper jelly, mustard, brown sugar, marmalade, vinegar, thyme, chile powder, coriander, cayenne and orange zest into the bowl.\n            \n\n              Brush the ham with about one-quarter of the glaze. Add the remaining 1 cup broth to the pan. Return to the oven and bake, brushing the ham with more glaze twice (reserve some for finishing), until the surface is caramelized and a thermometer inserted into the thickest part registers 140 degrees F, 1 1/2 to 2 more hours. Transfer the ham to a cutting board. Brush with the reserved glaze; let rest 15 minutes before carving.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "ham", "quantity": 1.0}, {"food": "grape juice", "quantity": 1.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "butter oil", "quantity": 3.0}, {"food": "hot pockets ham cheese stuffed swich", "quantity": 0.5}, {"food": "mustard spinach", "quantity": 0.5}, {"food": "sugar", "quantity": 0.5}, {"food": "orange", "quantity": 0.25}, {"food": "vinegar", "quantity": 0.25}, {"food": "thyme", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "ground turkey", "quantity": 1.0}, {"food": "pepper", "quantity": 0.5}], "title": "\nBaked Ham with Orange-Pepper Glaze\n"}, {"directions": "\n\n              Preheat oven to 400 degrees F and spray a baking dish with cooking spray.\n            \n\n              Put the chicken in the baking dish and season with salt and pepper. Pour the hoisin sauce over the chicken and turn the chicken to coat evenly. Bake until opaque and cooked through, about 18 to 20 minutes.\n            \n\n              Meanwhile, pour an inch or more of water in a skillet or wok and bring to a boil over medium-high heat. Place the broccoli stems in a bamboo or collapsible steamer. Set the steamer over the boiling water, cover, and cook 2 to 3 minutes. Add the florets and continue to cook just until the vegetables are crisp tender and bright green, 2 to 3 minutes more. Season with the salt and pepper.\n            \n\n              Divide the chicken and broccoli among 4 plates and serve.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "fat free chicken breast ", "quantity": 4.0}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 0.75}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}], "title": "\nBaked Hoisin Chicken with Steamed Broccoli\n"}, {"directions": "\n\n              Preheat the oven to 450. Lightly grease a 24-cup mini muffin pan or spray with nonstick cooking spray.\n            \n\n              In a medium bowl, combine the cornmeal, flour, baking powder, salt and pepper.\n            \n\n              In a separate bowl, mix together the onion, milk, eggs and butter. Fold the egg mixture into the flour mixture until the flour mixture is just moistened.\n            \n\n              Spoon 1 tablespoon of the batter into each of the prepared mini muffin cups. Bake for 10 minutes, or until the hush puppies are firm to the touch and golden brown around the edges.\n            \n\n              Photograph by Hallie Burton\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1}, {"food": "yellow rice", "quantity": 0.6666666666666666}, {"food": "potato flour", "quantity": 0.3333333333333333}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 0.75}, {"food": "black bean mango", "quantity": 0.125}, {"food": "onion powder", "quantity": 0.5}, {"food": "milk", "quantity": 0.3333333333333333}, {"food": "eggs", "quantity": 2.0}, {"food": "butter oil", "quantity": 2.0}], "title": "\nBaked Hush Puppies\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: a 9-inch springform pan\n\n              Bring a large saucepan of generously salted water to a boil. Add half the noodles, dropping each in separately, and cook, stirring gently, until pliable but still firm, about 4 minutes. Lift the noodles out of the water with a slotted spoon then lay them on a sheet of foil in a single layer, not touching. Lightly drizzle the noodles with 1 tablespoon olive oil then rub them all over to coat well. Repeat with the remaining noodles and 1 tablespoon olive oil.\n            \n\n              Heat 2 tablespoons of the olive oil in a medium saucepan over medium-low heat Add the onion and cook, stirring occasionally, until completely soft and starting to caramelize, about 20 minutes. Stir in the tomato paste and garlic and cook, stirring until lightly caramelized, 1 to 2 minutes. Add the tomatoes, bay leaf and 1 cup water and bring to a boil over high heat. Reduce the heat to maintain a simmer and cook, stirring occasionally, until the sauce is slightly thickened, about 10 minutes. Discard the bay leaf. Carefully puree the sauce in a blender until smooth and return it to the pot. Stir in the parsley and season with salt and pepper. \n            \n\n              Preheat the oven to 375 degrees F. Shred half of the mozzarella on the large holes of a box grater. Add it to a large bowl, along with the ricotta, Parmesan, basil, eggs, 1 teaspoon salt and the 1/2 teaspoon pepper and stir to combine. Divide the ricotta mixture among the noodles, putting 2 to 3 tablespoons in each, and spread into an even layer. Reserve the remaining piece of mozzarella.\n            \n\n              Lightly grease a 9-inch springform pan with the remaining 1 tablespoon olive oil and spread 1/2 cup of the sauce over the bottom. Cut each lasagna noodle in half lengthwise then roll each noodle strip into a pinwheel. Rotate the pinwheels so the frilly ends are on top, then transfer them to the prepared pan in a snug, even layer. Pour the remaining sauce over the noodles, using the back of a spoon to spread it evenly over the top and into any gaps.\n            \n\n              Cover the pan with foil and bake until the noodles are tender and the lasagna is warmed through and bubbling, about 30 minutes. Remove the pan from the oven. Tear the remaining mozzarella into pieces and scatter them over the noodles. Return the lasagna to the oven until the mozzarella is just melted, 5 minutes. Let cool 10 minutes before unmolding. Carefully remove the sides of the pan, top with basil leaves and serve immediately.\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "lasagna", "quantity": 17.0}, {"food": "vegetable oil", "quantity": 5.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "tomatoes", "quantity": 15.0}, {"food": "corier leaf", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "seasoning mix", "quantity": 0.5}, {"food": "whole milk", "quantity": 1.0}, {"food": "", "quantity": 8.0}, {"food": "", "quantity": 0.5}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}], "title": "\nBaked Lasagna Roll-Ups\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Season the chicken with salt and pepper. Dredge in the flour and pat off the excess. Heat a large skillet over medium heat and add 2 tablespoons of the oil. Add the chicken skin-side down and saute until golden brown, about 5 minutes per side. Remove the chicken from the skillet and reserve. Discard the oil and wipe the pan out with a paper towel. Add the remaining 1 tablespoon oil and heat over medium-low heat. Add the onion and cook until golden, about 10 to 12 minutes. Add the lemon zest, garlic, and rosemary, and cook for 2 minutes more. Add the honey, lemon juice, and broth, increase the heat and bring to a simmer. Use a slotted spoon to transfer the onions to a 9- by 13-inch ovenproof casserole, and spread them out. Arrange the chicken, skin-side up in a single layer on the onions. Pour the cooking liquid over the chicken. Season with salt and pepper to taste. Bake in the oven, basting every 15 minutes, until cooked through, about 45 minutes. Remove from the oven and serve.\n            \n\n              Copyright 2001 Television Food Network, GP. All rights reserved \n            \n", "ingredients": [{"food": "diced chicken", "quantity": 3.5}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "garlic powder", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 1.5}, {"food": "honey smoked ham", "quantity": 1.0}, {"food": "lemon juice", "quantity": 0.25}, {"food": "diced chicken", "quantity": 1.0}], "title": "\nBaked Lemon Chicken\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Butter a 3-quart casserole dish.\n            \n\n              Bring a large pot of salted water to a boil. Add the macaroni and cook until tender, about 7 minutes; strain well. Transfer the macaroni to a large bowl, add the butter and toss to coat.\n            \n\n              Whisk together the milk, eggs and 2 teaspoons salt in a medium bowl. Add the milk-egg mixture to the macaroni; add the Cheddar and stir until it is evenly distributed. Pour into the prepared casserole dish.\n            \n\n              Bake until the custard is set and the top is browned and bubbling, 30 to 35 minutes.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "whole milk", "quantity": 3.0}, {"food": "eggs", "quantity": 4.0}, {"food": "yellow rice", "quantity": 0.75}], "title": "\nBaked Mac and Cheese\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F. Bring a large pot of salted water to a boil. Add the pasta and cook until just slightly softened, about 6 minutes. Reserve 1/2 cup cooking water, then drain the pasta and rinse under cold water.\n            \n\n              Meanwhile, melt 4 tablespoons butter in a large saucepan over medium heat. Whisk in the flour, mustard powder, Worcestershire sauce, hot sauce and cayenne and cook, whisking, until the mixture is smooth and slightly golden, about 2 minutes. Whisk in the milk and cook, whisking occasionally, until the sauce begins to boil and thicken, about 5 minutes. Stir in the havarti and all but 1 cup each of the cheddar and American cheese; cook, stirring, until the cheese just melts, about 1 more minute. Stir in the pasta, adding the reserved pasta water as needed to make a creamy sauce. Season with salt.\n            \n\n              Brush a 9-by-13-inch baking dish with melted butter. Spread the pasta mixture in the dish. Melt the remaining 4 tablespoons butter in a bowl in the microwave; stir in the crushed crackers and parmesan. Sprinkle the reserved cheddar and American cheese evenly over the pasta, then scatter the cracker mixture on top. Cover with aluminum foil and bake until heated through, about 25 minutes. Remove the foil; continue baking until browned and bubbly, about 20 more minutes. Let rest 10 minutes before serving.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "potato flour", "quantity": 0.25}, {"food": "onion powder", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "pepper", "quantity": 0.25}, {"food": "whole milk", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "cheddar cheese", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 12.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "parmesan cheese", "quantity": 2.0}], "title": "\nBaked Macaroni and Cheese\n"}, {"directions": "\n\n              Cook 1 1/2 cups macaroni as the label directs; drain and return to the pot. Stir in 2 cups shredded cheddar, 1 cup milk, 1/3 cup each grated parmesan and sour cream, 2 tablespoons butter, 1 tablespoon flour and 1/2 teaspoon each dijon mustard, hot sauce and kosher salt. Transfer to a buttered 1 1/2-quart baking dish; top with more cheddar and parmesan. Bake at 400 degrees F, 15 minutes, then broil until golden, 2 minutes.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [], "title": "\nBaked Macaroni and Cheese\n"}, {"directions": "\n\n              Preheat oven to 450 degrees F.\n            \n\n              Make a bed of herbs in a medium gratin dish or baking dish with the thyme, 4 of the parsley sprigs, and the bay leaves. Scatter the garlic on top. Season both sides of the fish with salt and pepper and place on top of the herbs. Add the vermouth and drizzle 2 tablespoons of the oil over the fish. Cover loosely with foil and bake until the fish is opaque, about 15 to 20 minutes, depending on how thick the fillets are.\n            \n\n              Carefully pour the pan juices into a small saucepan and set the fish aside. Reserve the garlic and 4 thyme sprigs. Bring the sauce to a boil over high heat and cook until reduced by half, about 5 minutes. Whisk in the remaining 2 tablespoons olive oil and the lemon juice. Season with salt and pepper. Set aside.\n            \n\n              Divide fish among 4 serving plates. Pour sauce over fish and garnish with the 4 remaining parsley sprigs, the reserved garlic and thyme, and tomatoes.\n            \n", "ingredients": [{"food": "thyme", "quantity": 4.0}, {"food": "parsley", "quantity": 8.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "garlic powder", "quantity": 8.0}, {"food": "vegetarian fillets", "quantity": 4.0}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 0.75}, {"food": "vegetable oil", "quantity": 4.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 12.0}], "title": "\nBaked Mahi Mahi with Wine and Herbs\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: a large pastry bag and 1/2-inch wide star tip\n\n              For the churros: Adjust the oven racks to the top and bottom thirds of the oven and preheat to 425 degrees F. Line 2 baking sheets with parchment.\n            \n\n              Bring 4 tablespoons of the butter, 1 tablespoon of the sugar, the salt and 1/2 cup of water to a boil in a small saucepan over medium heat. Add the flour and stir constantly until the mixture forms a ball. Transfer to a large bowl and beat with an electric mixer on medium-low until the dough is cool to the touch. Add the eggs one at a time and beat until incorporated. Transfer to a large pastry bag fitted with a 1/2-inch wide star tip.\n            \n\n              Pipe the batter into 2-inch lengths about 2 inches apart on the prepared baking sheets. Bake until golden brown, rotating the trays from top to bottom about halfway through, 15 to 18 minutes. Let sit on the baking sheets for a few minutes.\n            \n\n              Melt the remaining 3 tablespoons of butter in a medium microwave-safe bowl. Toss 1/4 cup sugar and 1 teaspoon cinnamon together in another medium bowl. Working in small batches, dip the churros completely in the melted butter and let any excess drip off, then toss in the cinnamon-sugar until completely coated. Once the cinnamon-sugar mixture is too wet to coat, mix together a fresh batch with the remaining 1/4 cup sugar and 1 teaspoon cinnamon. The churros can be baked and coated 1 day ahead of time and stored at room temperature in an airtight container.\n            \n\n              For the caramel-mango sauce: Bring, the sugar, salt and 1/4 cup of water to a boil in a small saucepan over medium heat. Continue to cook, swirling the saucepan occasionally but not stirring, until the mixture turns a medium caramel color (slightly darker than honey), about 5 minutes. Remove from the heat and stir in the mango and butter (take care, the mixture will bubble). Let the mixture cool for a few minutes in the saucepan, then transfer to a food processor and process until smooth. Keep refrigerated until ready to use. The caramel-mango sauce can be made a day ahead. Serve the churros with the caramel-mango sauce for dipping.\n            \n", "ingredients": [{"food": "sugar", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "potato flour", "quantity": 0.5}, {"food": "", "quantity": 1}, {"food": "butter oil", "quantity": 7.0}, {"food": "eggs", "quantity": 2.0}, {"food": "sugar", "quantity": 0.5}, {"food": "cinnamon", "quantity": 2.0}, {"food": "sugar", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "black bean mango", "quantity": 1.0}, {"food": "butter oil", "quantity": 1.0}], "title": "\nBaked Mini Churro Bites\n"}, {"directions": "\n\n              Warm the milk to about 110 degrees in a saucepan; pour into a medium bowl. Sprinkle in the yeast and let soften for about 2 minutes. Stir in the olive oil, brown sugar and cornmeal with a wooden spoon. Add the flour, salt, baking soda and cayenne pepper; stir to make a sticky dough.\n            \n\n              Turn the dough out onto a lightly floured surface and knead, adding more flour if needed, until smooth but still slightly tacky, about 5 minutes. Shape the dough into a ball, place in a lightly oiled bowl and cover with plastic wrap. Let rise in a warm spot until doubled in size, 45 minutes to 1 hour. Meanwhile, insert a wooden stick or small skewer into each hot dog half, about 1 inch deep; set aside.\n            \n\n              Preheat the oven to 450 degrees and lightly oil a large baking sheet. Turn the dough out onto a lightly floured surface; divide into 18 pieces. With your palms, roll each piece into a 10-inch length. Wrap each piece around a hot dog half, tucking and pressing the edges to seal; place on the baking sheet.\n            \n\n              Brush the dough-wrapped dogs with the beaten egg; sprinkle with sesame seeds, if desired. Bake until golden, 15 minutes.\n            \n\n              Photograph by Kate Sears\n            \n", "ingredients": [{"food": "milk", "quantity": 1.0}, {"food": "yeast extract spread", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "sugar", "quantity": 2.0}, {"food": "yellow rice", "quantity": 1.0}, {"food": "potato flour", "quantity": 1.25}, {"food": "salt", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "paprika", "quantity": 0.25}, {"food": "hot pockets ham cheese stuffed swich", "quantity": 9.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "sesame seeds", "quantity": 1.0}], "title": "\nBaked Mini Corn Dogs\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F.\n            \n\n              Toss the sweet potatoes in a medium bowl with 1 tablespoon oil, cumin and 1/4 teaspoon salt. Spread on a baking sheet and roast until soft and partially browned, 25 to 30 minutes.\n            \n\n              Spray both sides of the tortillas with cooking spray, then stack them up and cut the stack into 8 triangular pieces. Separate the tortilla pieces and lay them out onto a baking sheet. Sprinkle with the chili powder and 1/4 teaspoon salt and toss. Bake the chips until crisp, about 15 minutes, tossing the chips halfway through the baking time. Remove the chips from the oven and toss them with the lime zest.\n            \n\n              Heat 2 teaspoons of the oil in a medium skillet over medium-high heat. Add half of the onions and cook, stirring, until soft, about 4 minutes. Add the adobo sauce and tomato paste and stir until the tomato paste darkens slightly, about 2 minutes. Add the beans and 3/4 cup of water and simmer the sauce until it thickens and the beans are heated through, about 5 minutes. Set aside until ready to assemble the nachos.\n            \n\n              Combine the tomatoes, remaining onions, serrano chile, lime juice, remaining 1 teaspoon oil and 1/4 teaspoon salt in a food processor. Pulse until the mixture becomes a chunky salsa.\n            \n\n              To assemble the nachos, mound half of the tortilla chips in a 9-by-13-inch baking dish. Scatter most of the beans and the sweet potatoes over the chips. Sprinkle with half of the cheese. Mound the rest of the chips over the cheese and finish with the remaining beans, sweet potatoes and cheese. Place in the oven until the cheese melts, 5 to 7 minutes. Top with the avocado, salsa and cilantro.\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "cumin seed", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "corn bran", "quantity": 10.0}, {"food": "", "quantity": 1}, {"food": "chili powder", "quantity": 0.5}, {"food": "grape juice", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "fava beans", "quantity": 14.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "", "quantity": 1.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}, {"food": "chrysanthemum leaves", "quantity": 0.25}], "title": "\nBaked Nachos with Roasted Sweet Potatoes\n"}, {"directions": "\n\n              Peel the onions, but leave the root end intact. Pour about 2 inches of water into a large saucepan and set up a collapsible steamer inside. Steam the onions until easily pieced by a knife, about 30 minutes. (For more tender onions you may steam them a little longer; however, they might be somewhat harder to hollow out. Either way they're delicious!) Set aside to cool. \n            \n\n              Slice off about a third of the top portion of each onion. Using a paring knife, cut out the insides of each onion, leaving about 4 outside layers intact, to make a container for stuffing. Chop the onion insides and tops. \n            \n\n              Preheat the oven to 400 degrees F. \n            \n\n              Heat a large skillet over medium-high heat. Add the bacon and cook, stirring, until crispy and the fat has rendered, about 3 minutes. Add the chopped onion, herb sprigs, 1/8 teaspoon salt, and sugar. Season with pepper and cook, stirring occasionally, until lightly browned, about 12 minutes. Add the wine and cook until dry, scrapping the bottom of the skillet with a wooden spoon to get up any browned bits, about 2 minutes. Stir in the cream and remove from the heat. Remove and discard the herb sprigs. Stir in the cheese and mustard. \n            \n\n              Lightly butter a baking dish. Season the inside of the onions with salt and pepper, and spoon the stuffing into each onion cavity, mounding it slightly on top. Set the onions in the dish. \n            \n\n              Heat the butter in the skillet. Add the breadcrumbs and stir until they absorb the butter. Spoon the buttered breadcrumbs on top of each onion. \n            \n\n              Roast the onions until well browned and heated through, about 40 minutes. Serve warm or at room temperature.\n            \n", "ingredients": [{"food": "onions", "quantity": 6.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "thyme", "quantity": 1.0}, {"food": "rosemary", "quantity": 1.0}, {"food": "sage", "quantity": 1.0}, {"food": "salt", "quantity": 0.125}, {"food": "sugar", "quantity": 1}, {"food": "black bean mango", "quantity": 1}, {"food": "martha white foods", "quantity": 0.25}, {"food": "ice cream swich", "quantity": 0.25}, {"food": "macaroni cheese", "quantity": 0.75}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "", "quantity": 0.3333333333333333}], "title": "\nBaked Onions\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F. Heat 1 tablespoon of the oil in a large nonstick skillet over medium-high heat. Add the onions and cook, stirring, until just beginning to brown and soft, about 5 minutes.\n            \n\n              Add the onions, chicken broth, rice, 1/4 cup of the orange juice, 2 teaspoons of the orange zest, 1 tablespoon of oil and 3/4 teaspoon salt to a 2-quart baking dish and stir to combine.\n            \n\n              Toss the chicken with the remaining 1 tablespoon oil, 1/4 teaspoon salt and 1/4 teaspoon pepper in a medium bowl. Nestle the chicken into the rice mixture. Cover the dish with foil and transfer it to the oven, being careful not to spill.\n            \n\n              Bake for 55 minutes. Remove the foil and drizzle the chicken with 2 tablespoons of the orange juice. Continue to bake until most of the liquid has been absorbed, the chicken is fully cooked and the rice is tender, about 50 minutes more.\n            \n\n              Drizzle the chicken with the remaining orange juice. Sprinkle the mint, pine nuts and desired amount of remaining orange zest over the dish and serve.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.75}, {"food": "crisped rice bar", "quantity": 1.0}, {"food": "grape juice", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 6.0}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 2.0}, {"food": "pine nuts", "quantity": 2.0}], "title": "\nBaked Orange Chicken and Brown Rice\n"}, {"directions": "\nSpecial equipment: 2 wire racks 2 rimmed baking sheets\n\n              Adjust 2 oven racks to the top and bottom thirds of the oven and preheat to 425 degrees F. Put the wire racks in the baking sheets and coat each generously with cooking spray.\n            \n\n              Combine the flour and 3/4 teaspoon salt in a large re-sealable plastic bag. Combine the eggs and 3/4 teaspoon salt in another large plastic bag; combine the breadcrumbs, Parmesan and 3/4 teaspoon salt in a third large plastic bag.\n            \n\n              Add about a half of the zucchini sticks to the bag with the flour and use a combination of your hands and shaking the bag to coat the zucchini. Remove the zucchini and shake off any excess flour. Transfer to the egg wash and repeat until coated. (It's less messy if you use only one hand for the dry ingredients and the other for the wet.) Let any excess egg drip off before transferring to the breadcrumb mixture; repeat until fully coated (you'll still see some green and white of the zucchini peeking through the breading). Transfer to the prepared baking sheets and coat the breaded zucchini generously with cooking spray (there's no need to turn them). Repeat with the remaining zucchini.\n            \n\n              Bake, rotating the baking sheets from top to bottom about halfway through, until golden brown and tender, 25 to 30 minutes. Sprinkle with a little salt and serve warm with your favorite dipping sauces.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "eggs", "quantity": 2.0}, {"food": "", "quantity": 2.5}, {"food": "", "quantity": 0.5}, {"food": "turkey sticks", "quantity": 1.0}], "title": "\nBaked Parmesan Zucchini Fries\n"}, {"directions": "\n\n              Position a rack in the upper third of the oven and preheat to 450. Bring a large pot of salted water to a boil. Heat 1 tablespoon olive oil in a large skillet over medium-high heat. Add the pancetta and cook, stirring, until the fat renders, 2 to 3 minutes. Pour off the fat, leaving about 1 tablespoon in the pan. Add the onion and fennel and cook until the fennel is soft, about 5 minutes. Crush the tomatoes into the pan with your hands, then pour in the juices from the can and bring to a simmer. Fill the empty can with 1/2 cup of the boiling water and add to the sauce. Stir in the cream and simmer while you cook the pasta.\n            \n\n              Add the pasta to the boiling water and cook until al dente. Drain and add to the sauce. Stir in the basil and 1/2 cup parmesan. Drizzle with 1 tablespoon olive oil, season with salt and toss.\n            \n\n              Oil a 9-by-13-inch baking dish. Layer the pasta, mozzarella, fontina and the remaining 1/2 cup parmesan in the dish, alternating pasta and cheese. Drizzle with the remaining 1 tablespoon olive oil. Bake, uncovered, until browned and bubbly, about 15 minutes.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "low fat big franks", "quantity": 0.5}, {"food": "onion powder", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "plum", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "", "quantity": 12.0}, {"food": "basil", "quantity": 0.5}, {"food": "parmesan cheese", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 1.75}], "title": "\nBaked Penne with Fennel\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F.\n            \n\n              Whisk cornmeal into water, and cook until thickened, about 5 minutes. Add corn, pepper, cheese, butter, and salt. Butter a 7 by 7-inch baking dish. Pour polenta into baking dish and bake 45 minutes. Turn on broiler and broil until bubbly, 2 to 3 minutes.\n            \n\n              Copyright (c) 2004 Television Food Network, G.P., All Rights Reserved.\n            \n", "ingredients": [{"food": "coconut water", "quantity": 5.0}, {"food": "cornmeal", "quantity": 1.0}, {"food": "sunflower seed kernels", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 0.75}, {"food": "butter oil", "quantity": 2.0}, {"food": "salt", "quantity": 1.0}], "title": "\nBaked Polenta or Grits\n"}, {"directions": "\n\n              Preheat the oven to 450 degrees F. Combine the panko, oil, Parmesan, Italian seasoning and 3/4 teaspoon each salt and pepper in a large resealable plastic bag. Put the pork chops in a large bowl and toss to coat with 1 tablespoon water. Place the pork chops in the bag and shake well to coat, pressing the breadcrumb mixture firmly into the meat.\n            \n\n              Place the pork chops on a wire rack set on a baking sheet and top evenly with any breadcrumbs remaining in the bag. Bake until the breadcrumbs are dark golden and the internal temperature of the chops registers 165 degrees F on an instant-read thermometer (avoid touching bone), about 30 minutes. Serve immediately with lemon wedges, if using.\n            \n", "ingredients": [{"food": "", "quantity": 1.5}, {"food": "vegetable oil", "quantity": 5.0}, {"food": "", "quantity": 3.0}, {"food": "seasoning mix", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "pork skins", "quantity": 0.75}, {"food": "", "quantity": 1}], "title": "\nBaked Pork Chop\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Cut off the small end of the baked potato and top with the Cheddar, sour cream, bacon and chives. (Reserve the remaining potato for another use.)\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "sour cream", "quantity": 1.0}, {"food": "bacon", "quantity": 0.5}, {"food": "chives", "quantity": 1}], "title": "\nBaked Potato Bite\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Coat three 9-inch-roundcake pans with cooking spray. Prepare the cake mixes as directed; divide the batter evenly among the pans and bake 30 to 35 minutes. Let cool.\n            \n\n              Make the \"potato skin\" frosting: Beat the butter and milk with a mixer until smooth. Beat in the cocoa powder. Beat in the confectioners' sugar, 1 cup at a time, until the mixture is as thick as cookie dough. Form into 2 disks, wrap in plastic and refrigerate.\n            \n\n              Level the domed tops of 2 cakes with a serrated knife. Stack the flat cakes on a cardboard circle with vanilla frosting between each; use the remaining domed layer on top. Freeze 30 minutes.\n            \n\n              Trim the cake into a potato shape with a small serrated knife; reserve the trimmings. Cover the cake with a thin layer of vanilla frosting.\n            \n\n              Dust a sheet of parchment paper with cocoa powder. Remove 1 disk of chocolate frosting from the refrigerator and roll into a 5-by-10-inch oval, dusting with more cocoa. Repeat with the other disk of frosting.\n            \n\n              Use the parchment to press the frosting sheets against the cake as shown, leaving a few inches on top uncovered. Dust with more cocoa. (Don't worry about how the bottom of the cake looks-it will be covered with foil.)\n            \n\n              Gently fold back the frosting on top. Crumble about 1/2 cup of the cake trimmings (use the light inside pieces) and sprinkle them on top of the cake.\n            \n\n              Unwrap the candies and microwave until soft but not melted, about 12 seconds. Stack the candies, then flatten with your fingers. Set on top of the cake.\n            \n\n              When ready to serve, snip the mint leaves on top of the cake. Carefully wrap the bottom half of the cake with a large sheet of foil.\n            \n\n              Photograph by Andrew Purcell\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "shortening cake mix", "quantity": 2.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "milk", "quantity": 1.0}, {"food": "onion powder", "quantity": 2.0}, {"food": "sugar", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "yellow rice", "quantity": 3.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}], "title": "\nBaked Potato Cake\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F.\n            \n\n              Toss the potatoes in a bowl with the oil, salt, and pepper until completely coated. Place on a baking sheet and bake until fork tender, about 45 minutes.\n            \n\n              Meanwhile, bring a small pot of water to a boil and salt it generously. Fill a medium bowl with ice water. Put the chives in the boiling water and cook until bright green, about 30 seconds. Immediately, plunge into the ice water to set the color. Squeeze all the water out of the chives and give them a rough chop. Put into a blender with the sour cream. Pulse until you have a smooth green sauce and season with salt and pepper, to taste. Chill until ready to serve. (Or, thinly slice the chives and stir into the sour cream, season with salt and pepper, to taste.)\n            \n\n              Cut the potatoes lengthwise and then across. Pinch and press the sides to open the potatoes. Divide the butter among the potatoes and serve with the sour cream. Garnish with crumbled bacon if desired.\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "seasoning mix", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "chives", "quantity": 1.0}, {"food": "sour cream", "quantity": 0.5}, {"food": "butter oil", "quantity": 4.0}, {"food": "bacon", "quantity": 2.0}], "title": "\nBaked Potatoes\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F. Slice off and reserve the top 1 1/2 inches of the pumpkin. Scoop out the seeds and stringy pulp. Rub the inside of the pumpkin with the butter, then rub with 1 tablespoon brown sugar and a pinch of salt.\n            \n\n              Combine the rice, evaporated milk, molasses, vanilla, cinnamon, the remaining 3 tablespoons brown sugar and a pinch of salt in a small saucepan and bring to a boil, stirring occasionally.\n            \n\n              Put the pumpkin in a baking dish and fill the pumpkin with the rice mixture. Cover with the pumpkin top and add 1 inch of boiling water to the baking dish. Cover loosely with foil and bake until the pumpkin is tender and the rice pudding is thick, about 2 hours. Scrape the pumpkin flesh and stir into the rice pudding; sprinkle with brown sugar.\n            \n\n              Photograph by David Malosh\n            \n", "ingredients": [{"food": "sugar", "quantity": 1.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "crisped rice bar", "quantity": 0.6666666666666666}, {"food": "milk", "quantity": 1.0}, {"food": "molasses", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.25}, {"food": "cinnamon", "quantity": 0.25}], "title": "\nBaked Pumpkin Rice Pudding\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F. Whisk the ricotta, lemon zest, thyme, rosemary, 1/4 teaspoon kosher salt and the red pepper flakes in a medium bowl until smooth and creamy.\n            \n\n              Transfer to a 2-cup ramekin and sprinkle with the parmesan. Bake until golden and bubbling, about 15 minutes. Drizzle with the olive oil and sprinkle with sea salt. Serve with bread.\n            \n\n              Photograph by Andrew Purcell\n            \n", "ingredients": [{"food": "macaroni cheese", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "thyme", "quantity": 1.0}, {"food": "rosemary", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "hearts of palm", "quantity": 1}, {"food": "parmesan cheese", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "garlic bread", "quantity": 1}], "title": "\nBaked Ricotta with Lemon and Herbs\n"}, {"directions": "\n\n              Preheat the oven to 450 degrees F. Bring a large pot of salted water to a boil. Cook the rigatoni until very al dente, 2 to 3 minutes less than the label directs; drain.\n            \n\n              Heat the olive oil in a large skillet over medium heat. Add the garlic and red pepper flakes and cook until the garlic is golden. Crush the plum tomatoes into the skillet with your hands; rinse out each can with 1/2 cup water and add the water to the skillet. Add the basil; simmer, uncovered, until the sauce is thickened, about 15 minutes. Discard the basil; season the sauce with salt. (Alternatively, heat 4 cups prepared tomato sauce.)\n            \n\n              Stir the pancetta into the sauce, then add the meatballs, roasted red peppers and olives.\n            \n\n              Brush a 3-to-4-quart baking dish with olive oil. Toss the cooked pasta with the sauce and half of each cheese. Spread in the prepared baking dish. Sprinkle the remaining cheese over the pasta. Bake, uncovered, until browned, about 15 minutes. Let rest 15 minutes before serving.\n            \n\n              Photograph by Lisa Shin\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "plum", "quantity": 1.0}, {"food": "plum", "quantity": 1.0}, {"food": "basil", "quantity": 4.0}, {"food": "diced chicken", "quantity": 0.75}, {"food": "meatballs", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 3.0}, {"food": "", "quantity": 1.0}], "title": "\nBaked Rigatoni With Meatballs and Peppers\n"}, {"directions": "\n\n              Preheat the broiler. Bring a large pot of salted water to a boil. Add the pasta and cook as the label directs for al dente. Reserve 1/2 cup cooking water, then drain.\n            \n\n              Meanwhile, heat the olive oil in a large pot over medium-high heat. Add the sausage and cook, breaking it up into pieces, until browned, 3 to 5 minutes. Add the onion and chard stems; cook, stirring, until softened, 3 to 5 minutes. Add the garlic and cook 30 seconds. Add the tomatoes, oregano, 1/4 teaspoon salt and a few grinds of pepper.\n            \n\n              Cook, stirring, until thickened, about 4 minutes. Add the chard leaves and cook, stirring, until softened, about 3 minutes. Add the pasta and 1/4 cup reserved cooking water to the sauce and stir to coat, adding more cooking water as needed to loosen; season with salt and pepper. Transfer to a 3-quart baking dish. Dollop spoonfuls of the ricotta on top, then sprinkle with the mozzarella. Broil until golden brown and bubbling, 3 to 5 minutes. Let rest 5 minutes before serving. Sprinkle with parmesan.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "", "quantity": 12.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "sausage", "quantity": 12.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "whole milk", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "pepper", "quantity": 1}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 0.75}, {"food": "macaroni cheese", "quantity": 1}], "title": "\nBaked Rigatoni with Swiss Chard and Sausage\n"}]