[{"directions": "\n\n              Heat the oil in a large, heavy-bottomed pot over medium-high heat, until shimmering. Add the mushrooms and cook, stirring, until soft and brown, about 5 minutes. Add the onions and cook stirring, until soft and golden, about 8 minutes. Add the celery, carrots, peppers and garlic and cook, stirring, until the vegetables begin to brown and become fragrant, about 5 minutes. Stir in the soy sauce, garlic and onion powder, 2 teaspoons salt and 1 teaspoon pepper.\n            \n\n              Add the cabbage to the pot and stir until it begins to wilt, about 2 minutes. Pour in the crushed tomatoes, chicken broth and 1 cup water. Stir to combine. Bring to a boil then reduce to a simmer and cook until the cabbage is tender, 30 to 45 minutes. Season with salt and pepper.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 8.0}, {"food": "onion powder", "quantity": 2.0}, {"food": "celery seed", "quantity": 1.0}, {"food": "carrots", "quantity": 3.0}, {"food": "peppers", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "swamp cabbage", "quantity": 1}, {"food": "soy sauce", "quantity": 2.0}, {"food": "garlic powder", "quantity": 0.5}, {"food": "onion powder", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "tomatoes", "quantity": 28.0}, {"food": "diced chicken", "quantity": 4.0}], "title": "\nCabbage Soup\n"}, {"directions": "\n\n              Peel 1 medium kohlrabi or turnip and cut into matchsticks. Whisk the juice of 1/2 lemon, 1/4 cup chopped dill, 1/2 clove minced garlic, 1 teaspoon dijon mustard, and salt and pepper in a bowl; whisk in 3 tablespoons olive oil. Toss with the kohlrabi, 1/4 head shredded Savoy cabbage, and salt and pepper to taste.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nCabbage-Kohlrabi Slaw\n"}, {"directions": "\n\n              Boil 1 pound quartered, peeled Yukon gold potatoes in salted water until tender. Reserve 1/4 cup cooking water, then drain. Saute 2 cups shredded cabbage in butter, 2 minutes. Add the reserved cooking water, cover and cook 3 minutes. Add the potatoes, 4 sliced scallions, 1/2 cup half-and-half, 2 tablespoons butter and a pinch of nutmeg. Mash until smooth. Season with salt and pepper.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nCabbage-Potato Mash\n"}, {"directions": "\n\n              Put the potatoes in a medium pot and cover with cold water by 1 inch. Bring to a simmer over medium heat and cook until easily pierced with a knife, 20 to 25 minutes. Drain and let cool slightly. Peel the potatoes and pass through a ricer onto a clean surface in a thin layer (do not mound the riced potatoes). Let cool completely, at least 10 minutes.\n            \n\n              Combine 1 teaspoon salt, the finely ground pepper and the nutmeg in a small bowl; sprinkle over the riced potatoes. Drizzle the beaten egg over the potatoes, then sprinkle with 1 cup flour and 1/2 cup pecorino. Chop the potato mixture with a bench scraper, turning the mixture onto itself until it just starts to come together. Lightly dust the dough with flour and knead, adding up to 1/4 cup more flour if needed, until the dough is almost smooth and slightly wet but not sticky. Form the dough into a ball.\n            \n\n              Cut the dough into 4 pieces using the bench scraper; keep covered with a kitchen towel until ready to use. Cut 1 piece of dough in half; dust with flour and gently roll each half into a 1/2-inch-thick rope. Cut each rope into 1/2-inch pieces with the bench scraper or a sharp knife and dust with flour. Repeat with the remaining dough.\n            \n\n              Line 2 baking sheets with clean kitchen towels; dust with flour. Lightly flour your hands and roll each piece of dough between your palms to make a small ball. One at a time, place each dough ball on the tines of a fork closest to the handle and hold it in place with a floured thumb. In one gentle motion, quickly press and roll the dough along the tines toward the tip of the fork. Transfer to the prepared baking sheets. (The uncooked gnocchi can be frozen at this point. Freeze on the baking sheets until firm, then transfer to a resealable plastic bag and freeze up to 3 weeks.)\n            \n\n              Preheat the broiler and bring a large pot of salted water to a boil. Melt the butter in a large ovenproof skillet over medium heat. Stir in the coarsely ground pepper and cook until toasted, about 30 seconds. Add 3/4 cup of the boiling water. Bring to a boil and cook until reduced by half, 2 to 3 minutes. Remove from the heat.\n            \n\n              Working in batches, shake the gnocchi in a colander to remove any excess flour, then add to the pot of boiling water and cook until the gnocchi float to the top, about 2 minutes. Remove the gnocchi with a slotted spoon or spider and transfer to the skillet with the butter sauce, off the heat. Once all the gnocchi are in the skillet, stir to coat and return the skillet to medium heat. Bring the sauce to a boil, adding up to 1/4 cup of the cooking water if the gnocchi seem dry. Remove from the heat and stir in 1/4 cup each pecorino and parmesan. Sprinkle the remaining 1/4 cup each pecorino and parmesan over the top. Transfer the skillet to the broiler and broil until browned and bubbling, 1 to 2 minutes.\n            \n\n              Photograph by Ryan Liebe\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "ground turkey", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "egg substitute", "quantity": 1.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "parmesan cheese", "quantity": 0.5}], "title": "\nCacio E Pepe Gnocchi\n"}, {"directions": "\n\n              Make the dough: Combine the flour, salt and pepper in a large bowl. Make a well in the center and pour in the warm water. Sprinkle the sugar and yeast over the water and let stand until bubbling, 5 to 10 minutes. Pour the olive oil into the well, then stir with a wooden spoon to make a shaggy dough. Turn out onto a lightly floured surface and knead until smooth and elastic, about 5 minutes. Place in a lightly oiled bowl, tightly cover with plastic wrap and let rise in a warm place until doubled in size, about 2 hours.\n            \n\n              Make the pizza: One hour before baking, put a pizza stone or inverted baking sheet in the lower third of the oven and preheat to 500 degrees F. On a lightly floured surface, stretch the dough into a 12-inch round. Transfer the dough to a well-floured pizza peel or another inverted baking sheet. Dot with the ice and drizzle with 2 tablespoons olive oil. Slide the pizza onto the hot stone. Bake until the crust is golden brown and the ice melts, 12 to 13 minutes.\n            \n\n              Transfer the pizza to a cutting board and cover with small spoonfuls of the ricotta. Sprinkle with the pecorino and pepper; drizzle the remaining 2 tablespoons olive oil on top and season with salt.\n            \n\n              Photograph by Ryan Liebe\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.75}, {"food": "salt", "quantity": 1.0}, {"food": "pepper", "quantity": 1.0}, {"food": "coconut water", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "yeast extract spread", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "pepper", "quantity": 2.0}, {"food": "salt", "quantity": 1}], "title": "\nCacio E Pepe Pizza\n"}, {"directions": "\nSpecial equipment: a 3-inch round cutter\n\n              Preheat the oven to 400 degrees F. Line a baking sheet with parchment.\n            \n\n              Whisk together the flour, baking powder, black pepper and salt. Rub the butter into the flour mixture with your fingertips, until it is in even pieces about the size of a pea. Stir in 1 cup Pecorino-Romano, then gently stir the in the milk with a fork to make a loose dough.\n            \n\n              Turn the dough out onto a lightly-floured work surface. Pat into a 1/2-inch-thick rectangle. Fold the dough into thirds like a business letter. Pat into an 8-by-5-inch rectangle about 3/4-inch thick. Use a 3-inch round cutter to make 6 biscuits. Press together the scraps of dough, cut 2 more biscuits, and put all of them on the prepared baking sheet. \n            \n\n              Lightly brush the tops of the biscuits with the cream, then sprinkle them equally with the remaining 2 tablespoons Pecorino-Romano and a pinch of black pepper. Bake until puffed and golden brown on top, 20 to 22 minutes. Cool on a rack for 5 minutes before serving.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "butter oil", "quantity": 7.5}, {"food": "", "quantity": 1.0}, {"food": "milk", "quantity": 0.75}, {"food": "ice cream swich", "quantity": 2.0}], "title": "\nCacio e Pepe Biscuits\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the pasta and cook as the label directs, adding the peas during the last 4 minutes of cooking. Reserve 1 3/4 cups cooking water, then drain.\n            \n\n              Heat the butter and olive oil in a large skillet over medium-high heat. Add 1 cup of the reserved cooking water and 2 teaspoons pepper. Increase the heat to high and boil until the liquid is reduced by half, about 3 minutes.\n            \n\n              Add the pasta and peas to the skillet and simmer, tossing, until well coated. Remove from the heat and sprinkle with the parmesan, pecorino and parsley; toss until the cheese melts and the sauce is creamy, adding the remaining 3/4 cup cooking water as needed to loosen. Top each serving with more cheese.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "spaghetti", "quantity": 12.0}, {"food": "pigeon peas", "quantity": 1.0}, {"food": "butter oil", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "parmesan cheese", "quantity": 0.75}, {"food": "macaroni cheese", "quantity": 0.5}, {"food": "parsley", "quantity": 0.25}], "title": "\nCacio e Pepe with Peas\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 425 degrees F. Line a rimmed baking sheet with foil.\n            \n\n              Spread the chicken on the prepared baking sheet and roast, flipping halfway with tongs, until very crisp, 45 to 50 minutes.\n            \n\n              Meanwhile, whisk together the mayonnaise, Worcestershire, garlic and lemon juice in a large bowl. Season with salt and a generous amount of pepper. Reserve 1/2 cup of the sauce in a small bowl for dipping. \n            \n\n              Using tongs, transfer the hot wings to the large bowl of sauce; sprinkle with 2 tablespoons of the Parmesan and toss well to coat. Transfer to a serving bowl and top with the remaining 2 tablespoons Parmesan and several grinds of black pepper. Serve with the romaine, breadsticks and reserved sauce for dipping. \n            \n", "ingredients": [{"food": "diced chicken", "quantity": 3.0}, {"food": "mayonnaise dressing", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 3.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 0.25}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "", "quantity": 1}], "title": "\nCaesar Chicken Wings\n"}, {"directions": "\n\n              Puree minced garlic and anchovies, lemon juice, Worcestershire sauce, salt, pepper and 1 egg yolk; with machine running, slowly add 1/4 cup olive oil. Toss with romaine; top with parmesan and croutons.\n            \n\n              See all 50 Simple Salads\n            \n", "ingredients": [], "title": "\nCaesar Salad\n"}, {"directions": "\n\n              For the Caesar salad dressing: Combine the garlic, mustard, vinegar and two pinches of salt in a blender and mix thoroughly. Add the mayonnaise and blend together to form a thick base. In a slow stream add the olive oil through the hole in lid. Scrape the dressing with spatula into a bowl and season to taste with salt, pepper and lemon juice. If desired, add some anchovy to the dressing to create a deeper, saltier taste.\n            \n\n              For the Caesar salad croutons: Cut the baguette into cubes. Melt the butter in a skillet and add the garlic powder, paprika and pepper. Add the bread cubes and saute just until the bread cubes begin to brown. Set aside to cool.\n            \n\n              Wash and dry the lettuce. In a large salad bowl, combine the lettuce, dressing and croutons. Top with freshly grated Parmesan. Toss gently to combine well;\n            \n", "ingredients": [{"food": "garlic powder", "quantity": 6.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "mayonnaise dressing", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "grape juice", "quantity": 1}, {"food": "anchovy", "quantity": 1}, {"food": "", "quantity": 1.0}, {"food": "butter oil", "quantity": 3.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "paprika", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1.0}, {"food": "lettuce", "quantity": 1}, {"food": "", "quantity": 1}], "title": "\nCaesar Salad\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              For the pizza dough: Heat 1/4 cup of the olive oil and the garlic in a small saucepan over medium-low heat until the garlic is softened but not browned, about 5 minutes. Stir in 1/2 teaspoon pepper. Cool slightly.\n            \n\n              Whisk the water and sugar in a bowl; sprinkle the yeast over top. Set aside until foamy, about 10 minutes. Stir in the olive oil-garlic mixture.\n            \n\n              Whisk the flour and 2 teaspoons salt in a large bowl. Make a well in the center of the flour and pour in the yeast mixture. Gradually stir with a wooden spoon to make a rough dough.\n            \n\n              Turn the dough out onto a lightly floured surface. Knead until smooth and elastic, about 5 minutes, dusting with more flour as necessary. Form into a large ball. Brush a large bowl with olive oil, add the dough and turn to coat. Cover tightly with plastic wrap and set aside at room temperature until doubled in size, about 1 hour.\n            \n\n              Meanwhile, adjust an oven rack to the lowest position and preheat to 450 degrees F. Put a baking sheet on the rack to heat up while the dough rises. (The baking sheet should be the same size or slightly larger than the baking sheet that you will later form the dough on.)\n            \n\n              Once the dough has doubled in size, brush a rimmed baking sheet generously with half of the remaining olive oil. Put the dough onto the oiled baking sheet and stretch and pat evenly into the pan, making sure that it reaches the edges. Use your fingertips to make dimples all over the dough. Brush with the remaining olive oil and sprinkle lightly with salt. Arrange the tomato slices on the pizza in a single layer, making sure that each bite will have a piece of tomato. Sprinkle the tomatoes lightly with salt. Place the baking sheet with the dough directly on top of the preheated baking sheet in the oven (this helps with a crispy crust). Bake for 15 minutes. Remove the baking sheets and sprinkle the Parmesan over the dough. Continue to bake until the dough is golden brown and the cheese is melted, 10 to 15 minutes\n            \n\n              While the pizza is baking, make the Caesar dressing: Whisk together the lemon zest and juice, egg yolk, anchovies, garlic and honey in a large bowl. Slowly whisk in the olive oil, season with 1/4 teaspoon salt and a few grinds of pepper.\n            \n\n              Remove the pizza from the oven and transfer to a large platter or cutting board. Toss the romaine with the dressing. Season with additional salt and pepper if needed. Top the pizza with the salad. Use a vegetables peeler to shave ribbons of Parmesan over the salad. Drizzle with olive oil, cut into pieces and serve.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.6666666666666666}, {"food": "garlic powder", "quantity": 6.0}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 1.3333333333333333}, {"food": "sugar", "quantity": 1.0}, {"food": "yeast extract spread", "quantity": 0.25}, {"food": "potato flour", "quantity": 3.75}, {"food": "salt", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "", "quantity": 0.75}, {"food": "grape juice", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "anchovies", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "honey smoked ham", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "black bean mango", "quantity": 1}, {"food": "hearts of palm", "quantity": 2.5}, {"food": "hearts of palm", "quantity": 1}], "title": "\nCaesar Salad Pizza\n"}, {"directions": "\n\n              Preheat the oven to 450 degrees F. Halve the potatoes and place on a baking sheet. Then smash 3 of the garlic cloves and toss them with the potatoes, thyme, oil, 3/4 teaspoon salt and 1/2 teaspoon pepper. Roast the potatoes until golden and tender, about 40 minutes.\n            \n\n              Preheat the grill to high heat.\n            \n\n              While potatoes roast, mash the remaining 2 garlic cloves with the anchovies and a large pinch of salt into a paste. Rub the paste all over the steaks, and then sprinkle each steak with 1/2 teaspoon salt and 1/4 teaspoon pepper. Grill the steaks, turning occasionally, until grill marks appear, about 8 minutes for medium-rare. Let the steaks rest while making the sauce.\n            \n\n              Heat 1 tablespoon of the butter in a medium saucepan over medium-high heat until hot. Stir in the shallots and cook until golden, about 3 minutes. Whisk in the beer, Worcestershire and hot sauce. Simmer until the liquid is reduced to half, about 4 minutes. Stir together the cornstarch and 2 teaspoons water and whisk into the simmering sauce until thickened, about 30 seconds. Remove the saucepan from the heat and whisk in the remaining 2 tablespoons butter, 1 tablespoon at a time. Season the sauce with 1/4 teaspoon salt and pepper to taste.\n            \n\n              Slice the steaks and serve with the sauce and potatoes.\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 2.0}, {"food": "garlic powder", "quantity": 5.0}, {"food": "thyme", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "black bean mango", "quantity": 1}, {"food": "anchovy", "quantity": 2.0}, {"food": "", "quantity": 1.25}, {"food": "butter oil", "quantity": 3.0}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 0.5}, {"food": "cornstarch", "quantity": 1.0}], "title": "\nCaesar T-Bone Steak with Stout Pan Sauce\n"}, {"directions": "\n\n              Brown 1 pound ground beef in a large skillet with olive oil. Add 1 chopped onion, 3 chopped garlic cloves, 2 teaspoons each ground cumin and smoked paprika and 1/4 teaspoon cayenne pepper; cook 1 minute. Stir in 1 cup ketchup, 2 tablespoons apple cider vinegar, 1 tablespoon brown sugar and 1/2 cup water and simmer until thick, about 15 minutes. Serve on slider rolls with potato chips.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [], "title": "\nCafeteria Sloppy Joes\n"}, {"directions": "\n\n              Combine 1 cup barbecue sauce, 1/4 cup bourbon and 2 teaspoons Cajun seasoning in a saucepan. Simmer until slightly thick, stirring occasionally, 20 minutes.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [], "title": "\nCajun BBQ Sauce\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Cut each chicken breast in half horizontally to form 4 thinner cutlets. Toss the chicken with the olive oil, then rub all over with the Cajun seasoning; set aside.\n            \n\n              Cook the bacon in a large nonstick skillet over medium heat, stirring occasionally, until crisp, about 7 minutes. Remove and drain on paper towels. Pour off all but 1 tablespoon of the drippings from the skillet. Add the chicken and cook until browned, about 3 minutes per side. Transfer to a baking sheet; bake until cooked through, about 8 minutes.\n            \n\n              Meanwhile, add the bell pepper and scallion whites to the skillet. Cook until the scallions are wilted, about 2 minutes. Add the beans, corn and sofrito. Cook, stirring occasionally, until warmed through, about 2 minutes. Add 1 cup water and the heavy cream; bring to a simmer. Cook until the vegetables are tender and the sauce thickens, about 5 minutes. Add the scallion greens, lime juice and 1/2 teaspoon salt. Serve the chicken with the bean mixture; top with the bacon.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "seasoning mix", "quantity": 2.0}, {"food": "bacon", "quantity": 3.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "martha white foods", "quantity": 1.0}, {"food": "fava beans", "quantity": 1.0}, {"food": "corn bran", "quantity": 1.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "ice cream swich", "quantity": 0.25}, {"food": "", "quantity": 1.0}, {"food": "salt", "quantity": 1}], "title": "\nCajun Chicken with Pinto Beans\n"}, {"directions": "\n\n              Preheat the oven 350 degrees F.\n            \n\n              In a medium bowl, whisk 1/2 cup of the flour with the cornmeal, Cajun spice, and 1/2 teaspoon salt. Put the remaining 1 cup flour, buttermilk, and the cornmeal mixture respectively in 3 shallow dishes. Season the buttermilk with hot sauce, to taste.\n            \n\n              With the flat side of a cook's knife or the smooth side of a meat-pounder, pound each breast to equal thickness. Pat the chicken breasts dry and season with salt.\n            \n\n              Lightly coat each breast in flour and shake off any excess. Dip each breast into the buttermilk to coat and remove, shaking slightly so the excess buttermilk drains back into the bowl. Dredge the chicken in the cornmeal mixture, shaking off any excess coating. Lay the chicken on a piece of waxed paper.\n            \n\n              Heat a large (12-inch) cast iron skillet over medium heat with about 1/2 inch of oil. Lay 2 chicken breasts smooth-side down in the pan and cook until golden brown, 3 to 4 minutes. Flip and cook 3 to 4 minutes more. Drain chicken on a paper towel. Repeat with remaining chicken.\n            \n\n              Place all chicken breasts on a rack over a baking sheet and bake until firm to the touch, 6 to 8 minutes. Season with salt, and serve immediately with mustard mayonnaise or sliced tomatoes.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.5}, {"food": "yellow rice", "quantity": 1.0}, {"food": "cheesecake mix", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 1.5}, {"food": "Worcestershire sauce", "quantity": 0.5}, {"food": "fat free chicken breast ", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 0.8333333333333333}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1}], "title": "\nCajun Cornmeal Crusted Chicken\n"}, {"directions": "\n\n              For the pigs in blankets: Combine 1/3 cup warm water (110 to 115 degrees F) and the brown sugar in a medium bowl. Sprinkle the yeast over the water, and let stand until foamy, about 10 minutes. Whisk together the flour, cornmeal, Cajun seasoning and 1/2 teaspoon kosher salt in a small bowl. Add the flour mixture and the butter to the yeast, and mix with a fork until a dough forms.\n            \n\n              Turn the dough out onto a flour-dusted surface, and knead by hand until smooth, about 5 minutes, using more flour as needed. Coat the inside of a medium bowl with cooking spray; add the dough to the bowl, and cover. Let the dough rise in a warm spot until doubled in size, 1 to 1 1/2 hours.\n            \n\n              Preheat the oven to 400 degrees F. Coat a baking sheet with cooking spray. Make a slit down the length of each andouille link, cutting about halfway through, and stuff each with 1 tablespoon shredded cheese.\n            \n\n              Turn the dough out onto a lightly floured surface. Roll into an 8-by-18-inch rectangle, about 1/8 inch thick. Cut lengthwise into 8 strips. Discard the 2 outer strips with the most uneven edges.\n            \n\n              Wrap a strip of dough around an andouille link, coiling the strip from 1 end of the link to the other, leaving a 1/4-inch space between dough turns and leaving the ends of the sausage slightly exposed. Set on the prepared baking sheet, and repeat with the remaining dough and andouille. Brush the tops and sides with the beaten egg. Bake until golden brown, 18 to 22 minutes.\n            \n\n              For the remoulade sauce: Meanwhile, stir together the mayonnaise, cornichons, mustard, ketchup, scallions and hot sauce in a small bowl. Refrigerate until ready to serve.\n            \n\n              To serve: Cut each pig in a blanket into 4 pieces with a serrated knife. Serve with the remoulade sauce on the side.\n            \n", "ingredients": [{"food": "sugar", "quantity": 2.0}, {"food": "yeast extract spread", "quantity": 1.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "yellow rice", "quantity": 0.5}, {"food": "seasoning mix", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 2.0}, {"food": "", "quantity": 1}, {"food": "little links", "quantity": 6.0}, {"food": "macaroni cheese", "quantity": 6.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "mayonnaise dressing", "quantity": 0.5}, {"food": "", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 2.0}], "title": "\nCajun Cornmeal-Andouille Pigs in Blankets\n"}, {"directions": "\n\n              Bring a pot of salted water to a boil. Add the pasta and cook until al dente, about 1 minute less than the label directs. Reserve 1 cup of the cooking water, then drain the pasta. Meanwhile, combine the olive oil and sausage in a large skillet over high heat and cook, stirring, until the sausage starts to brown, about 2 minutes. Stir in the scallions and bell pepper and cook until the vegetables are slightly soft, about 3 more minutes. Add the Cajun spice and flour and cook, stirring, 2 more minutes. Gradually whisk in the milk and continue whisking until the sauce is thick and smooth, about 5 more minutes. Add the pasta, cheese and reserved cooking water to the skillet. Reduce the heat to medium low and cook, tossing to coat the pasta in the sauce and melt the cheese, about 1 minute. \n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "diced chicken", "quantity": 6.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "italian veg medley pasta", "quantity": 12.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "whole milk", "quantity": 2.0}, {"food": "cheddar cheese", "quantity": 8.0}], "title": "\nCajun Mac and Cheese\n"}, {"directions": "\n\n              Soak the red onion in a bowl of ice water for 15 minutes; drain and pat dry. Meanwhile, bring a large pot of salted water to a boil. Add the macaroni and cook as the label directs. Drain, transfer to a bowl and toss with 3 tablespoons milk. Let cool.\n            \n\n              Whisk the mayonnaise, sour cream, mustard, pickle brine, sugar, hot sauce, remaining 1 tablespoon milk and 1/2 teaspoon salt in a large bowl. Add the macaroni, red onion, bell peppers, celery, celery leaves and parsley; toss to coat. Cover and refrigerate at least 2 hours. Stir again before serving; season with salt.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "onion powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "milk", "quantity": 0.25}, {"food": "mayonnaise dressing", "quantity": 0.5}, {"food": "sour cream", "quantity": 0.25}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "fava beans", "quantity": 0.75}, {"food": "sugar", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "", "quantity": 2.0}, {"food": "celery seed", "quantity": 2.0}, {"food": "parsley", "quantity": 0.25}], "title": "\nCajun Macaroni Salad\n"}, {"directions": "\n\n              Preheat the broiler. Whisk 1 tablespoon each olive oil, chili powder and hot sauce in a bowl. Season the pork chops with 1/2 teaspoon salt. Pierce the chops all over with a fork and rub with the spice mixture on both sides; place on a rack set over a baking sheet. Set aside.\n            \n\n              Heat the remaining 1 tablespoon olive oil in a Dutch oven or large pot over medium-high heat. Add the celery, onion, garlic and the remaining 2 tablespoons chili powder. Cook, stirring, until the vegetables are translucent, about 8 minutes.\n            \n\n              Add the chicken broth and tomatoes to the pot. Cook, stirring occasionally, until reduced by about one-third, about 7 minutes. Add the beans and kale; toss to coat. Reduce the heat to medium, cover and cook until the kale is tender, about 7 minutes. (Add up to 1/2 cup water if the mixture looks dry.) Season with salt.\n            \n\n              Meanwhile, broil the pork until browned, 4 to 6 minutes. Flip; broil until cooked through, 2 more minutes. Serve with the kale and beans.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "chili powder", "quantity": 3.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "pork skins", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "celery seed", "quantity": 4.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "fava beans", "quantity": 1.0}, {"food": "kale", "quantity": 1.0}], "title": "\nCajun Pork Chops with Kale\n"}, {"directions": "\n\n              1. Preheat the oven to 400 degrees F. Cook the bacon in a large skillet over medium heat until crisp and browned, about 6 minutes. Increase the heat to medium-high and add the onion, garlic, tomato, and season with salt. Cook until the vegetables are tender, about 5 minutes. Stir in the kale and broth, cover, cook until wilted, about 8 minutes. Stir in the vinegar and season with salt.\n            \n\n              2. Meanwhile mix the Cajun spice with 1 tablespoon vegetable oil to make a paste. Rub the pork with the spice paste. Heat an ovenproof skillet over medium-high heat. Add the remaining 1 tablespoon oil and sear the pork, turning until all sides are golden brown, about 4 minutes. Transfer the skillet to the oven and roast until an instant-read thermometer inserted into the meat registers 145 degrees F, about 15 minutes. Set aside for 5 minutes to rest on a cutting board before slicing.\n            \n\n              3. Thinly slice the pork, divide evenly among four plates. Serve the pork with the greens and their liquid along with store-bought rolls or biscuits.\n            \n", "ingredients": [{"food": "bacon", "quantity": 3.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 8.0}, {"food": "diced chicken", "quantity": 1.5}, {"food": "vinegar", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "pork skins", "quantity": 2.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 1}], "title": "\nCajun Pork Tenderloin with Braised Greens\n"}, {"directions": "\n\n              Cook 1 cup wild rice blend in boiling salted water until tender, about 40 minutes; drain. Brown 3 ounces each ground pork and chopped andouille sausage in 2 tablespoons olive oil in a large skillet over medium-high heat. Add 1 chopped red bell pepper, 2 chopped celery stalks and 1 tablespoon chopped thyme and cook until the vegetables are tender, about 7 minutes. Add 1 teaspoon Cajun seasoning, the cooked rice and 1 bunch chopped scallions and cook, stirring, 3 minutes. Season with salt.\n            \n\n              Per serving: Calories: 214; Total Fat: 10 grams; Saturated Fat: 2.5 grams; Protein: 9 grams; Total carbohydrates: 23 grams; Sugar: 2 grams; Fiber: 3 grams; Cholesterol: 19 milligrams; \n            \n\n              Sodium: 324 milligrams\n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [], "title": "\nCajun Rice Pilaf\n"}, {"directions": "\n\n              Heat a large cast-iron skillet over high heat. Add the bacon and cook until crisp, about 2 minutes. Transfer with a slotted spoon to a paper towel-lined plate to drain. Add the sausage, onion, celery and bell pepper to the skillet and cook, stirring, until the vegetables are soft and the sausage begins to brown, about 3 minutes.\n            \n\n              Add the garlic, thyme, 1 teaspoon salt and 1/2 teaspoon pepper to the skillet, then stir in the rice. Add the chicken broth and 1 cup water and bring to a boil. Stir in the okra, then reduce the heat to low, cover and simmer 15 minutes. Remove from the heat and let sit, covered, 5 minutes. Add the bacon and parsley and fluff with a fork.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "bacon", "quantity": 2.0}, {"food": "diced chicken", "quantity": 12.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "pepper", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "thyme", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "crisped rice bar", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "frozen yogurt", "quantity": 2.0}, {"food": "parsley", "quantity": 2.0}], "title": "\nCajun Rice With Sausage\n"}, {"directions": "\n\n              Melt the butter in a medium saucepan over medium heat. Add the scallion whites and jalapeno and cook, stirring occasionally, until softened, about 3 minutes. Add 1 1/2 cups water, the rice, bay leaf and 1/2 teaspoon salt. Increase the heat to medium high and bring to a simmer. Reduce the heat to low; stir, then cover and simmer until the rice is tender and the water is absorbed, 15 to 18 minutes. Remove from the heat and stir in the greens. Cover and set aside.\n            \n\n              Season the scallops with salt and sprinkle one side with the Cajun seasoning. Heat a large skillet over medium-high heat. Add the vegetable oil, then the scallops, spice-side down; cook until browned and crisp, about 3 minutes. Flip and cook until just cooked through, about 1 minute.\n            \n\n              Stir the parsley and scallion greens into the rice and season with salt. Serve with the scallops and lemon wedges.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [{"food": "butter oil", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "pepper", "quantity": 1.0}, {"food": "crisped rice bar", "quantity": 1.0}, {"food": "corier leaf", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "turnip greens", "quantity": 4.0}, {"food": "sea lion", "quantity": 1.0}, {"food": "seasoning mix", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "parsley", "quantity": 0.5}, {"food": "", "quantity": 1}], "title": "\nCajun Scallops and Rice\n"}, {"directions": "\n\n              Put the shrimp in a large bowl of ice water. Add 1 tablespoon salt; stir to dissolve and set aside 20 minutes.\n            \n\n              Meanwhile, heat 2 tablespoons butter in a large skillet over medium-high heat. Add the corn, 1/2 teaspoon minced garlic and all but a few tablespoons of the scallions; season with salt and pepper. Cook, stirring occasionally, until the corn starts browning, about 4 minutes. Add 3/4 cup water and the tomatoes. Bring to a simmer, then reduce the heat to medium low and cook until the corn is very tender, about 15 minutes.\n            \n\n              Meanwhile, combine the Worcestershire sauce, lemon juice, hot sauce, rosemary and the remaining garlic in another large skillet over medium heat. Cook, stirring occasionally, until the liquid is reduced by half, about 5 minutes. Drain the shrimp, pat dry and add to the skillet. Add the remaining 4 tablespoons butter; swirl to melt. Cook, spooning the liquid over the shrimp, until cooked through, about 5 minutes. Serve the shrimp over the corn mixture; top with the reserved scallions. Serve with the bread and lemon wedges.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "shrimp", "quantity": 1.25}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 6.0}, {"food": "sunflower seed kernels", "quantity": 3.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 6.0}, {"food": "pepper", "quantity": 1}, {"food": "diced chicken", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 0.25}, {"food": "", "quantity": 1.5}, {"food": "Worcestershire sauce", "quantity": 1.5}, {"food": "rosemary", "quantity": 0.5}, {"food": "luncheon slices", "quantity": 8.0}], "title": "\nCajun Shrimp and Corn\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Heat the butter, olive oil and garlic in a large skillet over medium-high heat until fragrant, about 1 minute. Add the Cajun seasoning and shrimp and cook, stirring, until the shrimp begin to curl, about 1 minute. Season with salt and pepper.\n            \n\n              Add the tomatoes and scallions to the skillet and cook, stirring, about 1 minute. Add the rice and 1/4 cup water and continue to cook until the rice is warmed through and the shrimp are opaque, about 3 more minutes. Stir in the parsley and serve with lemon, if desired.\n            \n\n              Per serving: Calories 357; Fat 11 g (Saturated 3 g); Cholesterol 176 mg; Sodium 537 mg; Carbohydrate 40 g; Fiber 3 g; Protein 23 g\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "seasoning mix", "quantity": 2.0}, {"food": "shrimp", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "plum", "quantity": 4.0}, {"food": "", "quantity": 2.0}, {"food": "crisped rice bar", "quantity": 3.0}, {"food": "parsley", "quantity": 3.0}, {"food": "", "quantity": 1}], "title": "\nCajun Shrimp and Rice\n"}, {"directions": "\n\n              Whisk 1 1/2 cups water, the vinegar, ketchup, 1/4 cup mustard, the molasses and 1 tablespoon brown sugar in a 7-to-8-quart slow cooker. Combine the remaining 1 tablespoon brown sugar, the paprika, 1 teaspoon salt and 1/2 teaspoon pepper in a small bowl. Rub all over the pork, then add to the slow cooker along with the sausage. Cover and cook on low, 8 hours. Remove the pork and sausage and set aside to cool slightly. Skim off the excess fat from the cooking liquid, then strain into a large skillet and bring to a boil. Cook until reduced by one-third, about 15 minutes. Shred the pork with a fork and coarsely chop the sausage. Toss the pork and sausage with enough of the reduced cooking liquid to moisten; season with salt. Whisk the mayonnaise and the remaining 2 tablespoons mustard in a small bowl; spread on the buns. Fill with the pulled pork and pickle slices. Serve with potato chips.\n            \n\n              Photograph by Johnny Miller\n            \n", "ingredients": [{"food": "vinegar", "quantity": 0.5}, {"food": "", "quantity": 0.3333333333333333}, {"food": "spicy black bean enchilada", "quantity": 0.25}, {"food": "molasses", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "paprika", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "pork skins", "quantity": 1.0}, {"food": "pork sausage links", "quantity": 2.0}, {"food": "mayonnaise dressing", "quantity": 0.3333333333333333}, {"food": "sesame meal", "quantity": 8.0}, {"food": "potato chips", "quantity": 1}], "title": "\nCajun Slow-Cooker Pulled Pork\n"}, {"directions": "\n\n              Combine the spelt with 1 1/2 cups of water in a medium saucepan. Bring to a boil, reduce heat to medium low, cover and simmer until most of the water is absorbed and the grains are tender but still chewy, about 30 minutes. Remove from the heat and let sit, covered, for 10 minutes. Let cool completely (spelt can be made up to a day ahead).\n            \n\n              Heat the oil in a large nonstick skillet over medium-high heat. Add the bell pepper, scallion whites, celery and Canadian bacon and cook, stirring frequently, until the vegetables are crisp-tender and the ham is lightly browned, about 4 minutes. Add the garlic and Cajun seasoning and cook, stirring, for 1 minute. Add the spelt, tomatoes, scallion greens and 1/2 teaspoon salt cook, stirring, until the spelt and tomatoes are warmed through, about 2 minutes. Transfer to a serving dish and serve hot.\n            \n", "ingredients": [{"food": "spelt", "quantity": 0.75}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "pepper", "quantity": 1.0}, {"food": "martha white foods", "quantity": 4.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "bacon", "quantity": 2.5}, {"food": "garlic powder", "quantity": 2.0}, {"food": "seasoning mix", "quantity": 0.5}, {"food": "silk black cherry soy yogurt", "quantity": 1.0}, {"food": "salt", "quantity": 1}], "title": "\nCajun Spelt\n"}, {"directions": "\n\n              SET UP: Prepare a grill or grill pan and heat to medium-high heat.\n            \n\n              FORM THE PATTIES: Gently mix the ground beef, Cajun seasoning, and scallions. Form into four 1/2-inch-thick patties.\n            \n\n              MIX THE REMOULADE: Combine the mayonnaise, mustard, hot sauce, parsley, and celery in a small bowl. Refrigerate until needed.\n            \n\n              GRILL EVERYTHING: Grill the patties, flipping once, to desired doneness, about 4 minutes per side for medium. Brush the onion and green pepper with the oil and grill the vegetables until lightly charred and tender, about 5 minutes total.\n            \n\n              SERVE: Toast the buns on the grill for a minute or so. Put a patty on the bottom bun and top with remoulade. Add some onion and bell pepper, then add the top bun.\n            \n", "ingredients": [{"food": "frankfurter beef", "quantity": 1.5}, {"food": "seasoning mix", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "mayonnaise dressing", "quantity": 0.5}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 0.25}, {"food": "celery seed", "quantity": 1.5}, {"food": "onion powder", "quantity": 1.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.25}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "watermelon seed krnls", "quantity": 4.0}], "title": "\nCajun Spiced Burgers\n"}, {"directions": "\n\n              Bring a medium saucepan of water to a boil; add the brown rice and boil 10 minutes. Stir in the quinoa and cook until both grains are tender, about 15 more minutes. Drain well and set aside. Meanwhile, drizzle the bell peppers with 1 tablespoon water in a microwave-safe bowl. Cover with plastic wrap; microwave 10 minutes. Heat the olive oil in a wide saucepan over medium-high heat. Add the onion and cook, stirring, until golden, about 5 minutes. Add the sausage, garlic, thyme, allspice and 1/2 teaspoon salt and cook, stirring, until the sausage is brown and crisp, about 3 more minutes. Add the tomatoes and 1 cup water to the pan. Pile the kale on top, cover and cook until the kale wilts, about 2 minutes. Stir the kale into the sauce and bring to a simmer. Arrange the bell peppers on top, cover and simmer until the kale is just tender, about 8 minutes. Divide the peppers among plates. Stir the grains into the kale mixture and season with salt. Spoon into the peppers. Top with parsley. \n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "crisped rice bar", "quantity": 1.0}, {"food": "quinoa", "quantity": 0.3333333333333333}, {"food": "peppers", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "sausage", "quantity": 0.25}, {"food": "garlic powder", "quantity": 3.0}, {"food": "thyme", "quantity": 0.5}, {"food": "hearts of palm", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "parsley", "quantity": 1}], "title": "\nCajun Stuffed Peppers\n"}, {"directions": "\nSpecial equipment: 2 wire racks 2 rimmed baking sheets\n\n              Adjust two oven racks to the top and bottom third of an oven and preheat oven to 425 F. Put the wire racks in the baking sheets and coat each generously with cooking spray.\n            \n\n              Combine the flour and Cajun seasoning in a large re-sealable plastic bag. Combine the eggs and 1/2 teaspoon salt in another large plastic bag; combine the cornmeal, breadcrumbs and 1/2 teaspoon salt in a third large plastic bag.\n            \n\n              Add about half of the zucchini sticks to the bag with the flour and use a combination of your hands and shaking the bag to coat the zucchini. Remove the zucchini and shake off any excess flour. Transfer to the egg wash and repeat until coated. (It's less messy if you use only one hand for the dry ingredients and the other for the wet.) Let any excess egg drip off before transferring to the breadcrumbs and repeat until fully coated (you'll still see some green and white of the zucchini peeking through the breading). Transfer to the prepared baking sheets and coat the breaded zucchini generously with cooking spray (there's no need to turn them). Repeat with the remaining zucchini.\n            \n\n              Bake, rotating the baking sheets from top to bottom about halfway through, until golden brown and tender, 25 to 30 minutes.\n            \n\n              Meanwhile, stir together the mayonnaise, mustard, pickle and hot sauce in a small bowl. Serve with the zucchini fries.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 0.5}, {"food": "seasoning mix", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "eggs", "quantity": 2.0}, {"food": "cornmeal", "quantity": 1.5}, {"food": "", "quantity": 1.0}, {"food": "turkey sticks", "quantity": 1.0}, {"food": "mayonnaise dressing", "quantity": 0.25}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "pickle loaf", "quantity": 0.5}, {"food": "Worcestershire sauce", "quantity": 0.5}], "title": "\nCajun Zucchini Fries\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Lightly coat the top and inside cups of a 12-cup muffin pan with nonstick cooking spray.\n            \n\n              Put 1/4 cup almonds in the bowl of a food processor. Process until very fine and the nuts are the texture of cornmeal. Add the cake mix, yogurt, eggs, oil, 1/4 cup water and the remaining 3/4 cup whole almonds. Pulse until no bits of dry cake mix remain and the nuts are coarsely chopped Add 1/4 teaspoon of zest and the orange juice to the batter with the cranberries. Pulse two or three times to just combine the fruit.\n            \n\n              Divide the batter between muffin cups and bake until the tops are lightly browned and spring back to the touch, 18 to 20 minutes.\n            \n\n              Cool 10 minutes in the pan then transfer to a cooling rack to cool completely. In a small bowl whisk the powdered sugar, hot water and remaining 1/2 teaspoon zest until glossy and smooth. Adjust the consistency of the glaze with the remaining water, a few drops at a time until just loose enough to drizzle. Spoon over the cooled muffins. Let stand a few minutes for the glaze to harden.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "whole milk", "quantity": 1.0}, {"food": "shortening cake mix", "quantity": 1.0}, {"food": "whole milk", "quantity": 0.5}, {"food": "eggs", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "grape juice", "quantity": 0.75}, {"food": "cranberries", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "hot pockets ham cheese stuffed swich", "quantity": 2.5}], "title": "\nCake Mix Cranberry Orange Muffins\n"}, {"directions": "\n\n              For the cookies: Position oven racks in the top and bottom thirds of the oven and preheat to 350 degrees F. Coat 2 baking sheets with cooking spray.\n            \n\n              Beat the cake mix, butter, eggs and 1/3 cup water with an electric mixer on medium speed in a large bowl until smooth and no bits of dry cake mix are left. Drop the batter by the tablespoonful (a small ice cream scoop will make this task easier) onto the prepared baking sheets about 1 1/2 inches apart. (You will have additional batter for a second batch.)\n            \n\n              Bake until the cookies are set around the edges but still soft in the center, about 8 minutes. Let the cookies cool on the baking sheets for 10 minutes, then transfer them to a wire rack to cool completely (the rounded tops will sink slightly). When the baking sheets are cool, repeat with the remaining batter.\n            \n\n              For the frosting: Melt the butter and chocolate in a medium microwavable bowl in the microwave in 1-minute increments, stirring in between, until smooth.\n            \n\n              Beat the cream cheese, confectioners' sugar and vanilla together with an electric mixer on medium speed in a large bowl until smooth. Pour the chocolate mixture into the cream cheese mixture and beat until smooth.\n            \n\n              Frost the cookies, decorate with sprinkles and serve.\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 1}, {"food": "shortening cake mix", "quantity": 1.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "eggs", "quantity": 2.0}, {"food": "butter oil", "quantity": 6.0}, {"food": "baking chocolate", "quantity": 4.0}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "sugar", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "", "quantity": 1}], "title": "\nCake Mix Holiday Cookies\n"}, {"directions": "\n\n              Preheat the oven to 200 degrees F (for keeping the pancakes warm). Grate 3/4 teaspoon lemon zest and then squeeze 1 tablespoon of juice; reserve separately. Put one bag of the blueberries, the maple syrup, lemon juice and 1/4 teaspoon of the lemon zest into a small (8-inch) skillet with 1/3 cup water. Bring to a simmer over medium heat, stirring occasionally, and continue to simmer until the mixture is syrupy and thickened, 6 to 8 minutes. Remove the blueberry sauce from the heat and set aside. (You should have about 3/4 cup.)\n            \n\n              Meanwhile, whisk the cake mix, sour cream, eggs, the remaining 1/2 teaspoon lemon zest and 1 cup water in a large bowl until smooth and thick.\n            \n\n              Heat a large nonstick skillet over medium heat; lightly coat with cooking spray. Drop the batter by 1/4-cupfuls into the skillet, leaving 1 inch between each. Cook until bubbles rise to the top of the pancakes and they are set around the edges and lightly browned on the bottom, 5 to 7 minutes. Add about 5 blueberries to the top of each pancake and then carefully flip (the tops of the pancakes will still be a little soft). Continue to cook until lightly browned and cooked through, 5 minutes more. Transfer to a baking sheet and keep warm in the oven. Repeat with the remaining batter.\n            \n\n              Top the pancakes with the blueberry sauce and a dusting of confectioners' sugar. Serve with butter and maple syrup on the side.\n            \n", "ingredients": [{"food": "lemon juice", "quantity": 1.0}, {"food": "blueberries", "quantity": 8.0}, {"food": "syrup", "quantity": 1.0}, {"food": "shortening cake mix", "quantity": 1.0}, {"food": "sour cream", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "", "quantity": 1}, {"food": "sugar", "quantity": 1}, {"food": "", "quantity": 1}], "title": "\nCake-Mix Blueberry Pancakes\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Line a 9-by-13-inch cake pan with aluminum foil, and coat it with cooking spray.\n            \n\n              Beat the cake mix, oil, egg and 1/4 cup water in a large bowl with an electric mixer on medium speed until smooth. Let stand a few minutes until no longer tacky and then pat into the prepared pan.\n            \n\n              Bake until the edges are set, the cake has deflated and the top is no longer wet and shiny, 20 to 25 minutes. Let cool completely.\n            \n\n              Spread the softened ice cream over the cake in 1 even layer. Cover with plastic wrap and freeze until firm, at least 4 hours or overnight.\n            \n\n              Let the cake stand at room temperature for about 20 minutes before serving. Whip the cream with the sugar in a chilled medium bowl with an electric mixer until stiff peaks form. Spread over the ice cream. Top with your favorite sundae toppings, such as those suggested above. Use the foil to lift the cake out of the pan and place on serving platter. Slice and serve.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "shortening cake mix", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "egg substitute", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 5.0}, {"food": "ice cream swich", "quantity": 1.5}, {"food": "sugar", "quantity": 1.0}, {"food": "maraschino cherries", "quantity": 1}], "title": "\nCake-Mix Ice Cream Sundae Cake\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Coat two baking sheets with cooking spray.\n            \n\n              Beat the cake mix, eggs, butter and 1/4 cup water in a large bowl with an electric mixer on medium speed until smooth and no bits of dry cake mix are left. Stir in the chocolate chips and peppermint extract.\n            \n\n              Drop the batter onto the prepared baking sheets, using about 2 tablespoonfuls for each cookie (a small ice cream scoop will make this task easier) and spacing them about 1 1/2 inches apart. Bake until set around the edges but still soft in the center, about 10 minutes.\n            \n\n              Let the cookies cool on the baking sheets for 10 minutes and then transfer to a cooling rack to cool completely. Continue to bake cookies with the remaining batter.\n            \n\n              Place about 1 tablespoon marshmallow cream on half the cookies and top each with a second cookie, gently pressing on the marshmallow; it will continue to spread to the edges on its own in a few minutes.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "shortening cake mix", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "butter oil", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "vanilla extract", "quantity": 0.25}, {"food": "ice cream swich", "quantity": 1.0}], "title": "\nCake-Mix Mint Chocolate Sandwich Cookies\n"}, {"directions": "\n\n              Whisk the flour, cornstarch, salt, baking powder and baking soda in a large bowl. \n            \n\n              Beat the butter, brown sugar and granulated sugar in a bowl with a mixer on medium speed until combined but still slightly lumpy (use the paddle attachment for a stand mixer). The biggest lumps should be about the size of small peas; do not overbeat. Beat in the eggs one at a time. Reduce the mixer speed to low; add the flour mixture in batches and beat until combined. Stir in the chocolate chips by hand. Press plastic wrap directly onto the surface of the dough and refrigerate at least 2 hours or preferably overnight. \n            \n\n              Preheat the oven to 375 degrees F. Line 2 baking sheets with parchment paper. Drop 2 1/2-inch scoops of dough onto the prepared baking sheets, about 2 inches apart. Bake until the cookies are barely golden around the edges, about 20 minutes, rotating the baking sheets halfway through. Turn off the oven but keep the cookies inside for 5 more minutes to set. Remove the cookies from the oven and let cool 10 minutes on the baking sheets, then transfer to a rack to cool completely. \n            \n\n              Photograph by Kana Okada\n            \n", "ingredients": [{"food": "potato flour", "quantity": 3.75}, {"food": "cornstarch", "quantity": 2.0}, {"food": "salt", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "butter oil", "quantity": 2.0}, {"food": "sugar", "quantity": 1.25}, {"food": "sugar", "quantity": 0.5}, {"food": "eggs", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.5}], "title": "\nCakey Chocolate Chip Cookies\n"}, {"directions": "\n\n              Position oven racks in the top and bottom thirds of the oven, and preheat to 375 degrees F. Line 2 baking sheets with parchment.\n            \n\n              Whisk together the flour, baking soda and salt in a large bowl. Beat the butter and sugar with an electric mixer on medium-high speed in a second large bowl until light and fluffy, about 4 minutes. Add the eggs to the butter mixture, one at time, beating after each addition to incorporate; beat in the vanilla. Reduce the speed to medium, add the flour mixture, and beat until just incorporated. Stir in the chocolate chips.\n            \n\n              Scoop 12 heaping tablespoons of dough onto each prepared baking sheet about 2 inches apart. Roll each into a ball with slightly wet hands. Bake until the cookies are golden and tender, 12 to 15 minutes, rotating the baking sheets halfway through. Let the cookies cool for a few minutes on the baking sheets, then transfer them to a rack to cool completely.\n            \n\n              When the baking sheets have cooled completely, scoop the remaining dough onto 1 sheet and bake. Store the cookies in a tightly sealed container at room temperature for up to 5 days.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.25}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "butter oil", "quantity": 1.5}, {"food": "sugar", "quantity": 1.5}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 12.0}], "title": "\nCakey Chocolate Chip Cookies\n"}, {"directions": "\n\n              Cut the squid bodies on one side so they open up flat. Score with a sharp knife in a 1/4-inch crosshatch pattern. Slice into 1/2-inch strips. Cut any tentacles in half.\n            \n\n              Cook the noodles in a pot of boiling salted water until tender, about 8 minutes. Drain and run under cold water until cool.\n            \n\n              Stir together the broth, molasses and soy.\n            \n\n              Heat the oil in a wok or large heavy skillet over high heat. When it just begins to smoke, add the bell peppers, 1 teaspoon salt and 1/2 teaspoon pepper and cook, stirring, until charred in places and crisp tender, about 3 minutes. Stir in the scallion whites, ginger and garlic and cook, stirring, until very fragrant, about 2 minutes. Add the squid and sauce to the wok and cook, stirring until the squid is just cooked, about 1 minute. Stir in the lime juice, and then toss the squid mixture with the noodles. Chill until cool, about 30 minutes or up to overnight.\n            \n\n              Season with salt and pepper. Serve sprinkled with the cucumbers and scallion greens.\n            \n", "ingredients": [{"food": "squid", "quantity": 1.0}, {"food": "rice noodles", "quantity": 8.0}, {"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 0.3333333333333333}, {"food": "molasses", "quantity": 1.0}, {"food": "soy sauce", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 2.0}, {"food": "turnip greens", "quantity": 1.0}, {"food": "ginger", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "lime juice", "quantity": 1.5}, {"food": "black bean mango", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}], "title": "\nCalamari Stir Fry with Peppers and Cukes\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 400 degrees F. Arrange the bacon in a large ovenproof skillet and cook over medium-high heat until crispy, about 4 minutes per side. Transfer to a paper-towel-lined plate. Remove all but 2 teaspoons bacon drippings from the skillet.\n            \n\n              Reduce the heat to medium. Cut each bagel in half crosswise. Toast the bottom pieces in the skillet cut-side down until light golden brown, 3 to 4 minutes. \n            \n\n              Meanwhile, mash together the avocado, lemon juice, red pepper flakes, 1/4 teaspoon salt and a few grinds of pepper in a small bowl.\n            \n\n              Remove the bagel bottoms from the skillet and evenly spread the avocado mash over the toasted sides; set aside. Put the 2 top bagel pieces in the skillet cut-side down. Crack 1 egg into each bagel hole and season with salt and pepper. The whites will run over and under the bagels which is okay-- just make sure the yolks stay in the holes.  \n            \n\n              Cover the skillet and cook until the whites become crispy and the bottoms of the bagels are toasted, 3 to 4 minutes. Transfer the skillet to the oven and continue cooking until the whites are completely set and the yolk is still runny, about 5 minutes.  \n            \n\n              Meanwhile, layer each avocado bagel bottom with a slice of tomato, some arugula and 2 slices of bacon. Drizzle with the oil and sprinkle with salt and pepper. Top with the egged bagel tops. Cut each sandwich in half.\n            \n", "ingredients": [{"food": "bacon", "quantity": 4.0}, {"food": "bagels", "quantity": 2.0}, {"food": "avocado", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "black bean mango", "quantity": 1}, {"food": "eggs", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "arugula", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}], "title": "\nCalifornia BLT Egg-in-a-Hole\n"}, {"directions": "\n\n              thai Mix 1 1/4 pounds ground chicken, 1/2 cup panko, 2 teaspoons Worcestershire sauce, 1 tablespoon Greek yogurt and salt. Shape into four 1-inch-thick patties and chill. Brush with oil and cook 4 to 5 minutes per side on an oiled grill. Serve on whole-grain bread with sprouts, cucumber, tomato and avocado.\n            \n", "ingredients": [], "title": "\nCalifornia Burger\n"}, {"directions": "\n\n              Preheat the oven to 475 degrees F. Cook the bacon in a large skillet over medium heat until crisp, about 10 minutes. Remove with a slotted spoon and drain on paper towels. Add the tomatoes to the drippings in the pan and cook, turning once, until slightly softened, about 2 minutes. \n            \n\n              Brush a large rimmed baking sheet with olive oil. Stretch the pizza dough to fit the pan (if the dough shrinks back, let it rest a few minutes before continuing). Prick the dough all over with a fork. Top with the tomatoes, reserving the bacon drippings. Bake until the crust is golden brown, 12 to 15 minutes.\n            \n\n              Remove the flatbread from the oven; top with the goat cheese. Season with salt and pepper. Toss the sprouts and arugula with 1/2 tablespoon of the reserved bacon drippings (rewarm, if necessary), the lemon juice, and salt and pepper. Top the flatbread with the greens and bacon. \n            \n\n              Photograph by Anna Williams\n            \n", "ingredients": [{"food": "bacon", "quantity": 4.0}, {"food": "plum", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "pizza rolls", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 6.0}, {"food": "salt", "quantity": 1}, {"food": "brussels sprouts", "quantity": 1.5}, {"food": "arugula", "quantity": 3.0}, {"food": "", "quantity": 0.5}], "title": "\nCalifornia Flatbread\n"}, {"directions": "\n\n              Toppings: Guacamole, sprouts and shredded Monterey jack \n            \n\n              How to Make Classic Potato Skins: \n            \n\n              Pierce 4 large russet potatoes with a fork. Bake directly on the oven rack at 350 degrees until tender, about 1 hour. Let cool, then quarter lengthwise and scoop out the flesh, leaving a 1/4-inch shell. Brush both sides with melted butter and season with salt and pepper. Bake, skin-side up, at 450 degrees until crisp, about 15 minutes. Add your favorite team toppings. (For cheesy skins, flip the baked shells over before topping, sprinkle with 1 cup grated cheddar cheese and bake an extra 5 minutes.)\n            \n\n              Photograph by Karl Juengel/Studio D\n            \n", "ingredients": [], "title": "\nCalifornia Fresh Potato Skins\n"}, {"directions": "\n\n              Toast the cereal in a large dry skillet over medium-high heat, about 3 minutes. Transfer to a medium bowl; set aside. Add the corn to the skillet and cook until just warmed through, about 3 minutes. Transfer to a large bowl.\n            \n\n              Warm the grains as the label directs and fluff with a fork. Add to the corn along with the beans, tomatoes, scallions, cilantro, lime juice and half each of the sprouts and goat cheese. Add the sesame oil, 2 tablespoons water, 1/2 teaspoon salt and a few grinds of pepper and toss until combined. Stir in half of the toasted cereal and season with salt and pepper. Top each serving of the salad with the remaining goat cheese, toasted cereal and sprouts.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "millet", "quantity": 1.0}, {"food": "corn bran", "quantity": 1.0}, {"food": "mixed nuts", "quantity": 1.0}, {"food": "fava beans", "quantity": 1.0}, {"food": "grape juice", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "", "quantity": 0.5}, {"food": "", "quantity": 2.0}, {"food": "brussels sprouts", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "salt", "quantity": 1}], "title": "\nCalifornia Grain Salad\n"}, {"directions": "\n\n              Put the eggs in a medium saucepan and cover with cold water by 1 inch. Bring to a boil, then reduce the heat and gently simmer 10 minutes. Drain and rinse under cold water until cool; set aside.\n            \n\n              Meanwhile, heat 1 tablespoon olive oil in a small skillet over medium heat. Add the chickpeas and season with salt and pepper. Cook, stirring, until the chickpeas are lightly browned, about 3 minutes. Add the pepitas and cook, stirring, until lightly toasted, about 2 minutes; let cool.\n            \n\n              Make the dressing: Whisk the yogurt, 2 tablespoons water, the vinegar, chives and the remaining 1 tablespoon olive oil in a small bowl; season with salt and pepper.\n            \n\n              Peel and roughly chop the hard-boiled eggs. Toss the greens, sprouts and radishes in a large bowl; season with salt and pepper. Top each serving of salad with the chickpeas and pepitas, eggs and sliced avocado. Drizzle with the dressing and top with more chives.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "eggs", "quantity": 6.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "chickpeas", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "pumpkin flowers", "quantity": 0.3333333333333333}, {"food": "silk plain soy yogurt", "quantity": 0.5}, {"food": "vinegar", "quantity": 2.0}, {"food": "dessert topping", "quantity": 2.0}, {"food": "mixed nuts", "quantity": 1.0}, {"food": "brussels sprouts", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 8.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}], "title": "\nCalifornia Salad with Hard-Boiled Eggs\n"}, {"directions": "\n\n              Wrap tortillas in barely damp, doubled layers of paper towels and microwave on high for 45 to 60 seconds. Alternatively, heat the tortillas individually in an un-greased large skillet over medium heat. \n            \n\n              Lay the tortillas on a cutting board and start to layer the ingredients. Fan the leaf lettuce on the top three-quarters of each tortilla then lay the turkey slices on top, followed by the bacon, tomato, and avocado. Season with salt and pepper, to taste. Top with the arugula and some of the dressing. Fold up the bottom quarter of the tortilla and then start to roll each sandwich into a cone shape. Secure the tortilla with a toothpick. Serve immediately.\n            \n\nRANCH DRESSING\n\n\n              Mash the garlic and salt to a paste with the side of a chef's knife. In a medium bowl, whisk together the garlic, mayonnaise, 1/4-cup buttermilk, parsley, chives, scallion, vinegar, and pepper to taste. If the sauce is very thick, thin the dressing with a couple more tablespoons of the buttermilk. Use immediately or refrigerate, covered, for up to 3 days.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 10.0}, {"food": "chrysanthemum leaves", "quantity": 8.0}, {"food": "turkey breast", "quantity": 12.0}, {"food": "smoked turkey roll", "quantity": 12.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "lime juice", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "watercress", "quantity": 1.0}, {"food": "dressing", "quantity": 0.5}, {"food": "garlic powder", "quantity": 2.0}, {"food": "salt", "quantity": 0.5}, {"food": "barley flour or meal", "quantity": 1.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.5833333333333333}, {"food": "parsley", "quantity": 2.0}, {"food": "chives", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nCalifornia Wrap Sandwich\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F with 1 rack set on the middle shelf and 1 rack set on the bottom shelf. Fill a large baking dish halfway with warm water and place on the bottom rack.\n            \n\n              Butter eight 8-ounce ramekins and place on a baking sheet. Slice the cheese into 1/2-inch cubes and lay on a plate to keep them from sticking together.\n            \n\n              Whisk the heavy cream and eggs together in a large bowl. Add 1 teaspoon salt and a pinch of pepper. Add the baguette cubes and ham. Stir to combine.\n            \n\n              Melt the butter in a large saute pan over medium-high heat. Add the shallots, fennel and thyme, season with salt and pepper and cook until slightly softened and browned around the edges, 4 to 6 minutes. Add the apples, season with salt and pepper and cook until slightly softened and browned around the edges, 3 to 5 minutes. Stir in the wine and cook until the wine has completely absorbed, 3 to 4 minutes. Discard the thyme sprigs. Add the apple mixture along with the cheese cubes to the beaten eggs, and stir to combine.\n            \n\n              Evenly divide the bread pudding among the ramekins. Bake until a paring knife inserted into the center of a bread pudding comes out clean and hot, 18 to 25 minutes, rotating the pan halfway through. Allow the bread puddings to cool for at least 5 minutes before serving. Garnish each ramekin with a fennel frond and serve alongside a lightly dressed green salad.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 3.0}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "", "quantity": 3.0}, {"food": "eggs", "quantity": 4.0}, {"food": "black bean mango", "quantity": 1}, {"food": "pie crust", "quantity": 1.5}, {"food": "ham", "quantity": 8.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "thyme", "quantity": 2.0}, {"food": "apple", "quantity": 1.5}, {"food": "martha white foods", "quantity": 1.0}, {"food": "poultry salad swich spread", "quantity": 1}], "title": "\nCamembert and Ham Bread Pudding\n"}, {"directions": "\n\n              Combine the caramel sauce, thyme sprigs and 2 tablespoons water in a small microwave-safe bowl and microwave until hot, about 1 minute. Cover and keep warm.\n            \n\n              Cut the baguette into 4 long, angled slices. Divide half of the cheese among 2 bread slices; sprinkle with half of the chives. Top with the apple slices and the remaining cheese, chives and 2 bread slices.\n            \n\n              Melt the butter in a large skillet over medium heat. Add the sandwiches and cook, pressing occasionally with a spatula, until the bread is toasted and the cheese melts, about 4 minutes per side, adding more butter to the pan if needed.\n            \n\n              Remove the thyme from the caramel sauce and sprinkle with sea salt. Serve with the sandwiches for dipping.\n            \n\n              Photograph by Sam Kaplan\n            \n", "ingredients": [{"food": "dulce de leche", "quantity": 0.25}, {"food": "thyme", "quantity": 3.0}, {"food": "", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "chives", "quantity": 1.0}, {"food": "apple", "quantity": 1.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "sea lion", "quantity": 1}], "title": "\nCamembert-Apple Grilled Cheese With Salted Caramel\n"}, {"directions": "\n\n              Mix 2 parts Campari and 1 part seltzer in a tall glass with crushed ice. Garnish with an orange slice.\n            \n\n              Photograph by Anna Williams\n            \n", "ingredients": [], "title": "\nCampari and Soda\n"}, {"directions": "\n\n              Pulse the cookies in a food processor to make coarse crumbs. Transfer all but 1/2 cup crumbs to a bowl. Pulse the remaining crumbs until fine; add the 1/4 cup confectioners' sugar and pulse. Transfer the fine crumbs to a separate bowl.\n            \n\n              Preheat the oven to 350 degrees F. Line a rimmed baking sheet with foil. Sprinkle the red and butterscotch candies into a 7-by-10-inch rectangle, alternating colors as shown.\n            \n\n              Bake the candies until completely melted, 10 to 15 minutes. Immediately run a knife through the yellow candy to swirl it into the red (be careful-the candy will be very hot). Let cool completely on the baking sheet.\n            \n\n              Meanwhile, make the frosting: Wipe out the food processor (no need to wash it). Add the butter, confectioners' sugar, melted chocolate, cocoa powder, milk and vanilla and pulse until smooth.\n            \n\n              Trim the long top and bottom edges of the pound cakes with a paring knife to make them rounded.\n            \n\n              Spread the frosting over the pound cakes, making sure to cover the rounded undersides (leave the ends exposed to resemble cut logs).\n            \n\n              Sprinkle the coarse cookie crumbs on a platter. Place 1 cake on the crumbs, then run a fork through the frosting to create the texture of bark. Rest the second cake at an angle on top; repeat with the fork.\n            \n\n              Sift the fine cookie crumb mixture over the logs to look like ash.\n            \n\n              Snap the candy sheet into different-size shards; press the shards into the lower cake to create the flames.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "chocolate chip cookies", "quantity": 1.0}, {"food": "sugar", "quantity": 0.25}, {"food": "cinnamon", "quantity": 30.0}, {"food": "", "quantity": 30.0}, {"food": "corn cakes", "quantity": 2.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "sugar", "quantity": 3.5}, {"food": "baking chocolate", "quantity": 8.0}, {"food": "onion powder", "quantity": 0.25}, {"food": "milk", "quantity": 0.25}, {"food": "vanilla extract", "quantity": 2.0}], "title": "\nCampfire Cake\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              For the cookies: Whisk together the flour, baking powder and salt in a small bowl. Beat the superfine sugar and butter with an electric mixer on medium speed in a large bowl until light and fluffy, about 5 minutes; beat in the egg, then the vanilla. Add the flour mixture and mix on medium-low speed until completely incorporated. Divide the dough in half, pat into 2 discs about 1/4-inch thick and wrap in plastic wrap. Refrigerate until firm, about 1 hour.\n            \n\n              Position oven racks in the top and bottom thirds of the oven and preheat to 350 degrees F. Line 2 baking sheets with parchment paper. Let the dough sit at room temperature for a few minutes to make rolling easier. Roll out 1 disc of dough at a time on a floured work surface to about 1/4-inch thick. Cut out rounds with a 3 1/2-inch cookie cutter and arrange about 1 inch apart on the prepared baking sheets.\n            \n\n              Bake, switching and rotating the pans halfway through, until the cookies are golden brown on the bottom, 10 to 12 minutes. Let the cookies cool on the baking sheets until firm enough to transfer to a wire rack; let cool completely.\n            \n\n              For the royal icing: Combine the confectioners' sugar and meringue powder in a large bowl. Add 5 tablespoons water and beat with a mixer on medium-high speed until soft glossy peaks form, adding 1 to 2 tablespoons water if necessary, to make a thick but spreadable icing. Beat in the food coloring, a few drops at a time, to make a deep green color (for grass).\n            \n\n              For decorating: Spread the icing on the cookies, almost to the edges. Sprinkle the chopped chocolate covered nuts almost to the edge of the green to resemble dirt. Arrange 3 chewy chocolate candies in a triangle on top to resemble logs in a campfire. Fill the space in the center of each with snipped gummy bears to resemble a campfire and embers. Poke a marshmallow on the end of each pretzel stick and stick in the icing to form a tripod that meets in the center. Let the icing harden, about 1 hour.\n            \n\n              Right before serving, light the marshmallows on fire and blow it out when they are toasted to your liking.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.5}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 0.25}, {"food": "sugar", "quantity": 0.75}, {"food": "butter oil", "quantity": 2.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "onion powder", "quantity": 2.0}, {"food": "", "quantity": 1}, {"food": "malt beverage", "quantity": 1}, {"food": "baking chocolate", "quantity": 54.0}, {"food": "ruby red grapefruit juice blend", "quantity": 10.0}, {"food": "yellow rice", "quantity": 10.0}, {"food": "orange", "quantity": 10.0}, {"food": "silk light vanilla", "quantity": 10.0}, {"food": "", "quantity": 54.0}, {"food": "turkey sticks", "quantity": 54.0}], "title": "\nCampfire Cookies\n"}, {"directions": "\nSpecial equipment: nonstick aluminum foil, a quart-sized mason jar\n\n              Preheat the oven to 400 degrees F. Line a baking sheet with nonstick foil.\n            \n\n              Put the potatoes and pepper out on the prepared baking sheet. Drizzle the oil over the vegetables and toss along with 1 teaspoon of salt and 1/2 teaspoon pepper. Spread the vegetables out in to a single layer on three-quarters of the baking sheet. Crumble the sausage on the remaining quarter of the baking sheet. Roast until the potatoes are fork tender and the sausage is cooked all the way through, about 25 minutes. Let cool completely. Pack into a large plastic re-sealable bag and refrigerate up to overnight. Pack in a cooler. (Make sure to pack all of the other ingredients and equipment too.)   \n            \n\n              Build a medium campfire (if there is a grate for cooking then go ahead and use it).\n            \n\n              Make the hobo packs: Cut eight 15-inch pieces of nonstick foil. Stack 2 pieces of foil, place your hand in the center and fold the sides up to create a shallow bowl. Repeat with the remaining pieces of foil so you have 4 bowls total. Put a quarter of the potato-sausage mixture in the center of each bowl. Crack the eggs into a quart-sized glass mason jar and shake well to scramble. \n            \n\n              Divide the eggs evenly among the bowls. Fold the sides over the fillings to create a seal. Place the hobo packs directly onto the coals of the fire, or on the grate above the fire, and cook, rotating with tongs every few minutes until the eggs are set, about 10 minutes. This could take more or less time depending on the strength of the fire, careful of steam you can open the packs to check while they cook. Remove from heat and let cool for 2 minutes so you can handle the foil. \n            \n\n              Open each packs and flip the mixture out onto the middle of your tortillas and top with Cheddar, hot sauce, salsa, scallions and sour cream.\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 12.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "sausage", "quantity": 1.0}, {"food": "eggs", "quantity": 8.0}, {"food": "potato flour", "quantity": 10.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1}], "title": "\nCampfire Hobo Pack Breakfast Burritos\n"}, {"directions": "\nSpecial equipment: 3 ice cube trays, a tall pitcher\n\n              Boil the sugar with 1/2 cup water in a small saucepan over medium-high heat until the sugar dissolves, about 5 minutes. Add the basil to the syrup and let sit for 5 minutes.\n            \n\n              Strain the basil syrup into a small pitcher and discard the basil. Whisk the lemon juice into basil syrup. Pour the mixture into 3 ice cube trays and freeze until solid, about 4 hours. \n            \n\n              Pop the lemonade ice cubes into a large re-sealable plastic bag (freeze for up to 1 week). \n            \n\n              When ready to serve, add the lemonade ice cubes, frozen raspberries and water to a tall pitcher. Stir until evenly mixed. Top with vodka, if using.\n            \n\n              For camping: Pack the lemonade ice cubes and frozen raspberries in a cooler. Be sure to pack the remaining ingredients and a tall pitcher. \n            \n", "ingredients": [{"food": "sugar", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "raspberries", "quantity": 1.0}, {"food": "", "quantity": 1}], "title": "\nCampfire Raspberry Lemonade Cocktails\n"}, {"directions": "\n\n              Build a medium-low campfire that has a grate for cooking. Break the chocolate bar into small pieces using the handle of a wooden spoon (or you can smack it against a picnic bench).\n            \n\n              Unwrap and add the pieces to a medium saucepan along with the dulce de leche, 1/2 cup and 1 teaspoon salt. \n            \n\n              Place the saucepan, on the grate and over the fire, and cook, stirring occasionally, until the chocolate melts and the sauce is completely smooth, about 5 minutes. If it?s too thick, then add 1 tablespoon of water at a time until desired consistency. Serve with suggested dippers, such as marshmallows, graham crackers, berries, pineapple chunks, red and/or green grapes, shortbread cookies or vanilla wafers (see Cook?s Note).\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 4.0}, {"food": "dulce de leche", "quantity": 15.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "crackers", "quantity": 1}, {"food": "pineapple chunks", "quantity": 1}, {"food": "vanilla extract", "quantity": 1}], "title": "\nCampfire Salted Caramel and Chocolate Fondue\n"}, {"directions": "\n\n              Slice the loaf in half lengthwise and hollow out the bottom half, leaving a 1/2-inch border on all sides. Save the bread filling for another (like bread crumbs).\n            \n\n              Add the olives, giardiniera, peppers, oil, capers and vinegar to a food processor and pulse until the texture is similar to a chunky relish. \n            \n\n              Layer the bottom half of bread with half of the cheese, then spread half of the olive mixture on top of the cheese. Top with the mortadella, salami, ham and the remaining cheese. Spread the remaining olive mixture on to the top half of the bread. Close the sandwich and wrap it tightly in plastic wrap. The sandwich can be made and refrigerated the night before. Pack it on the bottom of your cooler and let the weight of the other food press and flatten the sandwich.   \n            \n\n              When you are ready to serve, cut in to 6 even pieces.\n            \n", "ingredients": [{"food": "barbecue loaf", "quantity": 12.0}, {"food": "mixed nuts", "quantity": 1.5}, {"food": "", "quantity": 0.75}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 6.0}, {"food": "sliced salami", "quantity": 6.0}, {"food": "ham", "quantity": 6.0}], "title": "\nCamping Muffuletta\n"}, {"directions": "\nSpecial equipment: a 10-cup plain Bundt pan\n\n              Preheat the oven to 350 degrees F and spray a 10-cup plain Bundt pan with nonstick baking spray.\n            \n\n              Whisk the cake mix, oil, eggs and 1 cup beer in a large bowl until smooth and well-combined, at least 30 seconds. Pour the batter into the prepared pan, smoothing the top with a rubber spatula, then bake until a cake tester inserted in the center of the cake comes out clean, 45 to 50 minutes. \n            \n\n              Meanwhile, pour 2 tablespoons beer in a heatproof glass bowl and microwave until hot, about 30 seconds. Stir in 2 tablespoons granulated sugar until dissolved.\n            \n\n              Let the cake cool in the pan for 5 minutes, then invert it onto a cooling rack. Using a toothpick, poke several holes over the cake, then drizzle the beer syrup evenly over the cake until it soaks in. Let the cake cool completely.\n            \n\n              Stir the confectioners' sugar and 2 tablespoons beer together in a bowl until smooth. Add more beer, 1 teaspoon at a time, as needed to form a thick glaze. Drizzle the glaze evenly over the cake and let stand until set, about 10 minutes.\n            \n\n              Meanwhile, combine the remaining beer and 2 tablespoons granulated sugar with the cherries in a medium saucepan. Bring to a simmer over medium heat and cook, stirring, until the cherries are warmed through and the liquid is reduced to a thick syrup, about 10 minutes. Transfer the cherries to a bowl and let cool completely.\n            \n\n              Serve cake slices with the cherries on the side and a dollop of whipped cream, if using.\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 1}, {"food": "shortening cake mix", "quantity": 15.0}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "eggs", "quantity": 3.0}, {"food": "barley flour or meal", "quantity": 12.0}, {"food": "sugar", "quantity": 0.25}, {"food": "sugar", "quantity": 1.5}, {"food": "frozen yogurt", "quantity": 12.0}, {"food": "ice cream swich", "quantity": 1}], "title": "\nCan o' Beer Cake\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 350 degrees F. Line 2 rimmed baking sheets with parchment.\n            \n\n              Separate the bacon into strips and blot each dry. Spread the sugar on a large plate. Press both sides of each bacon strip in the sugar. Arrange the coated bacon on the prepared baking sheets. Sprinkle with any remaining sugar.\n            \n\n              Bake the bacon for 15 minutes, turn the strips over and continue to bake until golden and glazed, 15 to 20 minutes more (it will still be pliable). Remove to a rack and let cool; the bacon will harden but it won't be super crispy.\n            \n", "ingredients": [{"food": "bacon", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}], "title": "\nCandied Bacon\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Peel the carrots and discard the skins. Using a vegetable peeler, peel long, wide ribbons of carrot until you can no longer make ribbons. Combine the carrot ribbons with the sugar and 1 1/2 cups water in a large saucepan. Bring to a simmer over high heat, stirring occasionally, then immediately remove the carrots with tongs to a rimmed baking sheet. Spread into a single layer and let cool, pouring any syrup from the bottom of the baking sheet back into the pot. Simmer the syrup until lots of small bubbles form on the surface and it is a bright orange color, about 10 minutes. (You should have 1 cup of syrup left.) Let cool for 5 minutes, then stir in the lemon juice. Remove to a heatproof container and refrigerate until cool, 1 hour.\n            \n\n              Meanwhile, combine the apricots and raisins in a food processor and pulse until roughly chopped, about 10 pulses. Add the nuts and 1/4 teaspoon salt, scrape down the sides and pulse until the nuts are roughly chopped, another 10 pulses. Set aside. \n            \n\n              Brush an 8-inch springform pan with butter and line with 1 sheet phyllo. Tuck any phyllo the hangs over the edge into the edges of the pan. Brush generously with butter and lay the next sheet of phyllo on top going in the other direction. Brush generously with butter and repeat this pattern with the remaining phyllo. Put the nut and fruit mixture into the pan and pack it down firmly so it is evenly spread out. \n            \n\n              Arrange the carrot strips on a work surface next to each other so they are about 1-inch wide. Starting from one end, roll them up loosely. Put them on top of the nuts so you can see the spiral of the carrot. Repeat with the remaining carrots until the top is covered in 30 to 40 carrot flowers. \n            \n\n              Put the pan on a baking sheet and bake until the phyllo is golden, 25 to 30 minutes. While it is still hot, drizzle the cold syrup all over the carrots until the nuts are just covered in syrup. Remove the sides of the pan and let cool until fully cooled and set, about 2 hours, before serving.\n            \n", "ingredients": [{"food": "carrots", "quantity": 2.0}, {"food": "sugar", "quantity": 1.5}, {"food": "", "quantity": 0.5}, {"food": "apricots", "quantity": 0.5}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.5}, {"food": "", "quantity": 1.0}, {"food": "walnuts", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 1.5}, {"food": "frozen yogurt", "quantity": 5.0}], "title": "\nCandied Carrot Rose Tart\n"}, {"directions": "\n\n              Make the candied zest: Remove the grapefruit zest with a vegetable peeler and slice into thin strands. Place in a saucepan; cover with water and bring to a simmer. Drain the zest and return to the saucepan; cover with water and repeat 2 more times. Set the zest aside. Juice the grapefruit into the saucepan, reserving 1 tablespoon for the frosting. Add the liqueur and granulated sugar; bring to a simmer over medium-high heat, stirring to dissolve the sugar. Add the zest, reduce the heat to low and simmer 20 minutes. Remove with a slotted spoon; set aside. Reserve the syrup.\n            \n\n              Make the cupcakes: Preheat the oven to 350 degrees F and line a muffin pan with 12 cupcake liners. Whisk the flour, baking powder and salt in a medium bowl. Beat the butter and granulated sugar in a large bowl with a mixer on medium-high speed until light and fluffy, about 5 minutes. Beat in the eggs, one at a time, then beat in the vanilla and the grated grapefruit zest. Reduce the speed to medium and add the flour mixture in 3 additions, alternating with the milk, beginning and ending with the flour mixture; beat until the batter just comes together.\n            \n\n              Divide the batter among the muffin cups, filling each two-thirds of the way. Bake until a toothpick inserted into the centers comes out clean, 18 minutes. Poke a few holes in each cupcake with a toothpick. Reheat the grapefruit syrup; brush generously over the cupcakes (reserve the remaining syrup). Remove the cupcakes to a rack to cool completely.\n            \n\n              Make the frosting: Beat the butter in a large bowl with a mixer on medium-high speed until fluffy, about 2 minutes. Add the confectioners' sugar, food coloring, grated grapefruit zest, liqueur and the reserved 1 tablespoon grapefruit juice; beat until smooth, about 3 minutes.\n            \n\n              Spread the frosting on the cupcakes. Dip grapefruit segments in the remaining syrup and set on the cupcakes; top with the candied zest.\n            \n", "ingredients": [{"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "", "quantity": 3.0}, {"food": "sugar", "quantity": 0.5}, {"food": "potato flour", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 1.5}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "milk", "quantity": 0.5}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 3.0}, {"food": "ruby red grapefruit juice blend", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "", "quantity": 2.0}], "title": "\nCandied Grapefruit Cupcakes\n"}, {"directions": "\n\n              Cut tops and bottoms off of the orange and score the orange into quarters, cutting down only into the peel and not into the fruit. Peel the skin and pith of the orange in large pieces, use the orange for another recipe. Cut the peel into strips about 1/4-inch wide. Put the orange peel in a large saucepan with cold water to cover, bring to a boil over high heat. Then pour off the water. Repeat 1 or 2 more times depending up how assertive you want the orange peels to be. (Test kitchen liked the texture of a 3 time blanch best, it also mellowed the bitterness. But it is a matter of preference.) Remove the orange peels from the pan.\n            \n\n              Whisk the sugar with 1 1/2 cups water. Bring to a simmer and cook for 8 to 9 minutes (If you took the sugar's temperature with a candy thermometer it would be at the soft thread stage, 230 to 234 degrees F.) Add the peels and simmer gently, reducing heat to retain a simmer. Cook until the peels get translucent, about 45 minutes. Resist the urge to stir the peels or you may introduce sugar crystals into the syrup. If necessary, swirl the pan to move the peels around. Drain the peels, (save the syrup for ice tea.) Roll the peels in sugar and dry on a rack, for 4 to 5 hours. Return to the sugar to store.\n            \n\n              Cook's Note: One way to use orange peels is to stuff a dried date with a piece of orange peel and almond, then dip the entire thing into dark chocolate.\n            \n", "ingredients": [{"food": "oranges", "quantity": 6.0}, {"food": "sugar", "quantity": 4.5}, {"food": "coconut water", "quantity": 1.5}], "title": "\nCandied Orange\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Soak 1 pound bacon in 1 cup tequila and refrigerate for 2 to 8 hours. Drain and blot the bacon dry. Preheat the oven to 350 degrees F. Mix together 1 cup light brown sugar, 1 teaspoon ancho chile powder and a heaping 1/4 teaspoon cayenne pepper; spread out on a large plate. Press both sides of each bacon strip in the sugar mixture. Arrange the coated bacon on two parchment-lined rimmed baking sheet. Sprinkle with any remaining sugar mixture. Bake for 15 minutes, turn the bacon over and continue to bake until the bacon is golden and glazed, 15 to 20 minutes more (it will still be pliable). Remove to a rack and let cool; the bacon will harden but it won't be super crispy.\n            \n", "ingredients": [], "title": "\nCandied Tequila-Ancho Bacon\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Assemble the cake: Trim 1/2 inch off the short ends of the pound cake, then trim the domed top to make it flat. Stand the cake on its side and slice in half horizontally to make two equal-size rectangles.\n            \n\n              Microwave the chocolate in 30-second intervals, stirring until melted. Beat the butter, 3 tablespoons milk and the confectioners' sugar with a mixer. Beat in the melted chocolate. Add more milk, if needed, to make the frosting spreadable.\n            \n\n              Lay the cake rectangles on a rack set on a rimmed baking sheet. Spread some of the frosting on one short end of each cake and press together to form a long rectangle. (You can slide a thin piece of cardboard under the cake for moving to a platter later.)\n            \n\n              Spread the remaining frosting on the cake in a 1-inch-thick layer, making the edges slightly higher than the center. Smooth the top and sides with an offset spatula. Freeze until firm, about 30 minutes.\n            \n\n              Mix the peanuts and dulce de leche in a bowl.\n            \n\n              Remove the cake from the freezer. Spread the peanut mixture on the frosting in a flat, even layer. Freeze until the dulce de leche is firm, about 30 minutes.\n            \n\n              Meanwhile, make the chocolate coating: Microwave the chocolate and butter in 30-second intervals, stirring, until melted and smooth.\n            \n\n              Pour the chocolate on the cake and spread it evenly over the top and sides with an offset spatula. Freeze until the chocolate cools slightly, 6 to 8 minutes.\n            \n\n              Starting at a short end of the cake, dip the edge of an offset spatula into the chocolate at an angle and gently pull up, repeating along the top of the cake to create a wave pattern. Chill 10 minutes before serving.\n            \n\n              Photograph by Kat Teutsch\n            \n", "ingredients": [{"food": "rice cake", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 3.0}, {"food": "butter oil", "quantity": 12.0}, {"food": "milk", "quantity": 3.0}, {"food": "sugar", "quantity": 1.0}, {"food": "peanuts", "quantity": 0.75}, {"food": "dulce de leche", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 10.0}, {"food": "butter oil", "quantity": 1.0}], "title": "\nCandy Bar Cake\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Line a baking sheet or pan with foil.\n            \n\n              Put the chocolate in a heatproof bowl. Bring a saucepan filled with an inch or so of water to a very slow simmer; set the bowl over, but not touching, the water, and stir with a rubber spatula. Just before the chocolate is completely melted, add the oil and stir to blend. Remove from the heat and stir vigorously until completely smooth. Set aside and let cool until just slightly warm, about 8 minutes\n            \n\n              Add all but a few pieces of the candy and quickly stir to combine. Spread the chocolate mixture on the prepared baking sheet so it's about 1/2 inch thick and the candy is coated. Scatter the remaining candy on top. Set aside at room temperature until firm, about 2 hours. Remove from the foil and break into pieces. Store in an airtight container at room temperature for up to 2 weeks.\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 21.0}, {"food": "vegetable oil", "quantity": 1.5}, {"food": "", "quantity": 1.75}], "title": "\nCandy Bark\n"}, {"directions": "\n\n              Spray one 8-inch-round cake pan and two 6-cup Bundt pans with cooking spray. Beat the cake mixes, eggs, buttermilk and oil with a mixer; divide among the pans. Bake until a toothpick comes out clean, about 25 minutes for the round cake and 30 to 35 minutes for the Bundts; let cool. \n            \n\n              Tint the vanilla frosting with orange food coloring. Trim the flat sides of the Bundt cakes and the top of the round cake to make level. Turn 1 Bundt cake upside down; spread with frosting. Top with the round cake, more frosting and the other Bundt cake, then frost the whole cake and chill 30 minutes. \n            \n\n              Lightly dust a sheet of wax paper with cornstarch. Roll out the fondant on the paper into a 21-by-8-inch rectangle, about 1/8 inch thick. Cut into 12 strips, 8 inches long and 1 3/4 inches wide, tapering the ends as shown. \n            \n\n              Attach the fondant strips to the cake, lightly pressing and smoothing them from the base of the cake upward. Refrigerate the cake 30 minutes. \n            \n\n              Draw jack-o'-lantern eyes, a nose and a mouth on paper and cut them out; attach to the cake with toothpicks. Score around the cutouts with a paring knife, then remove the toothpicks and paper. \n            \n\n              Trace the scored lines with the knife, cutting through the fondant and slightly into the cake. Pry out the pieces with the tip of the knife. \n            \n\n              Cut a 1-inch-deep circle out of the top of the cake. Put the dark chocolate frosting in a resealable plastic bag; snip the corner and pipe the frosting into the cutouts. \n            \n\n              Twist the 2 strings of licorice together and insert into the top of the cake to make a handle. Fill the top of the cake with snack-size candy.\n            \n\n              Photograph by Kat Teutsch\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "shortening cake mix", "quantity": 2.0}, {"food": "eggs", "quantity": 8.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 0.6666666666666666}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "orange", "quantity": 12.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "black bean mango", "quantity": 2.0}, {"food": "dessert topping", "quantity": 1}], "title": "\nCandy Bucket Cake\n"}, {"directions": "\n\n              Make the crust: Position a rack in the lower third of the oven and preheat to 375 degrees F. Pulse the cookies and granulated sugar in a food processor until finely ground. Add the melted butter and pulse until combined.\n            \n\n              Lightly coat a 9-inch tart pan with a removable bottom with cooking spray. Press the crumb mixture into the bottom and up the side of the pan. Bake until set, about 15 minutes, then transfer to a rack to cool completely.\n            \n\n              Meanwhile, make the filling: Heat the milk in a saucepan over medium-high heat until it starts simmering, then remove from the heat. Whisk the egg yolks, granulated sugar, cornstarch and salt in a medium bowl until combined. Gradually whisk one-third of the warm milk into the egg mixture, then pour into the saucepan with the remaining milk. Cook over medium heat, whisking constantly, until the mixture starts to bubble and thicken, about 3 minutes. Continue boiling, whisking, until the mixture is thick like pudding, about 2 more minutes. Remove from the heat, then whisk in the semisweet and mint-flavored chocolate and the butter. Pour into the prepared crust and spread evenly. Refrigerate until set, about 1 1/2 hours.\n            \n\n              Right before serving, beat the heavy cream, confectioners' sugar and peppermint extract in a medium bowl with a mixer on medium speed until soft peaks form. Spread the whipped cream on the tart and sprinkle with sanding sugar.\n            \n\n              Photographs by Johnny Miller\n            \n", "ingredients": [{"food": "chocolate chip cookies", "quantity": 1.0}, {"food": "sugar", "quantity": 0.25}, {"food": "butter oil", "quantity": 1.0}, {"food": "", "quantity": 1}, {"food": "whole milk", "quantity": 2.0}, {"food": "egg substitute", "quantity": 4.0}, {"food": "sugar", "quantity": 0.5}, {"food": "cornstarch", "quantity": 3.0}, {"food": "salt", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 6.0}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "sugar", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "sugar", "quantity": 1}], "title": "\nCandy Cane Chocolate Tart\n"}, {"directions": "\n\n              Beat the butter, superfine sugar and salt in a large bowl with a mixer on medium speed until light and fluffy, about 3 minutes. Beat in the egg, vanilla and peppermint extract. Reduce the mixer speed to low and beat in the flour until incorporated. Transfer the dough to a piece of plastic wrap and pat into a rectangle; tightly wrap and refrigerate until firm, at least 1 hour or overnight.\n            \n\n              Line 2 baking sheets with parchment paper. Spread some red sanding sugar and superfine sugar on separate plates. Gently roll heaping teaspoonfuls of dough into short logs with your hands. One at a time, roll half of the logs in red sanding sugar to form 4-inch strands. Repeat with the remaining logs and superfine sugar. Twist 1 strand of each color together, then arrange on the prepared baking sheets, about 2 inches apart, and bend the tops to form candy canes. Refrigerate until firm, about 15 minutes. Meanwhile, position racks in the upper and lower thirds of the oven and preheat to 350 degrees F.\n            \n\n              Bake, switching the pans halfway through, until the cookies are set and lightly browned around the edges, 11 to 13 minutes. Let cool completely on the baking sheets.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.5}, {"food": "sugar", "quantity": 0.75}, {"food": "salt", "quantity": 0.25}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.25}, {"food": "potato flour", "quantity": 2.0}, {"food": "sugar", "quantity": 1}], "title": "\nCandy Cane Cookies\n"}, {"directions": "\n\n              Make the pastry puffs: Preheat the oven to 450 degrees F and line 2 baking sheets with parchment paper. Bring 1 cup water, the butter, granulated sugar and salt to a boil in a medium saucepan. Remove from the heat and sift the flour directly into the pan; stir with a wooden spoon until a paste forms. Return to medium heat and cook, stirring constantly, until the paste is shiny and pulls away from the side of the pan, about 3 minutes.\n            \n\n              Transfer to a stand mixer fitted with the paddle attachment and beat on medium speed to cool slightly, about 2 minutes. Beat in 1 egg until incorporated, then beat in 1 more egg. Whisk the third egg in a small bowl, then beat into the dough, 1 tablespoon at a time, until just smooth and tight. (You may not need all of the third egg.)\n            \n\n              Transfer the dough to a pastry bag fitted with a 1/4-inch round tip. Pipe 1 1/4-inch rounds of dough onto the prepared baking sheets, about 1 inch apart; you should have about 50 puffs. (Alternatively, drop the dough in small mounds onto the baking sheets with a spoon.) Smooth the dough peaks with a dampened finger, then transfer to the oven and bake until puffed, 10 minutes. Reduce the oven temperature to 350 degrees F and continue baking until golden, 5 more minutes. Turn off the oven but leave the puffs inside to dry out, 5 to 7 more minutes. Remove from the oven and pierce a small hole in each puff with a paring knife to let steam escape; transfer to a rack to cool completely.\n            \n\n              Make the filling: Put the white chocolate in a medium heatproof bowl. Bring the heavy cream to a boil in a small saucepan, then pour it over the chocolate. Gently whisk until smooth and cool, about 7 minutes; whisk in the peppermint extract. Stir in the mascarpone until combined. Cover and refrigerate until thick enough to pipe, about 30 minutes. Transfer to a large pastry bag fitted with a 1/4-inch round tip.\n            \n\n              Insert the tip of the pastry bag into the hole in each puff and pipe in the filling. Transfer the filled puffs to a baking sheet; refrigerate at least 30 minutes or up to 2 hours.\n            \n\n              Make the icing: Whisk the confectioners' sugar and milk in a large bowl until smooth. Assemble the croquembouche: Dip the bottom of a puff into the icing, letting the excess drip off. Transfer the puff to a platter, icing-side down. Repeat with more puffs, arranging them side-by-side in a 7-inch circle. Fill in the circle with more puffs to stabilize the base of the tower. Continue building a conical tower of puffs, using the icing to hold them in place. (If the icing becomes too thick, whisk in more milk, 1 teaspoon at a time.)\n            \n\n              Dust the croquembouche with confectioners' sugar and sprinkle with crushed candy canes; chill until set, about 15 minutes.\n            \n\n              Photographs by Johnny Miller\n            \n", "ingredients": [{"food": "butter oil", "quantity": 6.0}, {"food": "sugar", "quantity": 1.0}, {"food": "salt", "quantity": 0.25}, {"food": "potato flour", "quantity": 1.0}, {"food": "eggs", "quantity": 3.0}, {"food": "baking chocolate", "quantity": 10.0}, {"food": "ice cream swich", "quantity": 0.6666666666666666}, {"food": "vanilla extract", "quantity": 0.25}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "sugar", "quantity": 2.5}, {"food": "whole milk", "quantity": 0.25}, {"food": "dessert topping", "quantity": 1}], "title": "\nCandy Cane Croquembouche\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: Baker's twine, 12 cardboard lollipop sticks and a piping bag or resealable plastic bag\n\n              Preheat the oven to 225 degrees F and line 2 baking sheets with parchment paper. Place 3 lollipop sticks on one of the baking sheets. Lay 2 candy canes in a heart shape around each stick, making sure the stick touches the inside of both candy canes at the top and bottom of the heart. Bake for 3 to 4 minutes, until the candy canes are slightly soft and malleable and very warm, but not hot to the touch.\n            \n\n              With your fingers, press the candy canes together, adhering them to the stick at the top and bottom. Gently bend the outer edges of the candy canes outwards to widen the heart shape. (If the candy canes harden too quickly, you may return to the oven for 30 seconds and try again.) Let cool completely on the baking sheet. Repeat with the remaining candy canes and sticks, using the other baking sheet and rotating the use of the sheets while the others cool.\n            \n\n              Once all of the hearts are formed and cooled, line them up on a piece of parchment placed on a work surface. Melt the white chocolate or candy melts in a bowl in the microwave on 50 percent power in 30 second intervals, stirring in between, 1 to 2 minutes total.\n            \n\n              Transfer the melted chocolate to a piping bag or resealable plastic bag with a corner snipped off and pipe it into the center of the hearts, spreading it to the edges with a small spoon or spatula. Sprinkle with the decorations of your choice. Let the pops harden completely at room temperature or in the refrigerator.\n            \n\n              Ornament Variation: Make the candy cane hearts without the lollipop sticks and let cool. Tie a decorative ribbon around the top of the heart, then fill with white chocolate and decorate.\n            \n", "ingredients": [{"food": "", "quantity": 24.0}, {"food": "martha white foods", "quantity": 8.0}, {"food": "barley flour or meal", "quantity": 1}], "title": "\nCandy Cane Heart Pops\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 275 degrees F and line a rimmed baking sheet with parchment paper.\n            \n\n              Spray 3 soup spoons lightly with cooking spray. Place 3 unwrapped candy canes on the prepared baking sheet and bake until the candy canes are slightly soft and pliable and very warm to the touch, 8 to 10 minutes. Gently lift a candy cane and place onto one of the greased spoons (if they're too hot to touch, lift with a paper towel.) Mold and gently press the curved top of the candy cane into the bowl of the spoon so that it takes the shape of the spoon; the center of the bowl will be bare. Mold the straight part of the candy cane to the handle of the spoon. If the candy canes cool too quickly, you can pop them back in the oven for a minute or two to soften again. Let cool on the spoons while you bake the next batch of candy canes, continuing until you've molded them all.\n            \n\n              Melt the 3 chocolates in 3 separate small bowls by microwaving each on 50 percent power in 20-second intervals, stirring in between each, until melted.\n            \n\n              Dip the bowls of the candy cane spoons into the melted chocolate; you will have 4 of each type of chocolate. Set the spoons so that the chocolate-covered bowls sit flat on the cooled baking sheet and the handles tilt upward resting on the baking sheet rim. Let the chocolate set slightly, 10 to 15 minutes at room temperature or 5 minutes in the refrigerator. Keep the remaining chocolate in the bowls warm and melted, returning them to the microwave if necessary.\n            \n\n              Spoon some melted chocolate into the open unfilled space in the bowls of the spoons. Sprinkle with marshmallows, chocolate chips or crushed candy canes, mounding them in the center so they look like they're on the spoon. Let harden completely at room temperature, about 1 hour, or in the refrigerator, 15 to 20 minutes. \n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "", "quantity": 12.0}, {"food": "baking chocolate", "quantity": 4.0}, {"food": "baking chocolate", "quantity": 4.0}, {"food": "baking chocolate", "quantity": 4.0}, {"food": "", "quantity": 1}, {"food": "baking chocolate", "quantity": 1}, {"food": "", "quantity": 1}], "title": "\nCandy Cane Hot Cocoa Spoons\n"}, {"directions": "\n\n              Prepare the ice cream: Let the ice cream soften slightly at room temperature, 5 minutes. Transfer to a stand mixer fitted with the paddle attachment and beat until creamy but not melted, about 1 minute. Add 1/2 teaspoon peppermint extract and the crushed candy canes and beat until just incorporated, about 30 seconds. Transfer to a small metal baking dish or loaf pan, cover and freeze until firm, 1 to 2 hours.\n            \n\n              Meanwhile, preheat the oven to 300 degrees F and line a baking sheet with parchment paper. Using a bowl or cake pan as a guide, trace an 8-inch circle onto the parchment with a pencil, then flip the parchment over (the circle should still be visible); set aside.\n            \n\n              Make the meringue: Fill a medium saucepan with 1 to 2 inches of water and bring to a simmer over medium-high heat; remove from the heat. Combine the egg whites, sugar and salt in a large heatproof bowl and set over the hot water (do not let the bowl touch the water). Whisk until the egg whites are foamy and hot, about 5 minutes. Remove the bowl from the pan and beat with a mixer on medium speed until stiff and shiny, about 10 minutes. Beat in the remaining 1/2 teaspoon peppermint extract until combined.\n            \n\n              Transfer the meringue to a pastry bag fitted with a 1/2-inch round tip. Pipe in a tight spiral onto the prepared parchment-lined baking sheet, starting in the middle of the circle and working toward the outer edge. Pipe more meringue around the outer edge of the circle to build up the side about 2 inches high. Dip a small paintbrush or toothpick in the food coloring, then drag it around the meringue spiral to create streaks. Repeat several times.\n            \n\n              Bake until the meringue is just firm but not brown, about 1 hour. (If it starts browning, reduce the oven temperature to 275 degrees F.) Transfer to a rack and let cool completely. (The meringue will continue to harden as it cools.) Carefully invert the meringue onto a platter and gently peel off the parchment. Invert again and set on the platter. Top with scoops of the prepared peppermint ice cream and sprinkle with more crushed candy canes. Freeze until ready to serve, up to 2 days.\n            \n\n              Photographs by Johnny Miller\n            \n", "ingredients": [{"food": "ice cream swich", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "dessert topping", "quantity": 0.25}, {"food": "egg substitute", "quantity": 4.0}, {"food": "sugar", "quantity": 1.25}, {"food": "hearts of palm", "quantity": 1}, {"food": "", "quantity": 1}], "title": "\nCandy Cane Pavlova\n"}, {"directions": "\n\n              Line a 9-by-13-inch pan with foil. Bring the marshmallows, sugar, cream, butter and salt to a simmer in a medium saucepan over medium heat, stirring constantly. Continue to stir until the marshmallows melt and the sugar dissolves. Remove the saucepan from the heat, add the white chocolate chips and vanilla, and stir until the chips are completely melted.\n            \n\n              Pour the mixture into the prepared pan and scatter the candy canes over the top. Let cool to room temperature, then wrap and refrigerate until chilled and firm, about 2 hours. Using the foil, lift the fudge from the pan and put on a cutting board. Cut the fudge into 1-inch squares.\n            \n", "ingredients": [{"food": "", "quantity": 4.0}, {"food": "sugar", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "baking chocolate", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "", "quantity": 3.25}], "title": "\nCandy Cane White Chocolate Fudge\n"}, {"directions": "\nSpecial equipment: skewers, optional and a pastry brush\n\n              Place 2 blocks of yellow cheese side by side on a cheese board. Press them together so they touch. Stack the remaining 2 blocks of yellow cheese on top of them. Stack the blocks of white cheese on top of the yellow in the same way. If desired, insert 2 skewers down through the top of the blocks to hold them together.\n            \n\n              Using a sharp knife, carve away the sides of the cheese blocks to resemble the bottom two-thirds of a piece candy corn. (You will add the white tip at the end using the goat cheese.) Reserve the cheese scraps for another use, such as queso sauce or grilled cheese sandwiches. After carving, remove the skewers from the tower if using. \n            \n\n              Using your hands, mold the goat cheese into the tip of the candy corn and add it to the cheese stack. Shape it to a point using a butter knife or offset spatula. Whisk together the red wine and paprika in a small bowl and paint it onto the white cheese portion with a pastry brush. Serve with an array of crackers.\n            \n", "ingredients": [{"food": "macaroni cheese", "quantity": 8.0}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 2.0}, {"food": "paprika", "quantity": 1.0}, {"food": "", "quantity": 1}], "title": "\nCandy Corn Cheese Tower\n"}, {"directions": "\n\n              Infuse the vodka: Combine the candy corn and vodka in an airtight container; set aside for at least 3 hours, then strain. \n            \n\n              Make the cordials: Add 4 ounces of the candy corn vodka, the orange liqueur, lemon juice and egg white to a cocktail shaker filled with ice. Shake vigorously for at least 30 seconds. Strain into 2 chilled martini glasses and garnish with candy corn.\n            \n\n              Photograph by by Levi Brown;\n            \n", "ingredients": [{"food": "corn bran", "quantity": 0.5}, {"food": "", "quantity": 1.5}, {"food": "orange", "quantity": 2.0}, {"food": "", "quantity": 0.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "corn bran", "quantity": 1}], "title": "\nCandy Corn Cordials\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: a 6-by-3-by-2 1/2 inch mini loaf pan\n\n              Line a 6-by-3-by-2 1/2 inch mini loaf pan with foil, being sure to leave a 2-inch overhang on the long sides of the pan. Lightly spray the foil with cooking spray and set aside.\n            \n\n              Combine the sweetened condensed milk and chocolate in a bowl and microwave for 1 minute. Using a whisk, stir them together until smooth. Pour half of the mixture into another bowl. Stir 3 to 4 drops of orange food coloring into one of the bowls and set aside. Pour half of the remaining mixture into another bowl and add 2 to 3 drops of yellow food coloring to one of them, stirring until evenly distributed. \n            \n\n              Pour the yellow mixture into the prepared pan. Tap the pan against a flat surface to ensure that it is smooth and even, then chill for 5 minutes. Pour on the orange mixture and spread it into a smooth and even layer. Tap on a flat surface again, and chill 5 minutes more. Top off the fudge with the white mixture, cover with plastic wrap and then chill in the refrigerator until completely set and firm, at least 1 hour and up to overnight. \n            \n\n              Using the foil overhang as handles, remove the fudge from the pan to a cutting board. Cut the fudge lengthwise into 1/2-inch-thick slices, and then into triangles so that they resemble candy corn. \n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "milk", "quantity": 0.75}, {"food": "baking chocolate", "quantity": 4.0}, {"food": "yellow rice", "quantity": 1}], "title": "\nCandy Corn Fudge\n"}, {"directions": "\n\n              Peel and segment the orange with a paring knife, removing the membranes and white pith. Chop the segments and toss with the orange liqueur in a bowl; set aside for about 10 minutes.\n            \n\n              Spoon the lemon curd into a small liqueur glass or brandy snifter in an even layer. Top with a thin layer of whipped cream, then pile on the oranges and dollop with the remaining whipped cream. Sprinkle with crushed shortbread cookies, if desired.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "orange", "quantity": 1.0}, {"food": "orange", "quantity": 1.0}, {"food": "lemon juice", "quantity": 3.0}, {"food": "whipped cream substitute", "quantity": 0.25}, {"food": "chocolate chip cookies", "quantity": 1.0}], "title": "\nCandy Corn Parfait\n"}, {"directions": "\n\n              Whisk 2 cups flour, 2 tablespoons sugar, 4 teaspoons baking powder and 1 teaspoon salt in a large bowl. Whisk in 2 eggs, 1 1/2 cups milk, 5 tablespoons melted shortening and 4 tablespoons melted butter. Tint half the batter orange and half yellow with food coloring. Preheat a round waffle iron to the lowest setting. Spoon some orange batter into the middle and some yellow batter around it. Cook until just crisp. Separate into triangles and dip the tips in melted white chocolate.\n            \n\n              Photograph by Ralph Smith\n            \n", "ingredients": [], "title": "\nCandy Corn Waffles\n"}, {"directions": "\n\n              Beat 3 egg whites until frothy. Beat in 3/4 cup superfine sugar and a pinch each of cream of tartar and salt until stiff peaks form. Add 1 teaspoon peppermint extract and swirl in 2 drops red food coloring. Drop by tablespoonfuls and bake about 1 hour at 300 degrees. Turn off the oven and keep meringues inside for 2 hours to dry.\n            \n", "ingredients": [], "title": "\nCandy-Cane Meringues\n"}, {"directions": "\n\n              Remove the stems from the pears. Halve lengthwise, then core. Insert a paring knife about 1/4 inch into the tapered end of each pear, then push a thin wooden pop stick about halfway into each. Arrange the pears on a parchment-lined baking sheet.\n            \n\n              Microwave the white candy melts in a medium microwave-safe bowl, stirring, until melted, 2 to 3 minutes. Hold each pear by the stick and dip into the melted candy; swirl to coat and let the excess drip off, then return cut-side down to the baking sheet.\n            \n\n              While the coating is still wet, microwave the black candy melts in a small microwave-safe bowl, stirring, until melted, about 1 minute. Transfer to a resealable plastic bag and snip off a corner. Pipe faces onto the pears. Let set, at least 1 hour.\n            \n\n              Photograph by Ralph Smith\n            \n", "ingredients": [{"food": "prickly pears", "quantity": 4.0}, {"food": "martha white foods", "quantity": 1.0}, {"food": "black bean mango", "quantity": 0.5}], "title": "\nCandy-Coated Pear Skulls\n"}, {"directions": "\n\n              1. Cut the grapes crosswise, then freeze. Puree the cantaloupe with the sugar in a blender. \n            \n\n              2. In a pitcher, combine the frozen grapes, pureed cantaloupe, lemon slices, mint sprigs, and wine. Ladle into glasses and serve.\n            \n", "ingredients": [{"food": "grapes", "quantity": 1.0}, {"food": "", "quantity": 4.0}, {"food": "sugar", "quantity": 0.8333333333333333}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}, {"food": "", "quantity": 1}, {"food": "", "quantity": 1.0}], "title": "\nCantaloupe Sangria\n"}, {"directions": "\n\n              Place 4 cups thinly sliced cantaloupe (about 1 1/4 pounds) in a pitcher. For still infused water, add 2 quarts of water. For sparkling water, add 1 quart of seltzer during prep and a second quart just before serving. Refrigerate 2 to 4 hours to allow the cantaloupe to infuse. Stir well and strain, discarding the cantaloupe. For serving, add fresh cantaloupe slices for garnish and plenty of ice. The infused water will keep refrigerated for up to 2 days.\n            \n", "ingredients": [], "title": "\nCantaloupe-Infused Water\n"}, {"directions": "\n\n              Toss the chicken with the oyster sauce in a bowl. Mix the cornstarch with 3 tablespoons cold water in another bowl. Place both bowls near the stove with the remaining ingredients.\n            \n\n              Heat a wok or deep skillet over high heat until hot. Add the peanut oil, then the scallions, ginger and garlic, and stir-fry about 20 seconds. Add the chicken mixture and stir-fry until the meat is no longer pink on the outside, 2 to 3 minutes. Stir in the mushrooms and bok choy.\n            \n\n              Add the broth and sesame oil to the skillet and bring to a boil over high heat. Add the cornstarch mixture, return to a boil and cook, tossing, until the chicken is cooked through and the sauce is thick and glossy, 2 to 3 minutes. Serve with rice, if desired.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "chicken tenders", "quantity": 1.25}, {"food": "Worcestershire sauce", "quantity": 0.5}, {"food": "cornstarch", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "", "quantity": 6.0}, {"food": "luncheon slices", "quantity": 8.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "cheesecake mix", "quantity": 8.0}, {"food": "", "quantity": 12.0}, {"food": "diced chicken", "quantity": 1.25}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "crisped rice bar", "quantity": 1}], "title": "\nCantonese Chicken and Mushrooms\n"}, {"directions": "\n\n              Heat the olive oil in a large skillet over medium heat. Add the garlic and red pepper flakes and cook until the garlic is just golden, about 1 minute. Crush the tomatoes into the skillet with your hands and add the juice. Add 1/2 teaspoon salt and simmer, stirring occasionally, until the sauce is slightly thickened, about 15 minutes. Add the zucchini and cook until crisp-tender, about 5 minutes. Season with salt.\n            \n\n              Meanwhile, bring a large pot of salted water to a boil. Add the capellini and cook as the label directs. Drain and add to the sauce along with the basil; toss to coat. Top with parmesan.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "whole milk", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "pineapple chunks", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "basil", "quantity": 0.25}, {"food": "parmesan cheese", "quantity": 1}], "title": "\nCapellini With Spicy Zucchini-Tomato Sauce\n"}, {"directions": "\n\n              Heat the milk, cream and nutmeg in a saucepan over medium heat, stirring occasionally, until steaming, 5 to 7 minutes. Reduce the heat to low and keep warm.\n            \n\n              Whisk the egg yolks and sugar in a separate saucepan until smooth. Cook over low heat, whisking constantly, until the mixture coats a spoon and registers 160 degrees F on a thermometer, about 25 minutes. Remove from the heat and gradually whisk in the warm milk mixture. Let cool 30 minutes.\n            \n\n              Transfer the eggnog to a pitcher, cover and refrigerate until cold, at least 3 hours and up to 1 day. Pour 1 to 2 tablespoons bourbon into each glass. Top with the eggnog and sprinkle with nutmeg.\n            \n\n              Photograph by Devon Jarvis/Studio D\n            \n", "ingredients": [{"food": "whole milk", "quantity": 6.0}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "nutmeg", "quantity": 0.125}, {"food": "egg substitute", "quantity": 12.0}, {"food": "sugar", "quantity": 2.0}, {"food": "barley flour or meal", "quantity": 1}], "title": "\nCapital Eggnog\n"}, {"directions": "\n\n              Line 2 baking sheets with parchment paper. Combine the granulated sugar and cinnamon in a small bowl and set aside.\n            \n\n              Whisk together the flour, baking soda and 1/4 teaspoon salt in a medium bowl. Whisk together the brown sugar, melted butter and corn syrup in a large bowl until smooth. Add the vanilla and egg and whisk until combined. Add the flour mixture and stir with a rubber spatula until just incorporated. The dough will be quite loose; refrigerate for 15 minutes to let it firm up a little.\n            \n\n              Position 2 oven racks in the center of the oven and preheat to 325 degrees F.\n            \n\n              Scoop out 12 mounds of dough, about 2 scant tablespoons each, and place them at least 2 inches apart on the prepared baking sheets. (The cookies will spread a lot during baking.) Lightly flour your hands and press the dough out until it is about 1/4-inch thick. Sprinkle each cookie with some cinnamon sugar, using all of it.\n            \n\n              Bake the cookies, switching the sheets about halfway through the baking time, until lightly browned at the edges, 10 to 12 minutes. Let the cookies rest on the sheets for 5 minutes, then carefully transfer to a rack to cool completely, about 20 minutes.\n            \n\n              To assemble: Turn 6 cookies upside-down on a cutting board. Scoop about 1/3 cup of the ice cream onto each cookie and spread it with a spoon or butter knife to the edges of the cookies. Top each with a second cookie, and press down gently to adhere. Serve the ice cream sandwiches right away, or put them in the freezer to harden for about 1 hour, then wrap and freeze for up to 2 weeks.\n            \n", "ingredients": [{"food": "sugar", "quantity": 2.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "sugar", "quantity": 0.5}, {"food": "butter oil", "quantity": 6.0}, {"food": "silk light vanilla", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 2.0}], "title": "\nCappuccino Ice Cream Sandwiches\n"}, {"directions": "\n\nFor the glazes:\n\n\n              Make the knots: Put the melted butter in a bowl. Whisk the granulated sugar and espresso powder in another bowl.\n            \n\n              Butter a 12-cup muffin pan. Divide the dough into 12 pieces; roll each piece into an 8-to-9-inch rope. Dip 1 piece of dough in the butter, letting the excess drip off, then roll in the espresso sugar. Tie the dough into a knot. Place in a muffin cup with one end of the knot facing up. Repeat with the remaining dough. Let rise, uncovered, in a warm place until doubled in size, about 1 hour, 15 minutes.\n            \n\n              Preheat the oven to 350 degrees F. Bake the knots until puffed and golden brown, about 30 minutes. Transfer to a rack and let cool 10 minutes in the pan.\n            \n\n              Meanwhile, make the glazes: Whisk 1 cup confectioners' sugar and the espresso powder in a medium bowl; add 1/4 cup heavy cream and whisk until smooth, adding more cream if necessary. In a small bowl, whisk the remaining 1/4 cup confectioners' sugar with the remaining 2 tablespoons cream until smooth. Transfer the white glaze to a resealable plastic bag.\n            \n\n              Remove the knots from the pan and dip the tops in the espresso glaze; let set 5 minutes. Snip a small corner of the bag with the white glaze and pipe over the knots.\n            \n\nBasic Sweet-Roll Dough:\n\n\n              Warm 1/2 cup water and the milk in a saucepan over low heat until a thermometer registers 100 degrees F to 110 degrees F. Remove from the heat and sprinkle the yeast on top, then sprinkle with a pinch of the sugar; set aside, undisturbed, until foamy, about 5 minutes.\n            \n\n              Whisk the melted butter, egg yolk and vanilla into the yeast mixture until combined. In a large bowl, whisk the flour, the remaining sugar, the salt and nutmeg. Make a well in the center, then add the yeast mixture and stir with a wooden spoon to make a thick and slightly sticky dough. Turn out onto a floured surface and knead until soft and elastic, about 6 minutes. Shape into a ball.\n            \n\n              Brush a large bowl with butter. Add the dough, turning to coat lightly with the butter. Cover with plastic wrap and let rise at room temperature until the dough is doubled in size, about 1 hour, 15 minutes.\n            \n\n              Turn the dough out of the bowl and knead briefly to release excess air; re-form into a ball and return to the bowl. Lightly butter a large piece of plastic wrap and lay it directly on the surface of the dough. Cover the bowl tightly with plastic wrap and refrigerate at least 4 hours or overnight.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 4.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "onion powder", "quantity": 1.0}, {"food": "nutmeg", "quantity": 1.0}, {"food": "sugar", "quantity": 1.25}, {"food": "onion powder", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 0.25}, {"food": "whole milk", "quantity": 0.5}, {"food": "", "quantity": 1.25}, {"food": "sugar", "quantity": 0.25}, {"food": "butter oil", "quantity": 4.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.5}, {"food": "potato flour", "quantity": 2.75}, {"food": "salt", "quantity": 0.75}, {"food": "nutmeg", "quantity": 0.5}], "title": "\nCappuccino Knots\n"}, {"directions": "\n\n              Position a rack in the center of the oven and preheat to 325 degrees F. Line an 8-inch square metal baking pan with a 12-by-8-inch piece of parchment paper, leaving an overhang on 2 sides.\n            \n\n              Melt the butter in a small microwave-safe bowl in the microwave, about 1 minute. Brush the parchment paper with some of the melted butter, then flip it over and press it back in the pan. Brush the other side of the paper and the sides of the pan with butter. \n            \n\n              Whisk the egg yolks and sugar vigorously in a large bowl until pale, creamy and thick, 1 to 2 minutes. Pour in the remaining melted butter and whisk until incorporated. Add the flour, cinnamon and salt, mixing until completely combined. \n            \n\n              Heat the milk in a microwave-safe bowl or measuring cup in the microwave until warm, about 1 minute. Whisk the espresso powder and vanilla extract into the milk until completely dissolved. Slowly add the milk mixture to the egg yolk mixture, whisking constantly until well combined (the batter will be thin).\n            \n\n              Beat the egg whites and the cream of tartar in a clean bowl with an electric mixer on medium speed in until stiff peaks form, about 2 minutes. Scrape the whites into the yolk mixture, gently breaking them up a little with a whisk. Using a whisk, gently stir and fold the mixture a few times to coat the whites with liquid while keeping as much volume as possible (the batter will not be homogeneous). Pour the batter into the prepared and gently smooth the top with a rubber spatula. \n            \n\n              Bake until the top is browned and puffed and the cake is mostly set with a slight jiggle in the center, about 1 hour. Let the cake cool completely in the pan, about 2 hours. \n            \n\n              To serve, dust the cake with some confectioners' sugar and a little cinnamon. Run a small offset spatula or thin knife around the edges of the pan to loosen. Use the parchment paper overhang to lift the cake from the pan and place it on a cutting board. Cut the cake into 9 squares and serve topped with whipped cream.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 6.0}, {"food": "eggs", "quantity": 3.0}, {"food": "sugar", "quantity": 0.75}, {"food": "potato flour", "quantity": 0.5}, {"food": "cinnamon", "quantity": 1.0}, {"food": "salt", "quantity": 0.125}, {"food": "milk", "quantity": 1.5}, {"food": "onion powder", "quantity": 5.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "sugar", "quantity": 1}, {"food": "ice cream swich", "quantity": 1}], "title": "\nCappuccino Magic Cake\n"}, {"directions": "\n\n              Beat the butter in a large bowl with a mixer on medium speed until smooth. Add the granulated sugar and beat until pale and thick, about 5 minutes. Whisk the egg yolks, vanilla and corn syrup in a bowl, then add to the butter mixture and beat until fluffy, about 2 minutes. Turn off the mixer and add the flour; pulse, turning the mixer on and off, until just combined. Transfer half of the dough (about 2 packed cups) to a sheet of parchment paper.\n            \n\n              Mix the coffee liqueur and espresso in a small bowl, then add to the remaining dough in the mixer along with the chocolate, pulsing until combined. Transfer the chocolate dough to another sheet of parchment paper. Pat each portion of dough into a 10-by-6-inch rectangle and cover with another sheet of parchment paper. Refrigerate until firm, about 1 hour.\n            \n\n              Roll out each portion of dough between the parchment sheets into a 12-by-8-inch rectangle, about 1/4 inch thick. Peel off the top parchment sheets and carefully invert the lighter dough onto the darker dough. Run a rolling pin over the dough to press it together. Refrigerate until firm, at least 30 minutes.\n            \n\n              Roll over the dough a few more times to make it slightly thinner, then peel off the top sheet of parchment paper and trim the dough into an even rectangle. Position the dough with a long side facing you and roll it away from you into a tight spiral, using the parchment paper to help. (The dough should be just soft enough to roll; chill or let stand at room temperature as needed.) Wrap the log with the parchment paper and freeze until firm, at least 1 hour. (The dough will keep in the freezer for up to 2 months.)\n            \n\n              Preheat the oven to 325 degrees F. Line 2 baking sheets with parchment paper. Slice the log of dough into 1/4-inch-thick rounds; place about 1 inch apart on the prepared baking sheets. Sprinkle with the raw sugar, if desired. Bake until the cookies are firm and lightly browned, 15 to 20 minutes. Let cool 2 minutes on the baking sheets, then transfer to a rack to cool completely. Store in an airtight container up to 4 days.\n            \n\n              Photograph by Steve Giralt\n            \n", "ingredients": [{"food": "butter oil", "quantity": 3.0}, {"food": "sugar", "quantity": 1.0}, {"food": "egg substitute", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "silk light vanilla", "quantity": 2.0}, {"food": "potato flour", "quantity": 4.0}, {"food": "", "quantity": 2.0}, {"food": "fava beans", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 0.6666666666666666}, {"food": "sugar", "quantity": 0.75}], "title": "\nCappuccino Pinwheels\n"}, {"directions": "\n\n              Position racks in the upper and lower thirds of the oven and preheat to 250 degrees F. Line 2 baking sheets with parchment paper. Fit a large pastry bag or large resealable plastic bag with a star tip.\n            \n\n              Beat the egg whites and cream of tartar in a large bowl with a mixer on medium speed until foamy. Increase the speed to medium high and beat until thick and opaque, about 1 more minute. Gradually add the sugar and beat until stiff shiny peaks form. Beat in 3/4 teaspoon vanilla. Transfer half of the meringue to a separate bowl; beat the espresso powder and the remaining 1/4 teaspoon vanilla into the remaining meringue.\n            \n\n              Holding the pastry bag in your hand, use a rubber spatula to spread the plain meringue on one side of the bag, filling the bag only half full. Turn the bag around and spread the coffee meringue on the other half of the bag. Twist the end of the bag so the 2 colors squish together. Pipe 1 1/2-inch meringues on the baking sheets, about 2 inches apart. Decorate with sprinkles.\n            \n\n              Bake, switching the pans halfway through, until the meringues are firm, about 2 hours. Turn off the oven and leave the meringues inside until dry and crisp, about 1 more hour.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "egg substitute", "quantity": 3.0}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "sugar", "quantity": 0.75}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "onion powder", "quantity": 2.0}, {"food": "", "quantity": 1}], "title": "\nCappuccino Swirl Meringues\n"}, {"directions": "\n\n              Wrap prosciutto around mini mozzarella balls. Thread a cherry tomato, a prosciutto-wrapped mozzarella ball and another tomato onto each skewer; toast over a flame until the tomatoes blister.\n            \n\n              Photograph by Anna Williams\n            \n", "ingredients": [], "title": "\nCaprese Bites\n"}, {"directions": "\n\n              Put the tomato slices in a large glass container or pitcher. Add the vodka (make sure it covers the tomatoes) and a pinch of salt; let infuse 6 to 12 hours at room temperature. Strain the vodka, then chill until ready to serve.\n            \n\n              Meanwhile, prick the grape tomatoes with a skewer; toss with the balsamic vinegar in a bowl and marinate 4 hours at room temperature.\n            \n\n              Drain the grape tomatoes, reserving the vinegar. Bring the vinegar to a boil in a nonreactive saucepan over medium heat. Reduce the heat and simmer until syrupy, about 20 minutes; let cool.\n            \n\n              For each drink, drizzle some of the balsamic syrup into the bottom of a chilled martini glass. Muddle 2 to 3 basil leaves with a splash of tomato-infused vodka in a cocktail shaker. Add another 1 1/2 ounces tomato-infused vodka and 1 cup ice; shake and strain into the glass. Skewer 2 marinated grape tomatoes, 2 basil leaves and a mozzarella ball on a cocktail pick and set in the martini.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [{"food": "tomatoes", "quantity": 1.25}, {"food": "hearts of palm", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "grape juice", "quantity": 16.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "basil", "quantity": 0.5}, {"food": "melon balls", "quantity": 8.0}], "title": "\nCaprese Martinis\n"}, {"directions": "\n\n              Slice the tomatoes and cheese into 1/4-inch thick slices. Arrange the salad on a serving platter or individual plates in an alternating pattern, with two to three slices of tomato for every piece of cheese. Season with the salt and pepper to taste. Scatter the basil leaves over the top and drizzle with the oil. Serve at room temperature.\n            \n", "ingredients": [{"food": "tomatoes", "quantity": 1.5}, {"food": "", "quantity": 1.0}, {"food": "sea lion", "quantity": 0.75}, {"food": "black bean mango", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 0.3333333333333333}, {"food": "vegetable oil", "quantity": 0.25}], "title": "\nCaprese Salad\n"}, {"directions": "\n\n              Mix the flour with 1/4 teaspoon each salt and pepper in a large bowl. Add the artichoke hearts and toss. Heat the olive oil in a large skillet over high heat. Add the artichoke hearts and fry until golden brown and crisp, about 3 minutes per side. Transfer to a paper towel-lined plate to drain. Remove the skillet from the heat and reserve the frying oil. \n            \n\n               Season the tomatoes with salt and pepper. Divide the mozzarella, tomatoes, prosciutto and fried artichokes among plates. Top with the basil and olives and drizzle with some of the reserved frying oil. \n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "potato flour", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "artichoke hearts", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "tomatoes", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "luncheon slices", "quantity": 8.25}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "olives", "quantity": 0.5}], "title": "\nCaprese Salad With Prosciutto and Fried Artichokes\n"}, {"directions": "\n\n              Preheat oven to 350 degrees F.\n            \n\n              Arrange the bread slices on a baking sheet, drizzle with extra-virgin olive oil, sprinkle with a little salt and pepper. Transfer to the oven and bake for 5 to 8 minutes or until golden brown. Remove from the oven and while still hot, rub the seasoned side of the toasts with the crushed clove of garlic. Reserve the toasts while you make the Caprese with Olives.\n            \n\n              In a bowl combine the diced mozzarella, tomatoes with the chopped basil and olives. Drizzle with a generous amount of extra-virgin olive oil and season with salt and pepper, to taste. Arrange a mound of the Caprese with Olives on top of each garlic toast.\n            \n\n              Cook's Note: make easy work of dicing the cheese by placing the mozzarella in the freezer for 10 to 15 minutes before dicing; the firmer the cheese, the easier it is to dice.\n            \n\n              Copyright 2005 Television Food Network, G.P. All rights reserved.\n            \n", "ingredients": [{"food": "luncheon slices", "quantity": 12.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "pepper", "quantity": 1}, {"food": "garlic powder", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "plum", "quantity": 3.25}, {"food": "chrysanthemum leaves", "quantity": 10.0}, {"food": "olives", "quantity": 10.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "pepper", "quantity": 1}], "title": "\nCaprese with Olives on Garlic Toast\n"}, {"directions": "\n\n              Fill a cocktail shaker halfway with ice. Add the gin, creme de violette, lime juice and limoncello and shake well. Rinse the inside of a cocktail glass with absinthe. Strain the drink into the glass, add the seltzer and garnish with a brandied cherry.\n            \n\n              Photograph by Jonathan Kantor\n            \n", "ingredients": [{"food": "", "quantity": 1.5}, {"food": "dulce de leche", "quantity": 0.5}, {"food": "lime juice", "quantity": 0.5}, {"food": "", "quantity": 0.25}, {"food": "", "quantity": 1}, {"food": "hearts of palm", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1}], "title": "\nCaptain Handsome\n"}, {"directions": "\n\n              1. Preheat oven to 350 degrees F. Generously butter and flour a 10-cup Bundt pan.\n            \n\n              2. For cake: Whisk flour, 1 1/3 cups sugar, 1 teaspoon pie spice, baking powder, baking soda, and salt together in a large bowl. \n            \n\n              3. Toss apples with remaining 1/4 cup sugar and 1/2 teaspoon pie spice and set aside. \n            \n\n              4. Whisk eggs and oil together in a large bowl. Whisk in sour cream, orange zest and juice, and vanilla. Pour egg mixture into dry ingredients and stir with a wooden spoon just until combined but slightly lumpy. \n            \n\n              5. Using a slotted spoon, scatter about 1/2 cup apples in bottom Bundt pan. Place about 1/3 batter on top. Repeat, alternating remaining apples and batter, ending with batter.\n            \n\n              6. Bake cake until a skewer inserted into center cake comes out clean, about 1 hour and 15 minutes. Cool 10 minutes; invert onto a rack placed over a baking sheet. Cool.\n            \n\n              7. For caramel: Stir sugar, corn syrup, and 2 tablespoons water in a small saucepan. Bring to a boil over medium heat and cook, swirling pan but not stirring, until sugar is a dark amber-colored caramel, about 15 minutes. Remove from heat; carefully pour in cream. Stir in pecans, vanilla, and salt. Cool until caramel becomes thick and syrupy; pour over cake; cool until set.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 3.0}, {"food": "sugar", "quantity": 1.3333333333333333}, {"food": "pumpkin pie spice", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 1.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 4.0}, {"food": "eggs", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "sour cream", "quantity": 0.5}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 1.3333333333333333}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "silk light vanilla", "quantity": 1.0}, {"food": "coconut water", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "pecans", "quantity": 0.75}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "salt", "quantity": 1}], "title": "\nCaramel Apple Cake\n"}, {"directions": "\n\n              Butter a 9-by-3-inch round cake pan. Make the caramel: Cook the sugar and corn syrup in a large skillet over medium-high heat, stirring occasionally, until the sugar is dissolved and the mixture is dark amber, 7 to 10 minutes.\n            \n\n              Reduce the heat to medium. Carefully add the cream and 4 tablespoons butter (it will splatter) and cook, stirring, until combined, about 3 minutes.\n            \n\n              Remove the skillet from the heat and let sit 1 minute. Pour 1 1/2 cups caramel into a glass measuring cup and set aside. Pour the remaining caramel into the prepared pan and set aside until set, about 30 minutes.\n            \n\n              Cut 3 apples into quarters and cut out the cores with a paring knife. Arrange the pieces skin-side down in the pan (overlapping them slightly) to form a ring about 1/2 inch from the edge. Save any pieces that do not fit for later.\n            \n\n              Halve the remaining whole apple crosswise. Scoop out the seeds with a melon baller or measuring spoon, leaving the stem on the top half. Chop the bottom and any of the leftover quartered apples into pieces; set aside.\n            \n\n              Arrange the apple top, stem-side down, in the center of the pan. If the quartered apples shift, just push them back into place.\n            \n\n              Preheat the oven to 350 degrees F. Make the batter: Whisk the flour, baking powder, baking soda, salt and cinnamon in a medium bowl. In a small bowl, whisk the sour cream, orange juice and vanilla.\n            \n\n              Using a stand mixer with the paddle attachment, beat the butter and sugar on medium-high speed until light and fluffy, about 5 minutes.\n            \n\n              Crack the eggs into a small bowl. Slip them into the mixer bowl, one at a time, and beat until the mixture is pale and creamy, about 5 more minutes. Scrape down the bowl and beater with a rubber spatula.\n            \n\n              With the mixer on low speed, add half of the sour cream mixture, then half of the flour mixture. Repeat. Turn off the mixer and scrape down the bowl with a rubber spatula; finish combining the batter by hand.\n            \n\n              Spread the batter over the apples in the pan. Top with the chopped apple. Bake on the middle oven rack until the cake is brown on top and springs back when pressed, 1 hour to 1 hour 20 minutes (don't worry if the top is dark). Cool in the pan on a rack.\n            \n\n              Bring 1 inch of water to a simmer in a skillet wide enough to hold the cake pan. Carefully run a sharp knife around the inside of the pan several times, then rest the pan in the water to soften the caramel, about 8 minutes. Remove the pan from the water and dry.\n            \n\n              Invert a plate on top of the cake, then flip over the cake and plate. Using pot holders or a towel, wriggle the pan off. Soften the reserved 1 1/2 cups caramel in the microwave, about 2 minutes. Drizzle the cake with some of the caramel. Slice and serve with the rest.\n            \n\n              Photographs by Kana Okada\n            \n", "ingredients": [{"food": "butter oil", "quantity": 4.0}, {"food": "sugar", "quantity": 3.0}, {"food": "silk light vanilla", "quantity": 5.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "", "quantity": 4.0}, {"food": "potato flour", "quantity": 3.0}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 1.0}, {"food": "cinnamon", "quantity": 0.5}, {"food": "sour cream", "quantity": 0.5}, {"food": "orange juice", "quantity": 0.3333333333333333}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 1.5}, {"food": "eggs", "quantity": 3.0}], "title": "\nCaramel Apple Cake\n"}, {"directions": "\n\n              Coat four 9-inch-round cake pans with cooking spray and prepare the cake mixes as directed (or coat 2 pans and make the cakes in 2 batches). Divide the batter among the pans and bake as directed. Let cool 20 minutes, then remove from the pans and let cool completely.\n            \n\n              Stack the cakes on an upside-down cake pan, spreading frosting between the layers. Freeze 30 minutes. Using a small serrated knife, trim the bottom 2 layers of the cake on an angle to resemble the bottom of an apple.\n            \n\n              Trim the top layer just enough to round the edge, then carve out a 3-inch-wide cone-shaped piece of cake from the middle where the stem would be (about1 1/2 inches deep). Gather all of the cake trimmings in a bowl.\n            \n\n              Crumble the cake trimmings and mix with just enough frosting to moisten. Clump the mixture together and mound in a ring around the hole to form the top of the apple.\n            \n\n              Cover the cake with a thin layer of frosting (this is the crumb coat-it doesn't have to be perfect). Freeze 20 minutes. Remove from the freezer and completely cover the top 4 inches of the cake and inside the cavity with more frosting.\n            \n\n              Mix the red food coloring with a dash of vanilla. Use a pastry brush to paint the top few inches of the cake a streaky red, blotting the brush on paper towels as needed. Repeat with the yellow food coloring to add a few yellow streaks.\n            \n\n              Unwrap the caramels and microwave until soft but not melted, about 20 seconds. Gather together, then flatten into a rectangle with your hands. Roll out on parchment paper to make a 7-by-26-inch rectangle, stretching with your hands as needed.\n            \n\n              Lightly brush the caramel rectangle with water where you want the peanuts to go. Sprinkle the nuts on top, then press them in with the rolling pin.\n            \n\n              Transfer the cake to a flat platter or sheet of parchment using your hands (don't touch the red part). Wrap the caramel around the cake, leaving the red top exposed. Tuck the caramel around the bottom of the cake; trim the excess with a knife so it looks like a pool of caramel. Insert a dowel into the top.\n            \n\n              Photograph by Andrew Purcell\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "shortening cake mix", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 20.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "yellow rice", "quantity": 10.0}, {"food": "soft tofu", "quantity": 70.0}, {"food": "fruit cocktail", "quantity": 1.0}], "title": "\nCaramel Apple Cake\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: 10 cup bundt pan\n\n              Preheat the oven to 350 degrees F. Generously butter and flour a 10-cup bundt pan.\n            \n\n              Whisk the flour, baking powder, baking soda, salt, 1 1/3 cup of the sugar and 1 teaspoon of the pie spice together in a large bowl. \n            \n\n              Toss the apples with the remaining 1/4 cup sugar and 1/2 teaspoon pie spice and set aside. Whisk the eggs and oil together in another bowl. \n            \n\n              Whisk in the sour cream, orange zest and juice, and vanilla. Pour the egg mixture into the dry ingredients and stir with a wooden spoon just until combined but still a bit lumpy. \n            \n\n              Using a slotted spoon, scatter about 1/2 cup of the apples in the bottom of the bundt pan. Put about a third of the batter on top. Repeat, alternating with the remaining apples and batter, ending with the batter. \n            \n\n              Bake the cake until it pulls away from the sides of the pan and a skewer inserted into the center of the cake comes out clean, about 1 hour and 15 minutes. Cool 10 minutes and invert the cake onto a rack placed over a baking sheet. Cool. (The cake can be prepared to this point a day ahead.) \n            \n\n              To make the caramel: Combine the sugar, corn syrup, and 2 tablespoons water in a small saucepan. Bring to a boil over medium heat and cook, swirling the pan but not stirring, until the sugar is dark amber-colored caramel, about 15 minutes. Pull pan from the heat and carefully pour in the cream (take care it will splatter). Stir in the pecans, vanilla, and salt. Cool until caramel becomes thick and syrupy, then evenly pour over the cake and cool until set. \n            \n", "ingredients": [{"food": "potato flour", "quantity": 3.0}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 1.0}, {"food": "sugar", "quantity": 1.3333333333333333}, {"food": "pumpkin pie spice", "quantity": 1.5}, {"food": "apples", "quantity": 4.0}, {"food": "eggs", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "sour cream", "quantity": 0.5}, {"food": "orange juice", "quantity": 1.3333333333333333}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "silk light vanilla", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "pecans", "quantity": 0.75}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "salt", "quantity": 1}], "title": "\nCaramel Apple Cake\n"}, {"directions": "\n\n              Heat the oil in a large heavy-bottom pot over medium heat until very hot and shimmering. Add the popcorn and immediately cover with a lid. Shake the pot constantly, holding the lid on with a heatproof holder, until the popping starts, about 1 minute. Reduce the heat to medium and continue to shake the pot until the popping slows to just a few per 5 seconds, 1 to 2 minutes more. Remove from the heat and let stand for another minute to allow any last kernels to pop. \n            \n\n              Spray a very large bowl with nonstick cooking spray. Put the popcorn in the bowl and remove any unpopped kernels. Add the peanuts. Spray a rubber heatproof spatula with the cooking spray and place next to the bowl. \n            \n\n              Combine the brown sugar, butter, corn syrup and salt in a medium saucepan and set over medium heat. Cook, stirring, until melted and the edges of the mixture begin to bubble. Clip a candy thermometer to the pan so the bottom of the thermometer is resting in the sugar syrup but not touching the bottom of the pan. Boil, stirring, until the thermometer registers 300 degrees F (the hard-crack stage), about 8 minutes. \n            \n\n              Turn off the burner and add the vanilla. Stir briefly--about 5 seconds--being careful not to burn yourself as the mixture bubbles up.\n            \n\n              Immediately pour the caramel evenly over the popcorn and quickly stir with the prepared rubber spatula until the pieces are mostly separated, about 3 minutes. Pull apart any larger clumps, being careful because the caramel will still be hot in spots. Stir in the apple chips. \n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "popcorn", "quantity": 0.3333333333333333}, {"food": "healthy request microwavable bowl", "quantity": 1}, {"food": "fruit cocktail", "quantity": 1.0}, {"food": "sugar", "quantity": 0.75}, {"food": "butter oil", "quantity": 6.0}, {"food": "silk light vanilla", "quantity": 0.25}, {"food": "salt", "quantity": 0.75}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "apple", "quantity": 2.0}], "title": "\nCaramel Apple Monster Munch\n"}, {"directions": "\n\n              Line 2 baking sheets with parchment paper. Heat the vegetable oil in a pot over medium-high heat. Add the popcorn kernels; cover and cook, shaking the pan, until the popping subsides. Remove from the heat and let any remaining kernels pop for 30 more seconds. Divide the popcorn between the prepared baking sheets, discarding any unpopped kernels. Scatter the apple chips and almonds on top.\n            \n\n              Make the caramel: Bring the apple juice, brown sugar and corn syrup to a boil in a large heavy-bottomed saucepan over medium-high heat. Cook without stirring until the mixture is deep amber and a candy thermometer registers 280 degrees F, about 30 minutes (the caramel will bubble vigorously toward the end of the cooking time).\n            \n\n              Stir the butter into the caramel until melted. Add 2 teaspoons salt and the apple pie spice. Add the applejack and cayenne, if using, and cook until slightly thickened, about 1 minute. Remove from the heat. Pour the hot caramel over the popcorn mixture and carefully toss with two rubber spatulas. Let cool slightly, then separate the mixture into clusters while still warm. Let cool completely.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "popcorn", "quantity": 0.6666666666666666}, {"food": "apple", "quantity": 4.0}, {"food": "almonds", "quantity": 1.0}, {"food": "apple juice", "quantity": 2.0}, {"food": "sugar", "quantity": 2.0}, {"food": "silk light vanilla", "quantity": 0.25}, {"food": "butter oil", "quantity": 12.0}, {"food": "salt", "quantity": 1}, {"food": "pumpkin pie spice", "quantity": 0.25}, {"food": "apple", "quantity": 1.0}, {"food": "pepper", "quantity": 0.75}], "title": "\nCaramel Apple Popcorn Clusters\n"}, {"directions": "\n\n              Combine the sugar, butter and salt in a medium saucepan and cook over medium heat, stirring occasionally, until dark amber, about 20 minutes.\n            \n\n              Remove the pan from the heat and carefully pour in the cream and vanilla (it will bubble up). Set the saucepan over low heat and continue cooking, whisking, until smooth and the bubbling subsides, 2 to 4 more minutes. Remove from the heat and pour into a large glass measuring cup or bowl so the caramel is about 2 inches deep. Set aside, stirring occasionally, until cooled slightly and thick enough to coat a spoon, 12 to 15 minutes.\n            \n\n              Line a rimmed baking sheet with parchment paper and coat with cooking spray. Insert a wooden stick into the center of each apple, about one-third of the way down. Holding an apple by the stick, dip it into the caramel and roll around to cover. Gently twirl the apple over the measuring cup, letting the excess caramel drip off, then turn it upside down and hold about 30 seconds to help set the caramel; place on the prepared baking sheet. Repeat with the remaining apples. Let set 15 minutes.\n            \n\n              Photograph by Andrew Purcell\n            \n", "ingredients": [{"food": "sugar", "quantity": 2.0}, {"food": "butter oil", "quantity": 6.0}, {"food": "salt", "quantity": 0.25}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "", "quantity": 1}, {"food": "apples", "quantity": 4.0}], "title": "\nCaramel Apples\n"}, {"directions": "\n\n              Remove the stems from the apples and scrub them under warm water and dry them. Insert a chopstick through the top of the apple all the way to the top and line a baking sheet with waxed paper, set aside.\n            \n\n              Put the sugar, maple syrup, corn syrup, and cream in a saucepan. Bring to a boil over medium-high heat and cook, swirling the pan but not stirring, until the mixture reaches 250 degrees F (firm ball stage) on a candy thermometer. Pull pan from the heat and stir in the butter. Tilt the saucepan and dip and spin each apple into the caramel, covering about 3/4 of the apple. Place on the prepared baking sheet until set.\n            \n\n              If using a topping spread the topping out on a sheet pan or wax paper and immediately roll the caramel coated apples in the topping. Transfer to the prepared baking sheet until set.\n            \n\n              Topping 1:\n            \n\n              2 cups chocolate wafers, graham crackers, or vanilla wafers\n            \n\n              Put the wafers or cracker of choice in a plastic storage bag and smash until coarse.\n            \n\n              Topping 2:\n            \n\n              2 cups walnuts or pecans, toasted\n            \n\n              1/3 cup dried cranberries\n            \n\n              1 tablespoon finely chopped crystallized ginger\n            \n\n              Preheat the oven to 350 degrees F.\n            \n\n              Spread the nuts on a baking sheet and toast until fragrant and brown, about 8 minutes. Pulse the nuts, cranberries, and ginger in a food processor until mixture resembles very coarse sand.\n            \n", "ingredients": [{"food": "apples", "quantity": 8.0}, {"food": "sugar", "quantity": 2.0}, {"food": "syrup", "quantity": 1.0}, {"food": "silk light vanilla", "quantity": 0.3333333333333333}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "butter oil", "quantity": 4.0}, {"food": "hearts of palm", "quantity": 1}], "title": "\nCaramel Apples\n"}, {"directions": "\nSpecial equipment: 6 to 8 chopsticks or ice pop sticks for skewering apples\n\n              Line a baking sheet with parchment. Wash and dry the apples well, insert a chopstick into the stem end of each one, and stand on the prepared baking sheet. Place the baking sheet and cream next to the stove.\n            \n\n              Put the sugar, corn syrup and 1/2 cup water in a medium saucepan with high sides and heat over medium-high heat, stirring occasionally, until the sugar dissolves, about 5 minutes.\n            \n\n              Raise the heat to high and cook without stirring until the mixture is honey colored, about 10 minutes. If you have a thermometer, it should read 330 degrees F. (If the flames reach up around the sides of the pot, keep the heat at medium high). Remove from the heat and immediately and carefully whisk in the cream (the mixture will darken as you do). Because the mixture will bubble up, use a whisk with a longer handle so the steam doesn't burn your hand.\n            \n\n              Let the mixture cool for 3 1/2 minutes, then carefully dip an apple into the caramel mixture, roll in a topping and set on the prepared baking sheet; repeat with the remaining apples. If the caramel cools while dipping, reheat it briefly over low heat, swirling occasionally; do not stir.\n            \n", "ingredients": [{"food": "apples", "quantity": 6.0}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "sugar", "quantity": 2.0}, {"food": "silk light vanilla", "quantity": 1.0}, {"food": "salt", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 1}], "title": "\nCaramel Apples\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: 2 ovenproof 6-ounce tea or coffee cups\n\n              Preheat the oven to 350 degrees F. Lightly butter 2 ovenproof 6-ounce tea or coffee cups. Tear a loosely packed 1/2 cup of the croissant pieces into slightly smaller pieces, and toss them with the melted butter in a small bowl; set aside.\n            \n\n              Whisk the egg with 2 tablespoons of the sugar in a medium bowl until the sugar is dissolved. Whisk in the half-and-half and vanilla. Stir in the remaining 1-inch croissant pieces and the caramels, and let the mixture sit, folding occasionally, for about 15 minutes. Don't worry if the mixture seems too wet; the excess moisture will be absorbed as the pudding bakes.\n            \n\n              Divide the soaked bread mixture between the prepared cups. Top each with half the buttered croissant pieces, and sprinkle with 1/4 teaspoon of the remaining sugar. Bake until the bread pudding puffs above the rim of the cups and is set, about 30 minutes. Let cool a few minutes (the pudding will sink), and serve warm.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 2.0}, {"food": "croissants", "quantity": 2.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "sugar", "quantity": 2.5}, {"food": "", "quantity": 0.75}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "soft tofu", "quantity": 4.0}], "title": "\nCaramel Bread Pudding for Two\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 350 degrees F. Line a 9-inch square baking pan with aluminum foil, leaving about a 2-inch overhang on 2 sides. Spread the coconut in a single layer on a baking sheet and set aside.\n            \n\n              Beat the butter, vanilla and salt with an electric mixer on medium speed in a large bowl until smooth and creamy. Add the confectioners' sugar and mix on low until just incorporated. Beat in the flour in 2 batches to make a smooth dough.\n            \n\n              Lightly flour your hands and press the dough into the prepared baking pan. Bake the shortbread until the edges are firm and the top is dry, 28 to 30 minutes. Top the shortbread with the caramels in an even layer. Return to the oven along with the baking sheet of coconut and cook, tossing the coconut once, until the caramels are melted and the coconut is golden, about 10 minutes.\n            \n\n              Spray the back of a spoon with cooking spray and use it to spread the caramel all over the shortbread. Sprinkle with the chocolate and let sit until the chips are melted, about 5 minutes. Sprinkle with the toasted coconut and let cool completely, about 1 hour.\n            \n\n              Using the foil overhang as handles, lift the shortbread out of the pan and cut into 12 pieces.\n            \n", "ingredients": [{"food": "coconut water", "quantity": 0.75}, {"food": "butter oil", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "salt", "quantity": 0.25}, {"food": "sugar", "quantity": 0.75}, {"food": "potato flour", "quantity": 2.0}, {"food": "", "quantity": 11.0}, {"food": "", "quantity": 1}, {"food": "baking chocolate", "quantity": 1.0}], "title": "\nCaramel Chocolate Shortbreads\n"}, {"directions": "\n\n              Boil 1/2 cup honey, 1 tablespoon molasses, 1/2 stick unsalted butter, 1 teaspoon vanilla and 1/2 teaspoon salt in a saucepan. Toss with 10 cups popcorn. Spread on a rimmed baking sheet and bake at 300 degrees until crisp, 10 to 15 minutes, checking often. Cool completely.\n            \n\n              Photograph by Corbis\n            \n", "ingredients": [], "title": "\nCaramel Corn\n"}, {"directions": "\n\n              Make the cupcakes: Preheat the oven to 350 degrees F. Line a 12-cup muffin pan with liners. Melt the butter in a small skillet over medium heat; cook, swirling the pan occasionally, until the butter is browned, 6 to 9 minutes. Immediately transfer to a medium bowl and let cool slightly. Whisk in the granulated sugar, eggs, milk and vanilla.\n            \n\n              Whisk the all-purpose flour, almond flour, baking powder and salt in a large bowl. Add the brown butter mixture and whisk until just combined (do not overmix).\n            \n\n              Divide the batter among the prepared muffin cups, filling them three-quarters of the way. Bake until the tops of the cupcakes spring back when gently pressed, 18 to 22 minutes. Let cool 5 minutes in the pan, then remove to a rack to cool completely.\n            \n\n              Meanwhile, make the frosting: Beat the butter, confectioners' sugar, pie spice and salt in a large bowl with a mixer on medium speed until just combined. Increase the mixer speed to medium high. Add the vanilla and beat until fluffy, about 3 minutes. Swirl in the dulce de leche with a rubber spatula, leaving some streaks. Transfer to a piping bag fitted with a round tip. Pipe onto the cupcakes and top with caramel corn.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "whole milk", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "potato flour", "quantity": 0.3333333333333333}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 1.5}, {"food": "sugar", "quantity": 2.0}, {"food": "pumpkin pie spice", "quantity": 0.75}, {"food": "salt", "quantity": 0.125}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "dulce de leche", "quantity": 0.5}, {"food": "corn bran", "quantity": 1}], "title": "\nCaramel Corn Cupcakes\n"}, {"directions": "\n\n              Bring 1 cup sugar and 2 teaspoons lemon juice to a boil in a saucepan over medium-high heat, stirring to dissolve the sugar. Continue to cook, swirling the pan but not stirring, until amber. Remove from the heat and carefully stir in 3/4 cup heavy cream and 2 tablespoons bourbon. Return to the heat and whisk until smooth; swirl in 2 tablespoons butter. Put 2 scoops vanilla ice cream in each glass and fill with root beer; drizzle with the caramel sauce.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nCaramel Floats\n"}, {"directions": "\n\n              Whisk 4 ounces chopped bittersweet or semisweet chocolate into the warm caramel sauce until smooth. Drizzle over vanilla ice cream.\n            \n\n              Photograph by Karl Juengel\n            \n", "ingredients": [], "title": "\nCaramel Ganache\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Whisk together the espresso powder and 1/4 cup hot water in a medium bowl until the espresso powder completely dissolves. Add 3/4 cup of the dulce de leche and stir until well combined.\n            \n\n              Beat 3 cups of the heavy cream in a large bowl with an electric mixer on medium speed to medium peaks, about 2 minutes. Add the espresso and dulce de leche mixture to the cream and beat to very stiff peaks, about 1 minute more.\n            \n\n              Arrange the chocolate wafer cookies to make a 9 1/2-by-4-inch rectangle directly in the center of a large, flat serving platter (breaking up 1 of the cookies to fill in any gaps). Spread 1/4 cup of the espresso-dulce de leche cream on top of the cookies. Lay 8 ladyfingers flat across this cream layer and then spread a third of the remaining cream mixture on top of the ladyfingers. Repeat this process 2 more times with the remaining ladyfingers and cream mixture. Use an offset spatula to spread the top layer of cream mixture evenly over the top and down the sides to cover the icebox cake completely. Cover with plastic wrap and refrigerate 8 hours and up to overnight. \n            \n\n              Once completely chilled, remove the plastic wrap from the cake. Beat the remaining 1/2 cup heavy cream in a medium bowl with an electric mixer (or by hand) to medium peaks. Spread the whipped cream on top of the cake. Microwave the remaining dulce de leche in a small microwave-safe bowl until it is loose enough to drizzle. Drizzle evenly on top of the cake, then sprinkle with the crushed espresso beans.\n            \n", "ingredients": [{"food": "onion powder", "quantity": 2.0}, {"food": "dulce de leche", "quantity": 13.0}, {"food": "ice cream swich", "quantity": 3.5}, {"food": "chocolate chip cookies", "quantity": 9.0}, {"food": "chocolate chip cookies", "quantity": 24.0}, {"food": "fava beans", "quantity": 0.25}], "title": "\nCaramel Latte Icebox Cake\n"}, {"directions": "\n\n              1. Preheat oven to 350F. Butter a 9-inch cake pan, line with parchment paper, and butter parchment paper.\n            \n\n              2. For Peaches: Stir sugar, corn syrup, allspice berries, and water in a medium saucepan. Cook, stirring continually, over medium heat, until sugar dissolves. Increase heat to high and cook, without stirring, until mixture turns an amber caramel, about 5 minutes. Remove from heat and discard allspice. Pour caramel into pan and cool. Cut peaches into wedges and arrange in concentric circles on caramel. Set aside.\n            \n\n              3. For Cake: Whisk flour, cornmeal, baking powder, baking soda, and salt in a medium bowl. Beat butter and sugar in a large bowl with an electric mixer on high speed until light and fluffy, about 5 minutes. Beat in eggs, one at time. Reduce speed to low. Add dry ingredients in 3 additions, alternating with sour cream, and beginning and ending with dry ingredients. Increase speed to medium and mix until batter is smooth, about 20 seconds.\n            \n\n              4. Spread batter evenly over peaches and bake until cake is golden brown and a toothpick inserted in center comes out clean, about 40 to 45 minutes. Cool cake for 20 minutes, in pan, on a rack.\n            \n\n              5. Slide a knife around edge of cake pan, invert pan onto a serving plate, and release cake. Remove parchment paper. Serve warm or at room temperature.\n            \n", "ingredients": [{"food": "sugar", "quantity": 0.6666666666666666}, {"food": "silk light vanilla", "quantity": 1.0}, {"food": "allspice", "quantity": 6.0}, {"food": "coconut water", "quantity": 1.0}, {"food": "peaches", "quantity": 3.0}, {"food": "potato flour", "quantity": 0.75}, {"food": "yellow rice", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 0.5}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "eggs", "quantity": 2.0}, {"food": "sour cream", "quantity": 0.5}], "title": "\nCaramel Peach Upside Down Cake\n"}, {"directions": "\n\n              Position a rack in the middle of the oven and preheat to 350 degrees F. Butter a 9-inch cake pan, line bottom with parchment paper and brush the paper with butter.\n            \n\n              Caramel peaches: Combine the sugar, corn syrup, allspice and water in a medium saucepan. Stir over medium heat until the sugar dissolves. Increase the heat to high, and continue to cook, without stirring, until the mixture becomes an amber caramel, about 5 minutes. Pour the caramel into the prepared pan and set aside to cool.\n            \n\n              Halve and pit the peaches, but leave their skins on. Cut each half into 3 wedges. Arrange the wedges in concentric circles in the pan. Set aside while you make the cake batter.\n            \n\n              Cake: Whisk the all-purpose flour, white corn flour, baking powder, baking soda, and salt in a medium bowl.\n            \n\n              Slowly mix the butter and sugar in a large bowl with a hand-held electric mixer. Increase the speed to high, and continue beating until the butter is light and fluffy, about 5 minutes. Add the eggs 1 at time, waiting for each to be fully incorporated before adding the next.\n            \n\n              While mixing at a low speed, add the dry ingredients in 3 additions, alternating with the sour cream in 2 additions, beginning and ending with the flour. Increase the speed to medium and mix briefly to make a smooth batter. Pour the batter over the peaches and smooth over.\n            \n\n              Bake the cake until golden brown and a toothpick inserted in the center comes out clean, about 40 to 45 minutes. Cool the cake in the pan on a rack, about 20 minutes.\n            \n\n              Run a knife around the edge of the pan to release the cake. Carefully invert the cake onto a serving plate and remove the parchment paper. Serve warm or at room temperature with ice cream or whipped cream, if desired.\n            \n\n              Serving suggestions: Vanilla ice cream or whipped cream.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "silk light vanilla", "quantity": 1.0}, {"food": "allspice", "quantity": 6.0}, {"food": "coconut water", "quantity": 1.0}, {"food": "peaches", "quantity": 3.0}, {"food": "potato flour", "quantity": 0.75}, {"food": "martha white foods", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 0.25}, {"food": "", "quantity": 0.5}, {"food": "eggs", "quantity": 2.0}, {"food": "sour cream", "quantity": 0.5}, {"food": "ice cream swich", "quantity": 1}], "title": "\nCaramel Peach Upside-Down Cake\n"}, {"directions": "\n\n              Line a sheet pan with parchment paper or foil. Spray with nonstick cooking spray.\n            \n\n              Just before you make the caramel, core and cut pears into eight wedges, blunting the cut side so that it can lay on a flat surface peel side up. Place a skewer into each wedge, cover with paper towel, and set aside.\n            \n\n              Combine sugars, corn syrup, butter, 1/2 cup heavy cream, vanilla and nutmeg in a heavy sauce pot. Bring to a boil over medium-high heat, stirring constantly with a wooden spoon. When the mixture has come to a brisk boil, slowly add in the remaining cream, keep the mixture boiling. Be sure to wipe any extra sugar from the side of the pot. Clip a candy thermometer to the side of the pot with the tip immersed. Boil the mixture briskly, stirring gently, until the mixture registers 240 degrees F on the candy thermometer, about 10 minutes. Immediately remove from the heat. Pour the caramel into a medium heat proof bowl using a rubber spatula so that you do not scrape the bottom of the pot. Let caramel rest until it thickens and cools slightly, about 3 minutes.\n            \n\n              Blot excess moisture from the pears using the paper towels. Dip pears completely into caramel, swirling until it is fully coated, allow excess to drip off slightly. Place on prepared sheet pan. Decorate with black sesame seeds for eyes and candy button noses, while the caramel is still soft. Repeat until all the pears are dipped. Allow to cool until firm about 30 minutes. Serve.\n            \n\n              Halloween Web 2008\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "prickly pears", "quantity": 4.0}, {"food": "", "quantity": 36.0}, {"food": "sugar", "quantity": 0.5}, {"food": "sugar", "quantity": 0.5}, {"food": "corn bran", "quantity": 0.75}, {"food": "butter oil", "quantity": 4.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "nutmeg", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "sesame seeds", "quantity": 1}, {"food": "yellow rice", "quantity": 1}], "title": "\nCaramel Pear Mice\n"}, {"directions": "\n\n              Melt 1/3 cup butter with 1 tablespoon honey and a pinch of salt. Toss with 12 cups popcorn and 1 cup pecans. Spread on a parchment-lined baking sheet and bake 15 minutes at 325 degrees F, tossing. Cool.\n            \n", "ingredients": [], "title": "\nCaramel Popcorn\n"}, {"directions": "\n\n              Dip marshmallows halfway into the warm caramel. Let the excess drip off, then dip in crushed pretzels and place on a lightly oiled parchment-lined baking sheet until set. Drizzle with melted chocolate.\n            \n\n              Photograph by Karl Juengel\n            \n", "ingredients": [], "title": "\nCaramel Puffs\n"}, {"directions": "\n\n              Combine the heavy cream, corn syrup, butter and salt in a saucepan. Bring to a simmer over medium heat, whisking; remove from the heat.\n            \n\n              Sprinkle the sugar evenly in a large skillet. Cook over medium heat, undisturbed, until the sugar melts and starts caramelizing, about 5 minutes. Continue cooking, swirling the pan (but not stirring) until the caramel is dark amber, 10 to 15 more minutes.\n            \n\n              Remove from the heat and add the warm cream mixture. Return to medium heat and bring to a simmer; cook, whisking, until smooth, about 7 minutes. Stir in the vanilla. Let cool slightly before serving. To store, let cool completely, then cover and refrigerate up to 2 weeks; reheat before serving.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "ice cream swich", "quantity": 1.0}, {"food": "silk light vanilla", "quantity": 2.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "salt", "quantity": 0.25}, {"food": "sugar", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}], "title": "\nCaramel Sauce\n"}, {"directions": "\n\n              See how to make caramel\n            \n\n              Stir 1 1/3 cups chopped nuts into the warm caramel; cool until the mixture is thick enough to hold its shape. Drop spoonfuls onto an oiled parchment-lined baking sheet; let set. Top with melted chocolate and sprinkle with coarse sea salt.\n            \n\n              Photograph by Karl Juengel\n            \n", "ingredients": [], "title": "\nCaramel Turtles\n"}, {"directions": "\n\n              Spread the sugar in a medium skillet. Sprinkle with the lemon juice and 1/4 cup water. Set the skillet over medium-low heat and cook, stirring occasionally, until the sugar melts, about 2 to 3 minutes. Once the sugar has melted, stop stirring and cook, swirling the contents occasionally, until the sugar syrup is a deep amber color, about 12 to 15 minutes.\n            \n", "ingredients": [{"food": "sugar", "quantity": 1.5}, {"food": "lemon juice", "quantity": 0.5}], "title": "\nCaramel for a Gingerbread House\n"}, {"directions": "\n\n              Put the sugar, corn syrup, and water in a medium saucepan. Cook over medium-high heat, brushing down the sides of the pan as needed with water, until the sugar dissolves. Continue to cook, swirling the pan but not stirring, until the sugar is amber in color, about 8 minutes. Pull pan from the heat and carefully add the cream and butter. Take care; it may spatter. Whisk until smooth.\n            \n\n              Stir the chocolate, vanilla, and salt into the hot caramel until smooth. Serve sauce warm.\n            \n\n              Store in a sealed container in the refrigerator for up to 1 week. Reheat slowly, in a microwave at 30-second intervals, stirring, until warm and saucy. Be careful not to overheat or butter can separate from the caramel sauce.\n            \n", "ingredients": [{"food": "sugar", "quantity": 0.5}, {"food": "silk light vanilla", "quantity": 2.0}, {"food": "coconut water", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 0.75}, {"food": "butter oil", "quantity": 4.0}, {"food": "baking chocolate", "quantity": 4.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "salt", "quantity": 1}], "title": "\nCaramel-Fudge Sauce\n"}, {"directions": "\nSpecial equipment: a 1/3-cup ice cream scoop\n\n              Put the dulce de leche sauce and espresso powder in a small bowl and whisk until combined.\n            \n\n              Put 1 teaspoon of the espresso-dulce de leche sauce in the bottom of each waffle cone and swirl to completely coat the inside. (If the sauce is too thick to swirl, use a small offset spatula to smear the sauce on the sides.) Add 1 small scoop of coffee ice cream to each cone, then top with 1/2 teaspoon more of the espresso-dulce de leche sauce. Repeat these layers until the ice cream reaches the top of each cone. Using a 1/3-cup ice cream scoop, top each waffle cone with an additional scoop of coffee ice cream and freeze until the ice cream hardens, about 30 minutes. (See Cook's Note.)\n            \n\n              Once the ice cream has set, put the chopped chocolate and vegetable shortening in a small bowl that is deep enough to dip the tops of the cones into and microwave in 30-second increments, stirring after each, until completely melted and smooth, about 2 minutes. Cool until room temperature but still liquid.\n            \n\n              Remove the cones from the freezer and dip the tops of each in the melted chocolate. Immediately sprinkle each cone with the chopped espresso beans and freeze until ready to serve.\n            \n", "ingredients": [{"food": "dulce de leche", "quantity": 0.3333333333333333}, {"food": "onion powder", "quantity": 0.75}, {"food": "waffle", "quantity": 6.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "fava beans", "quantity": 2.0}], "title": "\nCaramel-Macchiato Dipped Ice Cream Cones\n"}, {"directions": "\n\n              chocolate-Melt 2 tablespoons butter in a skillet. Add 2 sliced bananas and 2 tablespoons brown sugar. Cook until golden and syrupy, about 5 minutes. Sprinkle the bananas with cinnamon and spoon over rum raisin ice cream.\n            \n\n              Copyright (c)2011 Food Network Magazine, LLC. Published by Hyperion. Available wherever books are sold. All Rights Reserved. Photograph courtesy of Antonis Achilleos.\n            \n", "ingredients": [], "title": "\nCaramelized Bananas\n"}, {"directions": "\n\n              Trim 2 leeks, leaving enough of the core to hold them together; halve lengthwise and rinse well. Halve 4 endives. Whisk 1/4 cup olive oil with 1 tablespoon red wine vinegar, salt and pepper; toss with the leeks and endives. Place the vegetables on a sheet of foil; drizzle with any extra dressing. Fold up the packet and grill over medium-high heat until the endives are slightly golden and the leeks are tender, 10 to 12 minutes. Top with crumbled blue cheese.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [], "title": "\nCaramelized Endives and Leeks\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 350 degrees F. Line a baking sheet with parchment paper.\n            \n\n              Heat a large skillet with a lid over medium-high heat and add the bacon. Cook, stirring occasionally, until the bacon is golden brown, about 9 minutes. Transfer the bacon to a plate using a slotted spoon. Add the onions to the skillet and cook, covered, stirring occasionally and scraping up the stuck bits on the bottom of the pan as needed, until the onions release their juices and are caramelized, golden and soft, about 30 minutes. (If the onions begin to brown before they soften, stir in a tablespoon water, lower the heat and return to cooking.)\n            \n\n              Combine the butter, thyme, 1 teaspoon salt and some pepper in a medium bowl. Stir in the onions until the butter melts and becomes saucy.\n            \n\n              Meanwhile, with a large serrated knife, shave 1/4 inch off the bottom crust of the bread.. Make 1-inch wide crosshatch cuts on the top of the bread, three-quarters of the way through to the bottom. Put the bread on the prepared baking sheet.\n            \n\n              Spoon 3/4 of the onion mixture into all of the slits. Mix together the Gouda and mozzarella in a small bowl, then stuff three-quarters of the cheese inside all of the slits. Spoon the remaining onion mixture on top, followed by the remaining cheese. (The bread will be very stuffed and messy.) Cover the bread loosely with foil and bake until the filling is warm and the cheese is melted, about 25 minutes. Transfer to a platter or cutting board and top with the bacon and parsley. Serve immediately.\n            \n", "ingredients": [{"food": "", "quantity": 0.25}, {"food": "onions", "quantity": 3.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "thyme", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "barbecue loaf", "quantity": 1.5}, {"food": "smoked turkey roll", "quantity": 4.0}, {"food": "", "quantity": 4.0}, {"food": "parsley", "quantity": 2.0}], "title": "\nCaramelized Onion and Bacon Pull-Apart Bread\n"}, {"directions": "\n\n              Cut the bread into 8 large wedges. Whisk the eggs, buttermilk, cream, granulated sugar, vanilla and cinnamon in a large baking dish. Add the bread and turn occasionally until soaked through, about 15 minutes. Preheat the oven to 250 degrees F. \n            \n\n              Put the confectioners' sugar in a fine-mesh sieve. Melt 1 tablespoon butter in a large nonstick skillet over medium heat. Add half of the bread and dust generously with the confectioners' sugar; cook, turning and dusting often with more confectioners' sugar, until golden brown and caramelized, 10 to 12 minutes (add more butter to the skillet, if needed). Transfer the French toast to a baking sheet and keep warm in the oven. Add 1 more tablespoon butter to the skillet and repeat with the remaining bread. Serve with maple syrup.\n            \n\n              Photograph by Andrew Purcell\n            \n", "ingredients": [{"food": "barbecue loaf", "quantity": 0.5}, {"food": "eggs", "quantity": 4.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.5}, {"food": "ice cream swich", "quantity": 0.25}, {"food": "sugar", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 1.5}, {"food": "cinnamon", "quantity": 0.25}, {"food": "sugar", "quantity": 1.25}, {"food": "butter oil", "quantity": 2.0}, {"food": "syrup", "quantity": 1}], "title": "\nCaramelized Sourdough French Toast\n"}, {"directions": "\n\n              Boil whole russet potatoes in their skins until they're easily pierced with a knife; let cool slightly before peeling. While the potatoes are boiling, saute sliced white onions in olive oil or butter over low heat until soft and deeply caramelized. Mash the potatoes with milk or cream, butter, and salt and pepper to taste. Stir the caramelized onions into the potatoes just before serving.\n            \n\n              Photograph by Anita Calero\n            \n", "ingredients": [], "title": "\nCaramelized-Onion Mashed Potatoes\n"}, {"directions": "\n\n              Combine 6 chopped bacon slices, 2 tablespoons olive oil, 3 crushed garlic cloves, 1/2 teaspoon minced rosemary, 2 minced jalapenos and 1/4 cup water in a skillet over medium-high heat; cook until the water evaporates and the bacon crisps, 12 minutes. Discard the garlic. Add 12 ounces cooked spaghetti to the skillet and toss. Whisk 3 eggs, 3/4 cup grated parmesan, 1/2 cup grated pecorino, 2 tablespoons chopped parsley and some pepper in a bowl; whisk in 1/4 cup pasta-cooking water, then toss with the pasta until creamy.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [], "title": "\nCarbonara\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 400 degrees F with a rack set on the middle shelf.\n            \n\n              Cook the pancetta with 1 tablespoon water in a large saute pan over medium heat until crispy and most of the fat has rendered, 10 to 12 minutes.\n            \n\n              Meanwhile, cook the potatoes. Pierce the potatoes all over with a fork and put in a large paper bag. Fold the top of the bag over several times. Microwave on high for about 15 minutes, carefully flipping the bag every 5 minutes. The potatoes are done once a cake tester or skewer easily pierces the flesh. Remove the potatoes from the bag and put on a baking sheet. Allow the potatoes to cool for 5 minutes.\n            \n\n              Once the pancetta is crispy, use a slotted spoon to transfer to a paper-towel-lined plate to drain. Stir the half-and-half, a pinch of salt and 1/2 teaspoon pepper into the rendered fat.\n            \n\n              Use a sharp paring knife to cut a lengthwise slit in the center of each potato. Carefully remove the flesh, leaving about 1/2-inch around the inside. Reserve 1/2 cup of the potato flesh for another use. Place the remaining flesh in a mixing bowl along with the half-and-half mixture, 2 1/2 cups of the Parmesan, the scallion whites, half of the pancetta and a large pinch of salt. Mash with a potato masher until mostly smooth. Season with additional salt and pepper if needed.\n            \n\n              Scoop the mashed potato mixture back into the skins. Make a large well in each potato deep enough to hold an egg and crack an egg into the well. Bake until the egg is just starting to set, about 10 minutes.\n            \n\n              Remove the potatoes and cover the eggs with the remaining Parmesan. Switch the oven to broil and broil until the eggs no longer wiggle when you shake the baking sheet, 3 to 5 minutes, checking frequently.\n            \n\n              To serve, top each potato with the reserved crispy pancetta and scallion greens and serve immediately.\n            \n", "ingredients": [{"food": "", "quantity": 4.25}, {"food": "sweet potatoes", "quantity": 4.0}, {"food": "", "quantity": 0.75}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "eggs", "quantity": 4.0}], "title": "\nCarbonara Stuffed Potatoes with Crispy Pancetta\n"}, {"directions": "\n\n              Heat a 7-liter pressure cooker over medium heat. Stir in the oil, onion, bay leaves, 1 1/2 tablespoons salt, the allspice, and thyme; cook, uncovered, until soft, about 8 minutes. Increase the heat to high, stir in the tomato paste, and cook, stirring and scraping, until it turns brick red, about 2 minutes.\n            \n\n              Season the chicken with some salt and black pepper, to taste, and add it to the pot, turning to coat with the tomato and onion. Stir in the water, then add the chile, okra, potatoes, and collard greens in that order. You don't need to stir--the collards will cook down and keep everything moist as the cooker comes up to pressure. Close the pressure cooker lid and bring the pressure up to high (which can take up to 10 minutes), then reduce the heat, if necessary, to maintain an even pressure for 7 minutes.\n            \n\n              Remove from the heat and press the pressure indicator stem until no more steam comes out. Carefully open the pot. Remove and discard bay leaves. Ladle the stew into bowls and serve.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.25}, {"food": "onion powder", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "seasoning mix", "quantity": 1.5}, {"food": "allspice", "quantity": 2.0}, {"food": "thyme", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 0.3333333333333333}, {"food": "black bean mango", "quantity": 1}, {"food": "diced chicken", "quantity": 8.0}, {"food": "coconut water", "quantity": 3.5}, {"food": "hot pockets ham cheese stuffed swich", "quantity": 1.0}, {"food": "okra", "quantity": 8.0}, {"food": "sweet potatoes", "quantity": 3.0}, {"food": "turnip greens", "quantity": 1.0}], "title": "\nCaribbean Chicken Pepper Pot\n"}, {"directions": "\n\n              Combine the curry powder, allspice, chopped thyme, 1 teaspoon salt and a few grinds of pepper in a medium bowl. Add the chicken and toss to coat; set aside.\n            \n\n              Skim 2 tablespoons of the solid cream off the top of the coconut milk; transfer to a large Dutch oven or pot and melt over medium-high heat. Add the chicken and cook, turning, until browned, about 5 minutes; transfer to a plate.\n            \n\n              Add the onion, garlic, cilantro, chile and thyme sprigs to the pot and cook, stirring, until the onion is softened, about 5 minutes. Return the chicken to the pot along with 1/4 cup water; stir. Add the coconut milk (including any remaining coconut cream from the can). Tear 1 lavash into small pieces; add to the pot and bring to a simmer. Reduce the heat to medium low, cover and cook until thickened, about 15 minutes.\n            \n\n              Just before serving, warm the remaining lavash in the microwave. Remove the thyme sprigs from the pot and stir in the peas and carrots. Cook until warmed through, about 2 minutes. Season with salt and pepper. Top with cilantro and serve with the remaining lavash.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [{"food": "curry powder", "quantity": 1.5}, {"food": "allspice", "quantity": 0.5}, {"food": "thyme", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 6.0}, {"food": "coconut milk", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "dessert topping", "quantity": 2.0}, {"food": "barley flour or meal", "quantity": 0.5}, {"food": "", "quantity": 1.0}, {"food": "pigeon peas", "quantity": 1.0}], "title": "\nCaribbean Chicken Roti\n"}, {"directions": "\n\n              Heat 1 tablespoon olive oil in a large pot or Dutch oven over medium-high heat. Season the chicken with salt and pepper and add to the pot. Cook, stirring occasionally, until browned, about 8 minutes. Add the curry powder and half of the garlic. Cook, stirring, until the garlic softens slightly, about 1 minute.\n            \n\n              Stir the chickpeas and their liquid into the pot and bring to a boil. Reduce the heat to medium low; cover and cook until the chicken is tender, about 12 minutes.\n            \n\n              Meanwhile, puree the remaining garlic, the cilantro, 2 tablespoons olive oil, the lime juice and vinegar in a mini food processor or blender until a paste forms. Heat the remaining 2 tablespoons olive oil in a small skillet over medium heat. Add the cilantro paste; cook until dark green, about 1 minute. Transfer to a medium bowl and add the coleslaw mix; season with salt and toss to coat.\n            \n\n              Top each serving of the chicken curry with the slaw mixture, some hot pepper sauce and cilantro. Serve with the naan.\n            \n\n              Photograph by Ryan Liebe\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 5.0}, {"food": "diced chicken", "quantity": 1.25}, {"food": "salt", "quantity": 1}, {"food": "curry powder", "quantity": 1.5}, {"food": "garlic powder", "quantity": 5.0}, {"food": "chickpeas", "quantity": 2.0}, {"food": "dessert topping", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "vinegar", "quantity": 1.0}, {"food": "cheesecake mix", "quantity": 4.0}, {"food": "Worcestershire sauce", "quantity": 1}, {"food": "garlic bread", "quantity": 2.0}], "title": "\nCaribbean Curried Chicken and Chickpeas\n"}, {"directions": "\n\n              Preheat the oven to 450 degrees F. Whisk 1 tablespoon each olive oil and cilantro, the hot sauce, lime zest and 1/2 teaspoon salt in a medium bowl. Put the fish in a large baking dish, leaving room between the fillets; top with the cilantro sauce. Bake until the fish is opaque and cooked through, 10 to 15 minutes.\n            \n\n              Meanwhile, heat the remaining 2 tablespoons olive oil in a large heavy pot or Dutch oven over medium-high heat. Add the shallots, celery, jalapeño, the remaining cilantro and ½ teaspoon salt. Cook until the vegetables start softening, about 3 minutes.\n            \n\n              Stir the pigeon peas and 1 cup water into the pot. Bring to a boil, then add the rice and tomatoes; cook until warmed through, about 2 minutes. Stir in the lime juice and season with salt and pepper. Serve the fish with the pigeon peas and rice.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 0.5}, {"food": "grape juice", "quantity": 1.0}, {"food": "vegetarian fillets", "quantity": 4.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "pigeon peas", "quantity": 1.0}, {"food": "crisped rice bar", "quantity": 1.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "pepper", "quantity": 1}], "title": "\nCaribbean Flounder with Pigeon Peas and Rice\n"}, {"directions": "\n\n              Heat the oil in a Dutch oven over medium heat. Pat the chicken dry, and season with some salt and pepper. Add the chicken, smooth side down, to the pan and cook until brown, about 4 minutes. Transfer the chicken to a plate. Add the onion and garlic to the pot, and cook until the vegetables are softened, about 5 minutes. Stir in the allspice and tomatoes and cook until the juices are almost evaporated. Add the chicken broth, kale, sweet potatoes, okra, bay leaves, the 1 1/2 teaspoons salt, Scotch bonnet, and thyme. Bring the liquid to a boil, adjust the heat to maintain a gentle simmer. Cook, uncovered, until the chicken is cooked through and the sweet potatoes are tender, about 25 minutes.\n            \n\n              Stir in the coconut milk and the shrimp and simmer until the shrimp turn pale pink and are firm but not tough and rubbery, about 2 minutes. Ladle the stew into warm bowls and serve.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "diced chicken", "quantity": 1.5}, {"food": "black bean mango", "quantity": 1}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "allspice", "quantity": 1.0}, {"food": "tomatoes", "quantity": 0.5}, {"food": "diced chicken", "quantity": 4.0}, {"food": "chrysanthemum leaves", "quantity": 1.5}, {"food": "sweet potatoes", "quantity": 2.0}, {"food": "okra", "quantity": 4.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "spicy black bean enchilada", "quantity": 1.0}, {"food": "thyme", "quantity": 0.5}, {"food": "coconut milk", "quantity": 0.3333333333333333}, {"food": "shrimp", "quantity": 8.0}], "title": "\nCaribbean Pepper Pot with Chicken and Shrimp\n"}, {"directions": "\n\n              For the caramel topping: Preheat the oven to 350 degrees F. Butter just the sides of a 9-inch round cake pan.\n            \n\n              Stir the sugar and 1/3 cup water in a medium saucepan over medium heat until the sugar dissolves. Cook, no longer stirring, but gently swirling the saucepan occasionally until the mixture is the color of light amber, 4 to 5 minutes. (If needed, brush any sugar crystals off the side of the pan with a pastry brush dampened with water.) Remove the saucepan from the heat, and carefully whisk in the butter (use caution; the mixture can bubble up considerably). Pour the caramel into the prepared cake pan, tilting the pan to cover most of the bottom (be careful; the pan will be very hot from the caramel). Lay the pineapple rings in the pan and fill each hole evenly with the chiles. Set aside.\n            \n\n              For the cake: Whisk together the flour, baking powder, baking soda, salt and crushed red pepper flakes in a medium bowl; set aside. Combine the coconut milk, buttermilk and vanilla in a small bowl; set aside.\n            \n\n              Beat the butter and sugar together in a large bowl with an electric mixer on medium-high speed until light and fluffy, about 4 minutes. Add the eggs 1 at a time, beating after each addition and scraping down the side of the bowl as needed. Reduce the mixer speed to low and add the flour mixture in 3 batches, alternating with the milk mixture and mixing until just incorporated. \n            \n\n              Pour the batter over the pineapple in the cake pan and spread evenly. Bake until the cake is golden brown and bounces back when pressed and a toothpick or cake tester comes out clean when inserted in the center, 50 to 60 minutes. Run a knife around the edge of the cake to separate it from the pan. Let the cake cool in the pan on a wire rack until just cool enough to handle, about 30 minutes. Invert a serving platter over the cake pan and, while holding them together, quickly flip them over so the cake unmolds, pineapple-side up. Let cool completely. Cut into wedges, and serve.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "pineapple chunks", "quantity": 20.0}, {"food": "ruby red grapefruit juice blend", "quantity": 2.0}, {"food": "potato flour", "quantity": 1.75}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "coconut milk", "quantity": 0.5}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 1.5}, {"food": "eggs", "quantity": 2.0}], "title": "\nCaribbean Pineapple Upside-Down Cake\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F. Put the sweet potatoes in a saucepan and cover with water by 1 inch. Bring to a boil, then reduce to a simmer and add the eggs. Cook until the potatoes are tender and the eggs are hard-boiled, 10 minutes; drain and set aside.\n            \n\n              Meanwhile, make the sauce: Puree the mango, jalapeno, half of the scallions, 2 tablespoons each water and vegetable oil, 1 tablespoon vinegar and 1 teaspoon brown sugar in a food processor; season with salt and pepper. Set aside.\n            \n\n              Slice the pork lengthwise down the center, stopping 3/4 inch before cutting all the way through; open like a book. Top with plastic wrap; pound with a rolling pin until 1 inch thick. Season with salt and pepper; rub with the remaining 1 tablespoon brown sugar and the allspice.\n            \n\n              Heat the remaining 2 tablespoons vegetable oil in an ovenproof skillet over medium heat. Add the pork; cook until browned, about 3 minutes per side. Transfer the skillet to the oven and bake until the pork is just cooked through, 5 minutes. Remove to a board; let rest.\n            \n\n              Peel and chop the eggs. Whisk the dijonnaise with the remaining 2 tablespoons vinegar; toss with the sweet potatoes, eggs, the remaining scallions, 3/4 teaspoon salt and a few grinds of pepper. Serve the pork with the potato salad and mango sauce.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 2.0}, {"food": "eggs", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "vinegar", "quantity": 3.0}, {"food": "sugar", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "pork skins", "quantity": 1.0}, {"food": "allspice", "quantity": 2.0}, {"food": "mixed nuts", "quantity": 0.25}], "title": "\nCaribbean Pork with Potato Salad\n"}, {"directions": "\n\n              Combine the black-eyed peas, 3 cups water and a pinch of salt in a small pot. Cover and bring to a boil.\n            \n\n              Meanwhile, heat the olive oil in a large, deep skillet over medium heat. Add the kielbasa and cook until golden, about 2 minutes. Add the scallion whites, celery, garlic, jalapeno, jerk seasoning and a generous pinch of salt. Cook until the vegetables brown, about 5 minutes. Add the thyme and tomato paste and cook, stirring occasionally, until the tomato paste turns brick red, about 2 more minutes. Add the rice, bay leaves and the black-eyed peas with their liquid to the skillet and bring to a boil; do not stir.\n            \n\n              Add the collards; cover, reduce the heat to low and simmer undisturbed until most of the liquid is absorbed, about 50 minutes; set aside for 10 minutes. Remove and discard the bay leaves.\n            \n\n              Just before serving, add the scallion greens and fluff with a fork.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "pigeon peas", "quantity": 10.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "smoked turkey roll", "quantity": 6.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "garlic powder", "quantity": 6.0}, {"food": "", "quantity": 1.0}, {"food": "seasoning mix", "quantity": 2.0}, {"food": "thyme", "quantity": 2.0}, {"food": "pasta with tomato sauce", "quantity": 2.0}, {"food": "crisped rice bar", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "turnip greens", "quantity": 4.0}], "title": "\nCaribbean Rice and Peas\n"}, {"directions": "\n\n              1. Prepare a grill pan or grill with a high heat direct heat. Smash the garlic, sprinkle with a pinch of salt, and, with the flat side of a large knife, mash and smear the mixture to a coarse paste. Stir into the olive oil along with the lemon juice, cumin, turmeric, allspice, and cayenne in a small bowl. Rub into the meat on both sides and set aside.\n            \n\n              2. Lightly oil the hot grill grates. Season the steaks with salt and pepper and grill over direct heat until nicely marked, about 3 minutes a side for medium-rare. Transfer to a plate or platter and let rest for 5 minutes.\n            \n\n              3. Meanwhile, melt the butter in a skillet, then add the plantains and honey. Cook, stirring often until glazed and warmed through, about 4 to 5 minutes. Serve steak with the plantains.\n            \n", "ingredients": [{"food": "garlic powder", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "cumin seed", "quantity": 1.0}, {"food": "turmeric", "quantity": 1.0}, {"food": "allspice", "quantity": 2.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "prime steaks", "quantity": 4.0}, {"food": "pepper", "quantity": 1}, {"food": "butter oil", "quantity": 2.0}, {"food": "luncheon slices", "quantity": 1.0}, {"food": "honey smoked ham", "quantity": 2.0}], "title": "\nCaribbean Strip Steak with Plantains\n"}, {"directions": "\n\n              Make the turkey: Combine the brown sugar, thyme, coriander, ground ginger, paprika, allspice, cayenne, garlic and 2 teaspoons salt in a small bowl. Pat the turkey dry. Rub the vegetable oil all over the turkey, then rub with the spice mixture. Let sit at room temperature 30 minutes before grilling.\n            \n\n              Preheat a grill to medium high and prepare for indirect grilling: On a charcoal grill, bank the coals to one side; on a gas grill, turn off half the burners. Brush the grill grates with vegetable oil. Lay the turkey on the grates skin-side up with the legs closest to the direct-heat side (the dark meat needs more heat). Cover the grill and cook until the turkey is deep golden brown and a thermometer inserted into the thickest part of the thigh registers 165 degrees F, 2 1/2 to 3 hours. Transfer to a cutting board and let rest 15 minutes.\n            \n\n              Meanwhile, make the chutney: Combine the plums, shallot, dried apricots, brown sugar, vinegar, fresh ginger, thyme, mustard seeds, allspice, coriander, cayenne and 1 teaspoon salt in a medium saucepan. Bring to a simmer over medium heat and cook until the plums are tender and the juices thicken, 10 to 15 minutes. Remove from the heat and let cool. Serve the turkey with the chutney.\n            \n\n              If you're making the turkey on a charcoal grill, you'll need 4 to 5 pounds of charcoal. Add several new briquettes to the coals every 30 minutes to maintain the heat.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "pineapple chunks", "quantity": 2.5}, {"food": "", "quantity": 1.0}, {"food": "apricots", "quantity": 0.5}, {"food": "sugar", "quantity": 0.5}, {"food": "vinegar", "quantity": 0.3333333333333333}, {"food": "ginger", "quantity": 1.0}, {"food": "smoked turkey roll", "quantity": 1.0}, {"food": "thyme", "quantity": 1.0}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "allspice", "quantity": 0.5}, {"food": "ground turkey", "quantity": 0.5}, {"food": "pepper", "quantity": 0.25}, {"food": "salt", "quantity": 1}], "title": "\nCaribbean-Spiced Turkey with Plum Chutney\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Heat a large cast-iron skillet over medium-high heat. Add the cumin seed and cook, stirring occasionally, until toasted, about 1 minute. Transfer to a small bowl. Add the chilies and garlic to the skillet. Cook over medium high heat, turning occasionally, until both are soft and blotchy black in spots, about 5 minutes. Remove from the skillet and cool. Add the chilies, garlic, toasted cumin seeds, oil, brown sugar and lime juice, 1 1/2 teaspoon salt and a few grinds of pepper to a blender and process until very smooth. Transfer the marinade to a large re-sealable plastic bag and add the steak. Shake well to coat, refrigerate for 1 to 4 hours.\n            \n\n              Prepare a grill for high heat. \n            \n\n              Remove the steaks from the marinade and shake off any excess. Brush the grill grates lightly with oil, lay the steak on the grill and cook until very well charred and grill marks appear, about 5 minutes. Turn the steaks and continue to cook until nicely charred, about 1 to 3 minutes more depending on thickness. Transfer the steaks to a cutting board and let rest for 10 minutes. While the steak rests, brush the scallions lightly with oil and grill, turning once until wilted and charred, about 2 minutes. Coarsely chop.\n            \n\n              Warm the tortillas on the grill grates. Thinly slice the steak against the grain on a bias. Double the tortillas then top with the steak, grilled scallions, guacamole and pico de gallo. Serve with lime wedges. \n            \n", "ingredients": [{"food": "cumin seed", "quantity": 1.5}, {"food": "seeds", "quantity": 4.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "sugar", "quantity": 2.0}, {"food": "lime", "quantity": 4.333333333333333}, {"food": "black bean mango", "quantity": 1}, {"food": "carrabba's italian grill", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "corn bran", "quantity": 24.0}, {"food": "", "quantity": 1}, {"food": "dulce de leche", "quantity": 1}], "title": "\nCarne Asada Tacos\n"}, {"directions": "\n\n              Preheat a grill or grill pan to medium high. Mix the yogurt, garlic and cilantro in a small bowl; set aside.\n            \n\n              Toss the onion rings with the olive oil and a pinch of salt. Sprinkle the steak with 1/2 teaspoon salt. Lightly brush the grill with olive oil and grill the onion and steak, turning once, until the onion is charred and the steak is cooked to medium rare, about 5 minutes per side. Transfer the steak to a cutting board and let rest 5 minutes.\n            \n\n              Make the slaw: Put the carrots and bell pepper in a medium bowl and toss with the jalapeno, lime juice and 1/4 teaspoon salt.\n            \n\n              Wrap the tortillas in a damp paper towel, then in plastic wrap; microwave until warm, 1 minute. Thinly slice the steak against the grain. Divide the steak and onion among the tortillas; top with the slaw, yogurt sauce and more cilantro. Serve with lime wedges.\n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [{"food": "silk plain soy yogurt", "quantity": 0.5}, {"food": "garlic powder", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "onion rings", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 1.0}, {"food": "carrots", "quantity": 4.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "pepper", "quantity": 1.0}, {"food": "lime juice", "quantity": 3.0}, {"food": "corn bran", "quantity": 12.0}], "title": "\nCarne Asada Tacos With Carrot-Pepper Slaw\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Toss the pork with 2 teaspoons of salt. Transfer to a 6- to 7-quart Dutch oven or pot along with the oil, oregano, red pepper, cloves, garlic, bay leaves, lime juice, orange peel and onion. Cover with 4 to 5 cups of water. Bring to a high simmer, then reduce the heat to low, partially cover the pot and simmer gently, checking occasionally to give it a stir, until the pork is tender and just beginning to fall apart, about 1 hour and 30 minutes. Fish out the bay leaves and orange peel. (The pork will not look super-attractive at this point but don't panic!)\n            \n\n              Remove the lid and increase the heat to medium-high. Simmer vigorously, stirring frequently, until all of the water has evaporated, leaving only the oil, and the pork has browned and begun to fry slightly at the bottom of the pot; continue to cook, scraping up the bottom of the pot frequently to release the fried bits, 30 to 40 minutes. Use a slotted spoon to remove the pork from any remaining oil in the pot.\n            \n\n              Serve with tortillas and suggested toppings to make tacos.\n            \n", "ingredients": [{"food": "pork skins", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.6666666666666666}, {"food": "", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1}, {"food": "cloves", "quantity": 1}, {"food": "garlic powder", "quantity": 6.0}, {"food": "chrysanthemum leaves", "quantity": 3.0}, {"food": "", "quantity": 2.0}, {"food": "orange peel", "quantity": 3.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "corn bran", "quantity": 1}, {"food": "sour cream", "quantity": 1}], "title": "\nCarnitas\n"}, {"directions": "\n\n              Heat the oil in a large heavy-bottomed pot or Dutch oven over medium heat. Add the onion and cook, stirring occasionally, until softened and golden, 5 to 7 minutes. Add the garlic and chili powder and cook until the garlic is softened, about 1 minute. Stir in the ketchup, vinegar, mustard, brown sugar, 1 teaspoon salt and several grinds of pepper. Stir to combine.\n            \n\n              Add the chicken to the sauce, turning to coat. Lower the heat to medium-low and keep at a steady simmer, adjusting the heat if necessary. Cover and cook, flipping the drumsticks halfway through, until the drumsticks are tender when pierced with a knife and the internal temperature registers 165 degrees F on an instant-read thermometer (avoid touching bone), 35 to 40 minutes. Remove the lid and continue to simmer until the sauce is as thick as molasses, turning the drumsticks several times to coat well and to keep from sticking, about 5 minutes. Remove to a plate and serve immediately.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "chili powder", "quantity": 1.5}, {"food": "", "quantity": 0.5}, {"food": "vinegar", "quantity": 0.25}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "sugar", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "diced chicken", "quantity": 8.0}], "title": "\nCarolina Barbecue Drumsticks\n"}, {"directions": "\n\n              Preheat a grill to medium. Whisk the yellow mustard, vinegar, brown sugar, mustard powder, hot sauce, Worcestershire sauce, 1/2 teaspoon salt, and pepper to taste in a bowl. Whisk in the butter. Season the chicken with salt and pepper, then toss with about one-third of the mustard sauce in a large bowl until coated. Let sit at room temperature, 10 minutes. Brush the grill grates generously with vegetable oil. Put about 1/4 cup of the remaining mustard sauce in a small bowl for basting and reserve the rest for topping. Grill the chicken, covered, basting occasionally with the sauce, until well marked and a thermometer inserted into the thickest part registers 170 degrees F, 10 to 12 minutes per side. Serve the chicken with the reserved mustard sauce, sliced tomato and macaroni salad, if desired.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "mustard spinach", "quantity": 0.5}, {"food": "vinegar", "quantity": 0.25}, {"food": "sugar", "quantity": 0.25}, {"food": "onion powder", "quantity": 1.5}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 2.0}, {"food": "diced chicken", "quantity": 8.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 1}], "title": "\nCarolina-Style Barbecue Chicken\n"}, {"directions": "\n\n              Make the carrot bread: Preheat the oven to 350 degrees F. Lightly butter one 9-by-5-inch loaf pan or three 6-by-3-inch mini loaf pans.\n            \n\n              Whisk the flour, granulated sugar, baking powder, salt, baking soda, cinnamon and nutmeg in a large bowl. Add the hazelnuts and coconut.\n            \n\n              Whisk the eggs, melted butter, yogurt, vanilla and lemon zest (if using) in a medium bowl. Stir in the shredded carrots. Fold the carrot mixture into the flour mixture until just combined.\n            \n\n              Spread the batter in the prepared pan(s). Bake until a toothpick inserted into the center comes out clean, about 55 minutes for a standard loaf or 35 to 40 minutes for mini loaves. Cool 30 minutes in the pan(s) on a rack, then turn out onto the rack to cool completely.\n            \n\n              Make the glaze: Whisk the confectioners' sugar, cream cheese, milk and vanilla in a bowl. Pour over the cooled carrot bread and let set, 15 to 20 minutes.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.5}, {"food": "potato flour", "quantity": 1.25}, {"food": "sugar", "quantity": 0.75}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "cinnamon", "quantity": 0.5}, {"food": "nutmeg", "quantity": 0.5}, {"food": "hazelnuts or filberts", "quantity": 0.75}, {"food": "coconut water", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "silk plain soy yogurt", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "carrots", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 3.0}, {"food": "milk", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 0.25}], "title": "\nCarrot Bread With Hazelnuts, Coconut and Cream Cheese Glaze\n"}, {"directions": "\n\n              Trim one short end of the pound cake (discard the end), then cut a wedge off each side as shown.\n            \n\n              Attach the wedges to each other with frosting (crust sides together), then attach to the trimmed cake.\n            \n\n              Mix the remaining frosting with the yellow and red food coloring. Spread over the cake.\n            \n\n              Arrange the jelly beans on the cake in tight rows.\n            \n\n              Trim the sour straws to various lengths, then gently stick into the top of the cake.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "rice cake", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "yellow rice", "quantity": 24.0}, {"food": "ruby red grapefruit juice blend", "quantity": 6.0}, {"food": "fava beans", "quantity": 4.0}, {"food": "apple", "quantity": 1.0}], "title": "\nCarrot Cake\n"}, {"directions": "\n\n              1. Preheat the oven to 350 degrees F. Spray a 9 by 13-inch baking pan with vegetable spray; line it with a piece of parchment paper, leaving an 1-inch overhang on 2 sides and spray the paper.\n            \n\n              2. Whisk together the flour, baking soda, salt and pumpkin pie spice in a medium bowl. In another medium bowl, whisk the eggs and sugars until pale; whisk in the oil, then the buttermilk and vanilla. Stir the wet ingredients into the dry ingredients and fold in the carrots. Pour the batter into the prepared pan and smooth the top.\n            \n\n              3. Bake until a toothpick inserted in the center of the cake comes out with a few moist crumbs attached, 35 to 40 minutes. Cool completely on a wire rack. Using the parchment overhang, remove the cake from the pan. Frost the cooled cake with Lighter Creamy Frosting, if desired. Cut into 16 (2 by 3-inch) pieces and serve.\n            \n\nLighter Cream Cheese Frosting:\n\n\n              In a medium bowl, stir together the cream cheese, confectioners' sugar, and vanilla.\n            \n\n              Spread the frosting over the top and sides of the cake.\n            \n\n              Yield: 16 servings\n            \n\n              Nutritional analysis per serving of frosting\n            \n\n              Calories 84; Total Fat 5g (Sat Fat 3g, Mono Fat 1g, Poly Fat 0g) ; Protein 2g; Carb 8g; Fiber 0g; Cholesterol 16mg; Sodium 71mg\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.75}, {"food": "salt", "quantity": 0.5}, {"food": "pumpkin pie spice", "quantity": 1.5}, {"food": "eggs", "quantity": 3.0}, {"food": "sugar", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.75}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "carrots", "quantity": 3.0}, {"food": "", "quantity": 1}, {"food": "macaroni cheese", "quantity": 12.0}, {"food": "sugar", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.5}], "title": "\nCarrot Cake\n"}, {"directions": "\n\n              Position an oven rack in the center of the oven, and preheat to 325 degrees F. Whisk together the butter, brown sugar, maple syrup, vanilla, cinnamon and salt in a large bowl. Add the oats, carrots and walnuts, and toss until evenly coated. Spread out on a rimmed baking sheet.\n            \n\n              Bake the oat mixture until golden and toasted, 30 to 35 minutes, stirring about halfway through. Let cool completely on the baking sheet. Stir in the raisins and dried pineapple. (The granola can be stored in an airtight container at room temperature for up to 5 days.)\n            \n", "ingredients": [{"food": "butter oil", "quantity": 4.0}, {"food": "sugar", "quantity": 3.0}, {"food": "syrup", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "cinnamon", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "oats", "quantity": 1.75}, {"food": "carrots", "quantity": 2.0}, {"food": "walnuts", "quantity": 1.0}, {"food": "raisins", "quantity": 0.5}, {"food": "pineapple chunks", "quantity": 0.3333333333333333}], "title": "\nCarrot Cake Granola\n"}, {"directions": "\nSpecial equipment: small offset spatula, orange gel food coloring, pastry bag and plain pastry tip\n\n              Preheat the oven to 375 degrees F. For the cake: Grease a 13-by-18-inch sheet pan with butter, line bottom of the pan with parchment paper and generously butter and flour the paper.\n            \n\n              In a small bowl, sift together the flour, cinnamon, baking powder, baking soda, ginger, nutmeg, and salt and stir to combine. Place the eggs and granulated sugar in the bowl of an electric mixer fitted with the paddle attachment and beat on medium-high speed until light, thick and pale, about 5 minutes. With the mixer on low, add the carrot, then slowly add the flour mixture, mixing just until incorporated. Pour the batter into the prepared pan and spread evenly. Bake until the top springs back when gently touched, about 15 minutes. \n            \n\n              While the cake is baking, lay a clean, thin cotton dish towel out on a flat surface and sift 1/4 cup confectioners' sugar evenly over it. (This will prevent the cake from sticking to the towel.) As soon as you remove the cake from the oven, loosen it around the edges and invert it squarely onto the prepared towel. Peel away the parchment paper. Starting at one of the short ends, gently roll the warm cake and the towel together. Allow the rolled cake to cool completely on a wire rack.\n            \n\n              For the candied carrots: Combine the grated carrot, sugar and 1/2 cup water in a small saucepan. Bring to a boil over medium-high heat, stirring often, and cook until the carrots are bright orange, glossy and almost dry, about 12 minutes. Remove to a plate with a slotted spoon and let cool. (The candied carrots will be in clumps.)\n            \n\n              For the frosting: Beat the cream cheese, butter and salt together with an electric mixer on medium speed until well combined and smooth, about 3 minutes. Reduce the speed to low and add the confectioners¿ sugar, vanilla and 1 teaspoon milk. Continue to beat until completely combined, about 2 minutes. (If needed add the second teaspoon of milk, the mixture should be fluffy not runny.) Increase the speed to high and beat until fluffy, about 4 minutes more.   \n            \n\n              To assemble: Place 1/2 cup of the frosting in a small bowl and set aside. Carefully unroll the cake onto a cutting board with the towel underneath. Using a small offset spatula, spread half the frosting evenly over the cake. Sprinkle the frosting evenly with walnuts, raisins and golden raisins, making sure to go all the way to the edges. Disperse teaspoons of candied carrots across the frosting. Carefully reroll the cake, using the towel as a guide. Place the cake roll on a platter. Frost the sides and ends of the cake with the remaining frosting and press shredded coconut all over the surface. \n            \n\n              Combine the reserved 1/2 cup frosting with 2 to 4 drops orange food coloring and mix well. Transfer the tinted frosting to a pastry bag fitted with a small plain tip. Pipe 12 carrots evenly down the center of the cake roll and top each with a small piece of reserved carrot frond. Place the cake in the refrigerator until fully chilled, about 2 hours.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1}, {"food": "potato flour", "quantity": 0.75}, {"food": "cinnamon", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "ginger", "quantity": 0.5}, {"food": "nutmeg", "quantity": 0.25}, {"food": "salt", "quantity": 0.25}, {"food": "eggs", "quantity": 4.0}, {"food": "sugar", "quantity": 1.0}, {"food": "carrot juice", "quantity": 0.5}, {"food": "sugar", "quantity": 0.25}, {"food": "turnip greens", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "butter oil", "quantity": 1.5}, {"food": "hearts of palm", "quantity": 1}, {"food": "sugar", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "milk", "quantity": 1.0}, {"food": "", "quantity": 1}, {"food": "walnuts", "quantity": 0.25}, {"food": "raisins", "quantity": 0.25}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.25}, {"food": "coconut water", "quantity": 1.0}], "title": "\nCarrot Cake Jelly Roll\n"}, {"directions": "\n\n              Position racks in the upper and lower thirds of the oven; preheat to 350 degrees F. Whisk the flour, oats, pumpkin pie spice, baking soda and salt in a medium bowl. Beat the butter, granulated sugar and brown sugar in a large bowl with a mixer on medium-high speed until light and fluffy, 3 to 5 minutes. Add the carrots and beat until combined, then beat in the egg. Stir in the flour mixture with a rubber spatula until combined, then stir in the raisins.\n            \n\n              Line 2 baking sheets with parchment paper. Arrange scoops of dough (1 rounded tablespoon per cookie) about 2 inches apart on the prepared baking sheets. Bake, switching the pans halfway through, until the cookies are golden and set around the edges but the centers are still soft, about 20 minutes. Transfer to racks and let cool completely on the baking sheets.\n            \n\n              Make the filling: Beat the marshmallow cream, cream cheese, butter and vanilla in a large bowl with a mixer on medium speed until thick and fluffy, about 3 minutes. Spread 1 tablespoon filling on the flat side of half the cookies; sandwich with the remaining cookies. Store in an airtight container in the refrigerator up to 2 days; bring to room temperature before serving.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.5}, {"food": "oats", "quantity": 0.75}, {"food": "pumpkin pie spice", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 1.5}, {"food": "sugar", "quantity": 0.5}, {"food": "sugar", "quantity": 0.25}, {"food": "carrots", "quantity": 0.75}, {"food": "egg substitute", "quantity": 1.0}, {"food": "raisins", "quantity": 0.3333333333333333}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "vanilla extract", "quantity": 1.0}], "title": "\nCarrot Cake Sandwich Cookies\n"}]