[{"directions": "\n\n              Make the pot roast: Preheat the oven to 300 degrees F. Liberally sprinkle the entire beef roast with salt and pepper. Heat the vegetable oil in a Dutch oven over medium-high heat. Add the roast and cook until browned and caramelized all over, 3 to 4 minutes per side (reduce the heat if the fat begins to smoke). Transfer to a plate and reduce the heat to medium.\n            \n\n              Add the onion to the pot and sauté, stirring occasionally, until just beginning to brown, 8 to 10 minutes. Add the Italian seasoning and red pepper flakes and sauté until fragrant, another minute. Add the garlic and sauté until fragrant, about 30 seconds. Deglaze with the red wine and cook until reduced by half, about 2 minutes. Add the beef stock and thyme and bring to a simmer. Adjust the seasoning of the jus. Return the beef roast to the pot along with any accumulated juices. Cover, place in the oven and cook, turning the roast every 30 minutes, until very tender, 3 1/2 to 4 hours. Transfer the roast to a cutting board and tent with foil. Increase the oven temperature to 350 degrees F.\n            \n\n              Strain the jus through a fine-mesh strainer into a bowl and return to the pot. Bring to a simmer and adjust the seasoning if necessary. Once the meat is cooled a bit, pull it apart into smaller chunks; return to the jus and reserve until ready to build the sandwiches.\n            \n\n              Meanwhile, cook the peppers: Toss the green bell pepper strips with the olive oil, granulated garlic and some salt and pepper on a baking sheet. Bake, stirring halfway through, until soft, about 20 minutes.\n            \n\n              Build the sandwiches: Place some beef on each hoagie roll, then top with the peppers and some giardiniera. Pour the warm jus into a bowl. Take each hoagie and quickly dunk it in the jus. Wrap in parchment for at least a minute to let the juices \"settle,\" then eat away!\n            \n\n              Photograph by Steve Giralt\n            \n", "ingredients": [{"food": "roast beef", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "seasoning mix", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 2.0}, {"food": "garlic powder", "quantity": 6.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "frankfurter beef", "quantity": 5.0}, {"food": "thyme", "quantity": 2.0}, {"food": "peppers", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "pizza rolls", "quantity": 6.0}, {"food": "hot pockets ham cheese stuffed swich", "quantity": 1}], "title": "\n\"Da Beef\" Italian Pot Roast Sandwich\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Melt the chocolate, shortening, vanilla and a pinch of salt in a small saucepan over medium-low heat, stirring constantly with a rubber spatula, until smooth, about 4 minutes. Pour the melted chocolate mixture into a small bowl. Pour over ice cream and let harden, or use as a coating for snacks like fruit or pretzels.\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 6.0}, {"food": "vegetable oil", "quantity": 6.0}, {"food": "vanilla extract", "quantity": 0.25}, {"food": "salt", "quantity": 1}], "title": "\nDIY Chocolate Shell Coating\n"}, {"directions": "\n\n              Shave the daikon into ribbons with a vegetable peeler. Toss with 1/4 teaspoon salt in a colander; let drain in the sink, tossing occasionally, about 15 minutes. Meanwhile, shave the carrots into ribbons with the peeler.\n            \n\n              Make the dressing: Whisk the ginger, vinegar, lime juice and 1/2 teaspoon salt in a large bowl. Slowly whisk in the vegetable oil and sesame oil until blended.\n            \n\n              Toast the sesame seeds in a skillet over medium heat, tossing occasionally, until the white seeds are golden, about 5 minutes. Add 1 tablespoon seeds to the dressing.\n            \n\n              Toss the daikon and carrots with the dressing and season with salt. Top with the remaining sesame seeds.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "carrots", "quantity": 1.0}, {"food": "ginger", "quantity": 1.0}, {"food": "vinegar", "quantity": 3.0}, {"food": "lime juice", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "sesame seeds", "quantity": 1.75}], "title": "\nDaikon-Carrot Salad\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              For the chile oil: Heat the oil, Sichuan peppercorns, cinnamon stick and star anise in a small pot over medium-low heat until it reaches 325 degrees F, then remove from the heat and let sit for 5 minutes. Remove the peppercorns, cinnamon stick, and star anise with a slotted spoon and discard, then stir in the crushed red pepper flakes. Set the oil aside to cool.\n            \n\n              For the sauce: Whisk together the soy sauce, sesame paste, sugar, five-spice powder, Sichuan peppercorns, garlic and 1/4 cup of the chile oil in a medium bowl. Whisk in 1/3 cup hot water and set aside.   \n            \n\n              For the noodles: Bring a large pot of water to a boil. Cook the noodles according to the package directions, adding the bok choy, if using, for the last minute of cooking time. Drain in a colander and rinse well under cold running water to stop the cooking process. Toss the noodles with 1 teaspoon of the reserved chile oil and set aside. \n            \n\n              Heat 3 tablespoons vegetable or peanut oil in a seasoned wok over high heat until shimmering. Add the pork and cook, stirring and breaking it up with a spoon, until it is browned, about 5 minutes. Add the Shaoxing wine, hoisin sauce and dark soy sauce and cook until all the liquid is evaporated and the pork is crispy, about 3 minutes. Add the sui mi ya cai, if using, and cook until it starts to sizzle, about 2 minutes. (Otherwise, remove from the heat after the pork is crispy.) Remove from the heat and add the reserved noodles and sauce to the wok, tossing well to coat. Place in a serving bowl, top with scallions and serve immediately.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.5}, {"food": "whole milk", "quantity": 1.0}, {"food": "cinnamon", "quantity": 0.5}, {"food": "anise seed", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 2.0}, {"food": "soy sauce", "quantity": 3.0}, {"food": "", "quantity": 2.0}, {"food": "sugar", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}, {"food": "garlic powder", "quantity": 2.0}, {"food": "", "quantity": 0.25}, {"food": "noodles", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "pork skins", "quantity": 0.5}, {"food": "", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "soy sauce", "quantity": 1.0}, {"food": "", "quantity": 0.3333333333333333}, {"food": "silk light vanilla", "quantity": 3.0}], "title": "\nDan-Dan Noodles\n"}, {"directions": "\n\n              Bring a pot of water to a boil. Pulse the sesame seeds in a mini food processor with 2 tablespoons sesame oil, 1 tablespoon sugar and 1/4 teaspoon salt until powdery; set aside.\n            \n\n              Prepare the stir-fry: Quarter, seed and finely dice the pickles and put in a bowl. In another bowl, mix the garlic, ginger, scallions, 1/2 teaspoon salt and the remaining 1/2 teaspoon sugar. Mix 1 tablespoon soy sauce and the broth in a third bowl. Mix the pork with 1 tablespoon soy sauce and 1/2 teaspoon salt in another bowl. Place the four bowls by the stove.\n            \n\n              Place a large skillet over high heat. Add 2 tablespoons vegetable oil, then the pork, breaking it up with a wooden spoon, until cooked but not dry, 4 minutes. Transfer the meat to a bowl and toss with the remaining 1 tablespoon soy sauce.\n            \n\n              Add the remaining 1 tablespoon vegetable oil to the skillet; stir-fry the pickles for 1 minute. Add the garlic mixture and fry 30 seconds. Add the broth and boil until reduced by half, 4 minutes. Divide the broth among bowls and drizzle with the chili oil and vinegar.\n            \n\n              Meanwhile, add the noodles and bok choy to the boiling water and cook until just tender, 2 minutes. Drain and toss with the remaining 2 tablespoons sesame oil. Season with salt, then divide among the bowls. Top with pork and sprinkle with sesame powder. Serve with more sesame and chili oil.\n            \n\n              Photograph by Sang An\n            \n", "ingredients": [{"food": "sesame seeds", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 4.0}, {"food": "sugar", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "dill seed", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "ginger", "quantity": 1.0}, {"food": "", "quantity": 4.0}, {"food": "soy sauce", "quantity": 3.0}, {"food": "diced chicken", "quantity": 1.25}, {"food": "pork skins", "quantity": 8.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "egg substitute", "quantity": 9.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}], "title": "\nDan-Dan Noodles\n"}, {"directions": "\nSpecial equipment: Chilled cocktail glass\n\n              Fill a cocktail shaker with ice. Add the vodka, lingonberry concentrate, and bitters. Cover and shake vigorously until thoroughly mixed and chilled, about 30 seconds. In general, the drink is ready by the time the shaker mists up. Strain into a chilled cocktail glass. Top with the orange and grapefruit juices. Top the cocktail with 1/4 wheel citrus. Drink.\n            \n", "ingredients": [{"food": "", "quantity": 1.5}, {"food": "lemon concentrate", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "", "quantity": 0.5}, {"food": "barley flour or meal", "quantity": 0.25}], "title": "\nDanish Modern\n"}, {"directions": "\nSpecial equipment: Cocktail glass\n\n              Fill a cocktail shaker with ice. Add the vodka, lingonberry concentrate, and bitters. Cover and shake vigorously until thoroughly mixed and chilled, about 30 seconds. (In general, the drink is ready by the time the shaker mists up.) Strain into a chilled cocktail glass. Top with the orange and grapefruit juices. Garnish cocktail with citrus. Drink.\n            \n", "ingredients": [{"food": "vanilla extract", "quantity": 1.5}, {"food": "lemon concentrate", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "", "quantity": 0.5}, {"food": "barley flour or meal", "quantity": 0.25}], "title": "\nDanish Modern\n"}, {"directions": "\n\n              Mix 2 tablespoons each raw sugar and finely chopped dark chocolate on a plate. Combine 2 ounces each chocolate liqueur and vodka, 1 ounce chilled espresso, 1/2 teaspoon fresh orange juice and a strip of orange zest in a cocktail shaker with ice; stir well. Moisten the rim of a chilled martini glass and dip it in the sugar-chocolate mixture. Strain the cocktail into the glass and garnish with an orange wedge.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [], "title": "\nDark Chocolate Martini\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Pulse the flour, sugar and salt in a food processor until combined. Add the butter and pulse until it resembles coarse meal mixed with pea-size bits of butter, 10 to 15 times. Add the egg mixture and pulse until the dough just starts to come together, about 10 times. Turn the dough out onto a piece of plastic wrap, using the plastic to help form it into a disk. Wrap tightly and refrigerate until chilled, at least 1 hour or up to overnight.\n            \n\n              Whisk together the cream cheese, sugar, vanilla, egg yolk and salt in a medium bowl until smooth. Cover with plastic wrap and chill in the refrigerator, about 45 minutes. Toss the cherries with the sugar, almond extract and lemon juice and set aside.\n            \n\n              Position a rack in the center of the oven and place a rimmed baking sheet on it. Preheat the oven to 375 degrees F.\n            \n\n              Sprinkle the dough lightly with flour on both sides and roll out on a lightly floured surface into a 12-inch round that is about 1/8-inch thick. Transfer the dough to a piece of parchment and place on an inverted baking sheet. \n            \n\n              Spread the cream cheese mixture over the center of the dough, leaving a 2-inch border on all sides. Sprinkle the chopped chocolate over the cream cheese and top with the cherries. Fold the edges of the dough over the filling, pleating as needed. Brush the crust with the egg white and sprinkle with coarse sugar. Refrigerate for 15 minutes.\n            \n\n              Slide the galette and parchment paper onto the preheated baking sheet and bake until the crust is golden and the filling is bubbling, about 40 minutes. Transfer the baking sheet to a wire rack to cool slightly before serving, about 30 minutes.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.25}, {"food": "sugar", "quantity": 1.0}, {"food": "salt", "quantity": 0.25}, {"food": "diced chicken", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "sugar", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "frozen yogurt", "quantity": 10.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 2.3333333333333335}, {"food": "sugar", "quantity": 1}], "title": "\nDark Chocolate and Cherry Cheesecake Galette\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Put the hazelnuts on a small baking sheet and toast in the oven until golden, 10 to 12 minutes. Let cool. Transfer the hazelnuts to a cup and line the baking sheet with wax paper.\n            \n\n              Meanwhile, combine the confectioners' sugar, rice cereal and 1/2 teaspoon salt in a food processor and pulse until finely chopped, about 20 times. Add the chocolate-hazelnut spread and melted butter. Pulse until the mixture comes together in clumps, about 15 times; the mixture should be dry to the touch but hold together when pressed.\n            \n\n              Roll the mixture into teaspoon-size balls and place on the prepared baking sheet. Press a hazelnut into each ball and then press the dough back into a ball shape, leaving part of the hazelnut exposed at the top. Freeze the balls at least 20 minutes to let them firm up.\n            \n\n              Put the chocolate chips, shortening and a pinch of salt in a small microwave-safe bowl. Microwave until the chips on the bottom start to melt, 1 1/2 to 2 minutes. Stir until the mixture is melted and smooth. Gently stick a toothpick into the upper half of a ball, avoiding the hazelnut, and dip into the melted chocolate, leaving the top half uncoated. Allow the excess chocolate to drip off and return the ball to the baking sheet. Smooth over the hole from the toothpick with your fingertip. Repeat with the rest of the balls. Refrigerate until firm, about 20 minutes. You can store the balls covered in the refrigerator for up to 5 days.\n            \n", "ingredients": [{"food": "whole milk", "quantity": 36.333333333333336}, {"food": "sugar", "quantity": 0.5}, {"food": "crisped rice bar", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "margarine spread", "quantity": 0.5}, {"food": "butter oil", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 2.0}], "title": "\nDark Chocolate and Hazelnut Candies\n"}, {"directions": "\n\n              Pulse the chocolate in a food processor until finely chopped; transfer to a bowl. Add the hazelnuts to the food processor and pulse until finely chopped; transfer to the bowl with the chocolate.\n            \n\n              Whisk the flour, cocoa powder, baking soda and salt in a medium bowl. Beat the butter, granulated sugar and brown sugar in a large bowl with a mixer on medium-high speed until light and fluffy, about 3 minutes. Add the egg and vanilla and beat until combined. Reduce the mixer speed to low; beat in the flour mixture and chocolate and hazelnuts, then increase the speed to medium high and beat until combined.\n            \n\n              Divide the dough between 2 sheets of parchment paper; roll each into a 1-by-9-inch log, using the parchment to help you. Wrap and refrigerate until firm, at least 1 hour.\n            \n\n              Position racks in the upper and lower thirds of the oven; preheat to 350 degrees F. Line 2 baking sheets with parchment paper. Unwrap the logs and slice into 1/4-inch-thick rounds; arrange 1 inch apart on the prepared baking sheets. Sprinkle with coarse sugar. Bake until set, 15 to 20 minutes. Let cool 5 minutes on the baking sheets, then transfer to racks to cool completely.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 3.0}, {"food": "hazelnuts or filberts", "quantity": 0.5}, {"food": "potato flour", "quantity": 1.3333333333333333}, {"food": "onion powder", "quantity": 0.3333333333333333}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 0.25}, {"food": "sugar", "quantity": 0.25}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "sugar", "quantity": 1}], "title": "\nDark Chocolate-Hazelnut Sables\n"}, {"directions": "\n\n              Wet the rim of a martini glass and dip it in finely ground mixed peppercorns. Brew a small pot of strong hibiscus tea (it should be a deep reddish brown); sweeten heavily with sugar to make a syrup. In a cocktail shaker, combine 1 part syrup, 2 parts whiskey or bourbon, the juice of 1/2 orange and some ice. Shake well; strain into the martini glass.\n            \n\n              Photograph by Jonathan Kantor\n            \n", "ingredients": [], "title": "\nDark Night Cocktail\n"}, {"directions": "\n\n              Fill a highball glass or large wine goblet with ice cubes. Add the lime juice and the golden rum. Top off with the ginger beer and stir lightly. Float a layer of the dark rum on top by pouring it over the back of a wide, flat spoon. (Don't worry if it doesn't float; it tastes great either way.) Garnish with the lime wheel. Drink.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "grape juice", "quantity": 1.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 1.0}, {"food": "ginger", "quantity": 6.0}, {"food": "", "quantity": 0.5}], "title": "\nDark and Stormy\n"}, {"directions": "\nSpecial equipment: a pastry bag fitted with a star tip\n\n              For the crust: Preheat the oven to 350 degrees F. Process the graham crackers, brown sugar and ginger in a food processor until they form a fine crumb. Add the butter and rum, and pulse until the crumbs are soft and moist. Press the crumbs into the bottom and up the side of a 9-inch pie plate, and bake until firm, 12 to 15 minutes. Let the crust cool completely on a wire rack.\n            \n\n              For the rum pudding: Set a fine sieve over a mixing bowl; set aside. Whisk the milk, brown sugar and cornstarch in a medium saucepan until the cornstarch is dissolved and no lumps remain. Add the egg yolks, ginger and salt, and whisk until combined. Bring the mixture to a boil over medium-low heat, whisking constantly, 8 to 10 minutes. When the mixture is thick, reduce the heat to low, and cook for 1 minute more, whisking vigorously. Pour the pudding through the sieve set over the mixing bowl, and use a spatula to press it through (this will catch any eggy bits). Whisk the butter into the pudding until it's incorporated, then whisk in the rum. Pour the pudding into the cooled pie shell. Lay plastic wrap directly on the pudding, and refrigerate the pie until it's cool and set with a slight jiggle, about 2 hours.\n            \n\n              For the rum-and-lime whipped cream: Beat the confectioners' sugar, rum, lime juice and salt in a large bowl with an electric mixer on medium-high speed until combined. Add the heavy cream, and beat until fluffy peaks form.\n            \n\n              Transfer the whipped cream to a pastry bag fitted with a star tip. Pipe the whipped cream onto the cooled pie, and garnish with crystallized ginger. The pie can be refrigerated, loosely covered, up to overnight or served immediately.\n            \n", "ingredients": [{"food": "cracker barrel", "quantity": 14.0}, {"food": "sugar", "quantity": 3.0}, {"food": "ginger", "quantity": 1.0}, {"food": "butter oil", "quantity": 6.0}, {"food": "", "quantity": 1.0}, {"food": "whole milk", "quantity": 3.0}, {"food": "sugar", "quantity": 1.25}, {"food": "cornstarch", "quantity": 0.5}, {"food": "egg substitute", "quantity": 6.0}, {"food": "ginger", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "butter oil", "quantity": 3.0}, {"food": "", "quantity": 3.0}, {"food": "sugar", "quantity": 3.0}, {"food": "", "quantity": 1.0}, {"food": "lime juice", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "ice cream swich", "quantity": 1.0}], "title": "\nDark and Stormy Pie\n"}, {"directions": "\n\n              Puree a can of white beans in a food processor with 1 or 2 leftover peeled roasted sweet potatoes, 1/4 cup olive oil, 1/2 cup grated parmesan, and salt and pepper. Garnish with toasted nuts and serve with crackers.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [], "title": "\nDay-After Dip\n"}, {"directions": "\n\n              1. Put the turkey carcass, broth, garlic, bay leaves and thyme in a large Dutch oven (cut carcass in pieces if necessary so it fits) and add enough water to cover by an inch. Bring to a boil over medium-high heat; lower heat and simmer, uncovered, about 40 minutes. Strain the soup through a fine-mesh strainer into a large bowl; discard the solids. Add all but 2 cups of the broth back to the Dutch oven; reserve the remaining broth for another use (it will keep refrigerated up to 3 days or frozen up to 1 month).\n            \n\n              2. Add the turkey meat, green beans, corn and sweet potatoes to the pot; cover and cook over medium heat for 15 minutes. Add the pasta and continue to cook, uncovered, until the pasta and potatoes are tender, 10 to 12 minutes. Stir in the dill and pepper and season to taste with salt. Serve with the bread.\n            \n", "ingredients": [{"food": "smoked turkey roll", "quantity": 1.0}, {"food": "diced chicken", "quantity": 8.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "thyme", "quantity": 2.0}, {"food": "meat drippings ", "quantity": 2.0}, {"food": "fava beans", "quantity": 1.0}, {"food": "sunflower seed kernels", "quantity": 2.0}, {"food": "sweet potato puffs", "quantity": 1.0}, {"food": "italian veg medley pasta", "quantity": 1.0}, {"food": "meat drippings ", "quantity": 1}, {"food": "meat drippings ", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "garlic bread", "quantity": 1}], "title": "\nDay-After Turkey Soup\n"}, {"directions": "\n\n              Preheat the oven to 325 degrees F. Generously spray a 10-inch Bundt pan with cooking spray.\n            \n\n              Combine the flour, sugar, baking powder, baking soda, cardamom, and salt in a medium bowl. Combine the cocoa and espresso powder in a small bowl. Pour the boiling water over the cocoa mixture, whisking until smooth. Stir in the vanilla.\n            \n\n              Whisk together the yogurt, milk, oil, egg, and egg white in a large bowl; stir in the cocoa mixture until blended. Gradually add the flour mixture, stirring just until combined. Stir in the currants and chopped chocolate.\n            \n\n              Pour the batter into the pan. Bake in the center of the oven until a cake tester inserted in the cake comes out clean, about 50 minutes. Cool on a baking rack for 10 minutes, then turn the cake out onto a baking rack to cool completely. Dust generously with confectioners' sugar just before serving.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.0}, {"food": "sugar", "quantity": 1.3333333333333333}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "", "quantity": 0.25}, {"food": "salt", "quantity": 0.75}, {"food": "onion powder", "quantity": 0.6666666666666666}, {"food": "onion powder", "quantity": 1.0}, {"food": "coconut water", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "silk banana-strawberry soy yogurt", "quantity": 1.0}, {"food": "milk", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "egg substitute", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "hot pockets ham cheese stuffed swich", "quantity": 0.3333333333333333}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "sugar", "quantity": 1}], "title": "\nDecadent Chocolate Cake\n"}, {"directions": "\n\n              Tip: Rolled fondant is versatile. It can be tinted, flavored, modeled, formed, twisted, imprinted, and shaped into numerous of decorative pieces.\n            \n\n              Tip: Before applying fondant, a \"sticky\" surface should be applied to the cake which will help the fondant adhere to it. Many spread a thin layer of buttercream before laying out the fondant.\n            \n\n              Tip: When using rolled fondant to make decorations from, roll it to 1/4-inch thick. Either place them flat on greased (use shortening) wax paper or over forms to dry for 24 to 36 hours. Use royal icing to adhere fondant pieces to a rolled fondant iced cake and for the fine decorating commonly used on wedding cakes.\n            \n\n              Tip: The cake to be covered with rolled fondant must be cooled completely, preferably 24 hours, covered. This will tighten the crumbs and make the cake more solid.\n            \n\n              Tip: How far ahead you cover your cake with fondant will depend on the type of cake, filling, icing, etc. you use. With a basic butter cake, the fondant covering should be done no more than 2 to 3 days in advance of decorating and serving. A cake only remains fresh that long anyway and because fondant is sugar based, it's also how long it can stand without breaking down from the moisture in the cake. If you're using a layer cake and/or perishable fillings or icings, then you need to do everything just a day or two before the event.\n            \n\n              Tip: Fondant dries quickly, so while working with it, always keep excess well-wrapped in plastic, as well as the parts on the cake you are not working on.\n            \n\n              Tip: Once wrapped, unrolled fondant keeps for 1 to 2 months at room temperature. Do not refrigerate or freeze. If it gets too hard, put it in the microwave for a few seconds to soften; it will be easier to knead.\n            \n\n              Tip: To smooth out the fondant once it is put on the cake, use cornstarch on your hands to smooth out the fondant.\n            \n\n              Tip: If tiny cracks appear in the surface of the fondant, knead it a little - the warmth from the kneading or pressure from the rolling pin will make it smooth and satiny. Do not use water to smooth out cracks - water dissolves fondant as it is mostly sugar. Instead, use a bit of shortening on your fingertips to repair small tears.\n            \n\n              Add a few drops of vodka, lemon extract or clear vanilla extract. Use a small clean paintbrush to mix the liquid with the dust. Proceed to paint and decorate.\n            \n\n              Tip: Cracking can also be caused if your fondant is rolled too thick. Fondant is heavy and if not rolled thin enough (1/4-inch thick is usually best) the excess can pull the fondant from the top of the cake causing it to crack.\n            \n\n              Tip: To cover a crack, try rubbing a little of the same Fondant over the crack in a circular motion, then using a smother or your hands to rub it in.\n            \n\n              Tip: If fondant pleats at the bottom, gently unpleat and smooth out with the palms of your hands. With the palms of your hands, rub slightly up on sides to form an even top edge.\n            \n\n              Tip: Try to work with fondant in a cool room and on a cool surface. A warm room may make the fondant too soft and difficult to work with.\n            \n\n              Luster Dust Tips\n            \n\n              Tip: Luster dust gives colors a high sheen metallic-like finish. It can be used either alone or mixed with similar colored matte dusts to create a lustrous sheen, without lightening the color. They can also be used on gum paste, royal icing or any frosting recipe that dries hard and is firm to the touch. It is non toxic.\n            \n\n              Tip: Luster dusts can be incorporated into buttercreams to add shimmer cake decorations.\n            \n\n              Tip: When using luster dust, use an airbrush, blush brush or a small artist paintbrush to apply.\n            \n\n              Tip: Because luster dust is not water soluble, never mix them together to make paint colors. Instead use white spirits like vodka, gin, clear vanilla extract or lemon extract - the dust will absorb into these liquids and result in a more intense color. They also dry faster.\n            \n\n              How To Use:\n            \n\n              Use a bowl, mix a small amount of the dusting powder with a clear spirit.\n            \n\n              Luster dust comes in small, 2-gram, tubs. Carefully open the cap and, without breathing, put about 1/4 teaspoon into a very small cup.\n            \n", "ingredients": [{"food": "", "quantity": 1}], "title": "\nDecorating with Fondant\n"}, {"directions": "\n\n              For the crust: Place the flour, sugar, salt and butter in a food processor and pulse until the butter is evenly distributed but still visible in chunks. While pulsing, add the ice water 1 tablespoon at a time until the dough is just wet enough to hold together when pinched between your fingers.\n            \n\n              Turn the dough out onto a piece of plastic wrap, form into a disk and refrigerate for at least 30 minutes.\n            \n\n              Preheat the oven to 350 degrees F. Roll the dough out into a circle about 1/8-inch thick, and then fit into a 9-inch pie dish. Dock the crust all over using a fork. Cover the crust with plastic wrap and refrigerate for at least 30 minutes.\n            \n\n              Line the crust with foil and fill with dried beans or baking marbles. Bake for 10 to 12 minutes, and then remove the foil and beans and bake until the crust just begins to brown, another 15 minutes.\n            \n\n              For the filling: While the crust is baking, combine the farmer cheese, sugar and cardamom in a stand mixer with a paddle attachment and whip together until well incorporated. Add 1 egg at a time on medium speed, waiting until fully incorporated and smooth before each new addition. Stir in the heavy cream.\n            \n\n              Fill the crust with the cheese filling and bake until the top is browned and the filling is just slightly jiggly, 45 minutes. Let cool, and then eat the pie. Serve with orange marmalade.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.25}, {"food": "sugar", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "butter oil", "quantity": 1.5}, {"food": "ice cream swich", "quantity": 4.0}, {"food": "macaroni cheese", "quantity": 1.5}, {"food": "sugar", "quantity": 1.0}, {"food": "ground turkey", "quantity": 0.25}, {"food": "eggs", "quantity": 5.0}, {"food": "ice cream swich", "quantity": 1.5}, {"food": "marmalade", "quantity": 1}], "title": "\nDeep Dish Cheese Pie\n"}, {"directions": "\nSpecial equipment: an 8-inch springform pan\n\n              For the crust: Put the flour, granulated sugar and salt in the bowl of a food processor and pulse to combine. Add the shortening and pulse until it looks like cornmeal. Add the butter and pulse until the butter is about the size of a pea. Add 4 tablespoon ice water and pulse until the dough starts to come together but is still crumbly (add the remaining tablespoon water if necessary). Divide the dough into 2 pieces, one made from a third of the dough and the other from the remaining two-thirds of the dough. Form each into a disc and wrap in plastic. Refrigerate for 30 minutes or up to overnight.\n            \n\n              For the peach filling: Combine the peach wedges, light brown sugar, quick-cooking tapioca, cinnamon, vanilla extract, nutmeg, salt and lemon juice in a large bowl and toss to coat. Set aside. \n            \n\n              Lightly butter an 8-inch springform pan. On a lightly floured surface, roll the larger piece of dough into a 14-inch circle, about 1/4-inch thick.\n            \n\n              Roll the dough onto a rolling pin, then unroll it into the pan, patting it in gently, leaving a 1-inch overhang. Pour in the filling. \n            \n\n              Roll out the other piece of dough into a 10-inch circle about 1/8-inch thick and place it over the filling; press the crust edges together and trim any excess, leaving a 1-inch overhang. Roll up or pinch the overhang to seal.\n            \n\n              Place a foil-lined baking sheet on a rack in the lower third of the oven and preheat to 450 degrees F. Wrap an oiled, wide band of foil around the edge of the pan like a collar to protect the crust. Make slashes in the top of the crust and chill the pie 30 minutes. \n            \n\n              Place the pie on the foil-lined baking sheet and immediately reduce the oven to 400 degrees F. Bake the pie for 1 hour. Remove the foil band, brush the crust with heavy cream and sprinkle with some granulated sugar. Continue to bake until golden brown, about 45 minutes more. Let cool 1 hour, then carefully remove the edge of the pan. Let cool completely, about 1 more hour, before slicing.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.5}, {"food": "sugar", "quantity": 2.0}, {"food": "salt", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "butter oil", "quantity": 12.0}, {"food": "ice cream swich", "quantity": 4.0}, {"food": "silk peach soy yogurt", "quantity": 2.5}, {"food": "sugar", "quantity": 0.75}, {"food": "tapioca", "quantity": 0.3333333333333333}, {"food": "cinnamon", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "nutmeg", "quantity": 0.25}, {"food": "salt", "quantity": 0.25}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 1}, {"food": "ice cream swich", "quantity": 1.0}], "title": "\nDeep Dish Peach Pie\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: 9-inch spring form pan\n\n              Crust:\n            \n\n              If using the anise seeds, lightly toast them in skillet over medium heat until aromatic, 2 minutes. Grind in a spice mill or mortar and pestle until fine. Combine the butter and sugar in a food processor until creamy. Add the egg, anise seed if using, vanilla and salt and pulse to combine. (This may look rough and curdy, but don't worry, it all comes back together.) Add about half of the flour and pulse quickly 3 to 4 times to incorporate. Scrape down the edges of the processor and add the remaining flour. Pulse just enough to make a coarse, crumbly dough. Press dough into the bottom and up the sides of a 9-inch spring form pan to form a thin, even layer (see photo), using waxed paper to smooth. Freeze crust while you prepare the filling.;\n            \n\n              Filling:\n            \n\n              Pulse 1 1/4 cup almonds in a food processor until very finely ground (take care not to over process the nuts or they can get oily). Transfer nuts to a bowl. In the same processor, combine the butter and sugar until smooth. Add the cinnamon and continue to pulse until evenly combined. Scrape down the sides of the bowl and pulse in the egg. Add the reserved almonds and pulse until just blended. Arrange the plums cut side down, over the crust. Spread the filling on top and smooth with a small offset spatula. Sprinkle with the remaining almonds and place in the freezer for 30 minutes. Preheat oven to 350 degrees F. Bake pie until the filling puffs and is golden but still slightly soft in the center, 1 hour 15 minutes for a glass bottomed pan, or 1 hour 30 minutes for an aluminum pan. If the crust begins to over brown, cover the pie with foil during the last 15 minutes of cooking. When pie is done, turn off the oven and prop door open. Cool pie in the oven for 15 minutes, then transfer to a rack to cool completely. Serve at room temperature with ice cream or lightly sweetened whipped cream.;\n            \n\n              Make ahead:\n            \n\n              - Pie can be assembled and frozen up to 2 weeks in advance. Bake frozen pie for about 1 1/2 hours. - Baked pie can be tightly wrapped and refrigerated for up to 2 days, or frozen for up to 2 weeks. Bring to room temperature before serving.\n            \n", "ingredients": [{"food": "seeds", "quantity": 1.5}, {"food": "butter oil", "quantity": 10.0}, {"food": "sugar", "quantity": 0.75}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "salt", "quantity": 0.75}, {"food": "potato flour", "quantity": 1.75}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.5}, {"food": "butter oil", "quantity": 6.0}, {"food": "sugar", "quantity": 1.0}, {"food": "cinnamon", "quantity": 0.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "barley flour or meal", "quantity": 0.75}, {"food": "ice cream swich", "quantity": 1}, {"food": "whipped cream substitute", "quantity": 1}], "title": "\nDeep Dish Plum and Almond Pie\n"}, {"directions": "\nSpecial equipment: 9-inch springform pan\n\n              For the Crust:\n            \n\n              If using the anise seeds, lightly toast them in skillet over medium heat until aromatic, 2 minutes. Grind in a spice mill or mortar and pestle until fine.\n            \n\n              Combine the butter and sugar in a food processor until creamy. Add the egg, anise seed if using, vanilla and salt and pulse to combine. (This may look rough and curdy, but don't worry, it all comes back together.) Add about half of the flour and pulse quickly 3 to 4 times to incorporate. Scrape down the edges of the processor and add the remaining flour. Pulse just enough to make a coarse, crumbly dough.\n            \n\n              Press dough into the bottom and up the sides of a 9-inch springform pan to form a thin, even layer, using waxed paper to smooth. Freeze crust while you prepare the filling.\n            \n\n              For the Filling: \n            \n\n              Pulse 1 1/2 cups almonds in a food processor until very finely ground (take care not to overprocess the nuts or they can get oily). Transfer nuts to a bowl. In the same processor, combine the butter and sugar until smooth. Add the cinnamon and continue to pulse until evenly combined. Scrape down the sides of the bowl and pulse in the egg. Add the reserved almonds and pulse until just blended.\n            \n\n              Arrange the plums cut side down, over the crust. Spread the filling on top and smooth with a small offset spatula. Sprinkle with the remaining 1/4 cup almonds and place in the freezer for 30 minutes.\n            \n\n              Preheat oven to 350 degrees F. Bake pie until the filling puffs and is golden but still slightly soft in the center, 1 hour 15 minutes for a glass bottomed pan, or 1 hour 30 minutes for an aluminum pan. If the crust begins to overbrown, cover the pie with foil during the last 15 minutes of cooking. When pie is done, turn off the oven and prop door open. Cool pie in the oven for 15 minutes, then transfer to a rack to cool completely.\n            \n\n              Serve at room temperature with ice cream or lightly sweetened whipped cream.\n            \n", "ingredients": [{"food": "seeds", "quantity": 1.5}, {"food": "butter oil", "quantity": 10.0}, {"food": "sugar", "quantity": 0.75}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "salt", "quantity": 0.75}, {"food": "potato flour", "quantity": 1.75}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.5}, {"food": "butter oil", "quantity": 6.0}, {"food": "sugar", "quantity": 1.0}, {"food": "cinnamon", "quantity": 0.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "barley flour or meal", "quantity": 0.75}, {"food": "whipped cream substitute", "quantity": 1}], "title": "\nDeep Dish Plum and Almond Pie\n"}, {"directions": "\n\n              Make the crust: Pulse the flour, 4 tablespoons butter, the shortening, sugar and salt in a food processor until it looks like fine meal. Add the remaining 8 tablespoons butter and pulse until it is in pea-size pieces. Drizzle in the vodka and 3 tablespoons cold water and pulse until the dough just comes together. Divide the dough between 2 sheets of plastic wrap; use the plastic to help form each half into a disk. Wrap tightly and refrigerate until firm, at least 1 hour or overnight. (The dough can be frozen for up to 2 months; thaw at room temperature.)\n            \n\n              Make the filling: Peel the apples and slice 1/2 inch thick. Transfer to a bowl and toss with the sugar and lemon juice. Melt 4 tablespoons butter in a large skillet over medium-high heat. Add the apples and cook, stirring occasionally, until softened, 15 to 18 minutes. Add the flour, heavy cream, cinnamon and salt and stir until the juices thicken, about 2 minutes. Remove from the heat and let cool completely. (The filling can be made up to 2 days ahead; cover and refrigerate.)\n            \n\n              Roll out 1 disk of dough into a 13-inch round on a floured surface. Ease into a 9 1/2-inch deep-dish pie plate. Add the filling, mounding it in the center; dot with the remaining 2 tablespoons butter.\n            \n\n              Roll out the remaining disk of dough into a 12-inch round on a floured surface. Lay the dough over the filling and press the edges together. Fold the overhanging dough under itself and crimp the edge with your fingers. Brush with heavy cream and sprinkle with sugar. Cut a few slits in the top crust to let steam escape. Chill at least 1 hour.\n            \n\n              Set a baking sheet on a rack in the lower third of the oven; preheat to 425 degrees F. Set the pie on the hot baking sheet and reduce the oven temperature to 375 degrees F; bake until golden, 1 hour to 1 hour 10 minutes, rotating the pie as needed for even browning. (Cover the edge with foil if it is browning too quickly.) Transfer to a rack and let cool until set, about 3 hours.\n            \n\n              Photograph by Johnny Miller\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.5}, {"food": "butter oil", "quantity": 12.0}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "sugar", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "", "quantity": 3.0}, {"food": "mixed nuts", "quantity": 4.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "lemon juice", "quantity": 2.0}, {"food": "butter oil", "quantity": 6.0}, {"food": "potato flour", "quantity": 3.0}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "pumpkin pie spice", "quantity": 1.0}, {"food": "salt", "quantity": 0.25}], "title": "\nDeep-Dish Apple Pie\n"}, {"directions": "\n\n              Put an inverted baking sheet or pizza stone on the bottom oven rack; preheat to 475 degrees F. Brush the bottom and side of a 10-inch deep-dish pizza pan or a 9-inch-round cake pan (preferably dark metal) with 2 tablespoons olive oil. Press the dough into the pan.\n            \n\n              Combine the tomato sauce, garlic, oregano, 1/2 teaspoon salt and a few grinds of pepper in a bowl. Spread 1 cup of the sauce over the dough; scatter the onion on top. Transfer the pan to the hot baking sheet; bake until the crust puffs up slightly and starts browning, about 10 minutes.\n            \n\n              Remove the pizza from the oven; top with the cheese, pepperoncini and pepperoni, then top with the remaining sauce. Return to the hot baking sheet and bake until golden and crisp around the edge, about 12 minutes. Let cool 5 minutes. Top with the basil before slicing.\n            \n\n              Toss the greens with the remaining 2 tablespoons olive oil and the pepperoncini brine; season with salt and pepper. Serve with the pizza.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.25}, {"food": "pizza rolls", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 1.5}, {"food": "garlic powder", "quantity": 1.0}, {"food": "", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "onion powder", "quantity": 0.25}, {"food": "macaroni cheese", "quantity": 1.5}, {"food": "", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}, {"food": "chrysanthemum leaves", "quantity": 8.0}, {"food": "mixed nuts", "quantity": 1.0}], "title": "\nDeep-Dish Pepperoni Pizza\n"}, {"directions": "\n\n              Make the dough: Combine the flour, cornmeal, salt, yeast, olive oil, melted butter, vegetable oil and warm water in the bowl of a stand mixer fitted with the dough hook. Mix on medium speed until the dough comes together and pulls away from the side of the bowl but still sticks to the bottom, about 3 minutes. Reduce the mixer speed to low and knead 5 minutes. Transfer the dough to a lightly oiled bowl and turn to coat. Tightly cover with plastic wrap and let rise in a warm place, 1 hour.\n            \n\n              Meanwhile, make the sauce: Heat the olive oil in a medium saucepan over medium heat. Add the garlic and red pepper flakes and cook, stirring, until the garlic is slightly softened, about 1 minute. Add the tomato puree and 1 cup water. Stir in the oregano and 1 teaspoon salt. Bring to a boil, then reduce the heat and simmer, stirring occasionally, until slightly thickened, about 8 minutes.\n            \n\n              Preheat the oven to 425 degrees F. Generously brush two 9 1/2-inch round deep-dish pizza pans (or 9-inch cake pans) with about 3 tablespoons olive oil each. Divide the dough in half; press each half into the bottom of a pan. Let the dough rest, 15 minutes. Push the dough down and press it up the sides of the pans with your fingers. Layer the cheese on top of each crust and spread each with 1 1/2 cups sauce.\n            \n\n              Bake the pizzas until the crust is dark golden brown and the cheese is bubbling, 40 to 45 minutes (it will still be jiggly in the center). Sprinkle with parmesan (if using); let cool 15 minutes. Transfer to a cutting board and cut into wedges.\n            \n\n              You can freeze the baked pizza for up to a month. Let it cool, then tightly wrap in plastic and foil. To reheat, unwrap and bake at 325 degrees F until hot and bubbling, 50 to 60 minutes.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "potato flour", "quantity": 4.0}, {"food": "yellow rice", "quantity": 3.0}, {"food": "salt", "quantity": 2.0}, {"food": "yeast extract spread", "quantity": 2.5}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 3.0}, {"food": "parmesan cheese", "quantity": 1}], "title": "\nDeep-Dish Pizza\n"}, {"directions": "\n\n              Special equipment: a 9 1/2-inch deep-dish pie pan\n            \n\n              For the dough: Put the flour, sugar, vinegar and 1/2 teaspoon salt in a food processor, and pulse to combine. Add the coconut oil in small spoonfuls, and pulse until the largest pieces are pea-size. Add 8 tablespoons ice water, and pulse until evenly combined. Squeeze a handful of the dough together; it should just hold its shape. If the mixture is very powdery, pulse in an additional 1 to 2 tablespoons ice water. Divide the dough between 2 large pieces of plastic wrap, pat each into a 1/2-inch thick discs and chill for at least 1 hour up to overnight.\n            \n\n              For the filling: Meanwhile, peel and core the apples; cut into 1/2-inch-thick slices. Toss with the sugar and lemon juice in a large bowl. Melt the coconut oil in a large skillet over medium-high heat. Add the apples and cook, stirring occasionally, until the firmer apples soften but hold their shape, about 12 minutes. Add the flour, cinnamon and 1/4 teaspoon salt, and stir to combine. Remove from the heat, and let cool completely. (The filling can be made up to 2 days ahead; cover and refrigerate.)\n            \n\n              To assemble: To make rolling easier, let the dough soften a bitit should be slightly soft when pressedat room temperature (this may take anywhere from 20 to 40 minutes depending on the temperature of your kitchen). Roll 1 disc of dough out into a 13-inch round on a lightly floured surface or between two pieces of floured parchment or wax paper. If the dough gets too warm, refrigerate it to firm it up. Ease the crust into a 9 1/2-inch deep-dish pie pan. Add the cooled filling, mounding it slightly in the center.\n            \n\n              Roll out the remaining dough disc into a 12-inch round; place it over the filling, and press the 2 crusts together around the edges. Fold the overhanging dough under itself, and crimp as desired. Brush the top and edges with the almond milk, and sprinkle generously with sugar. Pierce the top with a knife (or make decorative cutouts) a few times to let steam escape. Chill for at least 1 hour.\n            \n\n              Position an oven rack in the lowest position in the oven, place a baking sheet on the rack and preheat to 425 degrees F; preheat for at least 30 minutes. Place the pie on the hot baking sheet, and lower the oven to 375 degrees F. Bake until the pie is golden and the filling is bubbly, 1 hour to 1 hour 20 minutes, rotating as needed. (Cover the edges with foil if they brown too quickly.) Transfer to a rack, and cool until set, about 3 hours.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 3.0}, {"food": "sugar", "quantity": 2.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 8.0}, {"food": "mixed nuts", "quantity": 4.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "lemon juice", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 4.0}, {"food": "potato flour", "quantity": 3.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "salt", "quantity": 0.25}, {"food": "milk", "quantity": 2.0}], "title": "\nDeep-Dish Vegan Apple Pie\n"}, {"directions": "\n\n              Toss 1 pound leftover cooked or raw green beans with 1 teaspoon salt, 1/4 teaspoon cayenne pepper and 1 cup buttermilk; soak for 15 minutes. Season 1 cup cornmeal with salt and cayenne. Dredge the green beans in the cornmeal, then deep-fry in 2 inches of 375 vegetable oil until golden brown, 2 to 3 minutes.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [], "title": "\nDeep-Fried Green Beans\n"}, {"directions": "\n\n              Push each candy bar onto a skewer or popsicle stick; refrigerate for at least 2 hours or overnight.\n            \n\n              Whisk the flour and baking soda in a medium bowl. Whisk in the seltzer to make a smooth batter (about the consistency of pancake batter). Heat 4 to 6 inches of vegetable oil in a deep pot until a deep-fry thermometer registers 330 degrees.\n            \n\n              Hold the Snickers by the skewer and dip into the batter, turning to coat. Carefully place the Snickers in the hot oil (skewers and all); fry, turning as needed, until crisp, 1 1/2 to 2 minutes. Use tongs to remove each bar by the stick; drain on paper towels or a rack and serve warm.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "breakfast bars", "quantity": 4.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "", "quantity": 0.75}, {"food": "vegetable oil", "quantity": 1}], "title": "\nDeep-Fried Snickers on a Stick\n"}, {"directions": "\nSpecial equipment: a deep-frying thermometer\n\n              Fill a medium Dutch oven halfway with canola oil and heat until a deep-frying thermometer registers 350 degrees F. Set a rack over a baking sheet.\n            \n\n              Put the chocolate chips in a small bowl. Heat the heavy cream in a small pot until almost to a boil. Pour the cream over the chocolate chips and allow to sit for 1 minute. Stir until completely smooth. Reserve the sauce while you fry the cookies--it will thicken as it cools.\n            \n\n              Whisk together the flour, powdered peanut butter, granulated sugar, baking powder and baking soda in a medium bowl. Add the buttermilk and egg and whisk until just combined. \n            \n\n              Add 7 cookies to the batter and use a fork to completely coat them in the batter. Add the cookies 1 at a time to the hot oil until all 7 are added. Fry, turning the cookies occasionally with a slotted spoon, until puffed and golden brown, 2 to 3 minutes. Use the slotted spoon to transfer the fried cookies to the rack on the baking sheet. Repeat the frying process with the remaining cookies and batter.\n            \n\n              Stack the fried cookies on a platter and sift confectioners' sugar over the top. Serve immediately with the chocolate sauce for dipping.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "ice cream swich", "quantity": 0.3333333333333333}, {"food": "potato flour", "quantity": 1.0}, {"food": "peanut butter ", "quantity": 3.0}, {"food": "sugar", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "peanut butter ", "quantity": 14.0}, {"food": "sugar", "quantity": 3.0}], "title": "\nDeep-Fried Tagalongs\n"}, {"directions": "\n\n              Toppings: Deli-sliced pastrami, Russian dressing and dill pickle slices on cheesy skins\n            \n\n              How to Make Classic Potato Skins:\n            \n\n              Pierce 4 large russet potatoes with a fork. Bake directly on the oven rack at 350 degrees until tender, about 1 hour. Let cool, then quarter lengthwise and scoop out the flesh, leaving a 1/4-inch shell. Brush both sides with melted butter and season with salt and pepper. Bake, skin-side up, at 450 degrees until crisp, about 15 minutes. Add your favorite team toppings. (For cheesy skins, flip the baked shells over before topping, sprinkle with 1 cup grated cheddar cheese and bake an extra 5 minutes.)\n            \n\n              Photograph by Karl Juengel/Studio D\n            \n", "ingredients": [], "title": "\nDeli Pastrami Potato Skins\n"}, {"directions": "\n\n              Preheat oven to 350 degrees F. Butter and flour an 8-inch cake pan.\n            \n\n              Put the chocolate in a heatproof bowl. Bring a saucepan filled with an inch or so of water to a very slow simmer; set the bowl on the pan (without touching the water). Stir occasionally until melted and smooth. Alternatively, put the chocolate in microwave safe bowl. Microwave on half power until soft, about 1 minute depending upon the power of your machine. Cool.\n            \n\n              Whisk the flour, baking powder and salt in a bowl.\n            \n\n              Beat the butter and sugar in a medium bowl with an electric mixer on medium-high speed until light and fluffy, about 4 minutes. Add the eggs, 1 at a time, beating well after each addition. Stir in chocolate, orange peel, and vanilla and mix until fully combined. Add in flour, salt, and baking powder in 3 parts alternating with the milk to make a thick batter.\n            \n\n              Pour batter into prepared pan. Bake in the middle of the oven until a tester comes out clean, about 30 minutes.\n            \n\n              Cool cake in the pan for 10 minutes, then turn out onto rack to cool completely.\n            \n\n              Serve dusted with confectioners' sugar and with whipped cream or ice cream, if desired.\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 2.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 1.25}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 0.5}, {"food": "sugar", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "orange peel", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "milk", "quantity": 0.25}, {"food": "sugar", "quantity": 1}, {"food": "ice cream swich", "quantity": 1}], "title": "\nDelilah's Chocolate Surprise\n"}, {"directions": "\n\n              Make the crusts: Pulse the flour, walnuts, granulated sugar and salt in a food processor until finely ground. Add the butter and pulse until the mixture looks like coarse meal. Drizzle in 2 to 3 tablespoons ice water and pulse until the dough starts to come together. Turn out onto a sheet of plastic wrap; shape into a disk, then wrap and refrigerate until firm, about 1 hour.\n            \n\n              Preheat the oven to 375 degrees F. Spray an 18-cup mini-muffin pan with cooking spray. Press 1 tablespoon dough into the bottom and up the side of each cup. Refrigerate 20 minutes. \n            \n\n              Bake the crusts until golden brown, 20 to 25 minutes, then press the centers of the crusts down with a small spoon. Let cool in the pan 10 minutes, then remove to a rack to cool completely. \n            \n\n              Make the filling: Put the chocolate chips in a bowl. Combine 3 tablespoons cream and 1 tablespoon bourbon in a small microwave-safe bowl and microwave until simmering, about 30 seconds; pour over the chocolate chips and let stand 1 minute, then stir until smooth. Let cool slightly. \n            \n\n              Spoon the filling into the crusts and let set, about 20 minutes. Whisk the remaining 1/4 cup cream and 1 tablespoon bourbon with the confectioners' sugar until soft peaks form; spoon onto the tartlets and top with the candied walnuts.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.0}, {"food": "walnuts", "quantity": 0.5}, {"food": "sugar", "quantity": 0.25}, {"food": "hearts of palm", "quantity": 1}, {"food": "butter oil", "quantity": 4.5}, {"food": "", "quantity": 1}, {"food": "baking chocolate", "quantity": 0.3333333333333333}, {"food": "baking chocolate", "quantity": 0.3333333333333333}, {"food": "ice cream swich", "quantity": 0.25}, {"food": "", "quantity": 2.0}, {"food": "sugar", "quantity": 1.0}, {"food": "walnuts", "quantity": 1}], "title": "\nDerby Tartlets\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Combine the tomatoes, tomato paste, seafood seasoning and some salt and pepper in a large bowl.\n            \n\n              Juice the celery, carrot, garlic, shallot, cucumber, lime and green bell pepper into the bowl. Stir in a couple of dashes of Worcestershire sauce. Divide among glasses and garnish with a celery stalk. Add a splash of vodka if desired.\n            \n", "ingredients": [{"food": "barley flour or meal", "quantity": 5.0}, {"food": "pasta with tomato sauce", "quantity": 2.0}, {"food": "seasoning mix", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "celery seed", "quantity": 2.0}, {"food": "carrot juice", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "cucumber", "quantity": 0.5}, {"food": "lime", "quantity": 0.5}, {"food": "pepper", "quantity": 0.5}, {"food": "Worcestershire sauce", "quantity": 1}, {"food": "hearts of palm", "quantity": 1}, {"food": "", "quantity": 1}], "title": "\nDetox Juicy Mary... with maybe a splash of vodka\n"}, {"directions": "\n\n              Put the pizza dough in a large bowl and coat with 2 tablespoons of the olive oil. Cover the bowl with plastic wrap and let sit in a warm spot until the dough is slightly puffy, 30 minutes.\n            \n\n              Spread the butter all over the inside of a metal 9-by-13-inch pan and put the dough in the middle. Starting from the middle of the dough and using your fingertips, push the dough out to the corners of the pan. Cover with plastic wrap and place in a warm spot until puffy and doubled in thickness, about 1 hour. Push the dough all the way to the edges, recover with plastic wrap and let rest for 15 minutes more. \n            \n\n              Meanwhile, position an oven rack in the bottom third of the oven and preheat to 500 degrees F. Place a baking sheet on the rack to preheat. \n            \n\n              Combine the tomatoes and tomato paste in a blender and blend until smooth. Heat the remaining 1 tablespoon olive oil in a large skillet over medium-high heat until shimmering. Add the garlic and cook until fragrant and soft but not brown. Add the tomato mixture, oregano, chile flakes, 1/2 teaspoon salt and 1/4 cup water, bring to a simmer, reduce the heat to medium low and cook until thick, about 15 minutes.\n            \n\n              Uncover the dough and cover evenly with the pepperoni. Sprinkle about 2 cups of the Cheddar evenly along the edges of the pizza. Sprinkle the remaining 1/2 cup Cheddar over the rest of the pizza, then top the entire pizza with the Havarti and scallions. \n            \n\n              Put the pan on the preheated baking sheet and bake the pizza until the edges are golden and the cheese is melted and bubbling, about 15 minutes. \n            \n\n              Loosen the sides and bottom of the pizza with a metal spatula and slide onto a cutting board. Spoon the sauce in 4 thick crosswise lines over the pizza. Cut into squares and serve. \n            \n", "ingredients": [{"food": "pizza rolls", "quantity": 1.5}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "whole milk", "quantity": 28.0}, {"food": "pasta with tomato sauce", "quantity": 0.25}, {"food": "garlic powder", "quantity": 2.0}, {"food": "", "quantity": 0.5}, {"food": "celery flakes", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "martha white foods", "quantity": 8.0}, {"food": "", "quantity": 8.5}, {"food": "silk light vanilla", "quantity": 8.0}], "title": "\nDetroit-Style Pizza\n"}, {"directions": "\n\n              To make the frosting: Put the chocolate in a large heatproof bowl. In a small saucepan, bring the cream to a boil. Pour the cream over the chocolate, move the bowl gently to let the cream settle. Set the mixture aside until softened, about 4 minutes. Whisk until smooth. Cover the surface of the frosting with plastic wrap. Set aside and let set up at room temperature, about 2 hours.\n            \n\n              To make the cake: Set a rack in the middle of the oven and preheat to 350 degrees F. Lightly butter two 9-inch round cake pans and line the bottoms with a circle of parchment or wax paper.\n            \n\n              In a medium bowl, whisk together the flour, baking soda, baking powder, and salt. Set aside.\n            \n\n              In a standing mixer fitted with the paddle attachment, beat the butter at medium speed until smooth, about 2 minutes. Increase the speed to medium-high and slowly add the sugar. Continue beating until light and smooth, about 4 minutes. Turn the mixer off and scrape down the sides of the bowl with a rubber spatula. Add the cocoa powder and vanilla and beat at medium speed for 1 minute more. (Stop the machine and scrape down the sides of the bowl again, if needed.) With the mixer running at medium-low speed, add the eggs, one at a time, beating for 1 minute between each addition. Scrape down the sides of the bowl.\n            \n\n              Combine the water and milk in a saucepan and bring just to a boil. Remove from the heat.\n            \n\n              With the mixer at low speed, add the flour mixture, about a 1/4 cup at a time. Carefully pour the hot liquid into the batter. Remove the bowl from the mixer and, using a large rubber spatula, finish combining the batter until smooth. Divide the batter evenly between the prepared pans. Lightly drop each pan onto the counter to settle the batter.\n            \n\n              Set the pans on the middle rack in the oven. Bake until the cakes begin to pull away from the sides of the pans and the center springs back when touched lightly, about 30 to 35 minutes.\n            \n\n              Cool the cakes, in the pans, on a rack for 10 minutes. Turn the cake layers out of the pans and cool on the rack. (If not assembling the cake right away, wrap the layers in plastic wrap and store at room temperature for up to 1 day, or freeze for up to 2 months.)\n            \n\n              Assemble the Devil's Food Cake. Place 1 cake layer upside-down on a cake stand or flat plate. Scoop about 1/3 of the icing onto the center of the layer. Using a large, offset spatula, spread the icing evenly over the layer to the edges. Place the other cake layer, rounded-side up, on top. Evenly spread half of the remaining icing over the top, spreading any excess icing down the sides. Spread the remaining icing around the sides of the cake. Use the tip of the offset spatula to make a swirling pattern in the icing. Serve. Store under a cake dome or loosely wrapped with plastic, at room temperature, for up to 2 days.\n            \n\n              Copyright 2001 Television Food Network, GP. All rights reserved\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 15.0}, {"food": "ice cream swich", "quantity": 1.5}, {"food": "potato flour", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "salt", "quantity": 0.75}, {"food": "butter oil", "quantity": 12.0}, {"food": "sugar", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.75}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "eggs", "quantity": 3.0}, {"food": "coconut water", "quantity": 1.25}, {"food": "milk", "quantity": 0.25}], "title": "\nDevil's Food Cake\n"}, {"directions": "\n\n              1. For frosting: Place chocolate in a large heatproof bowl. Bring cream to a boil in a small saucepan and immediately pour over chocolate. Set aside until chocolate softens, about 4 minutes. Stir until smooth. Cover surface of frosting with plastic wrap and let sit until room temperature, about 2 hours.\n            \n\n              2. For cake: Preheat oven to 350F. Lightly butter two 9-inch round cake pans; line bottoms with parchment paper.\n            \n\n              3. Whisk flour, baking soda, baking powder, and salt together in a medium bowl. Set aside. Beat butter using a mixer set at medium speed until smooth. Increase speed to medium-high and gradually add sugar. Beat until light and smooth, about 4 minutes. Scrape down bowl sides as needed. Add cocoa and vanilla, and beat at medium speed for 1 minute. Reduce speed to medium-low and add eggs, one at a time and beating for 1 minute between each addition.\n            \n\n              4. Bring 1 1/2 cups water and milk to a boil in a saucepan. Remove from heat.\n            \n\n              5. Beat flour mixture into batter 1/4 cup at a time using mixer set at low speed. Carefully pour hot milk mixture into batter. Stir using a rubber spatula until smooth. Evenly divide batter among prepared pans. Lightly tap pans on counter to distribute batter.\n            \n\n              6. Bake on middle rack in oven until cakes begin to pull away from pan sides and center springs back when touched lightly, about 30 to 35 minutes. Cool cakes, in pans, on a rack for 10 minutes. Release from pans and cook completely on rack.\n            \n\n              7. Ice cake, spreading 1/3 cup frosting between layers and remainder over top and sides. Garnish with raspberries.\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 15.0}, {"food": "ice cream swich", "quantity": 1.5}, {"food": "potato flour", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "salt", "quantity": 0.75}, {"food": "butter oil", "quantity": 12.0}, {"food": "sugar", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.75}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "eggs", "quantity": 3.0}, {"food": "milk", "quantity": 0.25}, {"food": "", "quantity": 1}], "title": "\nDevil's Food Cake\n"}, {"directions": "\nSpecial equipment: Red cupcake liners\n\n              For the cupcakes: Position an oven rack in the center of the oven, and preheat to 350 degrees F. Line a 12-cup muffin tin with cupcake liners, and lightly coat with cooking spray.\n            \n\n              Whisk together the flour, baking soda, baking powder and 1/2 teaspoon salt in a medium bowl; set aside.\n            \n\n              Bring the cocoa powder, milk and 1/2 cup water to a simmer in a small saucepan over medium heat, and whisk until the cocoa dissolves into a smooth, thicker mixture, about 3 minutes. Stir in the vanilla, and set aside until just slightly warm to the touch.\n            \n\n              Beat the butter and sugar on medium-high speed in the bowl of a stand mixer fitted with a paddle attachment (or in a large bowl if using a handheld mixer) until combined and fluffy, about 3 minutes. Add the eggs and egg yolks one at a time, beating to incorporate after each addition. Continue to beat while slowly pouring the cocoa mixture into the bowl (be sure to scrape out any cocoa that coats the saucepan) just until incorporated, scraping down the side of the bowl as needed. Reduce the speed to medium, add the flour mixture and beat until just incorporated. Remove the bowl from the stand, and finish stirring by hand to avoid overmixing.\n            \n\n              Divide the batter evenly among the lined muffin cups, and bake until the cupcakes bounce back when gently pressed and a toothpick inserted in the center comes out clean, 18 to 20 minutes. Let cool in the pan for a few minutes, then transfer to a rack to cool completely.\n            \n\n              For the glaze: Combine the butter, chocolate, honey and salt in a small microwave-safe bowl, cover with plastic wrap and poke a hole in it to vent. Microwave on high (at 100 percent power) for about 1 minute, until the butter and most of the chocolate is melted. Whisk until smooth, and let cool, 15 to 20 minutes. Dip the top of each cupcake in the glaze, and let it set up, about 30 minutes.\n            \n\n              Decorate the cupcakes: Pinch each fruit chew into a curved horn shape with pointed ends. Cut the licorice laces into twelve 5-inch pieces, and snip 1 end of each to make a Y-shaped tail. Press two horns into the top of each cupcake, and press a tail into the back of each cupcake.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "onion powder", "quantity": 0.5}, {"food": "milk", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "butter oil", "quantity": 10.0}, {"food": "sugar", "quantity": 1.0}, {"food": "egg substitute", "quantity": 2.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "honey smoked ham", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "ruby red grapefruit juice blend", "quantity": 24.0}, {"food": "ruby red grapefruit juice blend", "quantity": 2.0}], "title": "\nDevil's Food Cupcakes\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 450 degrees F or a convection oven to 425 degrees F.\n            \n\n              Stand a drumette on its wide end and, holding the narrow bone at the top, use a paring knife to push and scrape the skin and meat downward to expose the bone and make a plump \"lollipop\" of chicken at the bottom. Repeat with the remaining drumettes. Season generously with salt and pepper and set aside.\n            \n\n              Pulse the bread in a food processor to make coarse bread crumbs, (about 12 times). Add the garlic, parsley, scallions, 1 teaspoon salt, pepper, to taste, and continue to pulse until finely chopped but not a paste. Transfer the mixture to a shallow bowl and toss with melted butter.\n            \n\n              Brush each drumette with some honey mustard. Then press and roll each one in the bread crumbs to coat. Arrange the drumettes (standing up if you can) on a rack set over a baking sheet. Roast until chicken is cooked and the bread crumbs are golden brown and crisp, 20 to 25 minutes. Serve drumettes hot or at room temperature with hot sauce, if desired.\n            \n\n              Halloween Web 2008\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 12.0}, {"food": "salt", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "garlic bread", "quantity": 3.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 0.25}, {"food": "martha white foods", "quantity": 2.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 0.3333333333333333}, {"food": "Worcestershire sauce", "quantity": 1}], "title": "\nDeviled Chicken Lollipops\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Lightly oil a baking sheet. Combine the butter and garlic in a large microwave-safe bowl. Cover with plastic wrap and microwave to melt the butter, about 1 minute. Whisk in the Dijon and 1/4 teaspoon of the cayenne. \n            \n\n              In another large bowl, combine the breadcrumbs, Parmesan, chives, paprika and the remaining 1/4 teaspoon cayenne. Sprinkle the chicken thighs with 1/2 teaspoon salt. Dip the chicken in the mustard mixture to coat and roll in the breadcrumbs on all sides. Lay on the prepared baking sheet so the pieces do not touch.\n            \n\n              Bake on the middle rack of the oven until the coating is browned and crispy and the chicken is no longer pink near the bone, about 40 minutes. \n            \n\n              Transfer to a large platter and serve.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1}, {"food": "butter oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "pepper", "quantity": 0.5}, {"food": "", "quantity": 1.5}, {"food": "", "quantity": 0.75}, {"food": "barley flour or meal", "quantity": 0.25}, {"food": "paprika", "quantity": 2.0}, {"food": "diced chicken", "quantity": 8.0}, {"food": "salt", "quantity": 1}], "title": "\nDeviled Chicken Thighs\n"}, {"directions": "\n\n              Position a rack in the upper third of the oven; preheat to 475 degrees F. Brush a rimmed baking sheet with 1 tablespoon olive oil. Add the chicken skin-side up; season with salt, pepper and 1/2 teaspoon chili powder. Arrange the sweet potatoes around the chicken; season with salt and pepper. Drizzle the chicken and sweet potatoes with 1 tablespoon olive oil. Roast until the chicken is lightly browned and the sweet potatoes are just tender, 25 to 30 minutes.\n            \n\n              Meanwhile, combine the mustard, 1 tablespoon hot sauce and the remaining 1/2 teaspoon chili powder in a small bowl. Toss the panko, melted butter, remaining 1 teaspoon hot sauce and a pinch of salt in another small bowl.\n            \n\n              Remove the baking sheet from the oven and spread the mustard mixture on top of each chicken breast. Top with the panko, lightly pressing to adhere. Move the chicken and sweet potatoes to one side of the pan. Mound the kale on the other side; toss with the remaining 1 tablespoon olive oil and season with salt and pepper.\n            \n\n              Roast until a thermometer inserted into the thickest part of the chicken registers 165 degrees F and the kale is crisp on top, about 15 minutes.\n            \n\n              Photograph by Bobbi Lin\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "chili powder", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 2.5}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "butter oil", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}], "title": "\nDeviled Chicken with Kale and Sweet Potatoes\n"}, {"directions": "\n\n              Position a rack 6 inches from the heat source and preheat the broiler. Combine the panko and 1 tablespoon parsley on a plate. Combine the mayonnaise, mustard and cayenne in a small bowl. Season the cod on both sides with salt; brush the top with the mayonnaise mixture, then invert into the panko mixture, pressing to help it adhere.\n            \n\n              Drizzle a baking sheet with olive oil and top with the cod, panko-side up. Broil until the fish is just cooked through and the panko is crisp and golden, about 6 minutes.\n            \n\n              Meanwhile, heat a large pot or Dutch oven over medium-high heat. Add 3 tablespoons olive oil, then add the red onion and cook, stirring occasionally, until lightly browned, about 3 minutes. Add the escarole, kale, 1/2 teaspoon salt and a few grinds of pepper. Cook, stirring occasionally, until the greens are wilted, about 3 minutes. Stir in the lemon juice and the remaining 1 tablespoon parsley. Serve the cod with the greens and lemon wedges.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [{"food": "escarole", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "", "quantity": 0.3333333333333333}, {"food": "parsley", "quantity": 2.0}, {"food": "mayonnaise dressing", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "pepper", "quantity": 0.25}, {"food": "fish oil", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "onion powder", "quantity": 1.0}], "title": "\nDeviled Cod with Winter Greens\n"}, {"directions": "\n\n              Toppings: Crab salad, cayenne pepper and paprika\n            \n\n              How to Make Classic Potato Skins:\n            \n\n              Pierce 4 large russet potatoes with a fork. Bake directly on the oven rack at 350 degrees until tender, about 1 hour. Let cool, then quarter lengthwise and scoop out the flesh, leaving a 1/4-inch shell. Brush both sides with melted butter and season with salt and pepper. Bake, skin-side up, at 450 degrees until crisp, about 20 minutes. Add your favorite team toppings. (For cheesy skins, flip the baked shells over before topping, sprinkle with 1 cup grated cheddar cheese and bake an extra 5 minutes.)\n            \n\n              Photograph by Karl Juengel/Studio D\n            \n", "ingredients": [], "title": "\nDeviled Crab Potato Skins\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F and butter a shallow 3-quart baking dish. Melt 6 tablespoons butter in a large nonstick skillet over medium heat. Add the scallion whites, bell pepper and celery; cook, stirring occasionally, until the vegetables are softened, about 6 minutes. Add the thyme and sherry and cook, stirring, until the sherry is mostly reduced, 3 minutes. Add the broth, 1 teaspoon salt and the cayenne; bring to a simmer, then remove from the heat.\n            \n\n              Whisk the eggs in a large bowl and add the scallion greens. Add the bread cubes, vegetable-broth mixture and crabmeat and stir until combined. Transfer to the prepared baking dish. Cut the remaining 2 tablespoons butter into small cubes and scatter evenly over the stuffing; sprinkle with the paprika. Cover with foil and bake 30 minutes, then uncover and bake until golden brown, 20 to 30 more minutes.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "celery seed", "quantity": 4.0}, {"food": "thyme", "quantity": 2.0}, {"food": "barley flour or meal", "quantity": 0.25}, {"food": "diced chicken", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "pepper", "quantity": 0.25}, {"food": "eggs", "quantity": 2.0}, {"food": "potato flour", "quantity": 16.5}, {"food": "", "quantity": 1.0}, {"food": "paprika", "quantity": 1.0}], "title": "\nDeviled Crab Stuffing\n"}, {"directions": "\n\n              Puree 8 hard-boiled eggs with 1/4 cup mayonnaise, 1 tablespoon mustard, 1 chopped pickle, a dash of hot sauce, and paprika, salt and pepper to taste. Garnish with chives.\n            \n\n              See all 50 Game-Day Dips\n            \n\n              Photographs by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nDeviled Dip\n"}, {"directions": "\nSpecial equipment: a pastry bag fitted with a small round pastry tip\n\n              Preheat the oven to 350 degrees F. Generously coat a 13-by-9-inch straight-sided baking dish (preferably glass) with cooking spray.\n            \n\n              Separate the egg whites and yolks into 2 medium bowls. Whisk the whites until combined and just foamy, then transfer them to the prepared baking dish. Cover the dish with foil and bake until they have fully set, about 20 minutes. Let cool completely in the baking dish.\n            \n\n              Meanwhile, beat the yolks until smooth. Lightly coat a medium nonstick skillet with cooking spray. Add the yolks, and scramble over medium-low heat until fully cooked and slightly dry, 4 to 5 minutes.\n            \n\n              Transfer the yolks to a food processor. Add the sour cream, mayonnaise, vinegar, mustard, hot sauce, 1/2 teaspoon salt and a few grinds of pepper, and pulse until smooth and creamy. Spoon the yolk mixture into a pastry bag fitted with a small round tip, or a resealable plastic bag with the tip cut off.\n            \n\n              Put a platter on top of the baking dish with the egg whites and flip to turn them out onto the platter. With a long sharp knife, trim about 1/4-inch from the edges, including any browned outer edges, to make a neat rectangle of whites. Cut the trimmings into 1/4-inch cubes that will be used for \"stars\" (discard any with browned edges). Cut the large rectangle of egg whites into 54 square pieces: 6 rows across and 9 columns down. Straighten the eggs to keep the rectangle together. Pipe a heaping amount of the egg yolk mixture onto the upper left-hand corner of the rectangle (this will be the section of the flag that holds the stars). Use the rest of the yolk filling to generously pipe 6 horizontal stripes right over the middle of each egg (see Cook's Note). Sprinkle the corner square with parsley and the stripes with paprika or cayenne. Top the parsley with the small dice \"stars\".\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "eggs", "quantity": 18.0}, {"food": "sour cream", "quantity": 0.25}, {"food": "vinegar", "quantity": 0.25}, {"food": "mustard spinach", "quantity": 3.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "parsley", "quantity": 0.25}, {"food": "barley flour or meal", "quantity": 1}], "title": "\nDeviled Egg American Flag\n"}, {"directions": "\n\n              Coat a 1 1/2-quart and a 2 1/2-quart ovenproof bowl with cooking spray. Prepare the cake mixes; divide the batter between the bowls. Bake at 325 degrees F, about 45 minutes for the small bowl and about 55 minutes for the large bowl. Let cool, then remove from the bowls.\n            \n\n              Make the frosting: Heat the sugar with the cream of tartar, salt and 1/3 cup water in a saucepan, stirring, until dissolved. Beat the egg whites with a mixer until frothy. Slowly beat in the hot sugar mixture, then beat until stiff peaks form, about 7 minutes.\n            \n\n              Remove about 2 cups of the frosting to a small bowl and fold in enough yellow food coloring to make a bright egg yolk color (about 8 to 10 drops); set aside.\n            \n\n              Set the cakes rounded-side down. Trim the tops with a serrated knife so the cakes sit at the same height.\n            \n\n              Flip the cakes over and slice off a 3-inch piece from each one as shown; reserve the trimmings.\n            \n\n              Line up the cut sides of the cakes, then trim the sides of the smaller cake as shown to make an oval shape. Flip the cakes over.\n            \n\n              Use a little white frosting to stick the cakes together, then cover completely with a thin layer of frosting; freeze 20 minutes. Cover with the remaining white frosting, making it as smooth as possible.\n            \n\n              Crumble the reserved cake trimmings and mix with just enough of the prepared yellow frosting to moisten. Clump the mixture together and mound on the wider end of the cake to form the yolk.\n            \n\n              Put the remaining yellow frosting in a pastry bag fitted with a large star tip. Pipe in a spiral over the cake mound. Sprinkle with the crushed strawberry \"paprika\" and top with the sour straw \"chives.\"\n            \n\n              Photograph by Andrew Purcell\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "shortening cake mix", "quantity": 2.0}, {"food": "strawberries", "quantity": 4.0}, {"food": "whiskey sour mix", "quantity": 2.0}, {"food": "sugar", "quantity": 1.5}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "hearts of palm", "quantity": 1}, {"food": "egg substitute", "quantity": 3.0}, {"food": "", "quantity": 1}], "title": "\nDeviled Egg Cake\n"}, {"directions": "\n\n              Put 6 eggs in a pot; cover with cold water. Bring to a simmer, then remove from the heat, cover and let sit 10 minutes. Drain, cool and peel. Halve lengthwise and scoop out the yolks; mash with 1 tablespoon milk, 1/4 cup mayonnaise, 1/4 teaspoon mustard powder, 1 tablespoon each chopped parsley, chives and tarragon, and salt and pepper. Pipe into the egg whites. Top with paprika and chives.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [], "title": "\nDeviled Eggs\n"}, {"directions": "\n\n              Heat 1/3 cup of the vegetable oil in a 10-inch nonstick ovenproof saute pan over medium-high heat until it shimmers. Carefully add the jalapeno and scallions. Turn off the heat and stir to combine. Cook in the hot oil for 1 minute, stirring constantly. Stir in the sesame oil and season lightly with salt. Remove to a bowl and set aside until ready to serve. Wipe the pan clean.\n            \n\n              Heat the broiler with a rack set in the middle of the oven.\n            \n\n              Pulse the ham, onions and mustard in the bowl of a food processor until a chunky paste forms.\n            \n\n              Whisk the eggs and heavy cream in a mixing bowl.\n            \n\n              Heat the remaining vegetable oil in the same saute pan over medium-high heat. Add the pureed ham mixture and saute until the onions have softened and the mixture is lightly browned in parts, about 5 minutes, stirring occasionally. Reduce the heat to medium and wait 2 minutes in order for the pan to come down to temperature; continue stirring. Pour the beaten eggs over the ham, mix together and cook until the eggs start to set, about 2 minutes. Sprinkle with the cheese and continue to cook until the frittata is almost set but the top is still runny, 5 to 7 minutes.\n            \n\n              Place the frittata under the broiler and broil until the top is golden brown, 3 to 5 minutes. Let stand for 5 minutes. Using a rubber spatula, loosen the frittata from the pan and invert onto a plate. Cut into wedges and serve topped with the jalapeno and scallion relish. Serve alongside a lightly dressed green salad if desired.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "ham", "quantity": 8.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "mustard spinach", "quantity": 0.3333333333333333}, {"food": "eggs", "quantity": 10.0}, {"food": "ice cream swich", "quantity": 0.25}, {"food": "", "quantity": 1.5}, {"food": "poultry salad swich spread", "quantity": 1}], "title": "\nDeviled Ham Frittata with Jalapeno and Scallion Relish\n"}, {"directions": "\n\n              Prepare the lobsters (see Cook's Note). Preheat a grill to medium.\n            \n\n              Melt the butter with the olive oil in a small skillet over medium heat. Add the sausage and cook until the fat begins to render, 1 to 2 minutes. Add the garlic and cook until fragrant, about 1 minute. Pour about half of the butter-oil into a bowl and keep warm; leave the sausage in the skillet. Add the panko to the skillet; cook, tossing, until crisp and golden, about 5 minutes. Stir in the parsley, chives and lemon juice and season with salt and pepper.\n            \n\n              Brush the lobster tails and cavities with some of the reserved butter-oil; season with salt and pepper. Firmly pack the breadcrumb mixture into the cavities and onto the tails; drizzle with more of the reserved butter-oil.\n            \n\n              Place the lobsters on the grill shell-side down; cover with a disposable aluminum pan and cook until the shells turn red and the stuffing is crisp, 12 to 15 minutes. Sprinkle with parsley; serve with lemon wedges and the remaining butter-oil for dipping.\n            \n\n              Photograph by Yunhee Kim\n            \n", "ingredients": [{"food": "", "quantity": 4.0}, {"food": "butter oil", "quantity": 12.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "sausage", "quantity": 0.3333333333333333}, {"food": "garlic powder", "quantity": 6.0}, {"food": "", "quantity": 1.75}, {"food": "parsley", "quantity": 0.25}, {"food": "chives", "quantity": 3.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "salt", "quantity": 1}], "title": "\nDeviled Portuguese Grilled Lobsters\n"}, {"directions": "\n\n              Try deviled eggs in a new way: Pipe the filling onto potatoes! Mash the yolks of 12 hard-boiled eggs with 1/2 cup mayonnaise and 2 teaspoons Dijon mustard; season with salt and pepper (save the egg whites for an egg salad). Boil 12 baby potatoes in salted water until tender; halve lengthwise. Pipe the yolk mixture on top of the potatoes and sprinkle with paprika and chives.\n            \n\n              Photograph by Jeffrey Westbrook\n            \n", "ingredients": [], "title": "\nDeviled Potatoes\n"}, {"directions": "\n\n              For the ribs: Preheat the oven to 350 degrees F.\n            \n\n              Lay the short ribs meaty side up in a large roasting pan and season with salt and pepper. Scatter the carrots, celery, onion, garlic, bay leaf, and rosemary around the ribs. Add the chicken broth and vinegar. Set the pan directly over 2 burners and bring to a simmer over high heat. Lay a sheet of parchment paper over the ribs and transfer to the oven. Cook until the meat is fork-tender, about 2 hours. Remove from the oven and cool in the liquid, about 30 minutes. (The dish can be prepared up to this point 1 day ahead, covered, and refrigerated.)\n            \n\n              For the coating: Whisk the mustard with the honey, water, and 1/2 teaspoon of the salt. Pulse the bread to make coarse bread crumbs in a food processor. Add the garlic, parsley, olive oil, remaining 1/2 teaspoon salt, and the pepper, to taste, and pulse briefly to combine. Transfer mixture to a shallow bowl.\n            \n\n              Preheat the oven to 450 degrees F.\n            \n\n              Remove the ribs from the braising liquid (reserve liquid for other uses) and pat dry. Brush the meaty side of each rib with some of the mustard mixture, then press it into the bread crumb mixture to coat. Arrange the ribs on a baking sheet and roast until the bread crumbs are brown and crisp, 20 to 25 minutes. Serve the ribs hot or at room temperature.\n            \n", "ingredients": [{"food": "frankfurter beef", "quantity": 8.0}, {"food": "black bean mango", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 6.0}, {"food": "corier leaf", "quantity": 1.0}, {"food": "rosemary", "quantity": 1.0}, {"food": "diced chicken", "quantity": 21.0}, {"food": "vinegar", "quantity": 0.3333333333333333}, {"food": "mustard spinach", "quantity": 0.3333333333333333}, {"food": "honey smoked ham", "quantity": 0.3333333333333333}, {"food": "coconut water", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "garlic bread", "quantity": 5.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "parsley", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nDeviled Short Ribs\n"}, {"directions": "\n\n              For the ribs: Preheat the oven to 350 degrees F.\n            \n\n              Lay the short ribs meaty side up in a large roasting pan and season with salt and pepper. Scatter the carrots, celery, onion, garlic, bay leaf, and rosemary around the ribs. Add the chicken broth and vinegar. Set the pan directly over 2 burners and bring to a simmer over high heat. Lay a sheet of parchment paper over the ribs and transfer to the oven. Cook until the meat is fork-tender, about 2 hours. Remove from the oven and cool in the liquid, about 30 minutes. (The dish can be prepared up to this point 1 day ahead, covered, and refrigerated.)\n            \n\n              For the coating: Whisk the mustard with the honey, water, and 1/2 teaspoon of the salt. Pulse the bread to make coarse breadcrumbs in a food processor. Add the garlic, parsley, olive oil, remaining 1/2 teaspoon salt, and the pepper, to taste, and pulse briefly to combine. Transfer mixture to a shallow bowl.\n            \n\n              Preheat the oven to 450 degrees F.\n            \n\n              Remove the ribs from the braising liquid (reserve liquid for other uses) and pat dry. Brush the meaty side of each rib with some of the mustard mixture, then press it into the breadcrumb mixture to coat. Arrange the ribs on a baking sheet and roast until the breadcrumbs are brown and crisp, 20 to 25 minutes. Serve the ribs hot or at room temperature.\n            \n", "ingredients": [{"food": "frankfurter beef", "quantity": 8.0}, {"food": "black bean mango", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 6.0}, {"food": "corier leaf", "quantity": 1.0}, {"food": "rosemary", "quantity": 1.0}, {"food": "diced chicken", "quantity": 2.5}, {"food": "vinegar", "quantity": 0.3333333333333333}, {"food": "mustard spinach", "quantity": 0.3333333333333333}, {"food": "honey smoked ham", "quantity": 0.3333333333333333}, {"food": "coconut water", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "garlic bread", "quantity": 5.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "parsley", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nDeviled Short Ribs\n"}, {"directions": "\n\n              Position racks in the upper and lower thirds of the oven; preheat to 450 degrees F. Brush 2 large baking dishes with vegetable oil. Pat the wings dry; sprinkle with 2 teaspoons salt and 1/2 teaspoon pepper. Spread in the dishes and bake, rotating halfway through, until golden, 40 to 45 minutes.\n            \n\n              Meanwhile, mix the dijon mustard, honey, mustard powder and garlic in a bowl. Remove the wings from the oven and toss with the mustard mixture, then continue baking until glazed, 3 to 5 more minutes.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1}, {"food": "diced chicken", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "mustard spinach", "quantity": 0.75}, {"food": "honey smoked ham", "quantity": 0.5}, {"food": "onion powder", "quantity": 3.0}, {"food": "garlic powder", "quantity": 0.5}], "title": "\nDijon Chicken Wings\n"}, {"directions": "\n\n              Bring a medium saucepan of water to a boil over high heat. Carefully lower 8 of the eggs into the boiling water one-by-one with a spoon and cook for 6 minutes. Prepare a bowl of ice water, then transfer the eggs to the bowl to stop the cooking process; let sit for at least 5 minutes. Carefully peel the eggs and set aside.\n            \n\n              Meanwhile, fill a large Dutch oven or heavy pot halfway with canola oil and heat over medium-high heat to 350 degrees F. \n            \n\n              Combine the sausage, 1/4 cup of the mustard and half the parsley in a medium bowl and mix well. Divide the sausage mixture into 8 even balls. Flatten each ball into an oval in your hand, put a peeled egg in the middle of each and wrap the sausage mixture around to completely cover. \n            \n\n              Put the flour in a shallow dish. Crack the remaining egg into another shallow dish, add the remaining 1/4 cup mustard and beat with a fork until well combined. Put the breadcrumbs in a third shallow dish. Dip the sausage-covered eggs first in the flour, then in the egg mixture, then in the breadcrumbs to coat.\n            \n\n              Carefully lower the coated eggs one-by-one into the hot oil with a slotted spoon (the oil temperature will drop to around 300 degrees F). Cook, adjusting the heat as needed to remain around 300 degrees F and turning the eggs to ensure even cooking, until golden brown all over and the sausage is cooked through, about 10 minutes. Transfer the eggs to a paper-towel-lined plate. Sprinkle with salt, pepper and the remaining parsley and gently roll the eggs a few times to coat. Cut each egg in half lengthwise and serve immediately with extra mustard.\n            \n", "ingredients": [{"food": "eggs", "quantity": 9.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "pork turkey sausage", "quantity": 1.0}, {"food": "mustard spinach", "quantity": 0.5}, {"food": "chrysanthemum leaves", "quantity": 0.3333333333333333}, {"food": "potato flour", "quantity": 0.5}, {"food": "", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nDijon Scotch Eggs\n"}, {"directions": "\n\n              Put the potatoes in a pot and cover with water by 1 inch; season with salt. Bring to a boil. Reduce the heat to medium and simmer until tender, about 8 minutes, adding the scallions during the last minute. Drain.\n            \n\n              Meanwhile, season the turkey with the paprika, 1/2 teaspoon salt and a few grinds of pepper. Heat the vegetable oil in a large skillet over medium heat. Add the turkey and cook until browned and cooked through, about 3 minutes per side; remove to a plate.\n            \n\n              Add the broth to the skillet, scraping the pan with a wooden spoon. Cook until reduced by half, about 5 minutes. Stir in the mustard and half of the butter. Season with salt and pepper; set aside.\n            \n\n              Melt the remaining butter in the pot used for the potatoes over medium heat. Add the potatoes, 1/4 cup water, the peas, lemon zest, parsley and a pinch each of salt and pepper. Cook until the peas are tender, 3 minutes. Serve with the turkey, pan sauce and lemon wedges.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 3.0}, {"food": "smoked turkey roll", "quantity": 4.0}, {"food": "smoked turkey roll", "quantity": 1.5}, {"food": "pepper", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "pigeon peas", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "parsley", "quantity": 2.0}], "title": "\nDijon Turkey Dinner\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Pulse the flour, baking powder, baking soda and fine salt in a food processor. Add the butter and pulse into pea-size pieces. Add the dill, then slowly pulse in the buttermilk until the dough just comes together. Transfer to a floured surface and knead three to five times. Shape into a disk.\n            \n\n              Roll out the dough to about 1/2 inch thick. Cut into rounds with a 2 1/2-inch round cutter or a glass. Reroll any scraps. Place on a baking sheet, brush with buttermilk and bake until golden, 10 to 12 minutes.\n            \n\n              Meanwhile, make the honey butter: Mix the butter, honey and sea salt in a bowl until smooth. Serve with the warm biscuits.\n            \n\n              Photograph by Roland Bello\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 1.0}, {"food": "diced chicken", "quantity": 12.0}, {"food": "dill seed", "quantity": 2.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.5}, {"food": "butter oil", "quantity": 4.0}, {"food": "honey smoked ham", "quantity": 2.0}, {"food": "sea lion", "quantity": 0.25}], "title": "\nDill Biscuits with Honey Butter\n"}, {"directions": "\n\n              In a small saucepan, combine the milk, sour cream, dill, butter, and sugar. Place over medium-high heat and cook, stirring, until the butter melts. Remove from the heat and cool to about 110 degrees F. Sprinkle the yeast over the surface of the milk. Set aside until foamy, about 10 minutes.\n            \n\n              Meanwhile, in large bowl, whisk together the flour and salt. Set aside.\n            \n\n              Pour the yeast mixture into the bowl of flour and mix until a soft, ragged mixture is formed.\n            \n\n              Transfer the flour mixture to a well-floured work surface and knead by hand until an elastic dough is formed, about 10 minutes. Transfer the dough to a lightly oiled bowl, cover with a kitchen towel and place in the warm spot, until doubled in size, about 2 hours.\n            \n\n              Place a rack in the center of the oven and preheat to 400 degrees F. Transfer the dough to the work surface and, using your hands, gently flatten into a 10-inch-long oval shape. Fold the dough into thirds lengthwise, overlapping the sides in the center. Press down on the overlapping sides to seal and make a seam. Place seam side-down in a buttered 9 by 5-inch loaf pan, cover with a kitchen towel, and return to the warm spot until the dough has risen about 1 1/2 inches over the top of the pan, about 1 1/2 to 2 hours.\n            \n\n              Brush the top of the dough lightly with warm water and, using a sharp knife, make 1/4-inch-deep slit down the center. Bake until golden brown, about 30 minutes.\n            \n\n              Remove the loaf from the pan and place in the center of the rack. Continue baking until the loaf sounds hollow when rapt lightly with your knuckles on the bottom and top, and an instant-read thermometer inserted in the center registers about 190 degrees F., about 15 minutes.\n            \n\n              Transfer the bread loaf to a cooling rack and let cool for 2 hours before using.\n            \n\n              Copyright 2001 Television Food Network, G.P. All rights reserved\n            \n", "ingredients": [{"food": "milk", "quantity": 2.0}, {"food": "sour cream", "quantity": 0.3333333333333333}, {"food": "dill seed", "quantity": 0.25}, {"food": "butter oil", "quantity": 3.0}, {"food": "sugar", "quantity": 2.0}, {"food": "yeast extract spread", "quantity": 0.25}, {"food": "potato flour", "quantity": 5.0}, {"food": "salt", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1}], "title": "\nDill Bread\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the pasta and cook as the label directs, then drain and rinse under cold water. Transfer to a bowl; drizzle lightly with olive oil and set aside.\n            \n\n              Meanwhile, heat 2 tablespoons olive oil in a large pot over medium-high heat. Add the onion, Canadian bacon, garlic, Worcestershire sauce and half of the dill and cook, stirring occasionally, until the onion is soft and slightly golden, 6 to 8 minutes.\n            \n\n              Add the mixed vegetables and 1/4 cup water to the pot; cover and cook until beginning to soften, 4 minutes. Add the broth, 2 cups water, 1 teaspoon salt, and pepper to taste. Bring to a high simmer and cook, uncovered, until the vegetables are tender, 12 to 15 more minutes. Stir in the pasta and the remaining dill; season with salt and pepper.\n            \n\n              Divide the soup among bowls. Top with the sour cream and sprinkle with paprika. Serve with rolls.\n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "italian veg medley pasta", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "bacon", "quantity": 4.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "dill seed", "quantity": 0.3333333333333333}, {"food": "mixed nuts", "quantity": 8.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "pepper", "quantity": 1}, {"food": "sour cream", "quantity": 0.3333333333333333}, {"food": "dessert topping", "quantity": 1}, {"food": "pizza rolls", "quantity": 1}], "title": "\nDill Minestrone Soup\n"}, {"directions": "\n\n              Brown 4 ounces sliced mushrooms in olive oil, 5 minutes. Add 1 bunch asparagus (trimmed and cut into thirds) and 2 tablespoons water; season with salt and pepper. Cook, stirring, until crisp-tender, about 7 minutes. Toss with 2 tablespoons chopped dill and 3/4 teaspoon lemon zest.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [], "title": "\nDill Mushrooms and Asparagus\n"}, {"directions": "\n\n              Mix 1/2 cup yellow mustard, 1/4 cup each finely chopped dill pickles and white onions, and 1 tablespoon chopped fresh dill.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [], "title": "\nDill Mustard\n"}, {"directions": "\n\n              Whisk the flour, sugar, baking powder, baking soda and salt in a large bowl. Whisk the eggs, buttermilk, vanilla and melted butter in a medium bowl until incorporated. Whisk the egg mixture into the flour mixture until just combined (it's OK if there are a few lumps).\n            \n\n              Heat a griddle or large nonstick skillet over medium heat; lightly brush with butter. Pour 1/2 cup batter onto the griddle for each pancake and cook until bubbles form on top and the bottom is lightly browned, about 3 minutes. (If the pancakes are browning too quickly, reduce the heat to medium low.) Flip and continue cooking until golden on the other side, about 1 more minute. Transfer to a plate. Repeat with the remaining batter, brushing the pan with more butter as necessary. Serve with butter and syrup.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [{"food": "potato flour", "quantity": 3.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 2.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "syrup", "quantity": 1}], "title": "\nDiner-Style Pancakes\n"}, {"directions": "\n\n              Preheat the oven to 325 degrees F and coat a 12-cup muffin pan with cooking spray. Lightly flour the pan, tapping out the excess. Sift the flour, baking powder, baking soda and salt through a fine-mesh sieve into a bowl; set aside.\n            \n\n              Microwave the butter with 1/2 cup water in a large microwave-safe bowl until melted. Whisk in the cocoa powder, brown sugar and granulated sugar until smooth (if the mixture is too thick, microwave 20 more seconds). Let cool.\n            \n\n              Whisk the sour cream, egg and vanilla into the cocoa mixture until smooth. Whisk in the flour mixture until just combined (do not overmix). Divide the batter among the prepared muffin cups, filling them halfway. Bake the cupcakes until a toothpick inserted into the centers comes out clean, 12 to 15 minutes. Let cool 15 minutes in the pan, then transfer to a rack to cool completely.\n            \n\n              Using a paring knife, cut a circle into the top of each cupcake, about 1/4 inch in from the edge and 1 inch deep; pry out the cake. Transfer the cupcakes to a baking sheet and freeze at least 30 minutes.\n            \n\n              Working quickly, fill each cupcake with a small scoop of vanilla ice cream. Top each with a larger scoop of strawberry ice cream, gently pressing so the strawberry ice cream is flush against the vanilla; freeze until firm, 20 minutes.\n            \n\n              Pour the chocolate shell topping into a small bowl. Dip the tops of the ice cream cupcakes into the chocolate; freeze until serving.\n            \n\n              Photograph by Ralph Smith\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 0.75}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 4.0}, {"food": "onion powder", "quantity": 0.75}, {"food": "sugar", "quantity": 0.5}, {"food": "sugar", "quantity": 0.5}, {"food": "sour cream", "quantity": 0.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.5}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.0}], "title": "\nDip Dark Secret\n"}, {"directions": "\n\n              Microwave 2 ounces finely chopped dark chocolate at medium power until melted. Dip dried apricots halfway in the chocolate, then press an almond on each. Place on a parchment paper-lined plate, then freeze until set, about 2 minutes.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nDipped Apricots\n"}, {"directions": "\n\n              Put the peeled, frozen banana in a blender along with the rum and Tia Maria. Add the half-and-half and blend until smooth. Pour into a chilled wine glass, garnish with a dusting of allspice. Serve.\n            \n", "ingredients": [{"food": "banana", "quantity": 1.0}, {"food": "fluid replacement", "quantity": 2.0}, {"food": "fluid replacement", "quantity": 0.5}, {"food": "fluid replacement", "quantity": 2.0}, {"food": "allspice", "quantity": 1}], "title": "\nDirty Banana\n"}, {"directions": "\n\n              Fill a shaker with ice. Add 1 ounce olive juice and 2 ounces each gin and dry vermouth. Shake well, then strain into a martini glass. Add a dash of bitters and garnish with an olive.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [], "title": "\nDirty Martini\n"}, {"directions": "\n\n              Put the pimentos, vodka, vermouth, oil, lime juice, 1/4 teaspoon salt and a few grinds of pepper in a food processor. Pulse until smooth, but still slightly chunky. Add the olives, onions, olive brine and garlic, and pulse until coarsely chopped. Refrigerate until chilled, at least 1 hour or overnight. Garnish with sliced olives and a few cocktail onions. Serve with vegetable chips.\n            \n\n              Copyright 2013 Television Food Network, G.P. All rights reserved\n            \n\n              From Food Network Kitchens\n            \n", "ingredients": [{"food": "pimento", "quantity": 1.5}, {"food": "", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "lime", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "olives", "quantity": 0.75}, {"food": "fruit cocktail", "quantity": 0.5}, {"food": "olive loaf", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "potato chips", "quantity": 1}], "title": "\nDirty Martini Salsa\n"}, {"directions": "\nSpecial equipment: 2 wire racks 2 rimmed baking sheets\n\n              Adjust 2 oven racks to the top and bottom thirds of the oven and preheat to 425 degrees F. Put the wire racks in the baking sheets and coat each generously with cooking spray.\n            \n\n              Combine the flour and 1/2 teaspoon salt in a large re-sealable plastic bag. Combine the eggs and 1/2 teaspoon salt in another large plastic bag; combine the breadcrumbs, Parmesan and 1/2 teaspoon salt in a third large plastic bag.\n            \n\n              Add about a half of the zucchini sticks to the bag with the flour and use a combination of your hands and shaking the bag to coat the zucchini. Remove the zucchini and shake off any excess flour. Transfer to the egg wash and repeat until coated. (It's less messy if you use only one hand for the dry ingredients and the other for the wet.) Let any excess egg drip off before transferring to the breadcrumb mixture; repeat until fully coated (you'll still see some green and white of the zucchini peeking through the breading). Transfer to the prepared baking sheets and coat the breaded zucchini generously with cooking spray (there's no need to turn them). Repeat with the remaining zucchini.\n            \n\n              Bake, rotating the baking sheets from top to bottom about halfway through, until golden brown and tender, 25 to 30 minutes.\n            \n\n              Lower the oven to 350 degrees F and let the baking sheet cool for a few minutes. Remove the rack from one of the baking sheets and line the baking sheet with foil. Slide the fries onto the baking sheet and arrange them in four equal piles. Scatter both cheeses equally over the piles and bake until melted, about 10 minutes. Meanwhile, warm the gravy. When the cheese is melted, use a spatula to lift each batch of cheese fries and place it on its own plate. Drizzle the gravy over the cheese fries and top with the bacon and scallions.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "eggs", "quantity": 2.0}, {"food": "", "quantity": 2.5}, {"food": "", "quantity": 0.5}, {"food": "turkey sticks", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.5}, {"food": "bacon", "quantity": 4.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}], "title": "\nDisco Zucchini Fries\n"}, {"directions": "\n\n              Cook 1 1/2 cups ditalini as the label directs. Cook 1 minced garlic clove in 3 tablespoons butter over medium-low heat, 4 minutes. Add 1 cup thawed frozen peas, 1/3 cup water and 1/4 teaspoon kosher salt; bring to a simmer, cover and cook 5 minutes. Puree the liquid, half of the peas and 2 tablespoons grated parmesan. Toss with the pasta and the remaining peas; season with salt. Top with basil and more parmesan.\n            \n", "ingredients": [], "title": "\nDitalini and Peas\n"}, {"directions": "\n\n              Mix 4 cups granulated sugar, 1 cup light corn syrup and 3/4 cup water in a saucepan, then cook over medium heat without stirring until 250 degrees on a candy thermometer. Beat 3 egg whites until firm; drizzle the hot syrup into the whites and beat until stiff. Stir in 1 teaspoon vanilla and 2 cups chopped hazelnuts or pecans. Shape into small balls with buttered hands, then roll in more chopped nuts and cool.\n            \n", "ingredients": [], "title": "\nDivinities\n"}, {"directions": "\n\n              Beat the butter, granulated sugar and brown sugar in a bowl with a mixer on medium speed until fluffy. Add the egg and vanilla; beat.\n            \n\n              Whisk the flour, cocoa powder, baking soda and salt in a bowl. Add to the butter mixture and beat until just combined. Stir in the chocolate chunks.\n            \n\n              Preheat the oven to 350 degrees F. Scoop rounded tablespoons of dough and roll into balls. Arrange on parchment-lined baking sheets about 2 inches apart. Refrigerate 30 minutes, then bake until the cookies are golden on the bottom, 12 to 15 minutes. Cool on the baking sheets, 10 minutes, then transfer to racks to finish cooling.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 1.0}], "title": "\nDouble Chocolate Chip Cookies With Chocolate Chunks\n"}, {"directions": "\n\n              Whisk the flour, granulated sugar, cocoa powder, baking powder and salt in a medium bowl. Whisk in the melted butter and eggs until combined, then stir in the white chocolate chips. Cover with plastic wrap and chill until firm, about 1 hour.\n            \n\n              Preheat the oven to 350 degrees F. Line 2 baking sheets with parchment paper. Put the confectioners' sugar in a shallow bowl. Roll tablespoonfuls of the dough into balls, then roll in the confectioners' sugar until well coated. Place 1 inch apart on the baking sheets.\n            \n\n              Bake until the cookies are puffed and the tops are cracked, about 10 minutes. Let cool 2 minutes on the baking sheets, then transfer to a rack to cool completely. Store in an airtight container up to 1 week.\n            \n\n              Photograph by Steve Giralt\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.5}, {"food": "sugar", "quantity": 0.5}, {"food": "onion powder", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 6.0}, {"food": "eggs", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "sugar", "quantity": 1.0}], "title": "\nDouble Chocolate Crackles\n"}, {"directions": "\n\n              Make the bread pudding: Preheat the oven to 350 degrees F and butter a shallow 2-quart baking dish. Toss the croissants with the melted butter on a baking sheet. Arrange in a single layer and bake until toasted, about 10 minutes.\n            \n\n              Meanwhile, whisk the eggs, egg yolks, milk, heavy cream, sugar, vanilla and salt in a large bowl. Arrange about half of the croissants in the prepared baking dish. Top with about two-thirds of the milk chocolate, then add the remaining croissants. Pour the egg mixture over the croissants, pressing gently so the croissants are submerged.\n            \n\n              Cover the baking dish with foil and bake 30 minutes. Uncover, top with the remaining milk chocolate and bake until the bread pudding is puffed, golden brown and set, 15 to 20 more minutes. Let sit 15 minutes.\n            \n\n              Meanwhile, make the sauce: Bring the heavy cream, butter, sugar, corn syrup and vanilla to a simmer in a medium saucepan over medium heat. Add the bittersweet chocolate and whisk until smooth. Serve the bread pudding with the chocolate sauce.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "butter oil", "quantity": 4.0}, {"food": "croissants", "quantity": 8.0}, {"food": "eggs", "quantity": 3.0}, {"food": "whole milk", "quantity": 1.5}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "sugar", "quantity": 0.25}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "baking chocolate", "quantity": 6.75}, {"food": "Worcestershire sauce", "quantity": 1}, {"food": "ice cream swich", "quantity": 1}, {"food": "butter oil", "quantity": 2.0}, {"food": "sugar", "quantity": 2.0}, {"food": "silk light vanilla", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 4.0}], "title": "\nDouble Chocolate Croissant Bread Pudding\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Grate the chilled chocolate with a fine grater or rasp and set aside.\n            \n\n              Whisk together the flour, cocoa powder, baking soda and sea salt.\n            \n\n              Beat the butter and sugar in a medium bowl with an electric mixer until just combined. Mix in the yolk. Add the dry ingredients to the butter and beat lightly together until just combined but still crumbly. Fold in grated chocolate with a spatula. Bring the dough together by lightly squeezing in your hands; but don't knead or overwork, as the secret to these cookies is their delicate, sandy texture.\n            \n\n              Divide the dough in half. Lay half the dough on a long sheet of waxed paper and shape into a log along the width of the waxed paper, leaving some space at each end. Pull the paper over the top of the log. Grip the edge of the top piece of paper, and use a straight, firm edge, like a ruler or the edge of a pan, to press gently against the edge of the dough where the papers come together to create a solid, firm round log. Repeat with remaining dough and refrigerate for at least 1 hour. (To keep logs round store inside an empty paper towel roll.)\n            \n\n              Preheat the oven to 350 degrees F. Line 2 baking sheets with parchment paper.\n            \n\n              Slice logs into 1/2-inch thick rounds with a sharp, thin knife. Divide rounds onto the prepared sheets, leaving about 1 inch between them, and refrigerate for 15 minutes.\n            \n\n              Bake until cookies smell fragrant with a full cocoa aroma and set on the outside, about 12 to 14 minutes. Remove from the oven and let cool on the pans, about 5 minutes.\n            \n\n              Transfer cookies to a rack to cool completely. Serve.\n            \n\n              Busy baker's tips: Dough can be made and frozen for up to 2 weeks. Store baked cookies in an airtight container for up to 5 days. Baked cookies can be wrapped in plastic wrap, then aluminum foil and frozen for up to 2 weeks.\n            \n\n              Cook's note: For super uniform cookies, place each sliced disk of dough in a muffin tin and bake. The cookies will be chewier, less sandy this way.\n            \n\n              Copyright 2007 Television Food Network, G.P. All rights reserved\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 3.0}, {"food": "potato flour", "quantity": 1.25}, {"food": "onion powder", "quantity": 0.3333333333333333}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "sea lion", "quantity": 0.25}, {"food": "butter oil", "quantity": 5.25}, {"food": "sugar", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}], "title": "\nDouble Chocolate Sable Cookies (France)\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\nFilling:\n\n\n              Special equipment: 9-inch fluted tart pan with removable bottom\n            \n\n              Crust: Whisk the flour, cocoa, salt and baking soda together in a medium bowl. Put the butter, confectioners' and brown sugar in a food processor and process until smooth and creamy. Add the dry ingredients and pulse to combine. Add the egg yolks and continue to pulse to make a smooth dough. Remove the blade, and turn dough out onto a large sheet of plastic wrap, form into a disk, and wrap tightly. Refrigerate at least 1 hour or up to 2 days.\n            \n\n              Meanwhile, make the filling: Put the chocolate in a medium bowl. Put the cream and sweetened condensed milk in a small saucepan and bring to a simmer over medium heat. (Alternatively, heat the cream and milk in the microwave.) Pour the cream over the chocolate and whisk until smooth and shiny. Whisk in the eggs and vanilla until smooth. Cover, and set aside at room temperature.\n            \n\n              Place the dough between 2 pieces of waxed or parchment paper and roll into a circle about 1/4-inch thick. Refrigerate for 15 minutes.\n            \n\n              Position a rack in the middle of the oven and preheat to 400 degrees F. Peel off a piece of parchment from the dough, then gently flip dough into tart pan, peeling away the rest of parchment. Carefully press dough into the tart pan so that it sits evenly in the pan. Trim excess dough from the edges, if needed. Line the crust with wax paper or lightly sprayed parchment paper and fill with pie weights or baking beans (see photo).\n            \n\n              Place tart shell on a baking sheet and bake for 20 minutes. Remove the paper and weights and continue to bake until the crust sets and looks a little dull (a sign it is cooked), about 5 minutes more. Reduce oven temperature to 325 degrees F.\n            \n\n              Remove tart pan from oven and spread the dulce de leche evenly over the warm crust. Then top with the chocolate filling. Bake until the filling sets around edges but is still slightly wobbly in the center, about 25 to 30 minutes. Cool completely.\n            \n\n              Serve. For a final flourish, sprinkle lightly with gray salt just before serving, if desired.\n            \n\nBusy Bakers' Tips:\n\n\n              - Make dough and freeze for up to a month ahead.\n            \n\n              - Form, bake and freeze crust, tightly wrapped, for up to 1 week.\n            \n\n              - Assemble and refrigerate up to 2 days, tightly wrapped.\n            \n\n              Copyright 2007 Television Food Network, G.P. All rights reserved\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.25}, {"food": "onion powder", "quantity": 0.3333333333333333}, {"food": "salt", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "butter oil", "quantity": 8.0}, {"food": "sugar", "quantity": 0.5}, {"food": "sugar", "quantity": 0.25}, {"food": "egg substitute", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "ice cream swich", "quantity": 0.6666666666666666}, {"food": "milk", "quantity": 0.3333333333333333}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "dulce de leche", "quantity": 0.6666666666666666}, {"food": "salt", "quantity": 0.5}], "title": "\nDouble Chocolate Tart with Dulce de Leche\n"}, {"directions": "\n\n              Make the simple syrup: Combine the sugar with 1/4 cup water in a small saucepan. Bring to a boil, stirring to dissolve. Remove from the heat and let cool. (Makes 4 ounces; refrigerate up to 1 month.)\n            \n\n              Combine the whiskey, lemon juice and 1/2 ounce simple syrup in a cocktail shaker; fill with ice. Shake well; strain into a rocks glass filled with ice. Top with the lager and garnish with lemon twist.\n            \n", "ingredients": [{"food": "sugar", "quantity": 0.25}, {"food": "whiskey sour mix", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "dessert topping", "quantity": 1}, {"food": "", "quantity": 1}], "title": "\nDouble Irish\n"}, {"directions": "\n\n              Let the ham sit at room temperature 30 minutes. Preheat the oven to 325 degrees F. Trim off any skin from the ham if needed. Score the ham through the fat in a diagonal crosshatch pattern without cutting into the meat. Place the ham, flat-side down, on a rack in a roasting pan. Pour 1/4 inch of water into the bottom of the pan. Roast the ham until it reaches an internal temperature of about 130 degrees F, about 2 1/2 hours or 15 minutes per pound. \n            \n\n              Meanwhile, mix the mustards and honey together in a small bowl. Mix together the breadcrumbs, parsley, thyme and olive oil together in another bowl. \n            \n\n              Remove the ham from the oven when it has reached 130 degrees F internally. Increase the oven temperature to 425 degrees F. Spoon or brush the mustard mixture all over the ham. Carefully pat the crumbs all over the ham. Add water as needed to the bottom of the pan. Return the ham to the oven and roast until the breadcrumbs are golden brown, about 25 minutes more.\n            \n", "ingredients": [{"food": "honey smoked ham", "quantity": 8.0}, {"food": "mustard spinach", "quantity": 0.5}, {"food": "rye grain", "quantity": 0.5}, {"food": "honey smoked ham", "quantity": 0.25}, {"food": "", "quantity": 0.5}, {"food": "parsley", "quantity": 0.25}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 2.0}], "title": "\nDouble Mustard and Herb Crusted Ham\n"}, {"directions": "\n\n              Combine 1 tablespoon diced shallot, the tomatoes and half of the cilantro in a small bowl; set aside.\n            \n\n              Melt the butter in a medium saucepan over medium heat. Add the remaining diced shallot, the serranos, jalapeno and 1/2 teaspoon salt and cook, stirring, until the shallots are tender, about 3 minutes.\n            \n\n              Sprinkle the flour into the pan and cook, stirring, until completely absorbed, about 1 minute. Whisk in the milk and bring to a simmer; cook, stirring occasionally, until slightly thickened, about 4 minutes. Stir in the pepper jack and American cheese until melted, then remove from the heat; stir in the remaining cilantro. Transfer to a bowl and top with the tomato mixture. Serve with chips.\n            \n\n              Photograph by David Malosh\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 1.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "", "quantity": 0.25}, {"food": "butter oil", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "potato flour", "quantity": 1.0}, {"food": "milk", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "potato chips", "quantity": 1}], "title": "\nDouble-Chile Queso Dip\n"}, {"directions": "\n\n              Make the brine: Combine the salt, peppercorns, sugar, rosemary sprigs, bay leaves, 3 tablespoons each juniper berries and fennel seeds, the garlic and 2 cups water in a large saucepan. Bring to a boil, whisking occasionally, then remove from the heat. Transfer the brine to a large bowl and add 6 cups cold water; let cool completely. Submerge the pork chops in the brine, cover and refrigerate overnight.\n            \n\n              Preheat a grill to medium. Make the roasted garlic butter: Cut off the top 1/4 inch of the garlic head and set it on a piece of foil. Drizzle with olive oil, then wrap in the foil and transfer to the grill. Cook until the garlic is softened, about 30 minutes; let cool. Meanwhile, remove the pork from the brine and pat dry with paper towels; set aside.\n            \n\n              Squeeze the roasted garlic cloves from the skins into a food processor. Add the butter, rosemary, lemon juice and a pinch of salt and pulse until smooth. Transfer to a bowl and set aside.\n            \n\n              Prepare the pork: Grind the remaining 1 teaspoon juniper berries and 2 tablespoons fennel seeds in a spice grinder or finely chop. Season the pork with the ground spices and salt and pepper. Lightly brush the grill grates with olive oil; transfer the pork to the grill. Cover and cook until marked, 15 minutes, rotating the pork 45 degrees halfway through to create a crosshatch pattern. Flip and repeat, cooking until an instant-read thermometer inserted into the center of the pork registers 145 degrees F.\n            \n\n              Remove the pork chops from the grill and spread the roasted garlic butter on top. Let rest at least 10 minutes.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "salt", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "rosemary", "quantity": 4.0}, {"food": "chrysanthemum leaves", "quantity": 4.0}, {"food": "goji berries", "quantity": 3.0}, {"food": "fennel seed", "quantity": 5.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "pork skins", "quantity": 4.0}, {"food": "pepper", "quantity": 1}, {"food": "garlic powder", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "butter oil", "quantity": 4.0}, {"food": "rosemary", "quantity": 2.0}, {"food": "", "quantity": 0.5}, {"food": "salt", "quantity": 1}], "title": "\nDouble-Cut Pork Chops with Garlic Butter\n"}, {"directions": "\n\n              To make the potatoes: Preheat the oven to 425 degrees F. \n            \n\n              Set the potatoes directly on the rack in the center of the oven and bake until easily pierced with a fork, about 1 hour. Remove from the oven and set aside to cool slightly. \n            \n\n              Meanwhile, make the chili: Preheat a medium, heavy-bottomed saucepan over medium-high heat, then add the oil. Add the onion, garlic, and salt, and cook, stirring, until lightly browned and fragrant, about 3 minutes. Add the ancho chile, oregano, cumin, coriander, and cloves and cook, stirring, until dark and fragrant, about 45 seconds. Add the tomato paste and chipotle. Using your hands, crush the tomatoes while adding them to the saucepan and cook, stirring, until the chipotle and tomato mixture is dark red, about 2 minutes. Add the beef, break it up with a wooden spoon, and cook, stirring occasionally, until well-browned, about 3 minutes. Add the beans and beer and bring to a boil. Lower the heat and simmer, stirring occasionally, until thick and fragrant, about 15 minutes. Lay the potatoes on the side they naturally roll to, and carefully cut a shallow oval out of the tops to make 6 lids. Gently scrape most of the potato pulp out of the lids and transfer to a large bowl. Reserve the lids. Carefully scoop out the insides from only 4 of the potatoes into the large bowl, leaving the shells intact. Scoop out the pulp from the remaining 2 potatoes into a small bowl and reserve for another use. (See Cook's Note.) Add 1/2 cup of the cheese, butter, salt, and scallion to the large bowl of pulp and mash lightly with a fork. Season with pepper, to taste. Lightly season the insides of the shells and lids with salt and pepper. Refill them with the potato mixture, pressing it into the bottom and against the sides. \n            \n\n              Set the filled potatoes on a baking sheet and fill each to the brim with some of the chili, mounding as much as you can on top (you'll need the rest for later). Mound the remaining 3/4 cup cheese over the potatoes. Place the potato lids skin-side down on the baking sheet. Bake until heated through and the cheese has melted and browned, about 12 minutes. Reheat the remaining chili. Transfer the stuffed potatoes to a serving platter and top each with a dollop of sour cream. Lean the potato lids against the sour cream and serve immediately, with the chili on the side for refills.\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 6.0}, {"food": "cheddar cheese", "quantity": 1.25}, {"food": "butter oil", "quantity": 0.25}, {"food": "salt", "quantity": 2.0}, {"food": "martha white foods", "quantity": 3.0}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 5.0}, {"food": "salt", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "onion powder", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "cumin seed", "quantity": 1.0}, {"food": "ground turkey", "quantity": 0.5}, {"food": "cloves", "quantity": 2.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "whole milk", "quantity": 4.0}, {"food": "frankfurter beef", "quantity": 1.0}, {"food": "fava beans", "quantity": 15.5}, {"food": "", "quantity": 12.0}, {"food": "martha white foods", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1}], "title": "\nDouble-Yummy Chili Stuffed Baked Potatoes\n"}, {"directions": "\n\n              Make the syrup: Combine 1 cup water, the jelly and 2 tablespoons elderflower liqueur in a saucepan over medium heat; bring to a boil, then reduce the heat to low and simmer until syrupy, 20 to 25 minutes. Transfer to a bowl and let cool, stirring occasionally. Meanwhile, make the doughnuts: Whisk the flour, sugar, baking powder, salt and nutmeg in a large bowl. Stir in the cream, eggs, vanilla and the remaining 3 tablespoons elderflower liqueur until smooth. \n            \n\n              Heat about 1/3 inches vegetable oil in a large pot over medium heat until a deep=fry thermometer registers 350 degrees F. Working in batches, drop heaping tablespoonfuls of the batter into the oil and fry, turning, until golden, 4 minutes. (Reduce the heat if the doughnuts are browning too quickly.) Remove with a slotted spoon and drain on paper towels, then roll in cinnamon sugar. Serve with the strawberry syrup. \n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "silk strawberry soy yogurt", "quantity": 0.5}, {"food": "", "quantity": 5.0}, {"food": "potato flour", "quantity": 2.25}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "baking chocolate", "quantity": 1.25}, {"food": "salt", "quantity": 0.25}, {"food": "hearts of palm", "quantity": 1}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "sugar", "quantity": 1}], "title": "\nDoughnut Holes With Strawberry Syrup\n"}, {"directions": "\n\n              Combine the mascarpone, 1/2 cup confectioners' sugar, the coffee liqueur and vanilla in a large bowl and beat with a mixer on medium speed until creamy, about 1 minute (do not overmix).\n            \n\n              Combine the heavy cream and 1/4 cup confectioners' sugar in a separate bowl; beat on medium-high speed until stiff peaks form. Fold the whipped cream into the mascarpone mixture in 3 additions; set aside.\n            \n\n              Combine the espresso and the remaining 1 tablespoon confectioners' sugar in a shallow bowl. One at a time, dip 12 doughnut halves in the espresso mixture and arrange in a single layer in a 9-by-13-inch baking dish, breaking the doughnuts as necessary to cover the bottom of the dish.\n            \n\n              Spread one-third of the mascarpone mixture over the doughnuts. Dip the remaining 12 doughnut halves in the espresso mixture and arrange on top. Spread the remaining mascarpone mixture on top. Cover with plastic wrap and refrigerate at least 4 hours or overnight. Cut into pieces and dust with cocoa powder.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "macaroni cheese", "quantity": 1.0}, {"food": "sugar", "quantity": 0.75}, {"food": "silk coffee", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "barley flour or meal", "quantity": 1.5}, {"food": "rice cake", "quantity": 12.0}, {"food": "onion powder", "quantity": 1}], "title": "\nDoughnut Tiramisu\n"}, {"directions": "\n\n              Bring the milk and 1/2 cup water to a boil in a saucepan. Add the sugar and chocolate to the blender; pour in the hot milk and blend until smooth. Transfer to a bowl and top with cinnamon. Serve with the doughnuts.\n            \n\n              Photographs by Con Poulos\n            \n", "ingredients": [{"food": "cinnamon", "quantity": 1.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "milk", "quantity": 0.5}, {"food": "sugar", "quantity": 6.0}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "", "quantity": 1}], "title": "\nDoughnuts and Chocolate Sauce\n"}, {"directions": "\n\n              Place the butter in a small saucepan and bring to a boil over medium-high heat. Boil for 1 minute.\n            \n\n              Set the saucepan aside and let the butter settle, undisturbed. The milk solids will come to the top of the butter and the watery whey will collect on the bottom. Skim off the milk solids with a spoon and pour the drawn butter into a serving bowl or several small ramekins, taking care not include the watery liquid in the bottom of the pan. Serve.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 0.5}], "title": "\nDrawn Butter for Steamed Lobster, Crabs, or Clams\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F. Butter a 2-quart shallow casserole dish. In a large pot of salted boiling water, cook the macaroni until al dente, about 5 minutes. Drain; transfer the pasta to the prepared casserole dish along with 1/4 cup of the cold milk. (This will cool the pasta and prevent it from becoming gummy.)\n            \n\n              Meanwhile, mix the cheeses together in a small bowl. Beat the eggs with 1/4 cup of the milk in a medium bowl. Add the scallions, bread and half of the cheese to the egg mixture; set aside.\n            \n\n              Cook the bacon in a large skillet over medium heat until crisp; transfer to paper towels to drain. Discard all but 2 tablespoons drippings from the pan. Add the onion and garlic; cook, stirring, until just brown, about 4 minutes. Stir in the flour, cayenne pepper and 1 teaspoon salt; cook for 2 minutes. Slowly add the remaining 1 3/4 cups milk and 3/4 cup water to the skillet. Bring to a boil, whisking until thick. Remove the sauce from the heat and whisk to cool slightly. Whisk in the remaining cheese. Add the sauce to the macaroni; stir to combine.\n            \n\n              Crumble up the bacon and add it to the egg/bread mixture. Spread evenly over the pasta. Place the casserole dish on a baking sheet and bake until golden brown, about 35 to 40 minutes. Remove from the oven; let sit 5 minutes before serving.\n            \n\n              Photograph by Tina Rupp\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "milk", "quantity": 2.5}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "eggs", "quantity": 2.0}, {"food": "martha white foods", "quantity": 2.0}, {"food": "garlic bread", "quantity": 3.0}, {"food": "bacon", "quantity": 3.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "potato flour", "quantity": 3.0}, {"food": "pepper", "quantity": 0.125}, {"food": "salt", "quantity": 1}], "title": "\nDressed-Up Bacon Mac and Cheese\n"}, {"directions": "\n\n              Cut an apple in half and scoop out the seeds with a spoon. Slice into 1/4-inch-thick rounds. Lay on a greased baking sheet and bake at 200 degrees F until dry, 2 to 3 hours.\n            \n", "ingredients": [], "title": "\nDried Apples\n"}, {"directions": "\n\n              Pulse the oats in a food processor until some of it is fine and some of it is still very coarse. Dump the oats into a medium bowl and whisk in the flours, baking soda, baking powder and salt. In a large bowl, beat the butter and the sugars with a mixer at medium speed until very light, about 5 minutes. Beat in the eggs, one at a time, until well blended. Beat in the vanilla.\n            \n\n              At low speed, add the flour mixture and mix until just combined. Using a rubber spatula or a wooden spoon, fold in the cherries, nuts and white chocolate chips. Cover the bowl with plastic wrap and chill for at least 24 hours and up to 48 hours.\n            \n\n              Position the racks in the upper and lower thirds of the oven and preheat the oven to 350 degrees F. Line baking sheets with parchment paper or silicone mats.\n            \n\n              Roll about 2 teaspoons of dough into balls and place them on the lined baking sheets, leaving about 1 inch of space between them.\n            \n\n              Bake until the cookies are golden brown around the edges and the centers are pale golden and still soft, about 9 minutes. Let cool on wire racks for about 10 minutes, then transfer the cookies with a spatula to the racks to cool completely (or for as long as you can wait!).\n            \n", "ingredients": [{"food": "oats", "quantity": 1.25}, {"food": "potato flour", "quantity": 2.0}, {"food": "potato flour", "quantity": 1.75}, {"food": "baking chocolate", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 1.25}, {"food": "salt", "quantity": 1.5}, {"food": "butter oil", "quantity": 2.5}, {"food": "sugar", "quantity": 1.5}, {"food": "sugar", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "", "quantity": 1.5}, {"food": "macadamia nuts", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 1.0}], "title": "\nDried Cherry, Macadamia and White Chocolate Chip Cookies\n"}, {"directions": "\n\n              Line a baking sheet with foil, shiny-side up; smooth out the creases. Make sure all your tools are dry.\n            \n\n              Chop the chocolate into 1/2-inch pieces with a large knife. Place all but 1 cup of the chopped chocolate in a microwave-safe bowl. Microwave 30 seconds, then stir with a rubber spatula. Continue microwaving and stirring at 30-second intervals until melted, 3 to 5 minutes total. Immediately add the reserved chopped chocolate to the bowl; stir vigorously until melted and shiny. Don't worry if there are a few small unmelted pieces.\n            \n\n              Pour the chocolate onto the prepared baking sheet; use the rubber spatula to spread it into a 10-to-12-inch circle, about 1/4 inch thick.\n            \n\n              Press the almonds and figs into the chocolate, arranging them so each bite has a mix of flavors and textures. Sprinkle with sea salt. Let the bark harden completely at room temperature, about 1 hour. (If the room is warm, you may need to freeze the bark for a few minutes.) Break into pieces and store in an airtight container at room temperature for 1 to 2 weeks.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 1.0}, {"food": "smoked turkey roll", "quantity": 0.5}, {"food": "figs", "quantity": 0.5}, {"food": "sea lion", "quantity": 1}], "title": "\nDried Fig-Smoked Almond Bark\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Put the tomatoes, sugar, thyme sprigs, 1 cup water, 1/2 teaspoon salt, and pepper to taste in a small saucepan. Bring to a boil over high heat, then reduce the heat and simmer, stirring occasionally, until thick, about 30 minutes. Meanwhile, mix half of the lemon juice, the chopped thyme, mustard and Worcestershire sauce in a large bowl. Season the flour with salt and pepper in another bowl. Heat a large cast-iron skillet over medium-high heat. Season the drumsticks with salt and pepper. Dip in the mustard mixture, then dredge in the seasoned flour. Melt the butter in the skillet and fry the drumsticks, turning, until golden on all sides, about 6 minutes. Transfer the skillet to the oven; bake until the chicken is golden and a thermometer inserted into the center registers 155 degrees F, about 15 minutes. Add the remaining lemon juice to the tomato jam and season with salt and pepper. Serve the drumsticks with the jam and biscuits.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "grape juice", "quantity": 2.0}, {"food": "sugar", "quantity": 3.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 1.0}, {"food": "mustard spinach", "quantity": 0.3333333333333333}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "diced chicken", "quantity": 8.0}, {"food": "butter oil", "quantity": 5.0}, {"food": "", "quantity": 1}], "title": "\nDrumsticks With Biscuits and Tomato Jam\n"}, {"directions": "\n\n              The day before roasting the turkey, remove the neck and giblets and reserve for gravy (see below). Pat the turkey dry with paper towels and put on a rimmed baking sheet.\n            \n\n              Combine 1/4 cup salt, the sugar, 1 tablespoon each rosemary, sage and thyme, the celery seeds and 2 teaspoons pepper in a spice grinder. Pulse until the herbs are finely chopped and the salt is pale green. Rub the turkey inside and out with the salt mixture, rubbing some under the skin of the breasts. Refrigerate, uncovered, at least 8 hours or overnight.\n            \n\n              Position an oven rack in the lowest position (remove the other racks); preheat to 350 degrees F. Rinse the turkey well and pat dry with paper towels. Stuff the cavity of the turkey with the herb sprigs, carrot, celery and shallots. Tie the legs together with kitchen twine. Put the turkey breast-side up on a rack set in a large roasting pan and tuck the wings under the body. Let sit at room temperature for 30 minutes.\n            \n\n              Pour the wine over the turkey, then brush all over with the melted butter. Roast the turkey 1 hour, then baste with the pan drippings, adding up to 1/2 cup water to the pan if the drippings are getting too dark. Continue to roast the turkey, basting every 30 minutes and adding more water to the pan if needed, until the skin is golden brown and a thermometer inserted into the thigh registers 160 degrees F, 1 1/2 to 2 more hours. Transfer the turkey to a cutting board and let rest 30 minutes before carving; reserve the drippings for the gravy.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "smoked turkey roll", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "sugar", "quantity": 1.0}, {"food": "rosemary", "quantity": 1.0}, {"food": "sage", "quantity": 1.0}, {"food": "thyme", "quantity": 1.0}, {"food": "celery seed", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "pineapple chunks", "quantity": 1.0}, {"food": "pineapple chunks", "quantity": 1.0}, {"food": "shallots", "quantity": 2.0}, {"food": "martha white foods", "quantity": 1.0}, {"food": "butter oil", "quantity": 1.0}], "title": "\nDry-Brined Herbed Turkey\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Unwrap the turkey and remove the neck and giblets (reserve for gravy). Rinse the turkey under cold water and pat dry. Combine 1/3 cup salt, the sugar and 1 teaspoon pepper in a bowl. Rub all over the turkey and inside the cavity. Put on a rimmed baking sheet and refrigerate, uncovered, at least 8 hours or overnight. Rinse well and pat dry. (A dry brine is a good choice if you're short on fridge space.)\n            \n\n              Mix the butter, parsley, sage, thyme, 1 teaspoon pepper, the paprika and cloves until combined. Reserve 4 tablespoons of the butter, then rub the rest under the turkey skin on the breasts and legs. Rub 2 tablespoons of the reserved butter on the skin; chill and save the rest for your gravy. Let the turkey stand 30 minutes at room temperature before roasting.\n            \n\n              Put the oven rack in the lowest position; preheat the oven to 350 degrees F. Put the turkey breast-side up on a rack in a large roasting pan, tucking the wing tips under. Tie the drumsticks together with twine. Roast until the skin is golden brown and a thermometer inserted into the thigh registers 165 degrees F, about 15 minutes per pound. Transfer to a cutting board and let rest 30 minutes before carving. Whisk the reserved 2 tablespoons flavored butter into your gravy just before serving, if desired.\n            \n\n              Photograph by Yunhee Kim\n            \n", "ingredients": [{"food": "frozen yogurt", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "sugar", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "butter oil", "quantity": 2.0}, {"food": "parsley", "quantity": 2.0}, {"food": "sage", "quantity": 1.0}, {"food": "thyme", "quantity": 1.0}, {"food": "paprika", "quantity": 0.25}, {"food": "cloves", "quantity": 0.125}], "title": "\nDry-Brined Turkey With Classic Herb Butter\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F.\n            \n\n              Spread the baguette pieces on a baking sheet. Brush with olive oil and season with salt and pepper. Bake 8 to 10 minutes, until crisp and light golden brown. Set aside.\n            \n\n              Put the sweet potato in a medium saucepan with cold water to cover, salt the water generously, and bring to a boil. Reduce the heat and simmer until the potato is just fork tender, about 6 minutes; drain and cool. Peel the potato and dice it into 1/4-inch cubes.\n            \n\n              Heat a medium skillet over medium-low heat. Add the duck legs skin side down and cook until the fat has rendered and the duck is warm, about 10 to 12 minutes. Remove the duck to a plate. If the skillet seems dry, add a bit of olive oil. Add the smashed garlic cloves and rosemary and cook until fragrant, about 3 minutes. Discard the rosemary and garlic. Add the onion and cook until tender, about 4 minutes. Add the celery and red pepper and cook until tender, about 3 minutes. Season with the 1 1/2 teaspoons salt and some pepper. Add the minced garlic and cook about 2 minutes more.\n            \n\n              While the vegetables cook, remove the skin from the duck legs and discard. Shred the duck meat into long strips. Add the sweet potatoes, shredded duck and chicken broth to the skillet and warm over medium heat, adding more stock if mixture seems dry. Stir in the hoisin and hot sauce, and season, to taste. Remove from heat and stir in the chopped parsley and sherry vinegar. To serve, top each baguette slice with 1 heaping tablespoon of the duck hash.\n            \n\n              Copyright 2005 Television Food Network, G.P. All rights reserved\n            \n", "ingredients": [{"food": "pasta with sliced franks in tomato sauce", "quantity": 1.3333333333333333}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "seasoning mix", "quantity": 1.5}, {"food": "sweet potato puffs", "quantity": 1.0}, {"food": "frog legs", "quantity": 2.0}, {"food": "cloves", "quantity": 3.0}, {"food": "rosemary", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "diced chicken", "quantity": 1.0}, {"food": "diced chicken", "quantity": 0.5}, {"food": "diced chicken", "quantity": 0.25}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 1}, {"food": "black bean mango", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 4.0}, {"food": "vinegar", "quantity": 1}], "title": "\nDuck Hash on Toasted Baguette\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F.\n            \n\n              Spread the baguette pieces on a baking sheet. Brush with olive oil and season with salt and pepper. Bake 8 to 10 minutes, until crisp and light golden brown. Set aside.\n            \n\n              Put the sweet potato in a medium saucepan with cold water to cover, salt the water generously, and bring to a boil. Reduce the heat and simmer until the potato is just fork tender, about 6 minutes; drain and cool. Peel the potato and dice it into 1/4-inch cubes.\n            \n\n              Heat a medium skillet over medium-low heat. Add the duck legs skin side down and cook until the fat has rendered and the duck is warm, about 10 to 12 minutes. Remove the duck to a plate. If the skillet seems dry, add a bit of olive oil. Add the smashed garlic cloves and rosemary and cook until fragrant, about 3 minutes. Discard the rosemary and garlic. Add the onion and cook until tender, about 4 minutes. Add the celery and red pepper and cook until tender, about 3 minutes. Season with the 1 1/2 teaspoons salt and some pepper. Add the minced garlic and cook about 2 minutes more.\n            \n\n              While the vegetables cook, remove the skin from the duck legs and discard. Shred the duck meat into long strips. Add the sweet potatoes, shredded duck and chicken broth to the skillet and warm over medium heat, adding more stock if mixture seems dry. Stir in the hoisin and hot sauce, and season, to taste. Remove from heat and stir in the chopped parsley and sherry vinegar. To serve, top each baguette slice with 1 heaping tablespoon of the duck hash.\n            \n\n              Copyright 2005 Television Food Network, G.P. All rights reserved.\n            \n", "ingredients": [{"food": "pasta with sliced franks in tomato sauce", "quantity": 1.3333333333333333}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "seasoning mix", "quantity": 1.5}, {"food": "sweet potato puffs", "quantity": 1.0}, {"food": "frog legs", "quantity": 2.0}, {"food": "cloves", "quantity": 3.0}, {"food": "rosemary", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "diced chicken", "quantity": 1.0}, {"food": "diced chicken", "quantity": 0.5}, {"food": "diced chicken", "quantity": 0.25}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 1}, {"food": "black bean mango", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 4.0}, {"food": "vinegar", "quantity": 1}], "title": "\nDuck Hash on Toasted Baguette\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F.\n            \n\n              Spread the baguette pieces on a baking sheet. Brush with olive oil and season with salt and pepper. Bake 8 to 10 minutes, until crisp and light golden brown. Set aside.\n            \n\n              Put the sweet potato in a medium saucepan with cold water to cover, salt the water generously, and bring to a boil. Reduce the heat and simmer until the potato is just fork tender, about 6 minutes; drain and cool. Peel the potato and dice it into 1/4-inch cubes.\n            \n\n              Heat a medium skillet over medium-low heat. Add the duck legs skin side down and cook until the fat has rendered and the duck is warm, about 10 to 12 minutes. Remove the duck to a plate. If the skillet seems dry, add a bit of olive oil. Add the smashed garlic cloves and rosemary and cook until fragrant, about 3 minutes. Discard the rosemary and garlic. Add the onion and cook until tender, about 4 minutes. Add the celery and red pepper and cook until tender, about 3 minutes. Season with the 1 1/2 teaspoons salt and some pepper. Add the minced garlic and cook about 2 minutes more.\n            \n\n              While the vegetables cook, remove the skin from the duck legs and discard. Shred the duck meat into long strips. Add the sweet potatoes, shredded duck and chicken broth to the skillet and warm over medium heat, adding more stock if mixture seems dry. Stir in the hoisin and hot sauce, and season, to taste. Remove from heat and stir in the chopped parsley and sherry vinegar. To serve, top each baguette slice with 1 heaping tablespoon of the duck hash.\n            \n\n              Copyright 2005 Television Food Network, G.P. All rights reserved.\n            \n", "ingredients": [{"food": "pasta with sliced franks in tomato sauce", "quantity": 1.3333333333333333}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "seasoning mix", "quantity": 1.5}, {"food": "sweet potato puffs", "quantity": 1.0}, {"food": "frog legs", "quantity": 2.0}, {"food": "cloves", "quantity": 3.0}, {"food": "rosemary", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "diced chicken", "quantity": 1.0}, {"food": "diced chicken", "quantity": 0.5}, {"food": "diced chicken", "quantity": 0.25}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 1}, {"food": "black bean mango", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 4.0}, {"food": "vinegar", "quantity": 1}], "title": "\nDuck Hash on Toasted Baguette\n"}, {"directions": "\nSpecial equipment: Skewer; Pastry bag; #235 Wilton fuzzy tip\n\n              For the beak: Stand an orange gumdrop on its base. Snip with scissors straight down about three-quarters of the way through to make the mouth. Trim around all sides of the gumdrop to decrease the size and shape into a tapered beak. Repeat to make remaining beaks.\n            \n\n              For the duck: Make a 1/2-inch ball with some of the yellow fondant for the head. Attach the beak to the head by inserting it into the ball and reshaping around it. Form the remaining fondant into a teardrop shape. Dab the bottom of the head with water and attach to the side of the teardrop, toward the big end. Repeat to make remaining ducks.\n            \n\n              For the eyes: Dip a skewer in the melted chocolate and make 2 small dots on each duck head for eyes. Set aside.\n            \n\n              To assemble: Frost the cupcakes with the buttercream. Place the avocado-tinted frosting in a pastry bag with a #235 Wilton fuzzy tip. Hold the bag straight up, with the tip 1/8 inch above the surface. Squeeze to form grass on the top of the cupcake, and then stop squeezing and pull the pastry bag up, making grass blades about 1/2-inch long. Repeat around the edges of the cupcake to form a ring of grass. Repeat with remaining cupcakes.\n            \n\n              Sprinkle the center of the cupcakes with blue sanding sugar to make the pond. Place the ducks in the center and press gently to adhere.\n            \n", "ingredients": [{"food": "orange", "quantity": 12.0}, {"food": "", "quantity": 0.75}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "", "quantity": 12.0}, {"food": "", "quantity": 2.0}, {"food": "", "quantity": 0.5}, {"food": "sugar", "quantity": 1}], "title": "\nDuck in a Pond Cupcakes\n"}, {"directions": "\n\n              Place the duck breast-side up on a cutting board. Remove and reserve the giblets and discard the liver. Break down the duck and score the breasts.\n            \n\n              Puree the shallots, ginger and coriander in a mini food processor. Season the duck legs and the meat side of the breasts with salt, pepper and 2 tablespoons of the ginger mixture. Cover and refrigerate the duck and the remaining ginger mixture while you make the stock.\n            \n\n              Make the duck stock: Trim the excess fat from the duck bones and chop into 6 to 8 pieces. Heat 2 tablespoons olive oil in a Dutch oven or large pot over medium-high heat; add the bones, reserved wings and giblets and brown, turning occasionally, about 25 minutes. Add the broth and enough water to cover the bones. Bring to a boil, then reduce to a simmer and cook, uncovered, about 3 hours, skimming as needed. Strain the duck stock and skim off any excess fat from the surface. (The stock can be made a day ahead. Just cover and refrigerate.)\n            \n\n              Preheat the oven to 375 degrees F. Place the duck legs on a rack in a roasting pan with 1/4 inch water. Roast until brown and crisp, about 1 hour 15 minutes.\n            \n\n              Meanwhile, heat the remaining 1 tablespoon olive oil in a medium saucepan over medium-high heat; add the reserved ginger mixture and cook, stirring, until browned, 5 to 7 minutes. Add the port and scrape up any browned bits from the pan with a wooden spoon. Boil until the mixture looks like wet sand. Add 3 cups of the duck stock and the bay leaf and simmer until the liquid reduces by about three-quarters, about 45 minutes. Strain into a separate saucepan. Add the figs and heat until plump, about 2 minutes. Whisk in the butter, season generously with salt and pepper and add the vinegar. Keep the sauce warm over low heat but do not boil.\n            \n\n              Scrape the ginger mixture off the breasts. Heat a medium skillet over high heat. Place the breasts, skin-side down, in the skillet and cook until the fat begins to render and the skin is golden brown, 1 to 2 minutes. Pour off the fat. Reduce the heat to low and continue cooking, removing the fat as it renders, until the skin is tight and golden, 15 to 20 minutes. Increase the heat to medium-high, flip the breasts and cook until the meat is lightly browned but still medium-rare, 1 to 2 more minutes.\n            \n\n              Thinly slice the breasts and cut the legs in half. Divide the meat among plates and top with the sauce and figs.\n            \n\n              Photograph by Marcus Nilsson\n            \n", "ingredients": [{"food": "duck", "quantity": 1.0}, {"food": "shallots", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "seeds", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "corier leaf", "quantity": 1.0}, {"food": "figs", "quantity": 6.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "vinegar", "quantity": 1.0}], "title": "\nDuck with Figs and Port\n"}, {"directions": "\n\n              Combine the Campari, lemon juice, orange liqueur and prosecco in a champagne flute. Garnish with a flamed orange twist.\n            \n\n              To make a flamed orange twist, light a match over the cocktailand squeeze a strip of peel over the match to release the oils. Drop the peel into the drink.\n            \n\n              Photograph by Jim Franco\n            \n", "ingredients": [{"food": "", "quantity": 0.5}, {"food": "lemon juice", "quantity": 0.5}, {"food": "orange", "quantity": 0.5}, {"food": "", "quantity": 4.0}, {"food": "orange", "quantity": 1}], "title": "\nDue Campari Nuovo\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the macaroni and cook until al dente; drain and toss with the milk in a large bowl.\n            \n\n              Meanwhile, toast the curry powder in a small dry skillet over medium heat until fragrant, about 1 minute. Whisk in the peanut oil and cook until the oil is curry-colored; let cool. Whisk the mayonnaise, chutney and curry oil in a large bowl, then whisk in the vinegar to make a smooth dressing. Season with 1/4 teaspoon salt, and pepper to taste.\n            \n\n              Add the broccoli slaw mix, scallions and cilantro to the dressing and toss until combined. Stir in the pasta and toss to coat. Cover and refrigerate until serving.\n            \n\n              Photograph by Rick Lew\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "milk", "quantity": 0.25}, {"food": "curry powder", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "mayonnaise dressing", "quantity": 2.0}, {"food": "black bean mango", "quantity": 0.25}, {"food": "vinegar", "quantity": 0.25}, {"food": "pepper", "quantity": 1}, {"food": "cheesecake mix", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "", "quantity": 0.25}], "title": "\nDuff's Curried Pasta Salad\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Line 2 baking sheets with parchment paper. Fit a large pastry bag with a 1/2 -inch round tip.\n            \n\n              Combine the butter, granulated sugar, salt and 1 cup water in a medium saucepan and bring to a boil. Remove from the heat; sift the flour into the saucepan and stir with a wooden spoon to make a paste. Return to medium heat and stir until the dough pulls away from the side of the pan and is slightly shiny, about 2 minutes. Transfer to a bowl and beat with a wooden spoon until slightly cooled, 2 to 3 minutes. Add the whole eggs, one at a time, beating until smooth before adding the next.\n            \n\n              Transfer the dough to the pastry bag. Pipe 1-inch mounds of dough 1 inch apart on the prepared baking sheets. Smooth the tops with a damp fingertip. Beat the egg yolk with 1 tablespoon water; brush on the dough mounds. Bake 15 minutes, then reduce the oven temperature to 350 degrees F and continue baking until the puffs are golden brown and crisp, about 25 more minutes. Transfer to a rack and let cool completely.\n            \n\n              Meanwhile, beat the heavy cream and the confectioners' sugar in a large bowl with a mixer until soft peaks form; refrigerate until ready to assemble. Place the chocolate in a microwave-safe bowl and microwave in 30-second intervals, stirring, until melted.\n            \n\n              Cut the puffs in half crosswise with a serrated knife; sandwich with the sliced bananas, dulce de leche and whipped cream. Drizzle the puffs with the melted chocolate and more dulce de leche.\n            \n\n              Photograph by Ralph Smith\n            \n", "ingredients": [{"food": "butter oil", "quantity": 6.0}, {"food": "sugar", "quantity": 2.0}, {"food": "salt", "quantity": 0.25}, {"food": "potato flour", "quantity": 1.0}, {"food": "eggs", "quantity": 4.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 4.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "dulce de leche", "quantity": 0.6666666666666666}], "title": "\nDulce and Banana\n"}, {"directions": "\n\n              Pour two 14-ounce cans sweetened condensed milk into a 9-by-13-inch baking dish. Cover with foil and set in a large roasting pan; add enough hot water to come halfway up the sides of the dish. Bake at 425 degrees F until slightly reduced and dark amber, about 1 hour 15 minutes. (A spotted skin may form on top.) Transfer to a food processor and puree until the skin dissolves and the dulce de leche is smooth. Chill until thickened, about 1 hour.\n            \n", "ingredients": [], "title": "\nDulce de Leche\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Line a 9-inch-square baking dish with foil, leaving a 2-inch overhang on two sides; coat the foil with cooking spray. Pulse 2 cups flour, the butter, confectioners' sugar, 1 teaspoon vanilla and the salt in a food processor until the mixture starts clumping together, about 1 minute. Press firmly and evenly in the bottom and 1/4 inch up the sides of the prepared pan. Bake until firm and lightly browned, 25 to 30 minutes. Transfer to a rack and let cool 5 minutes.\n            \n\n              Meanwhile, combine the dulce de leche, heavy cream, egg yolks and the remaining 1 tablespoon flour and 2 teaspoons vanilla in a medium bowl and whisk until smooth. Pour the mixture over the crust and sprinkle with the chocolate chips and pecans. Return to the oven and bake until set around the edge but slightly jiggly in the center, 20 to 25 minutes.\n            \n\n              Transfer to the rack and let cool completely. Lift out of the pan using the overhanging foil. Remove the foil and cut into pieces.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 2.0}, {"food": "diced chicken", "quantity": 1.5}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "dulce de leche", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 0.25}, {"food": "egg substitute", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "pecans", "quantity": 0.75}], "title": "\nDulce de Leche Cookie Bars\n"}, {"directions": "\n\n              Make the crepes: Combine the milk, eggs, flour, cocoa powder, granulated sugar, vanilla and salt in a blender and process until smooth. Refrigerate the batter 30 minutes.\n            \n\n              Lightly brush a 10-inch nonstick skillet with melted butter and place over medium heat. Add a scant 1/4 cup of batter and quickly swirl the pan to coat the bottom. Cook until set on top and golden on the bottom, about 30 seconds. Carefully lift the edge of the crepe with a rubber spatula, then flip with your fingers and cook 20 more seconds. Invert the crepe onto a plate. Repeat with the remaining batter to make 14 to 18 crepes, brushing the skillet with more butter as needed. Stack the finished crepes on the plate and let cool completely. (The crepes can be made up to 1 day ahead; let cool, then wrap the stack in plastic wrap and refrigerate.)\n            \n\n              Make the filling: Beat the butter in a stand mixer fitted with the paddle attachment on medium-high speed until light and fluffy. Add 2 3/4 cups confectioners' sugar in 2 batches, beating until smooth and fluffy. Add the dulce de leche and beat until combined. (The filling can be made up to 1 day ahead; cover with plastic wrap and refrigerate, then beat for a few minutes with a mixer before using.)\n            \n\n              Assemble the cake just before serving: Place 1 crepe on a platter or cake stand. Spread with a scant 1/4 cup of the filling, then top with another crepe. Repeat with the remaining filling and crepes, ending with a crepe on top.\n            \n\n              Beat the heavy cream and the remaining 1 tablespoon confectioners' sugar in a stand mixer fitted with the whisk attachment until stiff peaks form. Spread on top of the cake and drizzle with dulce de leche. Serve immediately.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "whole milk", "quantity": 1.25}, {"food": "eggs", "quantity": 4.0}, {"food": "potato flour", "quantity": 1.25}, {"food": "onion powder", "quantity": 0.25}, {"food": "sugar", "quantity": 0.25}, {"food": "vanilla extract", "quantity": 0.75}, {"food": "salt", "quantity": 0.125}, {"food": "butter oil", "quantity": 1}, {"food": "butter oil", "quantity": 2.0}, {"food": "sugar", "quantity": 2.75}, {"food": "dulce de leche", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1.0}], "title": "\nDulce de Leche Crepe Cake\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Finely grind the hazelnuts in a food processor. Spread on a baking sheet; bake until golden, 12 minutes.\n            \n\n              Whisk the flour, cornstarch, 1/3 cup of the ground hazelnuts, the baking powder, baking soda and salt in a bowl; set aside. Beat the butter and granulated sugar in a large bowl with a mixer on medium-high speed until light and fluffy, about 3 minutes. Add the egg yolks, liqueur and vanilla; beat until incorporated. Reduce the mixer speed to low; add the flour mixture and beat until just combined. Turn onto a sheet of plastic wrap; shape into a disk. Wrap and refrigerate until firm, at least 1 hour.\n            \n\n              Position racks in the upper and lower thirds of the oven; preheat to 350 degrees F. Line 2 baking sheets with parchment paper. Dust the dough with flour and roll out into a 6-by-12-inch rectangle (1/4 inch thick) on a floured surface. Cut into 1 1/2-inch squares; arrange 1/2 inch apart on the baking sheets. Cut out circles from the middle of half of the squares using a small cutter. Refrigerate until firm, 15 minutes.\n            \n\n              Bake, switching the pans halfway through, until the cookies are golden on the bottom, 12 to 14 minutes. Let cool 5 minutes, then transfer to racks to cool completely. Stir together the dulce de leche and the remaining ground hazelnuts. Sandwich between the plain and cut-out cookies. Dust with confectioners' sugar.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "hazelnuts or filberts", "quantity": 0.5}, {"food": "potato flour", "quantity": 1.0}, {"food": "cornstarch", "quantity": 0.75}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "egg substitute", "quantity": 2.0}, {"food": "chocolate hazelnut spread", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "dulce de leche", "quantity": 0.75}, {"food": "sugar", "quantity": 1}], "title": "\nDulce de Leche Sandwich Cookies\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Melt the butter in a large skillet over medium-high heat. Add the pineapple and a pinch of salt; cook, turning the pineapple occasionally, until softened and browned in spots, 5 to 7 minutes. Reduce the heat to medium and stir in 1/4 cup Dulce de Leche. Cook until the pineapple is glazed, 2 to 3 more minutes. Remove from the heat; let cool slightly.\n            \n\n              Place the rolls, cut-side up, on a baking sheet; bake until lightly toasted, about 3 minutes.\n            \n\n              Beat the heavy cream, vanilla and a pinch of salt in a medium bowl with a mixer on medium speed until stiff peaks form, 1 to 2 minutes; fold in 2 tablespoons Dulce de Leche until just combined. Spread each roll half with about 1/2 tablespoon Dulce de Leche and top with the pineapple mixture. Top with ice cream, the whipped cream, Dulce de Leche and coconut.\n            \n\nHomemade Dulce de Leche:\n\n\n              Pour two 14-ounce cans sweetened condensed milk into a 9-by-13-inch baking dish. Cover with foil and set in a roasting pan; add enough hot water to come halfway up the sides of the dish. Bake at 425 degrees F until thick and dark amber, about 1 hour 15 minutes. Transfer to a food processor and puree until smooth. Refrigerate until thickened, 1 hour. (Makes about 2 cups.)\n            \n", "ingredients": [{"food": "butter oil", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "barley flour or meal", "quantity": 0.5}, {"food": "pizza rolls", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 0.75}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "coconut water", "quantity": 1}], "title": "\nDulce de Leche-Pineapple Ice Cream Sundaes\n"}, {"directions": "\n\n              Combine 2 cups water, the broth, ham, sherry, sugar, ginger, orange zest, 1/2 teaspoon salt, and pepper to taste in a large pot. Cover and bring to a boil over high heat. Add the scallion whites, mushrooms and carrots. Reduce the heat and simmer, uncovered, until the carrots are crisp-tender, about 4 minutes.\n            \n\n              Add the cabbage, dumplings and scallion greens. Cover and cook until the dumplings are soft and heated through, 4 to 5 minutes. Divide the dumplings and soup among bowls. Drizzle with soy sauce, if desired.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 4.0}, {"food": "diced chicken", "quantity": 0.25}, {"food": "crisped rice bar", "quantity": 2.0}, {"food": "sugar", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "orange", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "barley flour or meal", "quantity": 24.0}], "title": "\nDumpling Soup\n"}, {"directions": "\n\n              Cook the bacon in a Dutch oven or large pot over medium-high heat until browned around the edges, about 5 minutes. Add the ginger, half of the scallions, 1 teaspoon salt and the sugar; stir-fry 30 seconds. Add the broth and 1 cup water; cover and bring to a boil. Meanwhile, combine the cornstarch and 3 tablespoons water in a small bowl. Add the sesame oil and 1 teaspoon pepper and stir to combine.\n            \n\n              Add the snow peas, tomatoes, watercress and dumplings to the boiling broth mixture. Stir the cornstarch mixture again and add to the soup. Cook, stirring occasionally, until the dumplings are tender and the broth thickens slightly, 3 to 5 minutes. Stir in the remaining scallions and season with pepper.\n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [{"food": "bacon", "quantity": 4.5}, {"food": "ginger", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "sugar", "quantity": 1.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "cornstarch", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "pepper", "quantity": 1}, {"food": "pigeon peas", "quantity": 4.0}, {"food": "plum", "quantity": 2.0}, {"food": "watercress", "quantity": 1.0}, {"food": "turkey pot pie", "quantity": 1.0}], "title": "\nDumpling Soup With Bacon and Snow Peas\n"}, {"directions": "\n\n              Whisk the flour, herb mixture, baking powder, baking soda, salt and 1/4 teaspoon pepper. Cut in the butter with a pastry blender until sandy. Stir in the buttermilk.\n            \n\n              Turn out onto a floured piece of parchment paper. Pat into a 3/4-inch-thick rectangle.\n            \n\n              Cut the dough into rough 2-inch squares with a large knife. Cover with plastic wrap.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "potato flour", "quantity": 3.0}, {"food": "mixed nuts", "quantity": 0.75}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "butter oil", "quantity": 6.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 1.5}], "title": "\nDumplings\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              For the dough: Pulse the flour, granulated sugar and salt in a food processor until combined. Add the butter, and pulse until the mixture resembles yellow cornmeal mixed with pea-sized bits of butter. Add the egg, and pulse until the dough just comes together. (If the dough is very dry, add up to 1 tablespoon cold water.) Remove the dough, gently pat it into a round, wrap it in plastic wrap and refrigerate until thoroughly chilled, at least 1 hour and up to 2 days.\n            \n\n              For the filling: Meanwhile, put the lemon juice in a medium bowl. Peel and core the apples; cut each in half, and cut each half into 4 wedges. Add the apples and granulated sugar to the bowl with the lemon juice, and toss.\n            \n\n              Melt the butter over medium-high heat in a large skillet. Add the sugared apples, and cook, stirring, until the sugar dissolves and the mixture begins to simmer, about 2 minutes. Cover, reduce the heat to medium-low and cook until the apples soften and release most of their juices, about 7 minutes.\n            \n\n              Strain the apples in a colander over a medium bowl to catch all the juice. Shake the colander to extract as much liquid as possible. Return the juice to the skillet, and simmer over medium heat until it has thickened and lightly caramelized, about 10 minutes.\n            \n\n              Toss the apples with the thickened juice, cinnamon, allspice and nutmeg in a medium bowl. Set aside to cool completely. (The cooled filling can be refrigerated for up to 2 days or frozen for up to 6 months.)\n            \n\n              For the streusel topping: Whisk the flour, sugar and salt together in a medium bowl. Add the butter, and rub it into the flour mixture with your fingers until it has been absorbed. Mix in the walnuts.\n            \n\n              To assemble and bake the pie: Position a rack in the lower third of the oven, place a baking sheet on it and preheat the oven to 375 degrees F. On a lightly floured work surface, roll the dough disk into a 12-inch circle. Layer it between pieces of parchment or wax paper on a baking sheet, and refrigerate for at least 10 minutes.\n            \n\n              Ease the dough round into a 9-inch pie pan. Fold and crimp the edges as desired. Add the filling, and spread it out to make an even layer. Squeeze handfuls of the streusel topping, and drop clumps of it on top of the filling to completely cover it.\n            \n\n              Bake the pie on the preheated baking sheet until the crust and streusel are golden brown, 50 to 60 minutes. Let it cool on a cooling rack for at least 3 hours before serving. (The pie keeps well, covered, at room temperature for 24 hours or refrigerated for up to 4 days.)\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.5}, {"food": "sugar", "quantity": 4.0}, {"food": "salt", "quantity": 0.25}, {"food": "diced chicken", "quantity": 14.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 3.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "butter oil", "quantity": 4.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "allspice", "quantity": 0.25}, {"food": "nutmeg", "quantity": 1}, {"food": "potato flour", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 6.0}, {"food": "walnuts", "quantity": 0.5}], "title": "\nDutch Apple Pie\n"}, {"directions": "\n\n              Sift the flour, cinnamon, baking soda, nutmeg, anise, cloves, ginger, salt and pepper into a medium bowl, then whisk to combine.\n            \n\n              Beat the butter and brown sugar in a large bowl with a mixer on medium-high speed until light and fluffy, 3 to 5 minutes. Reduce the mixer speed to low; add half of the flour mixture and beat until combined, scraping down the bowl as needed. Add 3 tablespoons water and the remaining flour mixture and beat until just combined. Turn out onto a piece of plastic wrap, pat into a disk, wrap and refrigerate until firm, about 1 hour.\n            \n\n              Dust the dough with confectioners' sugar, then transfer to a piece of parchment paper and roll out until 1/4 inch thick. Cut into shapes using 2-to-3-inch cookie cutters. Transfer the cutouts to 2 ungreased baking sheets and press sliced almonds decoratively on top. Freeze until firm, about 1 hour.\n            \n\n              Position racks in the upper and lower thirds of the oven and preheat to 325 degrees F. Transfer the cookies to the oven and reduce the temperature to 275 degrees F; bake, switching the position of the pans halfway through, until crisp and golden, 45 to 50 minutes. Let cool 3 minutes on the baking sheets, then transfer to racks to cool completely.\n            \n\n              Photograph by Johnny Miller\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.5}, {"food": "cinnamon", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "nutmeg", "quantity": 0.5}, {"food": "anise seed", "quantity": 0.25}, {"food": "cloves", "quantity": 0.25}, {"food": "ginger", "quantity": 0.25}, {"food": "salt", "quantity": 0.25}, {"food": "pepper", "quantity": 0.25}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 0.75}, {"food": "sugar", "quantity": 1}, {"food": "almonds", "quantity": 1}], "title": "\nDutch Spice Cookies\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: an electric waffle cone iron; a 4 12-inch round cutter; a candy or deep-fry thermometer\n\n              For the waffles: Place the warm milk in a small bowl and whisk the yeast into the milk. Allow the mixture to sit until bubbly, about 5 minutes. \n            \n\n              Put the flour, granulated sugar, cinnamon and salt in a food processor and pulse until the ingredients are combined. Add the butter and pulse until it resembles coarse meal. Add the eggs and the yeast mixture, and pulse to combine. Turn the dough onto a lightly floured surface and knead just until the dough comes together in a nice ball, 5 to 7 times. Set aside to rest for 45 minutes. \n            \n\n              Preheat a waffle cone iron on the medium-high setting. Form the dough into 16 equal balls, about 2 1/2 ounces each. Flatten 1 ball until it just forms a disk and place in the waffle cone iron. Shut the iron lid but don't clamp closed. Bake until crisp and golden, occasionally pressing down on the iron lid, 1 to 2 minutes. While the waffle is still warm, cut out a circle using a 4 1/2-inch round cutter, and then split the waffle horizontally using a knife. You should have 2 thin waffle halves. (If you wait until the waffle is cool it will be harder to cut.) \n            \n\n              For the filling: Combine the molasses, brown sugar, corn syrup, butter and cinnamon in a small saucepan over medium heat, and bring to a boil. Bring to the soft-ball stage (235 to 240 degrees F on a candy thermometer), stirring constantly, 8 to 10 minutes. Pour into a heat-resistant glass measuring cup and allow the mixture to cool until it thickens but is still spreadable, about 10 minutes. (If the filling gets too thick, rewarm in the microwave at 30-second intervals until the desired consistency is achieved.) Spread 2 tablespoons of filling on the cut side of a waffle and top with the other half. Allow the cookies to cool completely. \n            \n\n              Cut into shapes using a cookie cutter, or cut into wedges if desired. Mix confectioners' sugar and cinnamon together in a small bowl, and sprinkle it on top of the stroopwafels.\n            \n\n              From Food Network Kitchen\n            \n", "ingredients": [{"food": "milk", "quantity": 0.5}, {"food": "yeast extract spread", "quantity": 1.0}, {"food": "potato flour", "quantity": 4.0}, {"food": "sugar", "quantity": 0.75}, {"food": "cinnamon", "quantity": 0.5}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 2.0}, {"food": "eggs", "quantity": 2.0}, {"food": "molasses", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "silk light vanilla", "quantity": 0.5}, {"food": "butter oil", "quantity": 6.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "sugar", "quantity": 0.25}, {"food": "cinnamon", "quantity": 0.25}], "title": "\nDutch Stroopwafels\n"}]