[{"directions": "\n\n              Preheat the oven to 375 degrees F. Mix together the poppy seeds, garlic, onion and sesame seeds in a small bowl; set aside.\n            \n\n              Whisk together the flour, sugar, baking powder, baking soda and 3/4 teaspoon salt in a medium bowl. Add the butter and work it into the flour mixture with your fingers until the butter is broken down into very small pea-size pieces. Make a well in the center and pour in the milk. Using a fork, stir the dry ingredients into the wet.\n            \n\n              Once the dough comes together, knead it gently a couple of times on a well-floured surface. Roll out the dough to a little thinner than 1/8 inch. Cut as many 1 1/2-by-3-inch rectangles as you can. (You should get at least 30 pieces.) Place a mini hot dog onto each rectangle and roll it up, making sure the short ends overlap; seal and arrange seam-side down 2-inches apart on a baking sheet. Brush each dough-wrapped hot dog with the egg and top with 2 generous pinches of the topping.\n            \n\n              Bake in the oven until golden brown, 17 to 20 minutes. Serve with mustard on the side, for dipping.\n            \n", "ingredients": [{"food": "seeds", "quantity": 3.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "onion powder", "quantity": 2.0}, {"food": "sesame seeds", "quantity": 2.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "sugar", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 4.0}, {"food": "whole milk", "quantity": 0.6666666666666666}, {"food": "hot pockets ham cheese stuffed swich", "quantity": 30.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "mustard spinach", "quantity": 1}], "title": "\n\"Everything\" Pigs in a Blanket\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F and line a 9-by-13-inch baking dish with foil, leaving a 2-inch overhang on all sides. Pulse the tea leaves briefly in a spice grinder until ground but not powdery. Transfer to a medium bowl and whisk in the flour and salt.\n            \n\n              Beat the butter in a large bowl with a mixer on medium-high speed until fluffy, about 2 minutes. Reduce the mixer speed to low; add 2 1/2 cups confectioners¿ sugar and the vanilla and beat until incorporated, then increase the speed to medium high and beat until smooth, about 1 more minute. Reduce the mixer speed to low and beat in the flour mixture, then increase the speed to medium and beat until just combined.\n            \n\n              Scrape the dough into the prepared pan. Lay a piece of plastic wrap on top and press the dough evenly into the pan; remove the plastic wrap. Bake until the shortbread is firm and the edges are just light golden, 40 to 45 minutes. Transfer to a rack and let cool 20 minutes in the pan. Gently lift the shortbread out of the pan using the foil overhang. Slice into 1 1/2-inch squares. Transfer to racks to cool completely.\n            \n\n              Make the glaze: Whisk the remaining 1 cup confectioners¿ sugar and the milk in a bowl until smooth; drizzle over the shortbread. Sprinkle with coarse sugar and let set, 20 to 30 minutes.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "chrysanthemum leaves", "quantity": 0.25}, {"food": "potato flour", "quantity": 4.0}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 4.0}, {"food": "sugar", "quantity": 3.5}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "milk", "quantity": 3.0}, {"food": "sugar", "quantity": 1}], "title": "\nEarl Grey Shortbread\n"}, {"directions": "\n\n              Bring 1 cup water to a boil in a small saucepan over medium-high heat. Turn off the heat, add the tea bags and let steep 5 minutes. Discard the tea bags. Stir in 1 cup ice cubes until completely melted. Pour the tea into a liquid measuring cup, and let it chill completely in the refrigerator, about 30 minutes.\n            \n\n              Meanwhile, cook the sugar and 1/2 cup water in a small saucepan over medium heat, stirring occasionally, until the sugar has completely melted, about 5 minutes. Turn off the heat, add the mint and stir until it has completely wilted. Let cool completely at room temperature, at least 30 minutes.\n            \n\n              Strain the cooled mint syrup into a large liquid measuring cup or a pitcher, then press the leaves with a wooden spoon or spatula to extract as much liquid as possible. Discard the mint. Add the blueberries, and use a wooden spoon or a potato masher to lightly crush most of them (a few whole blueberries is fine). Add the chilled tea, and stir to combine.\n            \n\n              To serve, fill 4 tall glasses with ice. Divide the blueberry mixture among them. Add enough sparkling wine to fill each glass. Garnish with a mint sprig, and serve immediately.\n            \n", "ingredients": [{"food": "tea", "quantity": 6.0}, {"food": "sugar", "quantity": 0.5}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "blueberries", "quantity": 2.0}, {"food": "", "quantity": 1}], "title": "\nEarl Grey Tea and Blueberry Spritzer\n"}, {"directions": "\n\n              Pour 1/3 cup warm water (about 110 degrees F) into the bowl of a stand mixer. Gently whisk in the yeast, 1 tablespoon of the flour and 1 tablespoon of the sugar. Set aside until bubbly, 5 to 10 minutes.\n            \n\n              Meanwhile, heat the milk in a small saucepan over medium heat until bubbles start to form around the edges, about 6 minutes. Remove the pan from the heat, and stir in the butter, the remaining sugar and the salt. Set aside to cool, about 10 minutes.\n            \n\n              Fit the mixer with the paddle attachment, set on medium-low speed and pour the milk mixture into the yeast mixture. Add the 2 beaten eggs. Gradually mix in the remaining flour, and beat until a soft dough forms. Increase the speed to medium-high, and beat until the dough pulls away from the sides and forms a ball, about 5 minutes (the dough will be sticky).\n            \n\n              Transfer the dough to a lightly floured surface, and knead, adding more flour as needed, until smooth and elastic, about 5 minutes. Put the dough in a lightly buttered large bowl, cover and place in a warm spot to rise until doubled in size, about 1 1/2 hours.\n            \n\n              Line a baking sheet with parchment paper. Punch down the dough, transfer it to a lightly floured surface and cut it into 3 equal parts. Gently roll out each piece into a 16-inch-long rope. Transfer the ropes to the prepared baking sheet. Press the ropes together at one end, braid them, then gently tuck both ends under to form a long loaf. Cover, and let rise until doubled in size, about 1 hour.\n            \n\n              Preheat the oven to 350 degrees F. Brush the entire loaf with the remaining beaten egg. Scatter the almonds and nonpareils on top, concentrating them down the middle of the loaf (they will spread as the loaf bakes). Bake until the loaf is dark golden brown and sounds hollow when tapped, 50 to 60 minutes. Let cool about 30 minutes before slicing.\n            \n", "ingredients": [{"food": "", "quantity": 0.25}, {"food": "potato flour", "quantity": 6.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "milk", "quantity": 1.3333333333333333}, {"food": "healthy request microwavable bowl", "quantity": 6.0}, {"food": "salt", "quantity": 1.0}, {"food": "egg substitute", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.3333333333333333}, {"food": "martha white foods", "quantity": 1.0}], "title": "\nEaster Bread\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              For the frosting: Combine the sugar, butter and salt in the bowl of a stand mixer fitted with a paddle attachment (or in a large bowl if using a hand-held electric mixer). Mix on low speed until mostly incorporated. Add the vanilla, increase the speed to medium high and mix until smooth. Adjust the consistency with milk until the frosting is easy to spread.\n            \n\n              For the bunny: Spread a thin layer of frosting (about 2/3 cup) on the flat side of one cake layer and top with the flat side of the second cake layer. Measure 5 inches across the top of the cake and cut down through the layers, creating 2 layered pieces that are slightly different sizes.\n            \n\n              Place the larger piece of cake cut-side down on a large platter or cake board. If using a rectangular cake board, place the larger piece so that the long edges are parallel with the long edges of the board. This is the body of the bunny. Cut the smaller piece of cake in half crosswise, so you have 2 layered wedges. Place one wedge in front of the body, with one flat side on the board and the other flat side against the body. The curved side will be on top. Take a serrated knife and round off the sharp edges on top of the head. Cut the tip off (the nose) at a 45-degree angle. Reserve all scraps in a bowl.\n            \n\n              Separate the layers of the remaining wedge of cake. These will be the back legs. Round the sharp edges of the cake wedges with your knife and add to the scrap bowl. Place one piece on each side of the bunny, with one flat side down and the other flat side facing forward (the round side towards the back of the bunny), about 1 inch from the end of the bunny's body.\n            \n\n              Mix the cake scraps in the bowl with a fork until mashed and then pack into a ball with your hands. Place the ball behind the bunny's body and adhere with a dab of frosting. This is the bunny's tail.\n            \n\n              Frost the entire bunny, tail and all, using 2 to 3 cups of the frosting, keeping some definition with the bunny parts and frosting more generously around any sharp edges to give a rounded look to the bunny parts. Sprinkle the bunny with the coconut to fully cover. Gently pat to adhere.\n            \n\n              Insert the biscotti between the head and body, pressing into the cake to secure them. These are the ears. Place the base of the ears close together at the center of the head and angle them out. Frost the front of each biscotti with some frosting. Then, using the pink decorating icing, frost a smaller strip in the center of each biscotti, going down to where the ears meet the head but not going all the way to the top.\n            \n\n              To make the face, press a black jelly bean into each side of the head for the eyes. Cut one of the marshmallows into 3 circles, discard the middle piece and press the 2 end circles, cut-sides in, into the front of the face for the bunny cheeks. Push the white jelly bean halves into the face below the cheeks, round-sides out, for the teeth. Place the pink jelly bean above for the nose.\n            \n\n              Unroll the licorice wheel and cut 2 pieces, each about 1 1/2 inches long. For each piece, peel the strips apart halfway down and then cut each separated strip in half lengthwise so you end up with a piece looking a bit like a broom. Repeat with the second piece of licorice. Tuck each piece, with a dab of frosting, behind a marshmallow cheek, with the cut ends facing out for the whiskers.\n            \n\n              Cut the second marshmallow in half lengthwise. Make 3 slits in each half, going about halfway through (these are the toes), and place in front of the legs for the bunny's feet. Adhere the bottom of the feet with frosting if necessary.\n            \n", "ingredients": [{"food": "sugar", "quantity": 6.0}, {"food": "butter oil", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "milk", "quantity": 2.0}, {"food": "shortening cake mix", "quantity": 2.0}, {"food": "coconut water", "quantity": 1.25}, {"food": "", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "fava beans", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1.0}], "title": "\nEaster Bunny Cake\n"}, {"directions": "\nSpecial equipment: 2 sheet pans (18 by 13 inches each) and a mandoline or vegetable slicer\n\n              Position the oven racks in the upper and lower thirds of the oven and preheat to 425 degrees F.\n            \n\n              Make the scones. Whisk the flour, 1 tablespoon of the parmesan, the baking powder, 1/4 teaspoon of the thyme, 1/4 teaspoon of salt and 1/4 teaspoon black pepper together in a large bowl. Add 3/4 cup of the cream and stir with a wooden spoon until the dough just comes together. Gather the dough into a ball, transfer it to a floured surface and pat into a 1-inch-thick square. Cut into 4 equal-sized square biscuits, reshaping if necessary, and transfer to a plate to chill.\n            \n\n              Cut the carrots into 1 1/2-inch chunks on the bias, halving any larger pieces to keep them all roughly the same size. \n            \n\n              Line one sheet pan with parchment paper and spread the carrots on half. Melt 2 tablespoons of butter in a small bowl in the microwave. Drizzle the carrots with the butter and 1/2 teaspoon salt and toss to coat. On the other side of the tray, toss the asparagus with 1 tablespoon olive oil, 1/4 teaspoon salt and some pepper and spread it evenly. Bake on the bottom rack until the vegetables are just beginning to become tender, 15 minutes. \n            \n\n              Meanwhile, slice the potatoes into 1/8-inch-thick rounds with a mandoline or a vegetable slicer and place in a medium skillet with a lid. Stir the remaining 1 cup heavy cream, the garlic, the remaining 1/4 teaspoon chopped thyme, 3/4 teaspoon salt and a pinch of pepper together in a measuring cup or bowl and pour over the potatoes. Bring to a boil over medium heat, cover the pan, and lower the heat to maintain a simmer. Cook, stirring only occasionally, until the potatoes are tender when pierced with the tip of a paring knife and the cream has thickened, 10 to 12 minutes. Remove from heat and set aside, covered. \n            \n\n              Remove the carrots from the oven and spoon the marmalade over them, stirring until completely coated. Turn the asparagus spears and return the baking sheet to the oven. \n            \n\n              Butter 1/3 of the clean sheet pan. Spoon half the potato slices into an even, overlapping layer on the buttered area and sprinkle evenly with 1 tablespoon of the Parmesan. Top with the remaining potato slices, spoon any remaining cream over, and sprinkle with the Gruyere and remaining tablespoon of Parmesan.\n            \n\n              Arrange the ham slices in a single overlapping layer down the center of the sheet pan, leaving an empty space for the biscuits. Mix the brown sugar and pineapple syrup together in a small bowl and heat in the microwave for 30 second increments, stirring in between until the sugar has melted. Spoon the glaze onto the ham slices and spread it with the back of a spoon to cover. Cut the pineapple rings in half and lay a piece on top of each ham slice. If using, place a maraschino cherry half in the center of each pineapple slice and pin it down with a clove. If not, pin the pineapple to the ham with the clove.\n            \n\n              Evenly space the chilled biscuits on the tray and brush the tops with cream. Place the tray on the higher rack of the oven. Cook both trays until the potatoes are brown and crusty on top, the carrots are glazed and fully cooked, the asparagus is tender and lightly browned, the scones are golden, and the ham and pineapple are warmed through, about 20 minutes. \n            \n\n              To serve: Stir the carrots and grate the hard-boiled egg over the asparagus. Divide evenly among 4 plates. Serve with lemon wedges and mustard on the side.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.0}, {"food": "", "quantity": 3.0}, {"food": "baking chocolate", "quantity": 1.5}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "ice cream swich", "quantity": 1.75}, {"food": "carrots", "quantity": 1.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "asparagus", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "orange", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 0.5}, {"food": "ham", "quantity": 7.0}, {"food": "sugar", "quantity": 2.0}, {"food": "syrup", "quantity": 3.0}, {"food": "maraschino cherries", "quantity": 3.0}, {"food": "cloves", "quantity": 6.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "lemon juice", "quantity": 4.0}, {"food": "", "quantity": 1}], "title": "\nEaster Dinner on Two Sheet Pans\n"}, {"directions": "\n\n              Make the cake: Preheat the oven to 350 degrees F. Lightly oil and flour two 8-inch round cake pans, tapping out any excess flour. Whisk the flour, baking powder and baking soda in a medium bowl; set aside.\n            \n\n              Melt the coconut oil and unsweetened chocolate in a small saucepan over medium-low heat, stirring occasionally; remove from the heat. Whisk the hot water and cocoa powder in a large bowl until smooth. Drizzle in the melted chocolate mixture, whisking until combined. Whisk in the granulated sugar and salt until smooth. Whisk in the eggs, one at a time, then add the vanilla. Whisk in the flour mixture just until smooth.\n            \n\n              Divide the batter between the prepared pans. Bake until the tops of the cakes spring back when lightly pressed, 30 to 35 minutes. Transfer to a rack and let cool 10 minutes in the pans, then run a knife around the edges and turn out onto the rack to cool completely.\n            \n\n              Meanwhile, make the frosting: Beat the butter and salt in a large bowl with a mixer on medium speed until creamy, about 1 minute. Reduce the speed to low and gradually beat in the confectioners' sugar. Increase the speed to medium and beat until combined. Add the vanilla and beat on medium-high speed until fluffy, 2 to 3 minutes. Beat in the milk until smooth.\n            \n\n              Assemble the cake: Trim the domed tops of the cakes using a long serrated knife; transfer the scraps to a bowl. Cut each cake into 2 equal layers (leave the layers stacked). Cut both cakes in half, about 1/2 inch off-center. You will have 4 slightly smaller half moons and 4 slightly larger ones.\n            \n\n              Stack the 4 larger half-moons, spreading frosting between the layers. Place the stack cut-side down on a piece of parchment paper. Repeat with the smaller half-moons to make another 4-layer stack, then turn the stack cut-side down and attach it to the larger stack using more frosting\n            \n\n              Trim the sides of the smaller cake sandwiches to make a slightly pointed shape. Transfer the cake scraps to the bowl.\n            \n\n              Trim the curved top of the cake so that it has an even, rounded shape; add the scraps to the bowl. Add 2 to 3 tablespoons frosting to the bowl of cake scraps and mash with a fork until moistened. Pat the scraps mixture around the top, bottom and sides of the cake to round it out and form an egg shape.\n            \n\n              Cover the entire cake in a thin layer of frosting (this is the crumb coat; it doesn¿t have to be perfect). Refrigerate until firm, about 30 minutes. Cover the cake with the remaining frosting, building out the egg shape where needed with more frosting. Cover the cake with rows of coarse sugar, nonpareils and candy-coated chocolates. Refrigerate until set, at least 20 minutes.\n            \n\n              Photograph by Yunhee Kim\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.75}, {"food": "potato flour", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 4.0}, {"food": "hot pockets ham cheese stuffed swich", "quantity": 1.25}, {"food": "onion powder", "quantity": 0.3333333333333333}, {"food": "sugar", "quantity": 2.0}, {"food": "salt", "quantity": 0.5}, {"food": "eggs", "quantity": 5.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "butter oil", "quantity": 5.0}, {"food": "salt", "quantity": 0.25}, {"food": "sugar", "quantity": 5.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "whole milk", "quantity": 3.0}, {"food": "sugar", "quantity": 1}], "title": "\nEaster Egg Cake\n"}, {"directions": "\n\n              Frost the cupcake. Top with pink sanding sugar. Place Jordan almonds on top in a flower petal pattern. Press a jujube candy in the center of the flower. Cut the fruit-by-the- foot to make the flower stem, press onto the cake.\n            \n\nVanilla Cupcakes:\n\n\n              Preheat oven to 350 degrees F. Line two 12-cup cupcake tins with paper liners. (To avoid cupcakes sticking if they overflow slightly, lightly spray the tops of the pans.) Put tins on a baking sheet. Set aside.\n            \n\n              Process sugar and butter in a food processor until very creamy, scraping sides as needed, 1 to 2 minutes. Add the eggs and yolks, one at a time, pulsing after each addition. Add the milk, water, and vanilla and process to blend.\n            \n\n              Whisk both flours, baking powder, and salt in a medium bowl. Add the dry ingredients, in 3 batches to the wet, pulsing, and then scraping batter off the sides of the processor as needed after each addition. Process until the batter is very smooth and pourable like pancake batter, about 2 minutes.\n            \n\n              Evenly pour the batter into the prepared cups, filling them 3/4 of the way full. Bake until the cakes are just firm and spring back when gently pressed, and the tops are golden, 18 to 25 minutes. Cool slightly in tin, and turn out of tin when cool enough to handle. Cool cupcakes completely on a rack before frosting.\n            \n\nFluff Frosting:\n\n\n              Whisk the milk and vanilla extract together in a small bowl.\n            \n\n              Slowly beat the butter and sugar, in another medium bowl, with an electric mixer until incorporated. Raise the speed to high and mix until light and fluffy, about 5 to 7 minutes. (Occasionally turn the mixer off, and scrape the sides of the bowl down with a rubber spatula.) Add the fluff and salt and reduce the speed to low. Add the milk and vanilla mixture, scrape the bowl down, and mix until fully incorporated. Raise the mixer to high and beat briefly until fluffy, about 1 to 2 minutes. Frost cupcake immediately.\n            \n", "ingredients": [{"food": "", "quantity": 1.0}, {"food": "", "quantity": 2.0}, {"food": "sugar", "quantity": 1}, {"food": "almonds", "quantity": 5.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "sugar", "quantity": 2.6666666666666665}, {"food": "butter oil", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "egg substitute", "quantity": 2.0}, {"food": "milk", "quantity": 0.6666666666666666}, {"food": "coconut water", "quantity": 0.6666666666666666}, {"food": "vanilla extract", "quantity": 2.5}, {"food": "potato flour", "quantity": 2.6666666666666665}, {"food": "potato flour", "quantity": 1.3333333333333333}, {"food": "baking chocolate", "quantity": 4.0}, {"food": "salt", "quantity": 0.5}, {"food": "whole milk", "quantity": 0.25}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "butter oil", "quantity": 10.0}, {"food": "sugar", "quantity": 5.0}, {"food": "", "quantity": 0.5}, {"food": "salt", "quantity": 1}], "title": "\nEaster Flower Cupcake\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F. Rinse the chicken with cool water and pat dry. Place the chicken in a roasting pan on a rack, breast side up. Sprinkle the cavity of the chicken with salt and pepper. Tuck the wing tips under the back of the chicken. \n            \n\n              Combine 4 tablespoons butter, parsley if using, 1/2 teaspoon salt and 1/4 teaspoon pepper in a small bowl. Loosen the skin on the breast of the chicken by gently wriggling fingers under the skin. Rub outside of the chicken with about 1 tablespoon of the butter mixture. Rub the remaining mixture under the skin of the chicken breast. Sprinkle chicken with additional salt and pepper. Roast the chicken for 1 hour 15 minutes. \n            \n\n              Meanwhile, melt the remaining 1 tablespoon butter in a small saucepan over medium-low heat. Add the garlic and cook, stirring, until fragrant but not browned, about 2 minutes. Spoon the garlic out of the saucepan and discard. Add the apricot preserves, mustard and vinegar and cook, stirring, until warmed through and combined, about 2 minutes. Set aside to cool until ready to glaze the chicken. \n            \n\n              Increase the oven temperature to 425 degrees F. Remove the chicken from the oven and brush evenly with the apricot glaze. Continue roasting until an instant-read thermometer stuck into the chicken thigh registers 160 degrees F, about 15 minutes more. Tip the chicken so the juices run into the pan. Transfer the chicken to a cutting board and loosely tent with foil. \n            \n\n              Pour the juices from the pan into a degreasing cup or glass measuring cup. Pour or spoon off excess fat and discard. Add the chicken broth to the roasting pan and place directly on a burner over medium heat. Add the pan drippings and cook, stirring with a wooden spoon, and scraping up any browned bits, until the mixture is hot, about 2 minutes. Strain and pour into a gravy boat and season with salt and pepper. Carve the chicken and serve with the sauce.\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 5.0}, {"food": "black bean mango", "quantity": 1}, {"food": "butter oil", "quantity": 5.0}, {"food": "parsley", "quantity": 1.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "apricot nectar", "quantity": 0.25}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}], "title": "\nEasy Apricot Glazed Chicken\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F.\n            \n\n              Roll the puff pastry into an 11-inch square. Invert a 9-inch pie plate onto the center of the square and use a paring knife to cut a circle about half an inch larger than the edge of the pie plate (save the scraps for another use). Put the circle into the pie plate. Bake until the pastry rises into a golden dome, 15 to 20 minutes. Immediately use the bottom of a heat-safe measuring cup to pat down the pastry into the bottom and sides until flat, making a crust (some small pieces of puff pastry will flake off; this is fine). Let cool completely.\n            \n\n              Make the filling: Beat the cream cheese in a large bowl with an electric mixer on medium speed until smooth. Add the sugar and vanilla and beat until incorporated. Pour in the cream and beat on medium-high speed until stiff peaks form (take care not to overbeat).\n            \n\n              Spread the jam out on the bottom of the crust and then scrape the cream filling on top of it. Spread out into an even layer. Loosely cover with plastic wrap and refrigerate for at least 2 hours. Top with berries, cut into slices and serve.\n            \n", "ingredients": [{"food": "puff pastry", "quantity": 8.0}, {"food": "macaroni cheese", "quantity": 2.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "barley flour or meal", "quantity": 0.3333333333333333}, {"food": "goji berries", "quantity": 0.5}], "title": "\nEasy Berries and Cream Pie\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Put the sorbet, sweetened condensed milk and vodka in a medium bowl. Beat with an electric mixer on low until smooth and no lumps of frozen sorbet remain, 1 to 2 minutes.\n            \n\n              Put the cream in another medium bowl and beat with an electric mixer until it is thick and holds soft peaks, 1 to 2 minutes. Fold the whipped cream into the lemon sorbet mixture and pour into the pie crust. Freeze until set, about 4 hours and up to overnight. \n            \n\n              Serve each slice garnished with a dollop of whipped cream and a lemon jelly fruit wedge.\n            \n", "ingredients": [{"food": "lemon juice", "quantity": 1.0}, {"food": "milk", "quantity": 0.75}, {"food": "", "quantity": 0.3333333333333333}, {"food": "ice cream swich", "quantity": 0.6666666666666666}, {"food": "pie crust", "quantity": 9.0}, {"food": "whipped cream substitute", "quantity": 1}, {"food": "fruit cocktail", "quantity": 2.0}], "title": "\nEasy Boozy Lemonade Pie\n"}, {"directions": "\n\n              In a small Dutch oven or a large soup pot, heat the oil over medium-high heat. Sprinkle the chicken thighs on both sides with salt and pepper; put them in the pan, fattier side down, and cook until browned on the bottom and some of the fat has rendered out, 4 minutes. Flip the thighs over, tuck the garlic in around them and cook until the garlic is browned and aromatic, about 1 minute. Pour in the chicken stock and simmer until the thighs are cooked through, about 12 minutes. Remove the thighs from the pot and cut into bite-size pieces.\n            \n\n              While the soup is cooking, cut the leaves of the escarole away from the core and wash well in cold water, especially the white part near the base, where most of the dirt collects. Tear the leaves into 2-inch pieces.\n            \n\n              Stir the escarole into the pot a handful at a time until it all fits, then cover and cook until tender, 3 minutes. Return the chicken to the pot and bring back to a simmer. Serve hot.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "garlic powder", "quantity": 6.0}, {"food": "diced chicken", "quantity": 6.0}, {"food": "escarole", "quantity": 1.0}], "title": "\nEasy Chicken-Escarole Soup\n"}, {"directions": "\n\n              Put 1 1/2 cups of the milk, the sugar, and the cocoa in a non-reactive saucepan. Bring to a simmer, over medium-high heat. Remove from the heat.\n            \n\n              Meanwhile, whisk the remaining 1/2 cup of the milk, cornstarch, salt, egg yolks, and vanilla in a bowl. Gradually whisk the hot milk into the egg mixture.\n            \n\n              Return to the saucepan to a medium-high heat, and cook, whisking constantly, until the pudding comes to a full boil. Reduce the heat to maintain a simmer, and continue whisking until thick, about 2 or 3 minutes more.\n            \n\n              Pour the pudding into 6 small cups. Cover with plastic wrap and refrigerate for at least 4 hours or ideally overnight until set.\n            \n\n              Just before serving pour the cream into a chilled bowl. Whip the confectioners' sugar into the cream with a whisk or a hand held mixer, and continue beating until soft peaks form. Take care not to over beat the cream or it will be grainy. Serve each pudding with a dollop of whipped cream on top.\n            \n\n              Copyright 2005 Television Food Network, G.P. All rights reserved.\n            \n", "ingredients": [{"food": "whole milk", "quantity": 2.0}, {"food": "sugar", "quantity": 0.5}, {"food": "onion powder", "quantity": 0.3333333333333333}, {"food": "cornstarch", "quantity": 4.0}, {"food": "salt", "quantity": 0.25}, {"food": "egg substitute", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 0.75}, {"food": "sugar", "quantity": 0.25}], "title": "\nEasy Chocolate Pudding\n"}, {"directions": "\n\n              Make the curd: Whisk the sugar, lemon zest, lemon juice and salt in a medium saucepan. Whisk the whole eggs and yolks in a small bowl, then whisk into the lemon mixture. Cook the mixture over medium heat, whisking constantly, until it's thick like pudding, 6 to 8 minutes. Remove from the heat and whisk in the butter a few pieces at a time until incorporated. Strain the mixture through a fine-mesh sieve into a small bowl, pushing it through with a rubber spatula. Press plastic wrap directly onto the surface to prevent a skin from forming. Refrigerate until completely set, at least 4 hours and up to 5 days.\n            \n\n              Make the tart: Preheat the oven to 350 degrees F. Break the graham crackers into pieces, then pulse in a food processor with the sugar until finely ground; drizzle in the melted butter and pulse to combine.\n            \n\n              Press the crumb mixture into the bottom and about 1 inch up the side of a 9-inch springform pan. Bake until golden, about 10 minutes, then transfer to a rack and let cool completely.\n            \n\n              Pour the curd into the prepared crust and gently press plastic wrap directly onto the surface to prevent a skin from forming. Refrigerate until set, at least 4 hours. Remove the springform ring and transfer the tart to a platter. Top with whipped cream.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "crackers", "quantity": 14.0}, {"food": "sugar", "quantity": 2.0}, {"food": "butter oil", "quantity": 5.0}, {"food": "", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1}, {"food": "sugar", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.5}, {"food": "hearts of palm", "quantity": 1}, {"food": "eggs", "quantity": 3.0}, {"food": "butter oil", "quantity": 4.0}], "title": "\nEasy Citrus Tart\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Combine the ginger, sugar, allspice, cloves spices, and crystallized ginger, and 2 cups of water in a medium saucepan. Bring to a boil. Remove from the heat, cover and let steep for 45 minutes. Prepare a large bowl set over an ice bath. Strain the ginger syrup into the bowl, pressing out all the liquid from the ginger. Cool to room temperature.\n            \n\n              Just before serving, stir together the ginger syrup and seltzer in a pitcher. Add the lime juice if desired. Serve over ice.\n            \n", "ingredients": [{"food": "ginger", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "allspice", "quantity": 4.0}, {"food": "cloves", "quantity": 2.0}, {"food": "ginger", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "lime juice", "quantity": 2.0}], "title": "\nEasy Ginger Beer\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Sprinkle both sides of the chicken breasts with salt and pepper.\n            \n\n              Preheat a large skillet over medium-high heat for 2 minutes. Working quickly, melt 1 tablespoon of the butter, swirling it around the pan. Add the chicken, skin side down. Add the shallots, cut side down and not overlapping. Cook until the chicken and shallots are browned on the bottom, 2 to 3 minutes. Flip the shallots and chicken, nestle in the rosemary sprigs, then carefully pour in the chicken stock.\n            \n\n              Transfer the skillet to the oven and roast until the chicken is cooked through and the shallots are tender, 12 to 14 minutes, removing the smaller pieces of chicken first as they become cooked. Transfer the chicken to a serving plate.\n            \n\n              Check the skillet with the shallots to make sure the stock has not evaporated; if less than a few tablespoons remain, add 1/2 cup more stock or water. Reduce the pan juices over medium heat until about 1/2 cup of liquid remains, about 2 minutes. Remove the skillet from the heat and stir in the remaining 2 tablespoons of butter with a wooden spoon to thicken the pan sauce until it coats the spoon. Remove the rosemary and season the sauce with salt and pepper. Spoon some of the sauce over the chicken and scallions and the rest onto the plate.\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "butter oil", "quantity": 3.0}, {"food": "lotus root", "quantity": 4.0}, {"food": "rosemary", "quantity": 2.0}, {"food": "diced chicken", "quantity": 1.25}], "title": "\nEasy Pan-Roasted Chicken and Shallots\n"}, {"directions": "\nSpecial equipment: A heatproof 1-pint jar\n\n              Combine the vinegar, 2/3 cup water, onions, salt, peppercorns and coriander in a small pot, bring to a boil, then reduce to a simmer and cook for 5 minutes.\n            \n\n              Put the jalapenos in a heatproof 1-pint jar and pour the hot pickling mixture over them. Allow them to sit and soak up the flavor for 30 minutes up to overnight-the longer they sit, the more they will soften and absorb flavor. Stored in the refrigerator, they will keep for up to 1 month.\n            \n", "ingredients": [{"food": "vinegar", "quantity": 0.6666666666666666}, {"food": "onion powder", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1.0}, {"food": "seeds", "quantity": 1.0}, {"food": "", "quantity": 5.125}], "title": "\nEasy Pickled Jalapenos\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Lay the pastry on a floured surface and cut in half. Sprinkle one piece with the almonds and some sugar; lay the other piece on top. Press together with a rolling pin to make a 6-by-14-inch rectangle. Score a 1-inch border with a knife. Pierce the middle with a fork and make small slits with a knife. Transfer to a baking sheet lined with parchment paper, brush with water and bake until golden, 20 to 25 minutes. Cool on a rack.\n            \n\n              Stir 3/4 cup sugar, 2 tablespoons water and the lemon juice in a heavy pan. Cover and cook over medium-high heat just until the sugar melts. Uncover and cook, swirling the pan, until amber, about 5 minutes. Remove from the heat; add the plums, 3 tablespoons butter and the vanilla pod and seeds. Cook over low heat, tossing, until the plums are soft and the sauce thickens, about 20 minutes. Add the remaining 3 tablespoons butter and swirl to combine.\n            \n\n              Transfer the crust to a platter. Top with the plums and half of the sauce. Serve with ice cream and the remaining sauce on the side.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "puff pastry", "quantity": 17.0}, {"food": "potato flour", "quantity": 1}, {"food": "almonds", "quantity": 0.25}, {"food": "sugar", "quantity": 0.75}, {"food": "", "quantity": 0.5}, {"food": "plums", "quantity": 2.0}, {"food": "diced chicken", "quantity": 6.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1}], "title": "\nEasy Plum Tart\n"}, {"directions": "\n\n              Place potatoes, in their skins, in cool water. Bring to a boil, then simmer until they can be pierced with a skewer, offer no resistance, and slides off easily. Remove from the water and cool completely.\n            \n\n              Lay the nuts on a sheet tray and toast in a preheated 350 degree F oven for 10 minutes or until fragrant. Cool, then chop, by hand or in a processor until they are medium to fine grind.\n            \n\n              With a table knife, remove the skin from the potatoes and grate on the large holes of a box grater, into a bowl. Also, through the small holes, grate the zucchini. Chop or slice the chives finely and add to the bowl. Add the salt and pepper, to taste, along with the egg. Combine mixture well and form into a log shape. Cut into 2-inch pieces. Press each into an oval capsule shape about 2 inches long and roll in the chopped nuts. Place on a plate until ready to cook.\n            \n\n              In a saute pan, heat 1/4 to 1/2-inch of vegetable oil, add the potato croquettes, a few at a time. Don't crowd them. Fry until the nut crust begins to brown. Remove to a paper towel lined plate when cooked, to drain. Repeat process with the remaining mixture. Serve warm.\n            \n\n              Combine the mustard and honey and serve as a dipping sauce for the croquettes.\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 2.0}, {"food": "", "quantity": 1.5}, {"food": "", "quantity": 1.0}, {"food": "chives", "quantity": 0.25}, {"food": "", "quantity": 1}, {"food": "pepper", "quantity": 1}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "bread crumbs", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "honey smoked ham", "quantity": 0.25}], "title": "\nEasy Potato Zucchini Croquettes with Honey Mustard Dipping Sauce\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Rim the glasses with the lemon halves. Place some sugar on a shallow plate and dip the tops of the glasses in it. Fill a shaker halfway with ice. Add the cognac, lemon juice and orange liqueur. Shake for 10 seconds. Strain into the sugar-rimmed glasses and enjoy!\n            \n", "ingredients": [{"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "", "quantity": 3.0}, {"food": "lemon juice", "quantity": 1.5}, {"food": "orange", "quantity": 1.5}], "title": "\nEasy Sidecar Cocktail\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F.\n            \n\n              Heat 2 tablespoons of olive oil in a 10-inch ovenproof nonstick skillet over medium-high heat. Add the garlic, onion, paprika, cayenne and 1/2 teaspoon salt and cook, stirring, until the onions are soft and just starting to turn brown, about 6 minutes. Remove from the heat and stir in the vinegar until absorbed. Transfer to a bowl and let cool.\n            \n\n              Whisk together the eggs, 1/2 cup of water and 1 teaspoon of salt in a large bowl. Add the potato chips and cooled onions and stir to combine. Let sit for a few minutes.\n            \n\n              Heat the remaining 1 tablespoon oil in the skillet over medium-high heat, then add the potato and egg mixture and cook, until the bottom and the sides set and are a light golden brown, about 3 minutes (use a rubber spatula to help pull and peek around the sides). Transfer to the oven and bake until set, 15 to 20 minutes. Let cool slightly in the pan, then slide out onto a cutting board and cut into 12 wedges. Serve at room temperature.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "paprika", "quantity": 0.5}, {"food": "pepper", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "vinegar", "quantity": 1.0}, {"food": "eggs", "quantity": 7.0}, {"food": "potato chips", "quantity": 5.0}], "title": "\nEasy Spanish Tortilla Espanola\n"}, {"directions": "\n\n              1. Heat olive oil in a medium sauce pot over medium-high heat. Add fennel, onion, garlic, 1 1/4 teaspoons salt, fennel seed, and crushed pepper, if using, and cook until vegetables soften and brown slightly, about 5 minutes. Drain and reserve juice from tomatoes, and gently crush tomatoes with your hands. Add tomatoes, increase heat to high, and cook until slightly brown, about 5 minutes.\n            \n\n              2. Add reserved juices from tomatoes, vegetable broth, tomato juice, and basil leaves. Bring to a boil, stir, reduce heat to medium low, cover and cook until vegetables are cooked through and soup reduces and thickens, about 30 minutes.\n            \n\n              3. Remove pot from stove and puree soup in batches, with an immersion, regular blender, or food processor. Stir in lemon juice and season with pepper, to taste. Serve.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "fennel seed", "quantity": 0.5}, {"food": "onion powder", "quantity": 0.5}, {"food": "garlic powder", "quantity": 4.0}, {"food": "black bean mango", "quantity": 1}, {"food": "fennel seed", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.375}, {"food": "plum", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "tomato juice", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 6.0}, {"food": "lemon juice", "quantity": 1.0}], "title": "\nEasy Tomato Soup\n"}, {"directions": "\n\n              Make Classic Chocolate Cookie dough with 3 eggs and 3/4 teaspoon baking powder total; add 6 ounces melted semisweet chocolate with the eggs. Roll into balls and bake 6 to 8 minutes at 375 degrees; cool slightly. Flip over half the cookies, top each with a marshmallow and return to the oven to soften, 2 minutes. Top with the remaining cookies.\n            \n", "ingredients": [], "title": "\nEasy Whoopie Pies\n"}, {"directions": "\n\n              Preheat the oven to 450 degrees F. Line a baking sheet with parchment and coat with cooking spray.\n            \n\n              Cook the frozen collards in a large bowl in the microwave according to package instructions. Let cool slightly.\n            \n\n              Add the beef, black beans, Italian seasoning, garlic, egg, 1/2 teaspoon salt and a few grinds of pepper. Mix with your hands until just combined. Mix with your hands until just combined. Scoop mounds of the meat mixture (about 2 tablespoons each) onto the prepared baking sheet. With damp hands, roll the mounds into balls and space them evenly apart on the baking sheet. Bake until completely cooked through, 12 to 14 minutes.\n            \n\n              Serve the meatballs with warm pasta and sauce. \n            \n", "ingredients": [{"food": "collards", "quantity": 2.0}, {"food": "frankfurter beef", "quantity": 1.0}, {"food": "fava beans", "quantity": 0.5}, {"food": "seasoning mix", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "spaghetti", "quantity": 1.0}, {"food": "", "quantity": 2.0}], "title": "\nEat-Your-Veggies Italian Meatballs\n"}, {"directions": "\n\n              Preheat the oven to 450 degrees F. Line a baking sheet with parchment and coat with cooking spray.\n            \n\n              Cook the spinach in a large bowl in the microwave according to the package instructions. Let cool slightly.\n            \n\n              Add the turkey, breadcrumbs, cumin, garlic, carrot, egg, 1 tablespoon of the dill, 1/2 teaspoon salt and a few grinds of pepper. Mix with your hands until just combined. Scoop mounds of the meat mixture (about 2 tablespoons each) onto the prepared baking sheet. With damp hands, roll the mounds into balls and space them evenly apart on the baking sheet. Bake until cooked through, 12 to 14 minutes.\n            \n\n              Meanwhile, stir together the yogurt, lemon juice and remaining dill in a small bowl. Season with salt and pepper. \n            \n\n              Serve 3 meatballs in each pita half. Pack in shredded lettuce and sliced tomatoes. Drizzle with the yogurt sauce.\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 1}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "ground turkey", "quantity": 1.0}, {"food": "", "quantity": 0.25}, {"food": "cumin seed", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "carrot juice", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "dill seed", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "silk banana-strawberry soy yogurt", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "lettuce", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}], "title": "\nEat-Your-Veggies Mediterranean Meatballs\n"}, {"directions": "\n\n              Preheat the oven to 450 degrees F. Line a baking sheet with parchment and coat with cooking spray.\n            \n\n              Add the coleslaw to a large microwave-safe bowl. Pour in 1/4 cup water, cover and cook on high until tender and translucent, about 7 minutes. Let cool slightly. \n            \n\n              Add the pork, ginger, vinegar, soy, garlic, egg, all but 1 tablespoon of the scallions, 1/2 teaspoon salt and a few grinds of pepper to the coleslaw mix. Mix with your hands until just combined. Scoop mounds of the meat mixture (about 2 tablespoons each) onto the prepared baking sheet. With damp hands, roll the mounds into balls and space them evenly apart on the baking sheet. Bake until cooked through, 12 to 14 minutes.\n            \n\n              Put 3 meatballs on each lettuce leaf, sprinkle with the reserved scallions and drizzle with garlic chili sauce. To eat, fold each leaf like a taco and dip into the ponzu sauce.\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 1}, {"food": "cheesecake mix", "quantity": 4.0}, {"food": "pork skins", "quantity": 1.0}, {"food": "ginger", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "soy sauce", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "", "quantity": 4.0}, {"food": "black bean mango", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 6.0}, {"food": "Worcestershire sauce", "quantity": 1}, {"food": "Worcestershire sauce", "quantity": 1.0}], "title": "\nEat-Your-Veggies Pork Scallion Meatballs\n"}, {"directions": "\n\n              Whisk the wasabi and the water in a small bowl to make a thick liquid; cover and set aside. Boil the beans in salted water until tender, about 4 minutes, or microwave, covered, for about 2 minutes. \n            \n\n              Halve the avocado; press your knife into the pit, and then twist, and lift it out. Scoop the flesh from the peels into the bowl of a food processor. Add the wasabi paste, edamame, ginger, lime juice, and salt and process until smooth. Transfer to a serving bowl. Stir in the scallions and cilantro. Serve with crisp vegetables, for dipping.\n            \n", "ingredients": [{"food": "onion powder", "quantity": 1.0}, {"food": "coconut water", "quantity": 2.0}, {"food": "fava beans", "quantity": 0.5}, {"food": "avocado", "quantity": 1.0}, {"food": "ginger", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "salt", "quantity": 1.5}, {"food": "martha white foods", "quantity": 4.0}, {"food": "chrysanthemum leaves", "quantity": 0.3333333333333333}], "title": "\nEda'mole\n"}, {"directions": "\n\n              Puree 1 cup cooked shelled edamame with 1 garlic clove, 2 tablespoons each lemon juice and tahini, add 1 teaspoon cumin and 1 teaspoon sesame oil; add water if needed. Season with salt. Top with sesame seeds. Serve with rice crackers.\n            \n", "ingredients": [], "title": "\nEdamame Hummus\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Boil the beans in salted water for 4 to 5 minutes, or microwave, covered, for 2 to 3 minutes.\n            \n\n              In a food processor, puree the edamame, tahini, water, lemon zest and juice, garlic, salt, cumin, and coriander until smooth. With the motor running, slowly drizzle in 2 tablespoons of the olive oil and mix until absorbed.\n            \n\n              Transfer to a small bowl, stir in the parsley and drizzle with remaining oil. Serve with the suggested vegetables, or refrigerate, covered, up to 1 day.\n            \n", "ingredients": [{"food": "fava beans", "quantity": 0.5}, {"food": "", "quantity": 0.25}, {"food": "coconut water", "quantity": 0.25}, {"food": "lemon juice", "quantity": 0.5}, {"food": "lemon juice", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "salt", "quantity": 0.75}, {"food": "cumin seed", "quantity": 0.5}, {"food": "ground turkey", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "parsley", "quantity": 1.0}, {"food": "celery seed", "quantity": 1}], "title": "\nEdamame Hummus\n"}, {"directions": "\n\n              Boil 1 1/2 cups frozen shelled edamame as the label directs; drain and rinse under cold water. Toss with 1 cup each chopped tomato and cucumber, 1 minced red jalapeno and 1/4 cup chopped red onion. Add 1 tablespoon soy sauce, 2 teaspoons each brown sugar, lemon juice, lime juice and mirin or other rice wine, 1 teaspoon each grated ginger and rice vinegar, and 1/2 teaspoon sesame oil. Toss; season with salt and pepper.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [], "title": "\nEdamame Salad\n"}, {"directions": "\n\n              1. Heat a medium pot over medium-high heat, add 1 tablespoon oil, the scallion whites, and garlic. Cook until softened, 1 minute. Add 7 cups of water, the edamame, and potato; season with salt and cover. Once the soup boils, remove the lid and cook until the edamame and potato are tender, 15 to 20 minutes. Cool slightly and then carefully blend with an immersion until smooth (or in a traditional blender in batches). Keep warm.\n            \n\n              2. Meanwhile, heat a medium skillet over medium-high heat, add the remaining 1 tablespoon oil, then add the mushrooms, ham, if using, and scallion greens. Cook until the mushrooms brown, about 3 minutes, and then add the spinach, stirring until it wilts. Remove from the heat, season with salt and pepper.\n            \n\n              3. When ready to serve, gently reheat the soup and add rice wine vinegar. Ladle soup into 4 bowls and spoon some of the mushrooms, ham, and spinach into each bowl. Drizzle in the hot sauce as desired. Serve.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "martha white foods", "quantity": 4.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "frozen yogurt", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "ham", "quantity": 0.5}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "Worcestershire sauce", "quantity": 1}], "title": "\nEdamame Soup with Mushrooms and Spinach\n"}, {"directions": "\n\n              Heat the millet in a small dry saucepan, with a tight-fitting lid, over medium-high heat, cook, shaking occasionally, until the millet begins to \"pop\". Continue toasting the millet until the popping subsides, about 2 minutes, until it smells like freshly popped popcorn. Set aside to cool slightly.\n            \n\n              Add the water and the 1/4 teaspoon of the salt to the saucepan and bring to a boil over high heat. Wrap the pan's lid tightly with a small kitchen towel and cover the saucepan. (Make sure the towel's edges are folded up well away from the heat.) Lower the heat to low and simmer covered, for 20 minutes. Remove from the heat (don't uncover) and set aside for 10 minutes. Fluff the millet with a fork and transfer to a large bowl.\n            \n\n              Using a box grater, grate the carrot and radish into the bowl of millet. Add the ginger, garlic, lime juice, mirin, and chili paste and stir to combine.\n            \n\n              Meanwhile, bring a medium pot of water to a boil and salt it generously. Add the edamame, cover, and return to a boil; cook until soft, about 5 minutes. Drain and immediately add to the bowl of millet mixture (to lightly warm the vegetables). Stir to combine and set aside to cool.\n            \n\n              When cool, season the edamame mixture with the remaining 2 teaspoons salt. Transfer to a food processor and puree into a paste. Return the edamame to the bowl and stir in the panko and egg whites until incorporated.\n            \n\n              Using your hands, form the edamame mixture into 8 patties about 3 inches in diameter. Place on a parchment paper-lined baking sheet and refrigerate until set.\n            \n\n              Place a rack about 4 inches from the broiler element and preheat. Place the patties on a foil-lined baking sheet or broiler pan. Brush both sides of the patties lightly with oil and sprinkle with salt. Broil until the tops are lightly browned, about 3 minutes. Remove from the oven and flip the patties with a spatula. Broil until lightly browned and hot, about 3 minutes more. Serve on grilled naan bread with sprouts, pickled ginger, and wasabi. (The burgers can also be grilled or sauteed.)\n            \n", "ingredients": [{"food": "millet", "quantity": 0.25}, {"food": "coconut water", "quantity": 0.5}, {"food": "salt", "quantity": 2.25}, {"food": "carrot juice", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "ginger", "quantity": 2.0}, {"food": "garlic powder", "quantity": 0.5}, {"food": "lime juice", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 0.125}, {"food": "soybeans", "quantity": 1.0}, {"food": "", "quantity": 1.5}, {"food": "egg substitute", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "garlic bread", "quantity": 1}], "title": "\nEdamame Veggie Burger\n"}, {"directions": "\n\n              Cook a 14-ounce bag of frozen edamame in boiling salted water, 4 minutes. Drain; run under cold water. Cook 3 slices chopped bacon in a skillet until crisp, 8 minutes. Add the edamame; cook over high heat until the pods brown slightly, 3 minutes. Add 2 chopped scallions; stir. Toss with the juice of 1/2 lemon.\n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [], "title": "\nEdamame With Bacon\n"}, {"directions": "\n\n              Bring a small pot of water to a boil and add the edamame. Cook until tender, about 5 minutes. Drain well and cool slightly.\n            \n\n              Place the edamame in a food processor along with the miso, 1/2 cup water, garlic, ginger, sesame oil and 2 tablespoons rice vinegar. Set aside 1 tablespoon scallion for garnish and add the rest to the food processor. Process until smooth, scraping down the sides of the bowl as needed. Season with the additional tablespoon of rice vinegar if desired.\n            \n\n              Transfer the dip to a small serving bowl and garnish with the reserved scallions and the sesame seeds if using. Serve with crackers and vegetables for dipping.\n            \n", "ingredients": [{"food": "frozen yogurt", "quantity": 12.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "garlic powder", "quantity": 1.0}, {"food": "ginger", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "sesame seeds", "quantity": 0.5}, {"food": "rice crackers", "quantity": 1}], "title": "\nEdamame and Miso Dip\n"}, {"directions": "\n\n              Soak 1 ounce dried shiitake mushrooms in 2 cups boiling water, covered, until soft, 40 minutes. Drain, reserving the liquid. Discard the stems and chop the mushrooms. Cook 2 cups sushi rice as the label directs, using 1/2 cup mushroom-soaking liquid in place of 1/2 cup water. Cook 1 1/2 cups frozen edamame in salted boiling water until tender, 6 minutes. Add the edamame and shiitakes to the rice; season with salt. \n            \n\n              Per serving: Calories: 303; Total Fat: 2 grams; Saturated Fat: 0 grams; Protein: 9 grams; Total carbohydrates: 61 grams; Sugar: 1 gram; Fiber: 4.5 grams; Cholesterol: 0 milligrams; Sodium: 123 milligrams Photograph by Con Poulos\n            \n", "ingredients": [], "title": "\nEdamame and Shiitake Rice\n"}, {"directions": "\n\n              Cook 2 slices bacon in a medium nonstick skillet over medium heat until browned and crisp, about 7 minutes. Drain on paper towels; crumble. Cook one 14-ounce bag frozen edamame in pods as the label directs. Drain, toss with the bacon and 1/4 teaspoon chili powder, and season with salt.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [], "title": "\nEdamame with Bacon\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: ruler, scissors, pizza cutter, cookie cutters, disposable pastry bags, small and medium decorating tips\n\n              For the dough: Whisk together the flour, baking soda and salt in a medium bowl. Beat together the eggs and vanilla in a small bowl.\n            \n\n              Beat the butter, granulated sugar and confectioners' sugar together, in a large bowl, with an electric mixer on low speed. Once incorporated, increase the speed to medium, and beat until slightly creamy, about 3 minutes. Stop and scrape down the sides of the bowl as needed. \n            \n\n              Reduce the speed to low again and slowly pour in the egg mixture and beat until combined. Add the flour mixture, in 3 additions, increase the speed as the dough gets thicker to keep the beaters spinning. Scrape down the sides of the bowl and the beaters themselves as needed. Once all the flour is just incorporated, increase the speed to medium-high and beat until the dough is very smooth, about 5 minutes.\n            \n\n              Turn the dough out of the bowl and bring it together. Divide into 4 even pieces (about 11 ounces). Shape each piece into a flat square and wrap in plastic wrap. Refrigerate the dough for at least 3 hours or overnight.\n            \n\n              To roll, cut and bake the cookies: Position racks in the upper and lower thirds of the oven, and preheat to 350 degrees F. Line 2 baking sheets with parchment.\n            \n\n              Dust another sheet of parchment paper with flour and put 1 piece of the dough on top. Dust with more flour and top with another sheet of parchment. Roll the dough out into a square about 1/4-inch thick and chill until firm, about 20 minutes. Repeat with the remaining 3 pieces of dough.\n            \n\n              From 1 piece of rolled dough, measure and cut 6 panels for a box: two 4- by 4-inch squares for the top and bottom, two 4- by 2-inch rectangles for the long sides and two 3 3/4- by 2-inch rectangles for the slightly shorter sides. Arrange on the prepared baking sheets, cover and refrigerate. Repeat with the remaining 3 pieces of dough. If you find you can't get all the box parts from a piece then gather the scraps, reroll and cut panels from that. \n            \n\n              Bake, rotating the baking sheets front to back and bottom to top about halfway through, until golden brown around the edges, about 20 minutes. Let cool completely on the baking sheets on a cooling rack, about 30 minutes. Nice, straight sides make the boxes easier to assemble, so after cooling, use a fine kitchen rasp to file the edges until squared and straight.\n            \n\n              Meanwhile, make the royal icing: Combine the confectioners' sugar and meringue powder in a large bowl. Add 5 tablespoons water and beat with an electric mixer on medium-high speed until the icing forms thick and glossy peaks, about 2 minutes (adding up to 1 tablespoon more water, if needed). Remove 2 cups to thicken and transfer the rest into an airtight container with plastic wrap pressed on to the surface of the icing. \n            \n\n              Thicken the royal icing: Thicken the 2 cups of the royal icing by beating in tablespoons of extra confectioners' sugar until the mixture is the consistency of caulk. Fit a pastry bag with a medium round tip and fill it with the thickened icing.\n            \n\n              Build the boxes: Put a 4- by 4-inch panel flat-side up on a work surface and pipe the thickened icing around the perimeter. Push a long edge of a 4- by 2-inch side panel into the icing on any side you'd like (make sure the golden top is facing out). You can use a can to help prop the panel up. Push the other 4- by 2-inch side panel directly opposite of the first. Now do the same with the remaining 3 3/4-inch by 2-inch side panels. Pipe more thickened royal icing up the 4 corners to help the side panels adhere to one another. Then pipe some around the top perimeter of the box. Let the boxes dry for 24 hours before adding the decorations.\n            \n\n              When dry, use a paring knife to trim off excess overflowing icing so the outside of the box has a clean finish.\n            \n\n              Decorate: Fit small round tips into piping bags. Divide the remaining royal icing into batches and color as desired. Fill bags with icing and pipe neat lines along the seams of the box first. Then go back and pipe little dots along the piped lines to create more interest. At this point, you can decorate the box and lid however you want. Do some pencil sketches on paper first to get an idea of what you might like. Then go for it.\n            \n\n              Let the icing dry thoroughly for at least 24 hours. Fill with treats of your choosing, tie with a ribbon and present.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 4.25}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 0.25}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "butter oil", "quantity": 3.0}, {"food": "sugar", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "sugar", "quantity": 1.0}, {"food": "onion powder", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}], "title": "\nEdible Gift Boxes\n"}, {"directions": "\n\n              Heat 1 tablespoon vegetable oil in a skillet over high heat. Add the mushrooms and 1/2 teaspoon sugar and saute until golden, 3 minutes. Add the broth and 2 teaspoons soy sauce. Mix the cornstarch with 1/4 cup water; stir into the skillet and boil until thickened, 2 minutes.\n            \n\n              Heat 1 tablespoon vegetable oil in another skillet over high heat. Add the onion and the remaining 1 teaspoon sugar and cook until tender, 4 minutes. Add the bacon and cook 2 minutes. Add the peas, half of the scallions and the remaining 1 1/2 teaspoons soy sauce; cook 1 more minute. Transfer to a bowl and combine with the beaten eggs.\n            \n\n              Wipe out the skillet. Return to high heat and add 1/4 inch of vegetable oil. Add one-fourth of the egg mixture; spoon some of the hot oil on top and cook until puffy, 1 to 2 minutes. Flip and cook 1 minute, then drain on paper towels. Repeat to make 3 more omelets. Add the sesame oil to the mushroom gravy and pour over the omelets. Garnish with the remaining scallions.\n            \n\n              Photograph by Antinos Achilleos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 6.0}, {"food": "sugar", "quantity": 1.5}, {"food": "diced chicken", "quantity": 1.0}, {"food": "soy sauce", "quantity": 3.5}, {"food": "cornstarch", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "diced chicken", "quantity": 6.0}, {"food": "pigeon peas", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "eggs", "quantity": 6.0}, {"food": "vegetable oil", "quantity": 1.0}], "title": "\nEgg Foo Yong\n"}, {"directions": "\n\n              Pulse 2 peeled hard-boiled eggs in a food processor with 1 tablespoon mayonnaise, 1/2 teaspoon dijon mustard and a pinch each of salt and cayenne pepper until smooth. Transfer to a resealable plastic bag and snip a corner. Pipe into 12 pickled Peppadew peppers; sprinkle with paprikaand chopped chives.\n            \n", "ingredients": [], "title": "\nEgg Salad-Stuffed Peppadews\n"}, {"directions": "\n\n              Position a rack about 6-inches from the broiler, and preheat the broiler to high heat.\n            \n\n              Shear off the corn kernels with a sharp knife over a bowl¿you should have about 1/2 cup.\n            \n\n              Cook the turkey bacon in a medium nonstick skillet until crisp and brown on both sides, about 4 minutes. Transfer to a paper-towel lined plate, and set aside. Add the corn and 1 tablespoon of olive oil and cook until the corn is brown and begins to pop, about 4 minutes. Pour in the salsa verde and heat until simmering. Pour salsa into a bowl, crumble the bacon and add to the salsa. (Wipe out the skillet.)\n            \n\n              Warm the skillet over medium-low heat. Whisk the egg whites in a large bowl until foamy and doubled in volume; season with salt and pepper and whisk in the cilantro. Add the remaining 1 tablespoon olive oil to the skillet. Pour the whites into the skillet and swirl to cover entire skillet. Cook, without stirring, until the whites are almost set and light brown on the bottom, about 3 minutes.\n            \n\n              Place the skillet under the broiler and cook until the omelet sets and begins to brown, about 30 seconds. Spoon half of the salsa onto half of the omelet and fold the omelet over the filling. Transfer omelet to a serving platter and finish with the remaining salsa on top.\n            \n", "ingredients": [{"food": "corn bran", "quantity": 1.0}, {"food": "turkey bacon", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 0.3333333333333333}, {"food": "black bean mango", "quantity": 1}, {"food": "egg substitute", "quantity": 10.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}], "title": "\nEgg White Omelet with Corn, Turkey Bacon, and Green Salsa\n"}, {"directions": "\n\n              Position an oven rack 6-inches from the broiler, and preheat the broiler to high heat.\n            \n\n              Toss the cucumber, vinegar, and 1 tablespoon of the olive oil together. Season with salt and pepper and set aside.\n            \n\n              Warm a medium nonstick skillet over medium-low heat. Whisk the egg whites in a large bowl until foamy and doubled in volume; season with salt and pepper and whisk in the dill. Add the remaining 1 tablespoon olive oil to the skillet. Pour the whites into the skillet and swirl to cover entire skillet. Cook, without stirring, until the whites are almost set and light brown on the bottom, about 3 minutes.\n            \n\n              Place the skillet under the broiler and cook until the omelet sets and begins to brown, about 30 seconds. Spoon half of the cucumber salad onto half of the omelet and fold the omelet over the filling. Transfer omelet to a serving platter and scatter the remaining cucumber salad on top. Serve with the smoked salmon on the side.\n            \n\n              Copyright 2005 Television Food Network, G.P. All rights reserved.\n            \n\n              Yield: 2 servings\n            \n\n              Prep Time: 10 minutes\n            \n\n              Cook Time: 3 1/2 minutes\n            \n\n              Ease of preparation: easy\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "egg substitute", "quantity": 10.0}, {"food": "dill seed", "quantity": 2.0}, {"food": "smoked turkey roll", "quantity": 3.0}], "title": "\nEgg White Omelet with Cucumbers and Smoked Salmon\n"}, {"directions": "\n\n              Heat 2 tablespoons olive oil in a large skillet over medium heat. Add the broccolini, garlic, 2 tablespoons water, 1/2 teaspoon salt, and pepper to taste. Cover and cook, stirring occasionally, until the broccolini is tender, 8 to 10 minutes. Remove from the heat; keep warm.\n            \n\n              Whisk the eggs, 2 tablespoons water, and salt and pepper to taste in a medium bowl. Heat the remaining 1 tablespoon olive oil in a medium nonstick skillet over medium-low heat. Add the egg mixture and cook, stirring gently with a rubber spatula, until just cooked through, 3 to 4 minutes.\n            \n\n              Divide the cheese, broccolini and scrambled eggs among the rolls. Top with pepperoncini and drizzle with pepperoncini brine. Serve with chips.\n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "", "quantity": 1.75}, {"food": "garlic powder", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "eggs", "quantity": 6.0}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "pizza rolls", "quantity": 4.0}, {"food": "dessert topping", "quantity": 1}, {"food": "potato chips", "quantity": 1}], "title": "\nEgg and Broccolini Sandwiches\n"}, {"directions": "\n\n              Heat 1 1/2 tablespoons butter in a large nonstick skillet over medium heat. Add the hash browns and cook, stirring occasionally, until golden brown, about 15 minutes.\n            \n\n              Meanwhile, heat the remaining 1/2 tablespoon butter in a small saucepan over medium-high heat. Add the onion and cumin and cook, stirring occasionally, until the onion is softened, about 5 minutes. Add the beans and salsa, reduce the heat to low and cook until heated through, about 2 minutes.\n            \n\n              Lightly beat the eggs in a bowl with 1/2 teaspoon salt, and pepper to taste. Pour into the skillet with the hash browns and cook, stirring, until the eggs are almost set, about 2 minutes. Stir in half of the cheese and cook until the eggs are just set, about 1 more minute. Divide among the tortillas and top with the bean salsa, avocado, cilantro and remaining cheese.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "butter oil", "quantity": 2.0}, {"food": "frozen yogurt", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "cumin seed", "quantity": 0.5}, {"food": "fava beans", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "eggs", "quantity": 8.0}, {"food": "salt", "quantity": 1}, {"food": "macaroni cheese", "quantity": 0.3333333333333333}, {"food": "potato flour", "quantity": 8.0}, {"food": "avocado", "quantity": 1.0}, {"food": "", "quantity": 0.25}], "title": "\nEgg and Hash Brown Tacos\n"}, {"directions": "\n\n              Heat 2 tablespoons olive oil in a large nonstick skillet over medium-high heat. Add the potato and cook, tossing, until browned and beginning to soften, 4 to 5 minutes. Add the sliced pepper and onion and season with salt. Cook, tossing occasionally, until the potato is cooked through and the pepper and onion are browned but not completely soft, 8 to 10 minutes. \n            \n\n              Meanwhile, beat the eggs in a bowl and season with salt. Reduce the heat to low and give the pan a moment to cool. Pour in the eggs and cook, stirring constantly, until just set, 2 to 3 minutes. Remove from the heat. \n            \n\n              Toss the arugula with the remaining 2 teaspoons olive oil and the vinegar in a bowl. Season with salt. Fill each roll with the scrambled eggs, cheese, if desired, and the arugula.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "potato flour", "quantity": 1.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "eggs", "quantity": 6.0}, {"food": "arugula", "quantity": 4.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "pizza rolls", "quantity": 4.0}, {"food": "macaroni cheese", "quantity": 4.0}], "title": "\nEgg and Potato Sandwiches\n"}, {"directions": "\nSpecial equipment: a plastic piping bag or resealable plastic bag; a paring knife or fluted pasta cutter\n\n              Melt 2 tablespoons butter in a medium skillet over medium heat until foamy. Add the garlic and cook until it starts to become golden, about 2 minutes. Stir in the spinach and 1/4 cup water. Cook, stirring often, until the spinach is tender and the liquid has evaporated, about 5 minutes. Transfer to a food processor and add the ricotta, mozzarella, Parmesan and 1/2 teaspoon each salt and pepper. Puree until smooth and bright green. Spoon into a plastic pastry bag or large resealable plastic bag, snip the tip to 1/4 inch wide and set aside.\n            \n\n              Put 8 pieces of pasta on a clean work surface and pipe a circle of the spinach mixture in the middle of each square, making sure to leave about a 1-inch border all around. Using the back of a spoon, make a well in the middle deep enough to hold an egg yolk. One by one, separate 8 eggs and put a yolk in each well. (Reserve the whites for another use.)\n            \n\n              Crack the remaining egg into a small bowl and beat lightly with a fork. Brush the edges of the pasta pieces with the egg, and then top with the remaining squares of pasta. Working from the edge of the filling outward, firmly press the dough together, making sure there are no air bubbles. Trim the edges of each ravioli with a sharp knife or a fluted pasta cutter.\n            \n\n              Bring a large pot of salted water to a boil. Melt the remaining 6 tablespoons butter in a small skillet with the sage leaves over medium heat and cook, swirling often, until the butter is golden brown and the sage is fried and crisp, about 4 minutes. Set aside. Gently drop the ravioli into the water and cook until the pasta is tender and the egg is still runny, about 6 minutes.\n            \n\n              Remove from the water with a slotted spoon or handheld strainer and place each ravioli in an individual bowl. Top each with a sage leaf and evenly spoon the butter over. Serve immediately.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 8.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "mustard spinach", "quantity": 10.0}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 8.0}, {"food": "eggs", "quantity": 9.0}, {"food": "chrysanthemum leaves", "quantity": 8.0}], "title": "\nEgg-Stuffed Ravioli\n"}, {"directions": "\n\n              Put the eggs and turnips in a saucepan, cover with water and bring to a boil. Remove from the heat and let stand, covered, 10 minutes. Remove the eggs but keep the turnips in the hot water, covered, until tender, 2 to 3 more minutes. Peel the eggs and cut into quarters.\n            \n\n              Drain the turnips, then return to the warm pan and toss with the butter (turn on the heat to melt the butter if needed). Add the tarragon, chives, olive oil and lemon juice and toss.\n            \n\n              Toss the endive, lettuce, escarole, celery and beans in a large\n            \n\n              bowl and season with salt and pepper. Add the eggs and turnip mixture and gently toss again.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "eggs", "quantity": 6.0}, {"food": "turnips", "quantity": 1.0}, {"food": "butter oil", "quantity": 3.0}, {"food": "", "quantity": 2.0}, {"food": "chives", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "endive", "quantity": 2.0}, {"food": "lettuce", "quantity": 2.0}, {"food": "escarole", "quantity": 0.5}, {"food": "celery seed", "quantity": 2.0}, {"food": "fava beans", "quantity": 1.0}, {"food": "salt", "quantity": 1}], "title": "\nEgg-and-Bean Dinner Salad\n"}, {"directions": "\n\n              Combine the kimchi, vinegar and 1/2 cup water in a blender and process until very smooth.\n            \n\n              Toss the rice, half of the kimchi sauce and 1/2 teaspoon salt together in a medium bowl. Cover and microwave until hot, stirring halfway through, about 4 minutes.\n            \n\n              Meanwhile, cook the bacon in a large nonstick skillet over medium heat until browned and crispy, 4 to 5 minutes per side. Transfer to a paper towel-lined plate to drain and then roughly chop.\n            \n\n              Wipe out the skillet the bacon cooked in. Add the vegetable oil and place it over medium-high heat. Crack the eggs into the skillet and sprinkle each with a little salt. Cook until the whites are set and the yolks are still runny, about 4 minutes. Remove from the heat.\n            \n\n              Divide the hot rice among 4 bowls. Top each with an egg, avocado, bacon, the remaining kimchi sauce and scallion. Drizzle each with 1/2 teaspoon of sesame oil.\n            \n", "ingredients": [{"food": "", "quantity": 2.0}, {"food": "vinegar", "quantity": 0.3333333333333333}, {"food": "crisped rice bar", "quantity": 6.0}, {"food": "salt", "quantity": 1}, {"food": "bacon", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "eggs", "quantity": 4.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 2.0}], "title": "\nEgg-and-Kimchi Rice Bowls\n"}, {"directions": "\n\n              Cut a 2-inch round from the center of the bread, reserving the round. Melt a nut size bit of butter in a small nonstick skillet over medium heat. Place the slice of bread and the round in skillet and toast lightly, about 1 minute. Crack the egg into the hole and season with salt and pepper, and cook until golden brown, about 2 minutes. Add remaining the rest of the butter as needed to brown and crisp the toast. Flip the egg and round, season with salt and pepper. Cook another 2 minutes for a runny yolk, or slightly longer for a set egg.\n            \n\n              Transfer egg-in-the-hole to a plate and sprinkle with paprika, if desired. Serve and use the toasted round for dipping into the yolk.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "paprika", "quantity": 1}], "title": "\nEgg-in-the-Hole\n"}, {"directions": "\n\n              Put 2 cups of the milk, both citrus zests, and the vanilla bean and tar in a medium saucepan. Bring to a simmer over medium heat. Meanwhile, whisk the egg yolks and the 1/2 cup sugar in a medium bowl until lightened in color.\n            \n\n              Gradually pour the hot milk into the eggs while whisking constantly. Return the egg mixture to the pan and set over medium heat. Stir constantly with a wooden spoon in a figure 8 motion until the custard thickens slightly and coats the back of the spoon, about 2 to 3 minutes. Remove from heat and immediately stir in the remaining cup milk to stop the cooking. Transfer custard to a large bowl; cool to room temperature. (To speed this up, set bowl in another bowl of ice.)\n            \n\n              Put about 1 inch of water in a saucepan and bring to a simmer over medium heat. Put the egg whites and remaining 2 tablespoons sugar in a heatproof bowl large enough to rest in the saucepan without touching the water. Set the bowl over the simmering water and beat until the sugar dissolves and the egg whites feel warm to the touch, about 1 minute. Remove from the heat and beat the whites with an electric mixer until they hold a soft peak, about 3 minutes. Fold the egg whites into custard mixture. Add the rum and bourbon, cover, and refrigerate until ready to serve.\n            \n\n              Transfer eggnog to a punch bowl or pitcher. Pour into small cups and garnish with freshly grated nutmeg and citrus zest. Drink.\n            \n", "ingredients": [{"food": "milk", "quantity": 3.0}, {"food": "orange", "quantity": 1.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "egg substitute", "quantity": 4.0}, {"food": "sugar", "quantity": 0.5}, {"food": "egg substitute", "quantity": 2.0}, {"food": "martha white foods", "quantity": 0.6666666666666666}, {"food": "", "quantity": 2.0}, {"food": "nutmeg", "quantity": 1}, {"food": "orange", "quantity": 1}], "title": "\nEggnog\n"}, {"directions": "\nSpecial equipment: Milk frother or Immersion blender\n\n              In a nonstick saucepan combine 2 cups of the milk, the orange zest, and cinnamon. Heat over medium-high heat until just below a boil. Remove from the heat and set aside for 30 minutes to steep. Refrigerate the remaining cup of milk. \n            \n\n              Reheat the milk mixture to a simmer over medium heat. Meanwhile, in a medium bowl whisk together the eggs and sugar. Gradually pour half the hot milk into the egg mixture while whisking constantly. Pour the hot egg mixture back into the milk and cook the custard over low heat, stirring constantly until thickened, about 4 minutes. Don't let the custard boil. Strain custard into a bowl. Discard the cinnamon and orange zest. Add the vanilla to the custard and set aside to cool to room temperature, then refrigerate until cold. \n            \n\n              When ready to serve, foam the reserved cold milk with a milk frother or immersion blender, and fold into the custard. Serve eggnog in cups dusted with cinnamon. \n            \n", "ingredients": [{"food": "milk", "quantity": 3.0}, {"food": "orange", "quantity": 2.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "sugar", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "cinnamon", "quantity": 1}], "title": "\nEggnog - Slimmed\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 375 degrees F and line 2 baking sheets with parchment paper.\n            \n\n              Whisk together the flour, baking powder and salt in a medium bowl until combined. Beat the butter and 1/2 cup of the sugar with an electric mixer on medium speed in a large bowl until creamy, about 1 minute. Add the cream, rum extract, cloves, egg yolk and 2 teaspoons of the nutmeg and beat until smooth. Add the flour mixture and mix on low speed until the dough just combines.\n            \n\n              Roll the dough into twenty-four 1-inch balls using a 1/2-ounce ice cream scoop or a tablespoon. Combine the remaining 1/4 cup sugar and 2 teaspoons nutmeg in a small bowl. Roll the balls in the spiced sugar to coat, and then arrange 2 inches apart on the prepared baking sheets.\n            \n\n              Bake the cookies, rotating the baking sheets front to back and top to bottom halfway through, until golden brown at the edges, about 14 minutes. Remove the baking sheets from the oven, place on wire racks and immediately press a chocolate drop in the center of each cookie while it is still soft and warm. Do not move the cookies until the chocolate has completely set and the cookies are cool, at least 1 hour.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.25}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 0.75}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "cloves", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "nutmeg", "quantity": 4.0}, {"food": "baking chocolate", "quantity": 24.0}], "title": "\nEggnog Blossoms\n"}, {"directions": "\n\n              Make the cake: Preheat the oven to 350 degrees F. Coat a 9-inch springform pan with cooking spray. Whisk the flour, baking powder, nutmeg, cinnamon, baking soda and salt in a medium bowl. Beat the butter and granulated sugar in a large bowl with a mixer on medium-high speed until light and fluffy, about 3 minutes. Beat in the eggs, egg yolk and vanilla until combined.\n            \n\n              Reduce the mixer speed to low and add the flour mixture in three batches,\n            \n\n              alternating with the sour cream in two batches. Increase the mixer speed to medium high and beat until well combined, about 30 seconds. Transfer the batter to the prepared pan; set aside.\n            \n\n              Make the topping: Combine the flour, brown sugar, cinnamon, nutmeg and salt in a medium bowl. Work in the butter with your fingers until clumpy. Scatter the topping over the cake batter. Bake until golden brown and a toothpick inserted into the center comes out clean, 1 hour to 1 hour 10 minutes. Transfer to a rack and let cool 20 minutes, then remove the springform ring and let cool completely.\n            \n\n              Make the glaze: Whisk the confectioners' sugar with 3 tablespoons eggnog in a medium bowl until smooth. If the glaze is too thick, gradually whisk in the remaining 1 tablespoon eggnog as needed. Drizzle the glaze over the cake before serving.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "nutmeg", "quantity": 1.0}, {"food": "cinnamon", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 10.0}, {"food": "sugar", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "sour cream", "quantity": 1.0}, {"food": "potato flour", "quantity": 0.75}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "cinnamon", "quantity": 0.5}, {"food": "nutmeg", "quantity": 0.25}, {"food": "hearts of palm", "quantity": 1}, {"food": "butter oil", "quantity": 5.0}, {"food": "sugar", "quantity": 1.5}, {"food": "eggnog", "quantity": 3.0}], "title": "\nEggnog Coffee Cake\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Line a 9-by-13-inch baking dish with foil, leaving a 2-inch overhang on 2 sides; coat with cooking spray.\n            \n\n              Whisk the flour, nutmeg and salt in a medium bowl. Whisk the melted butter, granulated sugar, eggs, egg yolks, brandy and vanilla in a large bowl until smooth. Whisk in the flour mixture until smooth. Spread the batter in the prepared baking dish. Bake until the top is shiny and slightly cracked, about 40 minutes. Let cool completely in the pan.\n            \n\n              Lift the bars out of the pan using the foil overhang; dust with confectioners' sugar and sprinkle with nutmeg. Slice into 1 1/2-inch squares.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 2.5}, {"food": "nutmeg", "quantity": 0.75}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 2.5}, {"food": "sugar", "quantity": 1.75}, {"food": "eggs", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "sugar", "quantity": 1}], "title": "\nEggnog Cookie Bars\n"}, {"directions": "\n\n              Sift the flour, 1 teaspoon nutmeg, 1/2 teaspoon cinnamon and the salt into a large bowl. Beat the butter and granulated sugar in a separate large bowl with a mixer on medium-high speed until light and fluffy, 3 to 5 minutes. Beat in the whole egg, egg yolk, the brandy and vanilla. Reduce the mixer speed to low; add the flour mixture in 2 batches and beat until just incorporated. Divide the dough in half, wrap in plastic wrap and refrigerate until firm, 1 hour.\n            \n\n              Line 2 baking sheets with parchment paper. Dust each piece of dough with flour and roll out between pieces of parchment to 1/4 inch thick. Refrigerate 15 minutes. Cut into shapes and transfer to the baking sheets. Gather the scraps and refrigerate until firm; reroll once to cut out more cookies. Chill the cutouts 30 minutes.\n            \n\n              Position racks in the upper and lower thirds of the oven; preheat to 350 degrees F. Bake the cookies, switching the pans halfway through, until just golden, 11 to 13 minutes. Let cool 5 minutes, then transfer to racks to cool completely.\n            \n\n              Make the icing: Beat the confectioners' sugar, meringue powder, the remaining 1/4 teaspoon each cinnamon and nutmeg, and 3 to 4 tablespoons water with a mixer on high speed until smooth and thick. Transfer to a resealable bag and snip a small corner; pipe onto the cookies and decorate with nonpareils. Let set 30 minutes.\n            \n\n              Photograph by Andrew Purcell\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.5}, {"food": "nutmeg", "quantity": 1.25}, {"food": "cinnamon", "quantity": 0.75}, {"food": "salt", "quantity": 0.5}, {"food": "turkey sticks", "quantity": 2.5}, {"food": "sugar", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "onion powder", "quantity": 2.0}, {"food": "", "quantity": 1}], "title": "\nEggnog Cutouts\n"}, {"directions": "\n\n              Preheat the oven to 325 degrees F. Stir the sugar and 2 tablespoons water in a medium skillet. Bring to a boil over medium-high heat and cook, swirling the pan but not stirring, until deep amber, 5 to 7 minutes. Pour the caramel into a shallow 10-inch-round cake pan, tilting the pan so the caramel evenly coats the bottom.\n            \n\n              Bring a kettle of water to a boil. Whisk the eggnog and eggs in a large bowl until smooth, being careful not to beat in too much air. Pour the eggnog mixture over the caramel in the pan, then place in a large roasting pan. Fill the roasting pan with enough boiling water to come halfway up the side of the cake pan.\n            \n\n              Loosely cover the roasting pan with foil and bake 1 hour. Remove the foil and continue baking until the custard is set but still quivers, 40 minutes to 1 hour.\n            \n\n              Remove the flan from the roasting pan and let cool to room temperature, then cover and refrigerate until cold and set, about 2 hours. To serve, run a thin knife around the edge of the flan, place an inverted flat plate over the pan and flip to unmold.\n            \n\n              Photograph by Andrew Mccaul\n            \n", "ingredients": [{"food": "sugar", "quantity": 0.6666666666666666}, {"food": "eggnog", "quantity": 4.0}, {"food": "eggs", "quantity": 5.0}], "title": "\nEggnog Flan\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Line 2 baking sheets with parchment.\n            \n\n              Put the almonds and 1/2 cup of the confectioners' sugar in the bowl of a food processor and process until very finely ground, about 2 minutes. Add the butter and process until smooth, 30 seconds to 1 minute. Scrape the dough off the inside of the bowl if needed. Add the bourbon and rum and vanilla extracts and pulse until smooth. Add the flour and salt and pulse until the dough forms a ball.\n            \n\n              Roll mounded teaspoons of the dough into balls about 1 inch wide and place on the prepared baking sheets about 1 inch apart. Refrigerate for 30 minutes.\n            \n\n              Meanwhile, position oven racks in the top and bottom thirds of the oven and preheat to 350 degrees F.\n            \n\n              Bake, rotating the baking sheets from top to bottom and front to back halfway through, until the cookies are firm when gently pressed, completely dry and just beginning to crack at the top, 20 to 25 minutes. Cool the cookies on the sheets for 5 minutes; they will firm as they cool.\n            \n\n              Meanwhile, put the nutmeg and remaining 1 1/2 cups confectioners' sugar in a pie plate or wide baking dish and mix well. Toss the warm cookies very gently in the sugar mixture until evenly coated; the cookies need to be warm for the first coating of sugar to stick. Cool the cookies on a wire rack completely, about 30 minutes, then toss again in the sugar mixture so they are very white. Sprinkle with additional grated nutmeg.\n            \n\n              Store the cookies in a little bit of extra confectioners' sugar in an airtight container for up to a week.\n            \n", "ingredients": [{"food": "almonds", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "potato flour", "quantity": 2.25}, {"food": "salt", "quantity": 0.5}, {"food": "nutmeg", "quantity": 1.0}], "title": "\nEggnog Meltaway Cookies\n"}, {"directions": "\n\n              Make the cake: Preheat the oven to 350 degrees F. Coat two 8-inch-round cake pans with cooking spray and line the bottoms with parchment paper. Lightly coat the parchment with cooking spray and dust the pans with flour, tapping out the excess. Sift the flour, cornstarch, salt and pumpkin pie spice together into a medium bowl; set aside.\n            \n\n              Beat the egg yolks and 1/2 cup superfine sugar in a large bowl with a mixer on medium speed until very thick and light in color, 3 to 5 minutes. (The yolks should fall in a thick ribbon when the beaters are lifted.) Add half of the flour mixture and fold in with a rubber spatula until just incorporated. Add the melted butter, vanilla and the remaining flour mixture and fold until the batter is smooth and elastic. Divide the batter between the prepared pans, spreading it to the edges (the layers will be thin).\n            \n\n              Make the meringue: Beat the egg whites and cream of tartar in a separate large bowl with the mixer (and clean beaters) on medium speed until foamy, 1 to 2 minutes. Increase the speed to medium high and beat, slowly adding the remaining 1 cup superfine sugar, until stiff glossy peaks form, about 5 more minutes. Divide the meringue between the pans on top of the cake batter, spreading it to the edges; sprinkle with the almonds. Bake until the meringue is browned and crisp, 35 to 40 minutes. (The layers will puff and then collapse as they bake.) Transfer to a rack and let cool in the pans.\n            \n\n              Meanwhile, make the filling: Put the white chocolate in a small microwave-safe bowl and microwave in 30-second intervals, stirring, until smooth and melted; set aside. Beat 2/3 cup heavy cream and 1 tablespoon superfine sugar in a medium bowl with a whisk until stiff peaks form; set aside. In a separate medium bowl, combine the cream cheese and the remaining 1 tablespoon superfine sugar with a rubber spatula; mix in the remaining 2 tablespoons heavy cream, the vanilla and nutmeg, then stir in the melted white chocolate. Fold in the whipped cream. Refrigerate until firm but not completely set, 30 to 45 minutes.\n            \n\n              Run a thin knife around the edges of the cakes and invert onto a cutting board; peel off the parchment. Place 1 cake, meringue-side down, on a flat platter. Spread the filling on the cake, then top with the second cake layer, meringue-side up, pressing gently. (If you're not serving it right away, refrigerate up to 1 day; bring to room temperature before serving.)\n            \n\n              Photograph by Johnny Miller\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 0.75}, {"food": "cornstarch", "quantity": 1.0}, {"food": "salt", "quantity": 0.25}, {"food": "pumpkin pie spice", "quantity": 0.25}, {"food": "eggs", "quantity": 5.0}, {"food": "sugar", "quantity": 1.5}, {"food": "butter oil", "quantity": 4.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.3333333333333333}, {"food": "", "quantity": 1}, {"food": "baking chocolate", "quantity": 4.0}, {"food": "ice cream swich", "quantity": 0.6666666666666666}, {"food": "sugar", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "nutmeg", "quantity": 0.25}], "title": "\nEggnog Meringue Cake\n"}, {"directions": "\n\n              Mix the mustard and mayonnaise in a small bowl. Lay out 3 slices of bread and brush each with about 1 teaspoon of the mustard mixture. Top each piece of bread with 1 slice each of cheese, turkey and ham. Cover with another slice of bread and brush with another teaspoon of the mustard mixture; top each sandwich with another slice each of cheese, turkey and ham. Brush the remaining 3 bread slices with the mustard mixture and place mustard-side down on top of the sandwiches.\n            \n\n              Trim the crusts, then wrap the sandwiches tightly with plastic wrap. Chill in the refrigerator at least 30 minutes and up to 6 hours. (Wrapping the sandwiches helps keep them compact.)\n            \n\n              Whisk the eggnog and nutmeg in a shallow bowl. Unwrap the sandwiches and dip in the eggnog, turning to coat both sides. Melt half of the butter in a large nonstick skillet over medium heat. Add the sandwiches and cook until the undersides are golden, 3 to 4 minutes. Add the remaining butter, flip the sandwiches and cook until golden on the other side, about 3 more minutes.\n            \n\n              Cut the sandwiches into quarters. Dust with confectioners' sugar, if desired, and serve with cranberry sauce.\n            \n\n              Photograph by Andrew Mccaul\n            \n", "ingredients": [{"food": "mustard spinach", "quantity": 1.5}, {"food": "mayonnaise dressing", "quantity": 1.5}, {"food": "garlic bread", "quantity": 9.0}, {"food": "macaroni cheese", "quantity": 6.0}, {"food": "smoked turkey roll", "quantity": 6.0}, {"food": "ham", "quantity": 6.0}, {"food": "eggnog", "quantity": 0.5}, {"food": "hearts of palm", "quantity": 1}, {"food": "butter oil", "quantity": 3.0}, {"food": "sugar", "quantity": 1}, {"food": "Worcestershire sauce", "quantity": 1}], "title": "\nEggnog Monte Cristos\n"}, {"directions": "\n\n              Whisk the eggs in a large bowl. Whisk in the half-and-half, eggnog, granulated sugar, brown sugar, vanilla, 1 teaspoon nutmeg, the cinnamon and salt. Arrange the challah slices in 2 lengthwise rows in a 9-by-13-inch baking dish, shingling the slices. Pour the egg mixture all over the challah and gently press down. Cover with plastic wrap and refrigerate overnight.\n            \n\n              Preheat the oven to 350 degrees F. Combine the turbinado sugar and remaining 1/2 teaspoon nutmeg in a small bowl. Uncover the challah and sprinkle with the sugar mixture. Bake until browned and puffed, 35 to 40 minutes. Let sit 10 minutes. Dust with confectioners' sugar. Serve with whipped cream and/or syrup.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "eggs", "quantity": 8.0}, {"food": "", "quantity": 2.0}, {"food": "eggnog", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "sugar", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "nutmeg", "quantity": 1.5}, {"food": "cinnamon", "quantity": 0.5}, {"food": "salt", "quantity": 0.25}, {"food": "barbecue loaf", "quantity": 1.0}, {"food": "sugar", "quantity": 3.0}, {"food": "sugar", "quantity": 1}, {"food": "ice cream swich", "quantity": 1}], "title": "\nEggnog Overnight French Toast\n"}, {"directions": "\n\n              Make the waffles: Warm the milk and sugar in a medium saucepan over medium heat, whisking occasionally, until a thermometer registers 105 degrees F; remove from the heat. Sprinkle the yeast over the top and whisk to dissolve; let stand until foamy, about 5 minutes.\n            \n\n              Meanwhile, whisk the flour, nutmeg, salt and cloves in a large bowl; make a well in the center. Whisk the melted butter into the milk mixture, then pour into the well in the flour and whisk until almost smooth (a few small lumps are OK). Cover with plastic wrap and let stand at room temperature until the batter has doubled in size and is bubbly, about 1 1/2 hours.\n            \n\n              Preheat the oven to 200 degrees F. Put a wire rack on a baking sheet. Preheat a waffle iron according to the manufacturer?s directions, then lightly brush with melted butter. Stir the eggs and egg yolk and rum into the batter. (The batter will deflate.) Working in batches, fill the waffle iron about three-quarters full with batter and cook until golden and crisp, 3 to 7 minutes. Transfer the waffles to the rack and keep warm in the oven between batches.\n            \n\n              Make the topping: Combine the dulce de leche, rum and nutmeg in a small bowl; stir until smooth. Gradually add 2 to 3 teaspoons warm water until\n            \n\n              thin enough to drizzle. Top the waffles with ice cream and drizzle with the dulce de leche.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "whole milk", "quantity": 2.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "yeast extract spread", "quantity": 1.25}, {"food": "potato flour", "quantity": 2.0}, {"food": "nutmeg", "quantity": 1.5}, {"food": "salt", "quantity": 0.5}, {"food": "hearts of palm", "quantity": 1}, {"food": "butter oil", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "dulce de leche", "quantity": 0.3333333333333333}, {"food": "", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "ice cream swich", "quantity": 1}], "title": "\nEggnog Waffles a la Mode\n"}, {"directions": "\n\n              Make the granola: Preheat the oven to 300 degrees F. Toss the oats, pistachios, wheat germ, sesame seeds, maple syrup, brown sugar, vanilla, olive oil, cinnamon, cardamom and 1 teaspoon salt in a bowl. Spread on a rimmed baking sheet and bake 20 minutes, stirring halfway through. Remove from the oven and stir in the coconut. Return the granola to the oven and bake until golden, 20 to 25 more minutes, stirring halfway through.\n            \n\n              Meanwhile, make the yogurt: Whisk the Greek yogurt, eggnog and nutmeg to taste in a bowl until smooth. Cover and chill until ready to serve.\n            \n\n              Remove the granola from the oven and stir in the dried cranberries and apricots. Serve warm or at room temperature with the eggnog yogurt; drizzle with honey and sprinkle with nutmeg. Store extra granola in an airtight container in the freezer for up to 2 weeks.\n            \n\n              Photograph by Anna Williams\n            \n", "ingredients": [{"food": "oats", "quantity": 3.0}, {"food": "", "quantity": 1.0}, {"food": "wheat germ", "quantity": 0.3333333333333333}, {"food": "sesame seeds", "quantity": 2.0}, {"food": "syrup", "quantity": 0.5}, {"food": "sugar", "quantity": 0.25}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "cinnamon", "quantity": 0.5}, {"food": "ground turkey", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "coconut water", "quantity": 0.5}, {"food": "cranberries", "quantity": 0.5}, {"food": "apricots", "quantity": 0.5}, {"food": "silk banana-strawberry soy yogurt", "quantity": 2.5}, {"food": "eggnog", "quantity": 0.75}, {"food": "nutmeg", "quantity": 1}, {"food": "", "quantity": 1}], "title": "\nEggnog Yogurt With Granola\n"}, {"directions": "\n\n              Make the cake: Preheat the oven to 350 degrees F. Lightly brush an 11-by-17-inch rimmed baking sheet with vegetable oil and line with parchment paper. Brush the parchment with oil and dust with flour, tapping out the excess. Whisk the flour, 3/4 cup granulated sugar, the malted milk powder, cocoa powder, baking soda, cinnamon, allspice and nutmeg in a medium bowl; set aside. Beat the egg whites in a large bowl with a mixer on medium speed until foamy, 1 to 2 minutes. Increase the mixer speed to medium high and gradually add the remaining 2 tablespoons granulated sugar; continue beating until stiff shiny peaks form. Set aside.\n            \n\n              Beat the vegetable oil, egg yolks and milk in a separate bowl with the mixer on medium speed (no need to clean the beaters). Reduce the speed to low and beat in the flour mixture until just combined. Fold one-third of the beaten egg whites into the batter, then fold in the rest until incorporated. Pour the batter onto the prepared baking sheet and spread evenly with a rubber spatula. Bake until the cake pulls away from the sides of the pan and springs back when lightly pressed, 12 to 14 minutes. Dust the cake with the confectioners' sugar and spread a large clean kitchen towel (not terry cloth) on top. Invert a cooling rack onto the towel, then invert the cake onto the rack; peel off the parchment. Roll up the cake and towel together, starting from a long side to form a 17-inch-long roll. (You'll remove the towel later.) Set aside on the rack to cool completely.\n            \n\n              Make the frosting: Combine the granulated sugar and 3/4 cup water in a small saucepan and bring to a boil, stirring to dissolve. Cook over medium heat, without stirring, until a candy thermometer registers 240 degrees F, 20 to 30 minutes. (Brush any sugar crystals off the side of the pan with a wet pastry brush.) When the sugar has almost reached 240 degrees F, beat the egg and egg yolks in a stand mixer with the whisk attachment on high speed until thick and fluffy, about 5 minutes. Reduce the speed to low and slowly pour in the sugar syrup between the whisk and the side of the bowl. Increase the speed to high and beat until the bowl is cool to the touch. Remove the whisk and fit the mixer with the paddle attachment. With the mixer on medium-high speed, gradually add the butter and beat until thick and glossy. Combine the malted milk powder, vanilla and 1 teaspoon water in a small bowl; beat into the frosting along with the nutmeg.\n            \n\n              Unroll the cooled cake and spread with 1 1/2 cups of the frosting. Gently reroll the cake (without the towel) and trim the ends. Cover with the remaining frosting; dust with cocoa powder.\n            \n\n              Photograph by Johnny Miller\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.5}, {"food": "potato flour", "quantity": 1.25}, {"food": "sugar", "quantity": 0.75}, {"food": "milk", "quantity": 0.5}, {"food": "onion powder", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "cinnamon", "quantity": 0.5}, {"food": "allspice", "quantity": 0.25}, {"food": "nutmeg", "quantity": 0.25}, {"food": "eggs", "quantity": 4.0}, {"food": "milk", "quantity": 0.5}, {"food": "sugar", "quantity": 2.0}, {"food": "frosting", "quantity": 1}, {"food": "sugar", "quantity": 1.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "butter oil", "quantity": 2.5}, {"food": "milk", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}], "title": "\nEggnog-Chocolate Cake Roll\n"}, {"directions": "\n\n              Mix the ice cream, ginger, cinnamon and nutmeg in a large bowl until combined. Cover and freeze until ready to use.\n            \n\n              Combine 1/2 cup heavy cream with the brandy in a small bowl; set aside. Line the bottom of a 9-inch-round springform pan with parchment paper. Arrange about one-third of the panettone in the pan in a single layer, cutting the pieces as needed to completely cover. Brush the panettone lightly with some of the brandy cream. Spread half of the spiced ice cream over the panettone layer. Repeat with another layer of panettone, brush with more cream and top with the remaining ice cream. Cover with the remaining panettone and brush with the remaining cream. Cover the pan with foil and freeze until firm, at least 4 hours or overnight.\n            \n\n              Remove the cake from the freezer about 20 minutes before serving. Beat the remaining 2 cups heavy cream, the confectioners' sugar and vanilla in a large bowl with a mixer on medium-high speed until soft peaks form, about 2 minutes. Remove the springform ring. Cover the cake with the whipped cream and sprinkle with nutmeg.\n            \n\n              Photograph by Johnny Miller\n            \n", "ingredients": [{"food": "ice cream swich", "quantity": 4.0}, {"food": "ginger", "quantity": 0.5}, {"food": "cinnamon", "quantity": 0.5}, {"food": "nutmeg", "quantity": 0.5}, {"food": "ice cream swich", "quantity": 2.5}, {"food": "", "quantity": 0.25}, {"food": "luncheon slices", "quantity": 1.0}, {"food": "sugar", "quantity": 0.25}, {"food": "vanilla extract", "quantity": 1.0}], "title": "\nEggnog-Panettone Ice Cream Cake\n"}, {"directions": "\n\n              Cook 1 chopped onion in a skillet with 1/4 cup olive oil, 3 minutes. Add 1 each chopped celery stalk and eggplant; cook 4 minutes. Add 1 chopped red bell pepper and cook 3 minutes. Add 3 tablespoons golden raisins, some chopped oregano and 1/2 cup water; simmer 8 minutes. Add 1 cup halved grape tomatoes and 1 tablespoon each cider vinegar and capers; cook 7 minutes. Season with salt and pepper and top with torn basil.\n            \n\n              SERVES 6\n            \n\n              Calories: 138\n            \n\n              Total Fat: 9 grams\n            \n\n              Saturated Fat: 1 grams\n            \n\n              Protein: 2 grams\n            \n\n              Total carbohydrates: 14 grams\n            \n\n              Sugar: 7 grams\n            \n\n              Fiber: 4.5 grams\n            \n\n              Cholesterol: 0 milligrams\n            \n\n              Sodium: 199 milligrams\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nEggplant Caponata\n"}, {"directions": "\nSpecial equipment: a wide, shallow 2- or 2 1/2-quart baking dish\n\n              Adjust two racks to the top and bottom position of the oven and preheat to 400 degrees F. Line a baking sheet with foil.\n            \n\n              Pierce the eggplants all over with a fork, and place on the foil-lined baking sheet. Drizzle with olive oil. Roast on the top rack until completely soft when pierced with a paring knife, 1 hour to 1 hour 15 minutes.\n            \n\n              Meanwhile, toss the grape tomatoes with 1 tablespoon olive oil, 1/4 teaspoon salt and a few grinds pepper. Spread on a small baking sheet and roast in the same oven until the tomatoes are soft and wrinkled, about 20 minutes. Transfer to a large bowl.\n            \n\n              Mix together the panko, walnuts, flour and 1/2 teaspoon salt in a small bowl. Drizzle in 3 tablespoons olive oil and mix until the mixture starts to clump. Reserve.\n            \n\n              When the eggplants are cool enough to handle, halve them and scoop the soft flesh into the bowl with the tomatoes (if the eggplants are too slippery to handle, hold them with a clean towel while scooping). Discard the skins and stems. Using a fork or spoon, mash the eggplant into smaller bite-sized pieces. (It's okay if the tomatoes get mashed in the process.) Add the garlic, 1 tablespoon each of dill and parsley, the remaining 2 tablespoons olive oil, 1 1/2 teaspoons salt, and a few grinds of pepper. Check for seasoning and add more salt, if necessary.\n            \n\n              Drizzle a little olive oil in the bottom of a wide 2-quart baking dish. Spread the eggplant mixture in the dish. Sprinkle feta in an even layer, then top with the reserved panko-walnut mixture. Bake until the top is golden brown and the eggplant is hot, 30 to 35 minutes.\n            \n\n              Right before serving, sprinkle with the remaining 2 tablespoons each dill and parsley and the lemon zest.\n            \n", "ingredients": [{"food": "", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 0.5}, {"food": "walnuts", "quantity": 0.5}, {"food": "potato flour", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 6.0}, {"food": "grape juice", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "dill seed", "quantity": 3.0}, {"food": "parsley", "quantity": 3.0}, {"food": "", "quantity": 0.5}, {"food": "", "quantity": 1.0}], "title": "\nEggplant Crisp with Walnut Streusel\n"}, {"directions": "\n\n              Grill 2 eggplants over medium-high heat, turning, until soft, 30 minutes. Cool, then scoop out and puree the flesh in a food processor with 1/2 teaspoon chopped garlic, 5 tablespoons olive oil, 1 1/2 tablespoons lemon juice, and salt. Top with olive oil and parsley and serve with flatbread and vegetables.\n            \n\n              Per serving (does not include flatbread and vegetables for serving): Calories 247; Total Fat 21 grams; Saturated Fat 3 grams; Protein 3 grams; Total Carbohydrate 16 grams; Sugar: 7 grams; Fiber 9 grams; Cholesterol 0 milligrams; Sodium 152 milligrams\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [], "title": "\nEggplant Dip\n"}, {"directions": "\n\n              Preheat oven to 400 degrees. Have two racks set up in the oven.\n            \n\n              Place 3/4 of the tomatoes and 2 garlic cloves on a baking sheet. Drizzle with 1 teaspoon olive oil. Roast until the tomatoes burst and start to caramelize, about 30 minutes. Peel the roasted garlic and puree with the tomatoes, crushed red pepper, and 1/2 teaspoon salt in a food processor to make the sauce.\n            \n\n              Spray a baking sheet with cooking spray. Peel the eggplant top-to-bottom in alternating strips, so that some of the skin is left on, and slice into 1/3 inch rounds. Dip only one side of each round into the egg white and then into the crushed melba toast. Lay out on the sheet tray, crumb-side up. Sprinkle with 1/4 teaspoon salt. Spray with more cooking spray. Bake until just tender, about 25 minutes.\n            \n\n              Dice the remaining 1/4 of tomatoes, and toss with the remaining 2 teaspoons olive oil, red wine vinegar, basil leaves and 1/4 teaspoon salt.\n            \n\n              Preheat the broiler. Place the toasted ciabatta halves on a baking sheet cut-side up. Cut the remaining garlic clove in half and rub on the bread. Spoon 2 tablespoons of sauce on top of each ciabatta half, then top with 3 or 4 overlapping slices of eggplant, 2 more tablespoons sauce, shredded mozzarella, and grated parmesan. Broil until the cheese melts and starts to bubble, about 3 minutes. Top each open-faced sandwich with the fresh tomato and basil salad.\n            \n\n              Preheat oven to 400 degrees. Have two racks set up in the oven.\n            \n\n              Place 3/4 of the tomatoes and 2 garlic cloves on a baking sheet. Drizzle with 1 teaspoon olive oil. Roast until the tomatoes burst and start to caramelize, about 30 minutes. Peel the roasted garlic and puree with the tomatoes, crushed red pepper, and 1/2 teaspoon salt in a food processor to make the sauce.\n            \n\n              Spray a baking sheet with cooking spray. Peel the eggplant top-to-bottom in alternating strips, so that some of the skin is left on, and slice into 1/3 inch rounds. Dip only one side of each round into the egg white and then into the crushed melba toast. Lay out on the sheet tray, crumb-side up. Sprinkle with 1/4 teaspoon salt. Spray with more cooking spray. Bake until just tender, about 25 minutes.\n            \n\n              Dice the remaining 1/4 of tomatoes, and toss with the remaining 2 teaspoons olive oil, red wine vinegar, basil leaves and 1/4 teaspoon salt.\n            \n\n              Preheat the broiler. Place the toasted ciabatta halves on a baking sheet cut-side up. Cut the remaining garlic clove in half and rub on the bread. Spoon 2 tablespoons of sauce on top of each ciabatta half, then top with 3 or 4 overlapping slices of eggplant, 2 more tablespoons sauce, shredded mozzarella, and grated parmesan. Broil until the cheese melts and starts to bubble, about 3 minutes. Top each open-faced sandwich with the fresh tomato and basil salad.\n            \n", "ingredients": [{"food": "silk black cherry soy yogurt", "quantity": 1.25}, {"food": "garlic powder", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "eggplant", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "french toast", "quantity": 2.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 8.0}, {"food": "pizza rolls", "quantity": 2.0}, {"food": "", "quantity": 4.0}, {"food": "parmesan cheese", "quantity": 2.0}, {"food": "silk black cherry soy yogurt", "quantity": 1.25}, {"food": "garlic powder", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "eggplant", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "french toast", "quantity": 2.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 8.0}, {"food": "pizza rolls", "quantity": 2.0}, {"food": "", "quantity": 4.0}, {"food": "parmesan cheese", "quantity": 2.0}], "title": "\nEggplant Parm Sandwich\n"}, {"directions": "\n\n              Arrange the eggplant slices on several baking sheets and sprinkle generously all over with kosher salt. Set aside to let the bitter juices weep from the eggplant, about 1 hour.\n            \n\n              Transfer the eggplant to a colander in the sink, and rinse well under cold running water. Transfer eggplant to a work surface and blot very dry with paper towels.\n            \n\n              In a large bowl, whisk together the 1 1/2 teaspoons salt, breadcrumbs, oregano, thyme, and season with pepper.\n            \n\n              Place the flour in a medium lipped plate or bowl. In another medium bowl, whisk the egg and milk together. Dredge an eggplant slice in the flour, then dip it in the egg, and finally dredge it in the breadcrumb mixture. Shake off any excess breading and transfer the eggplant to a baking sheet. Repeat with the remaining eggplant.\n            \n\n              In a large straight-sided skillet, pour the oil to a depth of 1/2 inch. Heat the oil over medium heat until it registers 400 degrees F on a deep frying thermometer. (The oil must be heated to 400 degrees F. so that the breaded eggplant, when added, will drop the temperature of the oil to the proper frying temperature of 375 degrees F.)\n            \n\n              Working in small batches, fry the eggplant slices, turning once, until golden brown, about 3 minutes per batch. Using tongs, transfer to a paper towel-lined baking sheet and season with salt to taste. Repeat with the remaining eggplant.\n            \n\n              Preheat the oven to 400 degrees F. Lightly brush a 15 x 10- x 2-inch-baking dish with olive oil. Cover the bottom of the baking dish with 1/3 of the marinara sauce and arrange half of the eggplant over the sauce. Cover the eggplant with another 1/3 of the sauce. Scatter half of the Parmesan and half of the mozzarella over the sauced eggplant. Repeat with the remaining eggplant, sauce, Parmesan, and mozzarella. Bake until hot and just beginning to brown, about 30 minutes. Serve immediately.\n            \n\nQUICK MARINARA SAUCE\n\n\n              Heat the oil in a medium saucepan over medium-high heat. Saute the onion and garlic, stirring, until lightly browned, about 3 minutes. Add the tomatoes and the herb sprigs and bring to a boil. Lower the heat and simmer, covered, for 10 minutes.\n            \n\n              Remove and discard the herb sprigs. Stir in the salt and season with pepper to taste. Use immediately, store covered in the refrigerator for up to 3 days, or freeze for up to 2 months.\n            \n\n              Yield: about 3 1/2 cups\n            \n\n              Copyright 2001 Television Food Network, G.P. All rights reserved\n            \n", "ingredients": [{"food": "luncheon slices", "quantity": 2.0}, {"food": "salt", "quantity": 1.0}, {"food": "", "quantity": 5.0}, {"food": "", "quantity": 1.0}, {"food": "thyme", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 1}, {"food": "potato flour", "quantity": 1}, {"food": "eggs", "quantity": 6.0}, {"food": "whole milk", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "", "quantity": 7.0}, {"food": "", "quantity": 0.6666666666666666}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "onion powder", "quantity": 0.8333333333333333}, {"food": "garlic powder", "quantity": 5.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 7.0}, {"food": "hearts of palm", "quantity": 2.0}, {"food": "hearts of palm", "quantity": 2.0}, {"food": "salt", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nEggplant Parmesan\n"}, {"directions": "\n\n              Thinly slice a baguette; arrange in a single layer on a baking sheet. Brush with olive oil and sprinkle with salt. Bake at 425 degrees F until lightly golden, about 7 minutes. Let cool slightly.\n            \n\n              Slice 1 Japanese eggplant into 1/2-inch-thick rounds and toss with olive oil, salt and pepper. Spread on a baking sheet and roast about 12 minutes at 425 degrees F. Top the toast rounds with sliced mozzarella, the roasted eggplant and some marinara sauce; sprinkle with parmesan. Bake until the cheese melts.\n            \n\n              Photograph by Andrew McCaul\n            \n", "ingredients": [], "title": "\nEggplant Parmesan Bruschetta\n"}, {"directions": "\n\n              Cut the eggplant in half crosswise. Then cut each half lengthwise into 1/2 inch-thick slices (about 16 slices). Arrange the eggplant slices on several baking sheets and sprinkle generously all over with kosher salt. Set aside to let the bitter juices weep from the eggplant, about 1 hour.\n            \n\n              Transfer the eggplant to a colander in the sink, and rinse well under cold running water. Transfer eggplant to a work surface and blot very dry with paper towels.\n            \n\n              In a large bowl, whisk together the 1 1/2 teaspoons salt, breadcrumbs, oregano, thyme, and season with pepper to taste.\n            \n\n              Place the flour in a medium lipped plate or bowl. In another medium bowl, whisk the egg and milk together. Dredge an eggplant slice in the flour, then dip it in the egg, and finally dredge it in the breadcrumb mixture. Shake off any excess breading and transfer the eggplant to a baking sheet. Repeat with the remaining eggplant.\n            \n\n              In a large straight-sided skillet, pour the oil to a depth of 1/2 inch. Heat the oil over medium heat until it registers 400 degrees F on a deep frying thermometer. (The oil must be heated to 400 degrees F. since when the breaded eggplant is added it drops the temperature to the proper frying temperature of 375 degrees F.)\n            \n\n              Working in small batches, fry the eggplant slices, turning once, until golden brown, about 3 minutes per batch. Using tongs, transfer to a paper towel-lined baking sheet and season with salt to taste. Repeat with the remaining eggplant. The eggplant can be fried up to 2 hours before serving.\n            \n\n              When ready to serve preheat the broiler. Arrange the hero rolls, split-side up, on a baking sheet and toast under the broiler.\n            \n\n              Cover each roll with about 4 slices of eggplant, overlapping them slightly. Cover each of the eggplant heroes with about 3/4-cup of the sauce, sprinkle with 1 tablespoon Parmesan, and cover with 4 slices of the provolone. Broil until the cheese is melted and lightly browned. Close the hero rolls and slice in half crosswise. Serve immediately.\n            \n\nQUICK MARINARA SAUCE\n\n\n              Heat the oil in a medium saucepan over medium-high heat. Saute the onion and garlic, stirring, until lightly browned, about 3 minutes. Add the tomatoes and the herb sprigs and bring to a boil. Lower the heat and simmer, covered, for 10 minutes.\n            \n\n              Remove and discard the herb sprigs. Stir in the salt and season with pepper to taste. Use now, or store covered in the refrigerator for up to 3 days, or freeze for up to 2 months.\n            \n", "ingredients": [{"food": "eggplant", "quantity": 1.0}, {"food": "salt", "quantity": 1.5}, {"food": "", "quantity": 3.0}, {"food": "", "quantity": 1.5}, {"food": "thyme", "quantity": 1.5}, {"food": "black bean mango", "quantity": 1}, {"food": "potato flour", "quantity": 1}, {"food": "eggs", "quantity": 3.0}, {"food": "whole milk", "quantity": 1.0}, {"food": "shortening frying ", "quantity": 1}, {"food": "pizza rolls", "quantity": 7.0}, {"food": "", "quantity": 3.0}, {"food": "", "quantity": 0.25}, {"food": "macaroni cheese", "quantity": 16.5}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.25}, {"food": "garlic powder", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.5}, {"food": "hearts of palm", "quantity": 1}, {"food": "hearts of palm", "quantity": 1}, {"food": "salt", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nEggplant Parmesan Hero\n"}, {"directions": "\n\n              Thinly slice the eggplant into rounds and season with salt. Pour some flour into a shallow dish. Beat the eggs in another dish. In a third dish, mix the breadcrumbs and parmesan. Dredge the eggplant in the flour, then dip in the eggs and coat with the breadcrumb mixture.\n            \n\n              Heat 1 tablespoon olive oil in a large skillet over medium heat. Working in batches, cook the eggplant until golden, about 2 minutes per side, adding more oil between batches, if necessary. Drain on paper towels and season with salt.\n            \n\n              Toss the tomatoes with the remaining 2 teaspoons olive oil and the vinegar in a bowl. Spoon some ricotta onto each eggplant slice. Top with the tomato mixture and basil.\n            \n\n              Photograph by Anna Williams\n            \n", "ingredients": [{"food": "eggplant", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "potato flour", "quantity": 1}, {"food": "eggs", "quantity": 2.0}, {"food": "", "quantity": 0.75}, {"food": "parmesan cheese", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "basil", "quantity": 1}], "title": "\nEggplant Ricotta Bites\n"}, {"directions": "\n\n              Soak 1/4 cup minced red onion in water. Pierce 2 eggplants with a fork; microwave until soft, 20 to 25 minutes. Cool slightly, then halve, scoop out the flesh and chop. Drain the onion; toss with the eggplant, 3 tablespoons olive oil, some chopped cilantro and parsley, a squeeze of lemon juice, and salt and pepper. Drizzle with more olive oil.\n            \n\n              Per Serving: Calories: 161; Total Fat: 11 grams; Saturated Fat: 1.5 grams; Protein:3 grams; Total carbohydrates: 17 grams; Sugar: 7 grams; Fiber: 9.5 grams; Cholesterol: 0 milligrams; Sodium: 79 milligrams\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nEggplant Salad\n"}, {"directions": "\n\n              Heat 1 tablespoon vegetable oil in a pot over medium-high heat. Add the onion and cook until softened, about 5 minutes. Meanwhile, puree the garlic, ginger, jalapeno and 1 to 2 tablespoons water in a mini food processor until a paste forms. Drain the tomatoes, reserving the juice; coarsely crush the tomatoes in a separate bowl.\n            \n\n              Add the remaining 2 tablespoons vegetable oil and the eggplant to the pot; cook 2 minutes. Add the garlic-ginger paste and cook, stirring, 2 more minutes. Add the curry powder and tomatoes (but not the juice) and cook, stirring, 1 minute. Add the tomato juice and 1 cup water and cook until slightly reduced, about 3 minutes. Add the coconut milk and tofu; simmer until the eggplant is very tender, about 5 minutes. Add the spinach and cook until wilted, about 1 minute. Season with salt and pepper. Serve with rice, if desired.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 5.0}, {"food": "ginger", "quantity": 1.0}, {"food": "seeds", "quantity": 1.0}, {"food": "plum", "quantity": 1.0}, {"food": "eggplants", "quantity": 2.75}, {"food": "curry powder", "quantity": 1.0}, {"food": "coconut milk", "quantity": 1.0}, {"food": "firm tofu", "quantity": 12.5}, {"food": "mustard spinach", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 1}], "title": "\nEggplant and Tofu Curry\n"}, {"directions": "\n\n              Puree 2 tablespoons peanut butter, 1 garlic clove, the juice of 1 lemon and some fresh oregano in a blender. Blend in 3 tablespoons each olive oil and water; add salt and pepper. Brush 2 thinly sliced eggplants with olive oil, season with salt and pepper and grill 3 minutes per side. Top with the peanut dressing, more oregano and red pepper flakes.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nEggplant with Peanut Dressing\n"}, {"directions": "\n\n              Toss 1 pound chopped eggplant, 3 unpeeled shallots and 3 unpeeled garlic cloves with 1/4 cup olive oil, salt and pepper on a baking sheet. Roast at 400 degrees for 30 minutes. Add some walnuts; bake for 8 more minutes. Cool slightly, then squeeze the shallots and garlic from their skins and chop; toss with the eggplant, nuts, 1/2 cup plain yogurt, fresh dill and salt and pepper.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nEggplant with Yogurt and Dill\n"}, {"directions": "\n\n              Soak 1 pound cubed eggplant in warm salted water, about 15 minutes, then drain and squeeze dry. Season 1 cup flour with salt and pepper in a bowl. Beat 2 eggs with 1/2 cup milk in another bowl. Mix 1 1/2 cups flour and 1/2 cup grated parmesan in a third bowl. Dip the eggplant in the seasoned flour, the egg and then the flour-cheese mixture. Fry in 1/4 inch olive oil over medium-high heat until golden; drain on paper towels. Mix with 4 cups Perfect Marinara Sauce, recipe follows. Toss with rigatoni.\n            \n\nPerfect Marinara Sauce:\n\n\n              Combine 3 tablespoons olive oil, 6 thinly sliced garlic cloves and a pinch of red pepper flakes in a large skillet and cook over medium-low heat until the garlic is golden, about 6 minutes. Crush a 28-ounce can of San Marzano plum tomatoes into the skillet with your hands; rinse the can with about 1 cup water and add to the sauce. Add a handful of torn basil leaves and season with salt. Increase the heat to medium and simmer, uncovered, until thick, 20 to 25 minutes. Toss with 1 pound cooked pasta (makes 4 cups sauce).\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [], "title": "\nEggplant-Parmesan Sauce\n"}, {"directions": "\n\n              Pour enough water into 2 large skillets to reach a depth of about 3 inches, and divide the vinegar between them. Bring both skillets to a gentle simmer over medium heat. Crack an egg into a cup and carefully slide it into the hot poaching liquid. Quickly repeat with all the eggs. Poach the eggs, turning them occasionally with a spoon, until the whites are firm, or to the desired degree of doneness, about 3 to 5 minutes. Using a slotted spoon, remove the eggs and transfer to a kitchen towel. Lightly dab the eggs with the towel to remove any excess water. \n            \n\n              While the eggs are poaching, melt the butter in a large skillet over medium heat. Add the Canadian bacon and cook until heated through, about a minute on each side. \n            \n\n              To serve, toast the English muffin halves and divide them among 6 warmed plates. Top each half with a slice of Canadian bacon, and set an egg on top. Spoon the hollandaise sauce over the eggs and garnish with the chives. Serve immediately.\n            \n\nHollandaise Sauce\n\n\n              In a medium pan, completely melt the butter over medium-low heat. Remove from the heat and set it aside for 5 minutes. Skim and discard the white foam that rises to the surface of the butter. Carefully ladle or pour the clear golden butter into a container with a pouring spout. Take care not to add the milky solids and watery liquid at the bottom of the saucepan. Set the butter aside in a warm spot. \n            \n\n              Pour enough water into a medium saucepan to reach a depth of about 2 inches. Bring to a gentle simmer over medium heat. \n            \n\n              In a medium heatproof bowl, combine the egg yolks and the cold water. Whisk until the yolks are light and frothy. Place the bowl over the saucepan of simmering water and whisk constantly and vigorously until the yolks are thickened and light, about 3 to 4 minutes. (If the eggs begin to scramble, or the mixture is cooking very quickly or gets too hot, remove the bowl from the heat and whisk to cool). Remove the eggs from the heat and whisk for 30 seconds to cool slightly. \n            \n\n              Remove the saucepan from the heat and set the bowl over the hot water. Slowly drizzle the butter into the eggs while whisking constantly. Whisk in the lemon juice, salt, and pepper, to taste. (If the sauce is very thick, add a few drops of warm water to adjust the consistency so it is creamy and light.) Serve immediately or keep the hollandaise sauce in a small bowl set over warm, but not hot water, for about 30 minutes or in a warmed thermos for about an hour. \n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "vinegar", "quantity": 0.5}, {"food": "eggs", "quantity": 12.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "bacon", "quantity": 12.0}, {"food": "split pea soup", "quantity": 6.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "", "quantity": 1}, {"food": "butter oil", "quantity": 1.3333333333333333}, {"food": "egg substitute", "quantity": 2.0}, {"food": "coconut water", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "pepper", "quantity": 1}], "title": "\nEggs Benedict\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Fill a large, wide pot with about 3 inches of water and a hefty splash of vinegar. Bring to a low simmer.\n            \n\n              Meanwhile, heat 1 tablespoon of the oil in a large nonstick skillet. Add the onions, bacon, a pinch of salt and a few grinds of pepper, and cook, stirring frequently, until the onion and the bacon are browned in spots, about 5 minutes. Remove from the heat, and let cool.\n            \n\n              Put the remaining 2 tablespoons oil and the vinegar, lemon zest and juice, yogurt, 1 tablespoon water and 1/4 teaspoon salt in a jar or other container with a lid. Secure the lid, and shake well to combine. (The dressing can be made a day ahead; shake well before serving.)\n            \n\n              Toss the greens, tomatoes, onion-bacon mixture and dressing in a large bowl. Add salt to taste. Divide among 4 salad bowls.\n            \n\n              Toast the English muffins, and cut each in half.\n            \n\n              Crack 1 egg into a small bowl. Swirl the simmering water, then gently slide the egg into it. Repeat with the remaining eggs. Cook until the whites are set and the yolks are still runny, 3 to 4 minutes. Remove the eggs with a slotted spoon, and place 1 on top of each salad. Garnish each salad with 2 English muffin pieces and a few grinds of pepper.\n            \n", "ingredients": [{"food": "vinegar", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "bacon", "quantity": 5.25}, {"food": "black bean mango", "quantity": 1}, {"food": "grape juice", "quantity": 0.5}, {"food": "silk plain soy yogurt", "quantity": 2.0}, {"food": "mixed nuts", "quantity": 5.0}, {"food": "grape juice", "quantity": 0.5}, {"food": "muffins", "quantity": 2.0}, {"food": "eggs", "quantity": 4.0}], "title": "\nEggs Benedict Breakfast Salad\n"}, {"directions": "\n\n              Melt the butter in a large skillet over medium-high heat. Add half of the spinach and cook until wilted, about 2 minutes. Add the remaining spinach, the nutmeg, 1 teaspoon salt and a few grinds of pepper. Cook until all of the spinach wilts, about 3 more minutes. Drain the spinach in a colander and let cool, then squeeze out the excess moisture. Chop the spinach.\n            \n\n              Butter a 9-by-13-inch baking dish. Whisk the eggs, milk, lemon zest, 1 teaspoon salt and a few grinds of pepper in a large bowl. Arrange half of the English muffin pieces in the prepared baking dish. Top with half each of the spinach, scallions and cheese. Top with the remaining English muffin pieces, spinach, scallions and cheese. Pour the egg mixture onto the casserole, then press down on the English muffins to submerge them. Cover with foil and refrigerate 3 hours or overnight.\n            \n\n              Remove the casserole from the refrigerator 30 minutes before baking. Preheat the oven to 375 degrees F. Bake the casserole, covered, until just set, about 25 minutes. Uncover and bake until the top is lightly browned, about 20 more minutes. Let cool 10 minutes before serving. Serve with creme fraiche.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "butter oil", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 3.0}, {"food": "nutmeg", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "eggs", "quantity": 12.0}, {"food": "whole milk", "quantity": 2.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "split pea soup", "quantity": 6.0}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 2.0}, {"food": "", "quantity": 1}], "title": "\nEggs Florentine Casserole\n"}, {"directions": "\n\n              Heat the olive oil in a large skillet over medium-high heat. Add the garlic and cook until golden brown, about 3 minutes. Remove the garlic with a slotted spoon and discard. Increase the heat to high and add the salami, onion, peppers and red pepper flakes. Cook, stirring, until the salami starts to brown, about 5 minutes. Add the tomato puree and 1/2 cup water and cook until the vegetables are tender, about 5 minutes.\n            \n\n              Reduce the heat to medium. Scatter the parsley leaves into the skillet. Make 4 indentations in the pepper mixture for the eggs. Break 2 eggs into a small bowl, then pour both into one of the indentations. Repeat with the remaining eggs. Sprinkle with the grated cheese. Cover and cook until the whites are set and the yolks are cooked to desired doneness. Serve with the bread.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "salami", "quantity": 4.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 0.25}, {"food": "eggs", "quantity": 8.0}, {"food": "parmesan cheese", "quantity": 2.0}, {"food": "garlic bread", "quantity": 1}], "title": "\nEggs in Purgatory With Salami\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Heat the olive oil in a 10-inch cast-iron skillet over medium-high heat. Add the sausage; cook, stirring occasionally, until browned and almost cooked through, 4 to 5 minutes. Add the onion and cook, stirring occasionally, until softened and slightly golden, 2 to 3 minutes.\n            \n\n              Stir the bread into the sausage mixture and cook until lightly toasted, about 2 minutes. Add the marinara sauce and 2 cups water; bring to a simmer. Reduce the heat to medium (or move the skillet to a cooler part of the campfire). Stir in the provolone, 2 tablespoons parmesan and 1/4 cup basil.\n            \n\n              Use the back of a spoon to make 4 shallow wells in the tomato mixture; carefully crack 1 egg into each well. Cover the skillet and cook until the egg whites are set but the yolks are still runny, 4 to 9 minutes. Sprinkle with the remaining 2 tablespoons parmesan and 1/4 cup basil. Season with salt and pepper.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic bread", "quantity": 5.0}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "parmesan cheese", "quantity": 0.25}, {"food": "basil", "quantity": 0.5}, {"food": "eggs", "quantity": 4.0}, {"food": "salt", "quantity": 1}], "title": "\nEggs in Purgatory with Sausage\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Heat the oil in a large nonstick skillet over medium-high heat, add half of the onion and the garlic and cook, stirring, until soft and just begins to brown, about 4 minutes. Add the tomato paste, chili powder, 1/2 teaspoon salt and the cayenne pepper. Cook, stirring, until the oil is brick red, about 2 minutes. Add the chicken broth and bring to a simmer. Cook until thickened slightly, about 3 minutes. Add the shredded chicken and stir until just warmed through, remove from heat and cool to room temperature. \n            \n\n              Whisk together the sour cream, cilantro, lime juice and zest in a small bowl. Toss together the corn and pepper in another small bowl. \n            \n\n              Layer the dip in a medium, straight-sided 3-quart glass trifle bowl or your favorite serving dish. Spread the cornbread on the bottom, then top, in even layers, with the tomatoes, beans, cheese, cilantro-lime sour cream, chicken chili, the remaining chopped onions and the corn-pepper mixture. \n            \n\n              Wrap and refrigerate until chilled, at least 1 hour or overnight. Serve with chips for dipping.\n            \n\n              Copyright 2013 Television Food Network, G.P. All rights reserved\n            \n\n              From Food Network Kitchens\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "pasta with tomato sauce", "quantity": 3.0}, {"food": "chili powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "pepper", "quantity": 0.25}, {"food": "diced chicken", "quantity": 1.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "sour cream", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "corn bran", "quantity": 1.0}, {"food": "pepper", "quantity": 1.0}, {"food": "", "quantity": 1.5}, {"food": "tomatoes", "quantity": 3.0}, {"food": "fava beans", "quantity": 14.0}, {"food": "yellow rice", "quantity": 1.5}, {"food": "corn bran", "quantity": 1}], "title": "\nEight-Layer Chicken Chili Dip\n"}, {"directions": "\n\n              Stir the sugar and 2 tablespoons of the water together in a heavy-bottomed saucepan. Cover and bring to a boil over medium heat. Uncover and continue to cook, swirling the pan but not stirring, until the sugar is a dark golden caramel, 7 to 10 minutes. (It should smell slightly burnt.) Pull pan from the heat and carefully pour the 1/4 cup water into the caramel. Take care; it may spatter a lot. Whisk until smooth and allow to cool. (The burnt caramel can be held for up to 2 weeks at room temperature.)\n            \n\n              When ready to serve: Put 3 tablespoons of the burnt caramel into 4 mugs or cups and top evenly with the chopped chocolate. Bring the milk to a simmer in a medium pan over medium heat. Pull pan from the heat and add the Goldschlager and rum; pour over the chocolate. Serve El Dorado Hot Chocolates with a spoon to stir the layers together.\n            \n", "ingredients": [{"food": "sugar", "quantity": 0.75}, {"food": "coconut water", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 8.0}, {"food": "milk", "quantity": 6.0}, {"food": "cinnamon", "quantity": 6.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 3.0}], "title": "\nEl Dorado Hot Chocolate\n"}, {"directions": "\n\n              Combine the Scotch, liqueur, bitters and rosemary in a cocktail shaker filled with ice. Cover the shaker, and shake well to combine and chill the ingredients. Strain into a chilled martini glass.\n            \n", "ingredients": [{"food": "malt beverage", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}], "title": "\nElderflower Rob Roy\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: a flour sifter or fine-mesh sieve a 12-cup Bundt pan\n\n              Sprinkle the yeast over the warm water in a large bowl. Stir a few times, then let stand until the yeast has dissolved and the mixture begins to bubble, 1 to 2 minutes. Sift 1 1/2 cups of the flour into the bowl, and stir until mostly smooth. Cover with plastic wrap, and set aside in a warm place for about 30 minutes. The mixture will expand, loosen in texture and have large bubbles on the surface.\n            \n\n              Meanwhile, place the dried fruit, pecans, brandy and 2 tablespoons of the brown sugar in a microwave-safe bowl, stir until the sugar is dissolved, then microwave until hot and bubbling, 1 to 2 minutes. Stir, then set aside to cool.\n            \n\n              In a medium bowl, whisk together the remaining 1 1/2 cups flour, cinnamon, cardamom and salt. Generously butter a 12-cup Bundt pan; set aside.\n            \n\n              When the flour-yeast mixture has risen, beat the butter with the granulated sugar and remaining 3/4 cup brown sugar with an electric mixer on medium-high speed in a large bowl until light and fluffy, 3 to 4 minutes. Beat in the eggs, 1 at a time, until combined (the mixture may look slightly curdled at this stage), then add 1 teaspoon of the vanilla. Beat in the flour-yeast mixture. Reduce the mixer speed to medium-low, then gradually beat in the flour-spice mixture. Raise the mixer speed to medium, add the fruit-nut mixture with any remaining liquid and beat until the fruit is well blended. The dough should be soft, loose and elastic, almost like brioche dough or an extremely thick batter.\n            \n\n              Transfer the dough to the prepared Bundt pan, cover with plastic wrap and let rise in a warm place until the dough fills the pan a little more than 3/4 of the way, about 1 hour. When the cake is almost done rising, preheat the oven to 375 degrees F.\n            \n\n              Remove the plastic wrap from the cake. Bake the cake until golden brown and a cake tester comes out clean, 40 to 45 minutes. Let cool for 30 minutes in the pan on a wire rack. Loosen the sides with a small metal spatula, and turn the cake out, flat-side down, onto the wire rack to cool completely.\n            \n\n              Before serving, stir together the confectioners' sugar, 1 tablespoon of the milk and the remaining 1/2 teaspoon vanilla in a small bowl. Gradually add as much of the second tablespoon of milk as needed to make a thick glaze that will just gently run. Spoon the glaze over the top of the cake, allowing it to run down the outside and inside.\n            \n", "ingredients": [{"food": "yeast extract spread", "quantity": 0.25}, {"food": "coconut water", "quantity": 1.0}, {"food": "potato flour", "quantity": 3.0}, {"food": "fruit cocktail", "quantity": 1.0}, {"food": "pecans", "quantity": 0.5}, {"food": "barley flour or meal", "quantity": 0.3333333333333333}, {"food": "sugar", "quantity": 0.75}, {"food": "cinnamon", "quantity": 1.5}, {"food": "ground turkey", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 0.75}, {"food": "sugar", "quantity": 0.25}, {"food": "eggs", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 1.5}, {"food": "sugar", "quantity": 1.0}, {"food": "milk", "quantity": 2.0}], "title": "\nElection Cake\n"}, {"directions": "\nSpecial equipment: 3-inch star and letter cookie cutters\n\n              Whisk the flour, baking soda and salt in a medium bowl. Mix the vanilla and egg with a fork in a small bowl.\n            \n\n              Beat the butter, granulated sugar and confectioners' sugar together in the bowl of a stand mixer on low speed until the butter has picked up the sugars, about 30 seconds. (If using a hand mixer, beat about 2 minutes.) Increase the speed to medium and beat until slightly creamy, stopping halfway to scrape the bowl, about 1 minute (about 3 minutes with a hand mixer). \n            \n\n              Reduce the speed to low, slowly add in the egg mixture and beat until combined. Add the flour mixture a heaping cup at a time in 2 additions, stopping a few times to scrape the bowl and beaters. (If using a hand mixer, increase the speed as the dough gets thicker to keep the beaters spinning.) Once all the flour is just incorporated, add the confetti stars, increase the speed to medium (higher with a hand mixer) and beat until the dough is very smooth, about 2 minutes (about 5 minutes with a hand mixer). \n            \n\n              Turn the dough out of the bowl and bring it together. Divide the dough into 2 even pieces, each about 11 ounces. Shape each piece into a 6-inch square and wrap in plastic wrap. Refrigerate the dough for at least 3 hours and up to overnight. \n            \n\n              Position oven racks in the upper and lower thirds of the oven and preheat to 350 degrees F. Line 2 baking sheets with parchment. Take the dough pieces out of the refrigerator and let soften until just pliable but still cool and firm, about 15 minutes. \n            \n\n              Dust a piece of parchment with flour. Dust one square of the dough with flour and roll it to about 1/4 inch thick. Lift the dough occasionally by sliding a metal spatula or bench scraper underneath to make sure it isn't sticking to the parchment. Cut out cookies into stars and letters with 3-inch cutters, as close together as possible; transfer to one of the prepared baking sheets, leaving 1 inch between them. Gather together the scraps and repeat with the remaining dough. Sprinkle more stars over the top of the cookies and gently press down so they stick. Freeze the cookies on the baking sheet while you repeat with the other dough. Freeze the cookies about 10 minutes before baking.\n            \n\n              Bake, rotating the baking sheets from front to back and top to bottom halfway through, until the cookies are light golden brown, 18 to 20 minutes. Let cool completely on the baking sheets on a cooling rack, about 30 minutes.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 0.125}, {"food": "salt", "quantity": 0.125}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "butter oil", "quantity": 1.5}, {"food": "sugar", "quantity": 0.5}, {"food": "sugar", "quantity": 0.25}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}], "title": "\nElection Day Sugar Cookies\n"}, {"directions": "\n\n              For the eyes: Snip each mini marshmallow in half with scissors. Press a mini chocolate chip into the cut sides of the marshmallows as a pupil for each eye. Set aside.\n            \n\n              For the ears: Set the red gumdrop fruit slices on the work surface on their rounded side or upright. With a small sharp knife, trim one-third off the side of the gumdrop (to decrease its weight). Reserve the trimmings. Then cut through each slice vertically about three-quarters of the way through. Twist the top half away from the bottom half and press the parts together at a 45 degree angle (they will still be attached).\n            \n\n              For the tails: Slice the reserved trimmings from the ears into 12 thin strips about 1 inch long.\n            \n\n              For the trunks: Remove a 3/4-inch segment from each gummy ring to make a trunk.\n            \n\n              To assemble: Frost each cupcake with about 2 tablespoons of the buttercream. Place the pink sanding sugar in a small bowl. Invert each cupcake into the sugar and press gently to adhere.\n            \n\n              Attach the eyes by pressing gently into position. Insert one end of the trunk just below eye level. Push the bottom half of the ears into the sides of the cupcake. Insert a tail on the back of the cupcake. Repeat steps for all cupcakes.\n            \n", "ingredients": [{"food": "", "quantity": 12.0}, {"food": "baking chocolate", "quantity": 24.0}, {"food": "fruit cocktail", "quantity": 24.0}, {"food": "onion rings", "quantity": 12.0}, {"food": "vanilla extract", "quantity": 12.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "sugar", "quantity": 34.0}], "title": "\nElephant Cupcakes\n"}, {"directions": "\n\n              Heat 2 3/4 cups of the milk in a large saucepan over medium until hot but not boiling. Whisk the granulated sugar, cornstarch and salt in a large bowl. Whisk in the egg yolks and the remaining 1/4 cup milk. Whisk half of the hot milk into the egg mixture until smooth, and then gradually whisk the egg mixture into the heated milk. Cook over medium heat, whisking constantly, until the mixture boils and thickens, 4 to 6 minutes. Remove from the heat and whisk in the peanut butter until melted. Transfer to a bowl. Press plastic wrap directly onto the surface and chill until set, at least 4 hours.\n            \n\n              Preheat the oven to 350 degrees F with a rack set on the middle shelf. Line a baking sheet with parchment paper.\n            \n\n              Place the bacon on a cooling rack set over a baking sheet. Brush both sides of the bacon with the maple syrup. Bake until golden brown and slightly crispy, rotating the baking sheet halfway through, 20 to 25 minutes. Place on the lined baking sheet and cool completely. The bacon will continue to crisp as it cools. Break each piece of cooled bacon in half.\n            \n\n              Whip the heavy cream and confectioners' sugar in a large mixing bowl with a hand mixer to soft to medium peaks. Refrigerate until ready to use.\n            \n\n              To assemble, loosen the chilled pudding by whisking it until smooth and creamy. Spoon 1/4 cup of the pudding into the bottom of a 10- to 12-ounce glass. Layer in this order: 1/4 cup crushed waffle cookies, half of a sliced banana, 1/4 cup whipped cream, 1/4 cup pudding and a light sprinkle of additional crushed waffle cookies. Top each parfait with a dollop of the remaining whipped cream and 2 bacon halves.\n            \n", "ingredients": [{"food": "whole milk", "quantity": 3.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "cornstarch", "quantity": 0.25}, {"food": "salt", "quantity": 0.125}, {"food": "egg substitute", "quantity": 3.0}, {"food": "peanut butter ", "quantity": 0.75}, {"food": "bacon", "quantity": 6.0}, {"food": "syrup", "quantity": 0.25}, {"food": "ice cream swich", "quantity": 1.5}, {"food": "sugar", "quantity": 3.0}, {"food": "chocolate chip cookies", "quantity": 15.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.125}], "title": "\nElvis-Inspired Peanut Butter \"Brunch\" Parfait\n"}, {"directions": "\n\n              Hard-boil 6 eggs, then peel and slice in half. Scoop the yolks into a food processor and puree with 1 cup watercress leaves, 1/4 cup mayonnaise, 2 tablespoons each chopped scallions and tarragon, and salt and pepper. Cut 4 slices ham into thin strips; fold and place in the hollowed-out egg whites. Fill with the yolk mixture.\n            \n\n              Photograph by Stephanie Foley\n            \n", "ingredients": [], "title": "\nEmerald Eggs\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F.\n            \n\n              Bring a large pot of salted water to a boil over high heat. Cook the lasagna noodles, stirring occasionally, 1 minute longer than the package directs for al dente. The pasta should be tender enough so that it will roll without cracking. Drain well and rinse with cold water. Lay in a single layer on a baking sheet. \n            \n\n              Meanwhile, combine the chicken, jalapenos, chili powder, cumin, garlic, 1 cup cheese, 1/2 cup enchilada sauce, 1 tablespoon sour cream and the scallion whites in a large bowl until well combined.  \n            \n\n              Spread 1/4 cup of the enchilada sauce on to the bottom of a 13-by-9-inch baking dish. Lay half the cooked lasagna noodles on a clean work surface and spread a scant 1/4 cup of the chicken mixture over a noodle, covering it entirely. Starting with the short end, roll the noodle up. Transfer to the prepared baking dish seam-side down. Repeat with the remaining noodles and chicken mixture. Pour the remaining enchilada sauce over the lasagna rolls, then sprinkle with the remaining 1 cup cheese. Cover with foil and bake until the rolls are heated through and the sauce is bubbly, about 20 minutes. Remove the foil and bake until the cheese is browned on top, about 10 minutes. Let stand for 5 minutes. \n            \n\n              Stir 2 tablespoons water into the remaining sour cream and drizzle over the top of the noodles. Sprinkle with the scallion greens.\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "lasagna", "quantity": 12.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.25}, {"food": "chili powder", "quantity": 1.0}, {"food": "cumin seed", "quantity": 0.5}, {"food": "garlic powder", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 10.0}, {"food": "sour cream", "quantity": 0.3333333333333333}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}], "title": "\nEnchilada Lasagna Roll-Ups\n"}, {"directions": "\n\n              Puree 1/3 cup blue cheese, 2 tablespoons Greek yogurt and 3 tablespoons milk in a blender. Stir in some chopped chives, lemon juice, salt and pepper. Slice 4 heads endive lengthwise; toss with the dressing. Top with toasted walnuts, dried cranberries and more blue cheese and chives.\n            \n", "ingredients": [], "title": "\nEndive and Blue Cheese Salad\n"}, {"directions": "\n\n              Whisk 1 teaspoon dijon mustard, 1/2 teaspoon kosher salt, 2 tablespoons white wine vinegar, 1 tablespoon hazelnut oil and 3 tablespoons olive oil in a large bowl. Add 1 pint halved cherry tomatoes, 3 chopped endives and 4 chopped cucumbers; season with salt and pepper and toss. Top with chopped toasted hazelnuts.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [], "title": "\nEndive-Tomato Salad\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 300 degrees F and line a baking sheet with parchment paper.\n            \n\n              Stir together the rolled oats, chia seeds, almonds, cherries, coconut flakes, both types of raisins, the sunflower seeds, walnuts, maple syrup, cinnamon and vanilla in a large bowl. Pour onto the prepared baking sheet and season with salt.\n            \n\n              Bake, stirring after 15 minutes, until the nuts are golden brown, about 30 minutes total. Let cool and add to your favorite yogurt!\n            \n", "ingredients": [{"food": "oats", "quantity": 1.5}, {"food": "chia seeds", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.25}, {"food": "maraschino cherries", "quantity": 0.25}, {"food": "coconut water", "quantity": 0.25}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.25}, {"food": "raisins", "quantity": 0.25}, {"food": "sunflower seed kernels", "quantity": 0.25}, {"food": "walnuts", "quantity": 0.25}, {"food": "syrup", "quantity": 0.25}, {"food": "cinnamon", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 1}], "title": "\nEnergized Granola with Chia Seeds\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Heat the oil in a large pot over medium-high heat. Add the onions and cook, stirring, until softened and starting to brown, about 5 minutes. Stir in the carrots, peppers and zucchini and cook, stirring, until softened, about 15 minutes. Add the garlic, 1 teaspoon salt and 1/4 teaspoon pepper. Continue to cook, stirring, until the vegetables are lightly browned, for 10 minutes.\n            \n\n              Stir in the crushed tomatoes. Add 1 cup water to the empty tomato can and pour into the pot. Reduce the heat to medium low and simmer until the vegetables are very soft, the sauce has thickened slightly and the rawness from the canned tomatoes has mellowed, about 20 minutes. Puree the vegetables with a hand blender or transfer to a blender and puree until smooth, holding down the lid with a kitchen towel to prevent the hot sauce from spraying. Season with additional salt and pepper if needed and cool. You will have about 5 cups of sauce.\n            \n\n              While the sauce simmers, lay the English muffin halves in a single layer on a baking sheet and lightly toast in a toaster oven set to broil or under an oven broiler, 2 to 3 minutes. Spread the top of each muffin with 1 to 2 tablespoons of sauce. Combine the 2 cheeses and sprinkle over the sauce. To serve as a snack right away, add your desired toppings and place the assembled pizzas under the broiler in the oven or toaster oven until the cheese is melted, 2 to 3 minutes.\n            \n\n              To make ahead: Place the entire tray of mini pizzas in the freezer and freeze until hard, about 1 hour. Stack in a plastic freezer bag until ready to eat. To reheat, place the frozen pizzas on a piece of heavy-duty foil, add any toppings you like and bake in a toaster oven at 400 degrees F until golden, hot and the cheese is melted, 13 to 15 minutes.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "carrots", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "", "quantity": 1.5}, {"food": "garlic powder", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "tomatoes", "quantity": 28.0}, {"food": "split pea soup", "quantity": 6.0}, {"food": "", "quantity": 1.5}, {"food": "macaroni cheese", "quantity": 0.25}, {"food": "barley flour or meal", "quantity": 1}], "title": "\nEnglish Muffin Pizzas\n"}, {"directions": "\n\n              Wash all the escarole and tear 1 pound into bite-size pieces. Heat 1 tablespoon of the oil in a large nonstick skillet over medium heat until hot. Stir in the garlic, 3/4 teaspoon salt and 1/2 teaspoon pepper. Cook, stirring, until the garlic is golden, about 2 minutes. Stir in the torn escarole, a handful at a time, and cook, turning with tongs and adding more escarole as the greens wilt. Cook, stirring occasionally, until the liquid evaporates, about 5 minutes. Stir in the hot sauce.\n            \n\n              Place 4 tortillas on the work surface. Spread 1/2 cup of the cheese evenly over each tortilla, then divide the escarole among the tortillas, spreading evenly. Sprinkle the escarole with 1/2 cup more cheese per tortilla, spreading evenly. Top with the remaining tortillas.\n            \n\n              Wipe out the skillet. Heat 1 tablespoon of the oil over medium heat. Place 1 quesadilla in the skillet and cover. Cook until the bottom is golden, 2 to 3 minutes. Flip the tortilla and cook until the other side is golden, 2 to 3 minutes more. Transfer the quesadilla to a work surface and cook the remaining quesadillas in the same manner.\n            \n\n              Cut the remaining escarole into thin shreds. Add the beans, tomatoes, lime juice, cumin, the remaining 1 tablespoon oil and 1/2 teaspoon each salt and pepper.\n            \n\n              Cut the quesadillas into wedges and serve with the bean and escarole salad and salsa.\n            \n", "ingredients": [{"food": "escarole", "quantity": 1.25}, {"food": "vegetable oil", "quantity": 6.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "black bean mango", "quantity": 1}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "", "quantity": 4.0}, {"food": "fava beans", "quantity": 14.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.75}, {"food": "lime juice", "quantity": 1.0}, {"food": "cumin seed", "quantity": 0.75}, {"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 10.0}], "title": "\nEscarole Quesadillas\n"}, {"directions": "\n\n              Make lemon-basil oil:\n            \n\n              Mix 1/3 cup olive oil, a strip of lemon zest, 8 torn basil leaves and a pinch of salt; infuse 2 hours. Soak 1/2 thinly sliced red onion in water for 10 minutes to mellow the bite. When ready to serve, toss 1 head chopped escarole, the onion slices, 2 sliced celery stalks, 3/4 cup chopped green olives and a few tablespoons olive juice, 2 segmented lemons and 1/4 cup each toasted pine nuts and golden raisins in a serving bowl. Discard the zest from the infused oil, drizzle over the salad and season with salt and pepper.\n            \n\n              Photograph by Marcus Nilsson\n            \n", "ingredients": [], "title": "\nEscarole Salad\n"}, {"directions": "\n\n              Prepare the salad: Put the eggs in a saucepan; cover with cold water by 2 inches. Bring to a simmer over medium-high heat and cook 8 minutes. Transfer the eggs to a bowl of ice water with a slotted spoon, then drain, peel and roughly chop.\n            \n\n              Heat 1/4 inch olive oil in a medium skillet over medium-high heat. Add the bread cubes and fry, turning with a slotted spoon, until golden, about 2 minutes. Transfer the croutons to a paper towel-lined plate to drain.\n            \n\n              Discard the outer layer of leaves from the escarole. Separate the remaining leaves and coarsely chop. Toss with the croutons in a large bowl.\n            \n\n              Make the dressing: Put the lemon juice, orange juice, vinegar, olive oil, garlic and anchovies in a small covered container; shake well. Toss with the salad. Divide among plates, top with the hard-boiled eggs and season with salt and pepper.\n            \n\n              Photograph by Lisa Shin\n            \n", "ingredients": [{"food": "eggs", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "garlic bread", "quantity": 3.5}, {"food": "escarole", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "lemon juice", "quantity": 11.0}, {"food": "orange juice", "quantity": 11.0}, {"food": "vinegar", "quantity": 11.0}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "garlic powder", "quantity": 1.0}, {"food": "almond paste", "quantity": 5.0}], "title": "\nEscarole Salad With Anchovy Dressing\n"}, {"directions": "\n\n              Combine 3 tablespoons red wine vinegar, 4 minced anchovies and 1 grated garlic clove in a large bowl. Whisk in 1/3 cup olive oil; season with salt and pepper. Add 1 chopped small head escarole, 2 cups mixed baby lettuce and 1 cup fresh parsley; toss. Top with croutons.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [], "title": "\nEscarole Salad with Anchovy-Garlic Dressing\n"}, {"directions": "\n\n              1. Cook the bacon over medium heat in a medium skillet until crispy, about 12 minutes. Transfer to a paper towel-lined plate. To the drippings add the sliced onions and toss well. Cook until deep brown and well caramelized, stirring occasionally, another 25 minutes. Season with 1/4 teaspoon each salt and pepper. \n            \n\n              2. Meanwhile, in a small bowl stir together the cheese, vinegar and oil. The dressing will be chunky and not completely emulsified. Place the escarole in a large serving bowl and crumble the bacon over it. When the onions are done and still warm, sprinkle over the escarole along with the dressing. Toss well just before serving and season to taste with salt and pepper. \n            \n", "ingredients": [{"food": "bacon", "quantity": 4.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "macaroni cheese", "quantity": 4.75}, {"food": "vinegar", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "escarole", "quantity": 1.0}], "title": "\nEscarole Salad with Bacon, Caramelized Onions and Blue Cheese Vinaigrette\n"}, {"directions": "\n\n              Cook 3 tablespoons diced pancetta in a skillet until crisp; drain on paper towels. Add 2 tablespoons olive oil and 4 smashed garlic cloves to the skillet; cook 1 minute. Add 1 head chopped escarole and cook, tossing, until wilted, about 5 minutes. Add the pancetta and season with pepper.\n            \n\n              SERVES 4\n            \n\n              Calories: 124\n            \n\n              Total Fat: 10\n            \n\n              Saturated Fat: 2 grams\n            \n\n              Protein: 4 grams\n            \n\n              Total carbohydrates: 5 grams\n            \n\n              Sugar: 0 gram\n            \n\n              Fiber: 4 grams\n            \n\n              Cholesterol: 9 milligrams\n            \n\n              Sodium: 224 milligrams\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nEscarole With Pancetta\n"}, {"directions": "\n\n              Cook 4 chopped bacon slices in a skillet until crisp; remove with a slotted spoon and drain. Off the heat, whisk 3 tablespoons each currants and red wine vinegar, 2 tablespoons olive oil, and salt and pepper into the drippings. Toss with 1 head chopped escarole, chopped pistachios and the bacon.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nEscarole and Bacon Salad\n"}, {"directions": "\n\n              Puree 1/4 cup apple cider vinegar, 3 tablespoons chopped walnuts, 2 teaspoons dijon mustard, 1 teaspoon honey and 1/2 teaspoon kosher salt in a blender until smooth. Slowly add 1/3 cup olive oil with the motor running; blend until creamy. Combine 1 torn head escarole, 1 thinly sliced fennel bulb, 2 thinly sliced apples and/or pears, 1 cup fresh parsley, ½ cup chopped walnuts and 1/4 cup minced chives in a large bowl. Add the dressing, season with salt and pepper and toss.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [], "title": "\nEscarole-Apple Salad with Walnut Dressing\n"}, {"directions": "\n\n              Position a rack in the top third of the oven and preheat the oven to 350 degrees F.\n            \n\n              Mix together the flour, sugars, espresso powder, baking soda, anise seed, salt and chocolate chunks in a large bowl. Add the beaten eggs and stir with a wooden spoon until the dough starts to come together (it will be fairly dry before you knead it). Transfer the dough to a lightly floured surface. Knead the dough, squeezing it and pressing it against the surface, until you can form it into a ball, 15 to 20 times. Shape the dough into a flat log about 16 inches long and 2 inches wide. Cut the log in half crosswise. Brush the tops with a little bit of water and sprinkle the top and sides with some turbinado sugar.\n            \n\n              Place the logs side by side on a parchment-lined baking sheet and bake until golden, 30 to 35 minutes. Remove from the oven and cool for 10 minutes. Reduce the oven temperature to 325 degrees F.\n            \n\n              Transfer the logs to a cutting board and cut diagonally with a serrated knife into 1/2-inch slices. Place the cookies cut-side up on a baking sheet and bake until golden, about 10 minutes. Turn the cookies over and bake until golden on the other side, 8 to 10 more minutes. Transfer to a wire rack to cool. The centers will be slightly soft at first, but will crisp up as they cool.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "sugar", "quantity": 0.25}, {"food": "onion powder", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "anise seed", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "eggs", "quantity": 3.0}], "title": "\nEspresso Chocolate Chip Biscotti\n"}, {"directions": "\n\n              Chop the chocolate and put in a heatproof bowl. Bring the heavy cream, butter and salt to a simmer in a saucepan over medium heat; pour over the chocolate and let sit until completely melted, about 10 minutes. Stir with a rubber spatula or whisk until smooth. (If necessary, microwave in 20-second intervals until the chocolate melts.)\n            \n\n              Whisk in the vanilla extract, then the espresso. Stir until the ganache is smooth and shiny. Pour into a shallow baking dish and refrigerate until firm, at least 3 hours or overnight.\n            \n\n              Roll tablespoonfuls of the ganache into 18 to 24 balls, then roll in crushed toffee bars. Transfer to a parchment-lined baking sheet, cover with plastic wrap and refrigerate until firm, at least 1 hour or overnight. (To make these in advance, roll into balls but do not coat; cover and freeze up to 2 weeks. Let sit at room temperature for 20 minutes before uncovering, then roll in coating.)\n            \n\n              Photograph by Johnny Miller\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 12.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "", "quantity": 0.25}, {"food": "breakfast bars", "quantity": 1}], "title": "\nEspresso Chocolate Truffles With Toffee\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Rinse the rice in several changes of cold water, and then add to a medium saucepan with 3 3/4 cups water and 1 teaspoon salt. Bring to a boil, and then cover and reduce the heat to low. Cook, without stirring, until tender, about 15 minutes. Remove the saucepan from the heat and let stand, covered, 15 minutes more. Transfer the rice to a baking sheet. Stir together the vinegar, sugar and 1/2 teaspoon salt. Drizzle over the rice and fold in with a spatula. Let the rice cool completely (about 10 minutes in the refrigerator or 30 minutes at room temperature).\n            \n\n              Stir together the cream cheese, carrots and scallions.\n            \n\n              Place a piece of plastic wrap on the work surface and lightly oil. Place 1 1/3 cups rice on the plastic wrap and, using wet hands, press into a 7-inch square. Lay a single layer of salmon over the rice, leaving a 1/2-inch border on the side nearest to you. Line one-quarter of the vegetable cream cheese along the edge of salmon closest to you. Using the plastic wrap as an aid, firmly roll the sushi up into a cylinder. Press the rice together with even pressure to form a roll. Repeat with the remaining ingredients, making 3 more rolls.\n            \n\n              Stir together the onion flakes, sesame seeds, dried garlic and poppy seeds on a baking sheet. Roll each roll in the seed mixture. Cut each roll into 8 pieces with a wet knife. Serve with soy, wasabi and pickled ginger.\n            \n", "ingredients": [{"food": "crisped rice bar", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "vinegar", "quantity": 3.0}, {"food": "sugar", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "carrots", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "smoked turkey roll", "quantity": 12.0}, {"food": "onion powder", "quantity": 0.25}, {"food": "sesame seeds", "quantity": 0.25}, {"food": "garlic powder", "quantity": 2.0}, {"food": "seeds", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 1}], "title": "\nEverything Bagel Sushi Rolls\n"}, {"directions": "\nSpecial equipment: one 3 1/2-inch one 1 1/2-inch round cookie cutter\n\n              Preheat the oven to 350 degrees F. Spread the poppy seeds, sesame seeds, onion flakes and garlic flakes on a pie plate, and toast in the oven until fragrant and lightly browned, about 3 minutes. Set aside to cool, about 5 minutes.\n            \n\n              Whisk together the flour, baking powder and salt in a medium bowl. Reserving 2 tablespoons of the cooled \"everything\" mixture, whisk the rest in with the flour mixture, and set aside.\n            \n\n              Blend the sugar and butter on medium speed in the bowl of a stand mixer fitted with a paddle attachment until smooth, about 30 seconds. Add the egg yolks and sour cream, and continue blending, stopping to scrape down the bowl if necessary, until smooth and combined, 30 seconds more. Reduce the speed to low, and add the flour mixture by generous 1/4 cups, combining each addition before adding the next. Continue on low after the last addition until the dough forms a shaggy ball, about 30 seconds. Lay a piece of plastic wrap on a work surface, and lightly coat with cooking spray. Transfer the dough to the plastic wrap, and flatten it a bit into a narrow rectangle. Cover completely with the plastic wrap, and refrigerate for at least 1 hour or overnight.\n            \n\n              Line a baking sheet with parchment, lightly coat with cooking spray. Unwrap the dough, and place it lengthwise on a lightly floured work surface. Dust a rolling pin and the top of the dough with flour. Roll the dough into a rectangle that is 1/2 inch thick and about 6 1/2 by 9 1/2 inches. Cut out 6 rounds with a 3 1/2-inch round cookie cutter (since the dough doesn't reroll well, cut the doughnuts as closely as possible). Cut out a hole in the center of each with a 1 1/2-inch round cookie cutter. Carefully transfer the doughnuts and holes to the prepared baking sheet. Without rerolling the remaining dough, cut a few more rounds with the 1 1/2-inch cutter, and transfer them to the baking sheet. Refrigerate the cut dough for 30 minutes.\n            \n\n              Heat the oven to 275 degrees F. Line a baking sheet with paper towels. Heat 2 1/2 inches of oil (about 8 cups) to 375 degrees F in a heavy-bottomed pot or a Dutch oven. Carefully fry 2 doughnuts and about 4 holes at a time. They will sink, then slowly rise to the top. Once they float to the top, cook them until nicely browned, about 30 seconds, then flip and cook 30 seconds more. Remove them from the oil, let drain on the prepared baking sheet and sprinkle with some salt. Repeat with the remaining doughnuts and holes, keeping them warm in the oven until ready to serve.\n            \n\n              Transfer the doughnuts to a serving plate, drizzle with the honey and sprinkle with the reserved everything mixture.\n            \n", "ingredients": [{"food": "seeds", "quantity": 2.0}, {"food": "sesame seeds", "quantity": 2.0}, {"food": "onion powder", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "potato flour", "quantity": 2.5}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "salt", "quantity": 1.0}, {"food": "sugar", "quantity": 0.25}, {"food": "butter oil", "quantity": 1.0}, {"food": "egg substitute", "quantity": 3.0}, {"food": "sour cream", "quantity": 0.75}, {"food": "", "quantity": 1}, {"food": "vegetable oil", "quantity": 8.0}, {"food": "honey smoked ham", "quantity": 2.0}], "title": "\nEverything Doughnuts\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Line a baking sheet with foil and coat with cooking spray.\n            \n\n              Add the potatoes to a medium saucepan and cover with cold water. Bring to a boil over medium heat and cook until the potatoes are fork tender, about 15 minutes. Reserve 1/2 cup of the starchy water and drain the potatoes. Return the potatoes to the pan, add the cream cheese, scallions, the reserved starchy water and 2 teaspoons salt. Mash with a potato masher or fork. \n            \n\n              Meanwhile, mix together the bagel chips, everything bagel seasoning and 1 tablespoon oil in a small bowl. \n            \n\n              Press the bagel chip mixture onto the top of each salmon fillet. Transfer the fillets to the prepared baking sheet, skin side-down. Bake until the salmon is cooked through and the top is golden brown, 10 to 12 minutes. \n            \n\n              Arrange the tomato slices and onions on 4 plates and drizzle with the vinegar and remaining tablespoon of oil. Sprinkle with capers, if using, and season with salt and pepper. Divide the salmon and mashed potatoes among the plates.  \n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 1}, {"food": "sweet potatoes", "quantity": 2.5}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "potato chips", "quantity": 1.0}, {"food": "seasoning mix", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "vegetarian fillets", "quantity": 6.0}, {"food": "plum", "quantity": 4.25}, {"food": "onion powder", "quantity": 0.5}, {"food": "vinegar", "quantity": 2.0}, {"food": "capers", "quantity": 1.0}], "title": "\nEverything Salmon Fillets and Cream Cheese Potatoes\n"}, {"directions": "\n\n              For the dough: Warm the milk and 1/2 cup water in a medium saucepan over low heat to about 100 degrees F (but no more than 110 degrees F). Remove the saucepan from the heat, and sprinkle the yeast over the liquid. Sprinkle a pinch of the sugar over the top, and set aside without stirring until foamy, about 5 minutes. Then whisk in the butter and egg yolk.\n            \n\n              Whisk together the flour, remaining sugar and salt in a large bowl. Make a well in the center, and stir in the yeast mixture with a wooden spoon until you have a thick, slightly sticky dough. Turn the dough onto a floured work surface, and knead until soft and elastic, about 6 minutes. Shape the dough into a ball.\n            \n\n              Brush the inside of a large bowl with butter. Add the dough ball, turning to coat lightly. Cover the bowl with plastic wrap, trace a circle the size of the dough on the plastic and note the time. Let the dough rise in a warm place until doubled in size, about 1 hour 30 minutes.\n            \n\n              Turn the dough out of the bowl, and knead briefly to release excess air. Re-form it into a ball, and return it to the bowl. Lightly butter a large piece of plastic wrap, and lay it on the dough. Cover the entire bowl tightly with the rest of the plastic, and refrigerate for 4 hours or overnight to let the dough proof.\n            \n\n              For the filling: Preheat the oven to 350 degrees F. Spread the poppy seeds, sesame seeds, garlic flakes and onion flakes on a pie plate, and toast until lightly browned and fragrant, about 3 minutes. Let cool for 5 minutes. Mix the cream cheese, egg and flour in a small bowl until combined. Stir in the scallions, lemon zest, 1 teaspoon salt and a few grinds of pepper.\n            \n\n              To fill and form the buns: Butter a 9-by-13-inch baking pan with the 2 tablespoons softened butter. Turn the dough onto a floured work surface, and press it flat. Roll the dough into a 10-by-18-inch rectangle, with a long side facing you. Spread the filling evenly over the dough, leaving a 1-inch border on the side opposite you. Set aside 2 tablespoons of the toasted seed mix (for the topping), and scatter the rest over the filling. Starting from the side facing you, roll the dough up into a tight roll. Lightly brush the 1-inch border with water, and continue rolling to seal the roll. Fold the ends in just a bit, and if any spots look thicker than others, even out the roll with your hands.\n            \n\n              Cut the roll every 1 1/2 inches with a serrated knife, to make 12 buns. Place the buns cut-side down (except for the end pieces) in the prepared pan, spacing them 1 inch apart. Cover the buns loosely with plastic wrap, and set in a warm place to rise until they double in size with no gaps in between, 1 hour 30 minutes to 2 hours.\n            \n\n              For the topping: Stir the butter, reserved seed mix and scallions in a small bowl; set aside.\n            \n\n              Position an oven rack in the center of the oven, and preheat to 350 degrees F. Bake the buns until they're golden brown and the tops spring back when pressed lightly, 25 to 30 minutes. Spread the topping evenly over the buns, sprinkle with 1 teaspoon salt and return to the oven until the butter is melted and the topping is fragrant, 5 minutes more. Let the buns cool in the pan for 10 minutes before serving.\n            \n", "ingredients": [{"food": "whole milk", "quantity": 0.5}, {"food": "yeast extract spread", "quantity": 2.25}, {"food": "sugar", "quantity": 2.0}, {"food": "healthy request microwavable bowl", "quantity": 4.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "potato flour", "quantity": 2.75}, {"food": "salt", "quantity": 1.0}, {"food": "seeds", "quantity": 3.0}, {"food": "sesame seeds", "quantity": 3.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "onion powder", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "potato flour", "quantity": 0.25}, {"food": "turnip greens", "quantity": 5.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "butter oil", "quantity": 2.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "turnip greens", "quantity": 3.0}, {"food": "salt", "quantity": 1}], "title": "\nEverything Seed Buns\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the pasta and cook as the label directs. Reserve 1/2 cup cooking water, then drain.\n            \n\n              Combine the evaporated milk, eggs, havarti, Colby jack, 1/2 teaspoon salt and the nutmeg in a large saucepan over medium heat. Cook, whisking constantly, until smooth and thickened, about 8 minutes. Remove from the heat.\n            \n\n              Add the pasta and sour cream to the sauce; toss to coat, then let sit 5 minutes so the sauce thickens slightly. Add the reserved cooking water to loosen, if desired.\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "italian veg medley pasta", "quantity": 8.0}, {"food": "milk", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 1.5}, {"food": "hearts of palm", "quantity": 1}, {"food": "sour cream", "quantity": 0.25}], "title": "\nExtra Rich-and-Creamy Macaroni and Cheese\n"}, {"directions": "\n\n              You can make extra-creamy hummus using chickpea flour instead of whole chickpeas. (Look for the flour at specialty and health-food stores.) Simmer 2 3/4 cups salted water. Whisk in 3/4 cup chickpea flour to make a paste and cook 2 minutes. Puree with 1/4 cup tahini, 3 tablespoons olive oil and the zest and juice of 1 lemon. Toast 1/4 teaspoon each cumin and fennel seeds in a skillet; add some red pepper flakes and 2 tablespoons olive oil and cook 30 seconds. Serve warm, drizzled with the spiced oil and topped with parsley.\n            \n\n              Photograph by Sang An\n            \n", "ingredients": [], "title": "\nExtra-Creamy Hummus\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Brush a shallow 2 1/2-quart baking dish with butter. Put the potatoes in a large pot. Whisk the cream, flour, bay leaf, nutmeg, 1 teaspoon salt and 1/4 teaspoon white pepper in a bowl, then pour over the potatoes. Cook over medium heat, carefully stirring occasionally, until the cream just comes to a simmer, about 12 minutes. Continue to simmer, adjusting the heat if necessary and stirring to prevent the bottom from scorching, until the potatoes just begin to soften, about 5 more minutes. \n            \n\n              Transfer the potato mixture to the prepared baking dish; discard the bay leaf. Set the baking dish in a roasting pan and add enough water to come about halfway up the sides of the baking dish. Bake until the potatoes are tender and golden brown, about 1 hour. Remove the baking dish from the water bath and let stand 10 minutes before serving. \n            \n\n              Photograph by Kana Okada\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 1}, {"food": "sweet potatoes", "quantity": 2.125}, {"food": "ice cream swich", "quantity": 3.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "corier leaf", "quantity": 1.0}, {"food": "nutmeg", "quantity": 0.25}, {"food": "salt", "quantity": 1}], "title": "\nExtra-Creamy Scalloped Potatoes\n"}, {"directions": "\n\n              Position oven racks in the top and bottom thirds of the oven, and preheat to 300 degrees F. Line 2 baking sheets with parchment.\n            \n\n              Whisk together the flour, baking soda and salt in a large bowl. Beat the butter and both with an electric mixer sugars with an electric mixer on medium-high speed in a second large bowl until light and fluffy, about 4 minutes. Add the eggs to the butter mixture, one at time, beating after each addition to incorporate; beat in the vanilla. Reduce the speed to medium, add the flour mixture, and beat until just incorporated. Stir in the chocolate chips.\n            \n\n              Scoop 12 heaping tablespoons of dough onto each prepared baking sheet about 2 inches apart. Roll each into a ball with slightly wet hands. Bake until the cookies are golden, flat and crunchy, 24 to 28 minutes, rotating the baking sheets halfway through. Let the cookies cool for a few minutes on the baking sheets, then transfer them to a rack to cool completely.\n            \n\n              When the baking sheets have cooled completely, scoop the remaining dough onto 1 sheet and bake. Store the cookies in a tightly sealed container at room temperature for up to 5 days.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.25}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "butter oil", "quantity": 1.5}, {"food": "sugar", "quantity": 0.75}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 12.0}], "title": "\nExtra-Crispy Chocolate Chip Cookies\n"}, {"directions": "\n\n              Combine the garlic, ginger, chiles and 3 tablespoons kosher salt in a food processor and process to a fine paste; transfer the marinade to a large bowl. Using a paring knife, pierce each chicken wing two or three times through the skin then add to the marinade, tossing to coat evenly. Cover the bowl with plastic wrap and refrigerate for at least 2 hours, or preferably overnight.\n            \n\n              Meanwhile, toast the coconut in a medium skillet over medium heat, stirring often until golden, 4 to 5 minutes. Transfer the coconut to a bowl and let cool.\n            \n\n              Make the raita: Combine the cucumber and 1 teaspoon salt in colander set over a bowl, toss to combine and let stand for 30 minutes. Use your hands to squeeze as much moisture as possible from the cucumbers, then transfer them to a bowl. Stir in the yogurt, cilantro, lime zest and juice. Season the raita with more salt and pepper then cover with plastic wrap and refrigerate until ready to use, up to 2 days. Stir before serving.\n            \n\n              Put the chickpea flour in a large bowl. Using tongs, remove half the wings from the marinade and toss with the flour to coat evenly. Transfer the wings to a wire rack set over a baking sheet and repeat the dredging process with the remaining wings. Discard any leftover chickpea flour.\n            \n\n              Heat 2 inches of oil in a large, heavy-bottomed pot over medium heat until a deep-fry thermometer registers 350 degrees F. Working in 2 batches, fry the wings, turning occasionally, until golden brown and cooked through, 16 to 18 minutes per batch. Use a slotted spoon to transfer the wings to a large bowl and sprinkle with salt. (Make sure the oil returns to the proper temperature between batches.)\n            \n\n              Toast the mustard and coriander seeds in a medium skillet over medium heat, swirling the pan until the mustard seeds begin to pop and the spices are fragrant, 2 to 3 minutes. Stir in the turmeric, cook for 10 seconds, then stir in the butter. Heat until the butter melts and the spices begin to sizzle, about 1 minute. Pour the butter and spices over the chicken wings, toss to coat, then transfer to a serving platter. Add the toasted coconut to the seasonings left in the large bowl, then sprinkle over the wings. Serve immediately with the raita on the side.\n            \n", "ingredients": [{"food": "garlic powder", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 8.0}, {"food": "seeds", "quantity": 10.0}, {"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 4.0}, {"food": "coconut water", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1.0}, {"food": "silk plain soy yogurt", "quantity": 1.0}, {"food": "", "quantity": 2.0}, {"food": "grape juice", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "vegetable oil", "quantity": 1}, {"food": "chickpea flour", "quantity": 3.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "whole milk", "quantity": 1.0}, {"food": "turmeric", "quantity": 0.5}, {"food": "diced chicken", "quantity": 1.0}], "title": "\nExtra-Crispy Indian Spiced Chicken Wings\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: an 18-by-13-inch sheet pan\n\n              Position a rack in the upper third of the oven and preheat to 450 degrees F. Bring a large pot of salted water to a boil. Add the macaroni, and cook according to package directions until al dente. Drain the macaroni, reserving 1 1/2 cups of the pasta water. Set aside.\n            \n\n              Heat the half-and-half, cream cheese, and reserved pasta water in a large pot over medium heat, stirring until the cream cheese is completely melted and the mixture just comes to a simmer. Remove from heat and add the cheddar, Monterey jack, Dijon mustard, and hot sauce, whisking until the cheeses are melted and the sauce is smooth. \n            \n\n              Add the macaroni to the pot and stir to combine. (It will look very loose, but the pasta will absorb some of the sauce as it bakes.) Season to taste with salt if desired. Spread the macaroni mixture on an 18-by-13-inch sheet pan.\n            \n\n              Toss the panko, butter and 1/2 teaspoon salt together in a medium bowl and sprinkle evenly over the pasta. Bake until the cheese is bubbly and the bread crumbs are brown and crisp, rotating halfway through, 20 to 25 minutes.\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "", "quantity": 2.0}, {"food": "butter oil", "quantity": 6.0}], "title": "\nExtra-Crunchy Sheet-Pan Mac and Cheese\n"}, {"directions": "\n\n              Line an 8-inch square baking dish with aluminum foil and spray generously with nonstick cooking spray. Combine the cereal with 1 bag marshmallows in a large bowl; set aside.\n            \n\n              Melt the butter in a large heavy-bottomed pot or stockpot over medium-high heat. Add the 3 remaining bags of marshmallows and cook, stirring occasionally, until they are fully melted, about 5 minutes. Remove the pan from the heat and stir in the vanilla extract. Fold half the cereal mixture into the melted marshmallows until well-coated; fold in the remaining cereal mixture. \n            \n\n              Scoop the mixture into the prepared pan. Spray another piece of foil with cooking spray and use it to cover the mixture, pressing gently on the foil to evenly spread the mixture out, getting it evenly into the corners and flattening the top (you can dome the top slightly if you have extra mixture). Place in the refrigerator to set, around 1 hour. Cut into 2-inch squares and serve. Leftovers keep in an airtight container at room temperature, 2 days; or wrap in a freezer bag and freeze.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "crisped rice bar", "quantity": 9.0}, {"food": "", "quantity": 10.0}, {"food": "butter oil", "quantity": 6.0}, {"food": "vanilla extract", "quantity": 1.0}], "title": "\nExtra-Marshmallow Crispy Rice Treats\n"}, {"directions": "\n\n              Beat 8 eggs, 1 cup milk, chopped parsley, and salt and pepper. Add 1/2 cup stuffing bread cubes and 2 cups leftover cooked vegetables (such as broccoli or cauliflower). Heat 2 tablespoons olive oil in an ovenproof 10-inch nonstick skillet over medium-high heat; add the egg mixture and cook 2 minutes. Reduce the heat to medium-low, top with grated cheddar and cook 10 minutes. Broil 3 minutes, then slice.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [], "title": "\nExtra-Veggie Frittata\n"}]