[{"directions": "\n\n              Pulse 3/4 cup of the cilantro, the scallion whites, chipotles, chili powder, lime juice, 2 teaspoons of the salt, and 1 tablespoon of the olive oil in a mini-food processor to make a smooth paste. Coat the steak with the paste. Toss the peppers and onion with 1 tablespoon of the olive oil, and 1/2 teaspoon salt.\n            \n\n              Toast the cumin seeds in a small dry skillet over medium-high heat, about 1 minute. Mix seeds with the cabbage, remaining scallion greens, and remaining 1/4 cup cilantro in a large bowl. Set aside.\n            \n\n              Set a rack 6-inch from the broiler heating element and preheat the broiler. Preheat a broiler pan for about 10 minutes.\n            \n\n              Carefully pull the preheated pan from the broiler, set the steak in the center of the pan, and surround (but do not cover) with the peppers and onion. Return to the broiler. Cook until the meat feels firm but still gives gently when pressed, about 12 minutes for medium rare. Remove steak to a platter and let rest about 10 minutes before slicing. Toss the vegetables, and continue broiling until they soften and char, another 6 to 8 minutes.\n            \n\n              Dress slaw with orange juice and zest, lime zest, 1 1/2 teaspoons salt and 1 tablespoon oil.\n            \n\n              Slice the steak, against the grain, into very thin slices. Arrange on a platter with the peppers and onions. Serve with the slaw.\n            \n\n              Copyright 2005 Television Food Network, G.P. All rights reserved.\n            \n", "ingredients": [{"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "martha white foods", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "chili powder", "quantity": 1.5}, {"food": "lime juice", "quantity": 1.0}, {"food": "salt", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "", "quantity": 1.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.5}, {"food": "seeds", "quantity": 0.5}, {"food": "swamp cabbage", "quantity": 0.5}, {"food": "orange", "quantity": 0.5}, {"food": "orange juice", "quantity": 2.0}, {"food": "lime", "quantity": 1.0}], "title": "\nFajita Salad\n"}, {"directions": "\n\n              Pulse the chickpeas, garlic, half each of the scallions, cilantro and pickled peppers, the panko and cumin in a food processor until smooth, about 3 minutes. Form into 4 thin 3-inch patties.\n            \n\n              Heat the vegetable oil in a large nonstick skillet over medium-high heat. Add the patties and cook until a golden crust forms, 3 to 4 minutes per side.\n            \n\n              Meanwhile, whisk the yogurt with the pickled pepper brine in a medium bowl and season with salt. Toss the salad greens, chopped tomato and the remaining scallions and cilantro with half of the yogurt dressing in a large bowl.\n            \n\n              Put the falafel patties on the sandwich thins; top with the sliced tomato and the remaining yogurt dressing and pickled peppers. Serve with the salad.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [{"food": "chickpeas", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "silk light vanilla", "quantity": 4.0}, {"food": "", "quantity": 0.5}, {"food": "barley flour or meal", "quantity": 0.3333333333333333}, {"food": "", "quantity": 0.75}, {"food": "cumin seed", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "silk banana-strawberry soy yogurt", "quantity": 0.75}, {"food": "salt", "quantity": 1}, {"food": "mixed nuts", "quantity": 1.0}, {"food": "", "quantity": 2.0}, {"food": "", "quantity": 4.0}], "title": "\nFalafel Burgers\n"}, {"directions": "\n\n              Pulse half each of the parsley and onion, the cumin, 1/2 teaspoon salt and a few grinds of pepper in a mini food processor to make a paste. Put the chickpeas in a large bowl and roughly mash with a potato masher, leaving some whole. Add the parsley mixture, egg and 1/2 cup panko; stir to combine. Refrigerate 10 minutes.\n            \n\n              Meanwhile, combine the tomatoes, the remaining parsley and onion and 1/2 teaspoon salt in a medium bowl; set aside. Whisk the hummus and yogurt in another bowl to make a dressing.\n            \n\n              Put the remaining 1 cup panko on a baking sheet. Scoop tablespoonfuls of the chickpea mixture and roll in the panko to coat and form a ball. Heat 1 inch vegetable oil in a large high-sided skillet over medium-high heat. Fry the falafel, turning often, until golden, about 6 minutes. Remove to a paper towel-lined plate to drain.\n            \n\n              Toss the lettuce with half of the hummus dressing in a large bowl. Top with the tomato mixture and falafel. Serve with the remaining hummus dressing.\n            \n\n              Photographs by Charles Masters\n            \n", "ingredients": [{"food": "parsley", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "cumin seed", "quantity": 0.75}, {"food": "salt", "quantity": 1}, {"food": "chickpeas", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "", "quantity": 1.5}, {"food": "barley flour or meal", "quantity": 1.5}, {"food": "hummus", "quantity": 1.0}, {"food": "silk banana-strawberry soy yogurt", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "hearts of palm", "quantity": 2.0}], "title": "\nFalafel Salad with Hummus Dressing\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Set a rack on a rimmed baking sheet and coat with cooking spray. Toss the chicken with the olive oil in a large bowl, then add the falafel mix and toss to coat. Arrange the chicken on the rack and bake until golden and cooked through, about 10 minutes. While the chicken is baking, stack the pita halves and wrap them in foil; warm in the oven, about 5 minutes. \n            \n\n              Meanwhile, mix the hummus, lemon zest and juice, harissa and 3 tablespoons water in a large bowl. Remove 2 tablespoons of the hummus sauce and reserve. Add the coleslaw mix, radishes and parsley to the remaining hummus sauce and toss. Season with salt. \n            \n\n              Divide the chicken among plates and drizzle with the reserved hummus sauce. Stuff the slaw in the pitas and serve with the chicken. \n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "diced chicken", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "cheesecake mix", "quantity": 0.5}, {"food": "", "quantity": 2.0}, {"food": "hummus", "quantity": 6.0}, {"food": "grape juice", "quantity": 1.0}, {"food": "hot pockets ham cheese stuffed swich", "quantity": 0.5}, {"food": "cheesecake mix", "quantity": 4.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 6.0}, {"food": "parsley", "quantity": 1.0}, {"food": "salt", "quantity": 1}], "title": "\nFalafel-Crusted Chicken With Hummus Slaw\n"}, {"directions": "\n\n              Combine cheeses, milk and cornstarch in a bowl and refrigerate, for 2 hours.\n            \n\n              When ready to make the fondue: Set up a fondue pot, double boiler, or place a bowl over a saucepan of simmering water. Melt the butter in the pan or bowl. Then add the cheese mixture and heat gently, stirring until the cheese has melted and the mixture is thick enough to coat the back of spoon. Take care to regulate the heat to make sure the water doesn't boil, as overheating the cheese will cause it to curdle. Add the apple brandy just before serving. Keep warm and serve with the selection of dippers.\n            \n", "ingredients": [{"food": "", "quantity": 8.0}, {"food": "", "quantity": 4.0}, {"food": "whole milk", "quantity": 0.75}, {"food": "cornstarch", "quantity": 0.5}, {"food": "butter oil", "quantity": 1.0}, {"food": "apple", "quantity": 1.0}, {"food": "", "quantity": 1}, {"food": "sweet potatoes", "quantity": 1}, {"food": "apples", "quantity": 1}, {"food": "prickly pears", "quantity": 1}], "title": "\nFall Fondue with Gouda\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F.\n            \n\n              Heat 1 tablespoon oil in a large cast-iron skillet over medium-high heat. Sprinkle the steaks with salt and pepper and cook, flipping as needed, until browned all over and cooked to medium-rare (an internal temperature of 130 to 135 degrees F), 7 to 8 minutes. Transfer the steaks to paper towels to drain, wipe the skillet clean and return to medium heat.\n            \n\n              Heat the remaining 3 tablespoons oil in the skillet, then add the mushrooms. Sprinkle with salt and pepper and cook, stirring, until golden brown, 4 to 5 minutes. Add the onion and peppers, sprinkle with salt and pepper and cook, stirring, until lightly charred and soft, 7 to 8 minutes. Transfer to a bowl.\n            \n\n              Wipe out the skillet and sprinkle the cheese in it. Warm in the oven until melted, about 3 minutes.\n            \n\n              Meanwhile, divide the onions and mushrooms among the rolls. Very thinly slice the steaks and them divide among the rolls. Evenly pour some of the cheese over each roll. Sprinkle with flaky sea salt.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 4.0}, {"food": "prime steaks", "quantity": 8.0}, {"food": "black bean mango", "quantity": 1}, {"food": "mixed nuts", "quantity": 8.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "pizza rolls", "quantity": 4.0}, {"food": "sea lion", "quantity": 1}], "title": "\nFancy Philly Cheesesteak\n"}, {"directions": "\n\n              Preheat oven to 400 degrees F. \n            \n\n              Melt butter in a large cast-iron skillet over medium heat. Add potatoes and cook, stirring occasionally, until tender and brown, about 15 minutes. Stir in parsley and garlic. Season with salt and pepper, to taste, and remove from heat.\n            \n\n              Make 4 shallow depressions in potatoes and break 2 eggs into each. Transfer to oven and bake until egg whites are cooked and yolks are still runny, about 10 minutes. Sprinkle cheese over eggs and continue baking until cheese melts, about 1 minute more. Serve immediately.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 3.0}, {"food": "sweet potatoes", "quantity": 1.5}, {"food": "parsley", "quantity": 0.25}, {"food": "garlic powder", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "eggs", "quantity": 8.0}, {"food": "macaroni cheese", "quantity": 1.0}], "title": "\nFarmhouse Baked Eggs with Cheddar & Potatoes\n"}, {"directions": "\n\n              Cook the farro as the label directs. Drain and rinse under cold water, then transfer to a large bowl and toss with 2 tablespoons olive oil.\n            \n\n              Heat the remaining 1 tablespoon olive oil in a large skillet over medium-high heat. Add the corn and cook, stirring occasionally, until it begins to char, about 2 minutes. Add the tomatoes and scallions and cook, stirring, until they just begin to wilt, about 2 more minutes. Add 1/4 teaspoon salt, and pepper to taste.\n            \n\n              Stir the corn mixture into the farro. Add the arugula, lemon zest and lemon juice and toss. Season with salt and pepper.\n            \n\n              Photograph by Kana Okada\n            \n", "ingredients": [{"food": "barley flour or meal", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "corn bran", "quantity": 1.5}, {"food": "silk black cherry soy yogurt", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "arugula", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "", "quantity": 1.0}], "title": "\nFarro and Corn Salad\n"}, {"directions": "\n\n              Preheat the oven to 450 degrees F. Mince 1/2 red onion; cut the remaining 1 1/2 onions into 1/2-inch-thick wedges and set aside. Heat 1 tablespoon olive oil in a large pot or Dutch oven over medium-high heat. Add the minced onion, mushrooms and 1 teaspoon thyme; season with salt and pepper. Cook, stirring, until the vegetables are tender, about 5 minutes.\n            \n\n              Add the farro to the pot and cook, stirring, until toasted, about 1 minute. Add the wine and cook, stirring, until evaporated, 1 to 2 minutes. Add 5 cups water; bring to a boil. Reduce the heat to maintain a simmer and cook until the farro is tender and the liquid is mostly absorbed, 25 to 30 minutes.\n            \n\n              Meanwhile, combine the onion wedges, butternut squash and the remaining 2 tablespoons olive oil and 1 teaspoon thyme in a large bowl; season with 1/2 teaspoon salt and a few grinds of pepper and toss. Spread on a rimmed baking sheet. Roast until the vegetables are tender and browned, about 25 minutes.\n            \n\n              Add the cubed brie to the farro; stir until creamy. Stir in the parsley. Top each serving of farro with the vegetables and a slice of brie.\n            \n", "ingredients": [{"food": "onions", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 8.0}, {"food": "thyme", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 1.3333333333333333}, {"food": "martha white foods", "quantity": 0.25}, {"food": "squash", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 3.0}, {"food": "parsley", "quantity": 0.5}], "title": "\nFarro with Brie and Squash\n"}, {"directions": "\n\n              Cook 1 cup farro as the label directs. Heat 2 tablespoons olive oil in a medium saucepan over medium-high heat. Add 1 small bunch chopped Tuscan kale and a pinch each of salt and red pepper flakes. Cook, stirring, until the kale wilts, about 3 minutes. Stir in the farro and 1 tablespoon olive oil, then 1/4 cup grated parmesan; season with salt. Drizzle with more oliuve oil and top with more parmesan.\n            \n\n              Photograph by Ryan Liebe\n            \n", "ingredients": [], "title": "\nFarro with Kale\n"}, {"directions": "\n\n              Bring the bulgur and 1 cup water to a simmer in a small saucepan. Reduce the heat to a low simmer, cover and cook until all the water is absorbed and the bulgur is tender and fluffy, 12 to 15 minutes. Let cool completely.\n            \n\n              Put the oil, lemon zest and juice, vinegar, honey, 1/2 teaspoon salt and a few grinds of pepper in a small jar or container with a lid. Secure the lid, and shake to combine.\n            \n\n              Put the romaine, tomatoes, bell peppers, parsley, scallions, mint and cooked bulgur in a large bowl. Add the vinaigrette, and toss. Season to taste with salt and pepper\n            \n", "ingredients": [{"food": "wheat flour", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "grape juice", "quantity": 0.5}, {"food": "vinegar", "quantity": 2.0}, {"food": "honey smoked ham", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 1.0}, {"food": "plum", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "chrysanthemum leaves", "quantity": 1}], "title": "\nFattoush-ish Salad\n"}, {"directions": "\n\n              Cut 2 oranges and 4 lemons in half, scoop out the flesh, then put the rinds in a muffin tin to keep them level. Boil 1 1/2 cups water, add two 3-ounce boxes orange gelatin, mix and cook, stirring, 3 minutes; pour the mixture to the brim of each orange half. Repeat with two 3-ounce boxes lemon gelatin and the lemon halves. Refrigerate 3 hours and slice into wedges.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [], "title": "\nFaux Fruit Slices\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F with 2 racks set in the middle of the oven.\n            \n\n              Brush the lavash sheets on both sides with 3 tablespoons of the oil. Season lightly with salt and pepper. Cut into 2- by 1-inch rectangles. Place the rectangles on 2 baking sheets in a single layer. Bake until lightly browned and crispy, about 5 minutes. Halfway through cooking, rotate the baking sheets front to back and top to bottom, flipping the lavash pieces over if needed.\n            \n\n              Heat a large grill pan over medium heat. Brush the chicken with 2 tablespoons of the oil and sprinkle liberally with salt and pepper. Grill until slightly charred on both sides and the internal temperature of the chicken reaches 160 degrees F, 15 to 18 minutes. Rest the chicken on a cutting board for 5 minutes.\n            \n\n              Meanwhile, make the dressing: Whisk the honey, lemon zest, lemon juice, garlic and sumac together in a large bowl. Slowly whisk in the remaining oil. Season with salt and pepper.\n            \n\n              To serve, slice the chicken thinly against the grain. Use gloved hands to toss the sliced chicken, romaine, cucumbers, tomatoes, mint and lavash with the dressing. Gently break up the lavash pieces with your hands to better incorporate them into the salad. Season with salt and pepper if needed. Serve family-style, or divide the salad among 4 large plates. Drizzle with additional oil and sprinkle with sumac.\n            \n", "ingredients": [{"food": "", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 0.6666666666666666}, {"food": "black bean mango", "quantity": 1}, {"food": "diced chicken", "quantity": 2.0}, {"food": "honey smoked ham", "quantity": 1.5}, {"food": "grape juice", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "", "quantity": 0.5}, {"food": "hearts of palm", "quantity": 2.0}, {"food": "", "quantity": 2.25}, {"food": "grape juice", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 0.75}], "title": "\nFaux-toush Salad with Lavash\n"}, {"directions": "\n\n              Trim the tops and bottoms from the fennel bulbs, reserving a handful of the fronds. Quarter the bulbs. Set each quarter on its side and slice off most of the core. Cut the quarters into wedges about 1-inch thick (don't worry if some pieces fall off the wedge-use those too).\n            \n\n              In a large skillet with a tight-fitting lid, heat the olive oil over medium-high heat until almost smoking. Add the fennel and cook, without stirring, until golden brown on the bottom, about 5 minutes. Stir and let some more pieces brown for a minute or two.\n            \n\n              Stir in 1/2 cup water, scraping the bottom of the pan. Season with salt and pepper. Lower the heat to medium and cover the pan. Simmer, shaking the pan and adding more liquid occasionally if the pan is dry, until the fennel is very tender, 12 to 15 minutes.\n            \n\n              Meanwhile, chop the reserved fennel fronds and mix them with the lemon zest.\n            \n\n              When the fennel is tender, stir in the lemon juice and cook for 1 minute. Stir in the olives, remove from the heat and let stand for about 1 minute to warm the olives. Transfer the fennel to a platter. Sprinkle the fennel frond mixture over the top, drizzle with additional olive oil and serve.\n            \n", "ingredients": [{"food": "fennel seed", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "black bean mango", "quantity": 1}, {"food": "lemon juice", "quantity": 1.0}, {"food": "black bean mango", "quantity": 0.5}], "title": "\nFennel Braised with Olive Oil and Lemon\n"}, {"directions": "\n\n              1. Preheat the oven to 350 degrees F. Butter a 9 by 13-inch baking dish. Add the fennel, Parmesan, garlic, and 1/4 teaspoon salt and toss to combine. \n            \n\n              2. Whisk the mustard into the heavy cream and pour over the fennel mixture. Bake until bubbling and golden, about 1 hour.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 2.0}], "title": "\nFennel Gratin\n"}, {"directions": "\n\n              Toss 1 pound halved fingerling potatoes with 1 sliced fennel bulb, 1 sliced white onion, 6 sliced garlic cloves, 8 sage leaves, 3 tablespoons olive oil, and salt and pepper on a baking sheet. Roast at 425 degrees F until golden and crisp, 35 to 40 minutes, tossing halfway through. Season with salt and drizzle with olive oil.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nFennel Potatoes\n"}, {"directions": "\n\n              Slice two bulbs of fennel as thinly as you can (use a mandoline if you have one) and toss with red onion slices and some of the fennel fronds. Add kosher salt, lemon juice and extra-virgin olive oil to taste and toss.\n            \n\n              Photograph by Tina Rupp\n            \n", "ingredients": [], "title": "\nFennel Salad\n"}, {"directions": "\n\n              Whisk 2 tablespoons white balsamic vinegar with 1/4 cup olive oil in a large bowl; season with salt and pepper. Add 1 thinly sliced fennel bulb and 1 tablespoon chopped fronds, 2 segmented blood oranges, 2 cups baby kale and 1/4 cup each thinly sliced red onion and chopped toasted hazelnuts; toss. Top with crumbled gorgonzola. \n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [], "title": "\nFennel Salad with Blood Oranges\n"}, {"directions": "\n\n              Quarter, core and thinly slice 1 large fennel bulb; chop 1/3 cup of the fronds. Combine in a large bowl with 6 thinly sliced celery stalks and 2 cups baby arugula. Toss with 3 tablespoons each olive oil and lemon juice, 1/4 teaspoon lemon zest, and salt and pepper to taste.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [], "title": "\nFennel-Arugula Salad\n"}, {"directions": "\n\n              Whisk 1/3 cup sour cream, 3 tablespoons apple cider vinegar, some chopped fresh dill and chives and 1 teaspoon each caraway seeds and celery salt. Toss in 1 thinly sliced fennel bulb and 1/2 head thinly sliced red cabbage. Season with salt and pepper;  chill 20 minutes.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nFennel-Cabbage Slaw\n"}, {"directions": "\n\n              Whisk 2 tablespoons white wine vinegar and 1 tablespoon each dijon mustard and mayonnaise. Gradually whisk in 1/4 cup olive oil; season with salt and pepper. Toss with 1 thinly sliced pear, 1/2 thinly sliced fennel bulb and 1 cup each halved grapes and sliced celery. Top with chopped toasted pecans and some chopped fennel fronds.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [], "title": "\nFennel-Pear Salad with Grapes and Pecans\n"}, {"directions": "\n\n              In a large deep skillet, saute 1/2 pound crumbled sweet Italian sausage in 6 tablespoons butter for 5 minutes. Season with salt and pepper and add 1 diced fennel bulb, 1 diced onion, and 1 tablespoon each chopped sage and thyme; cook 5 minutes, then add 1 diced peeled apple and cook 2 minutes. Pour in 2 1/2 to 3 cups chicken broth. In a large bowl, mix 2 eggs and 1/4 cup chopped parsley. Add to the bowl 16 cups toasted white bread cubes and the hot broth mixture. Gently toss the stuffing, then spread in a buttered 9-by-13-inch baking dish. Dot the top with butter or turkey pan drippings, cover and bake 30 minutes at 350. Uncover and bake until golden, 20 more minutes. \n            \n\n              Photograph by Karl Juengel/Studio D\n            \n", "ingredients": [], "title": "\nFennel-Sausage Stuffing\n"}, {"directions": "\n\n              Toast the fennel seeds in a small skillet over medium heat, shaking the skillet, until the seeds are fragrant and a shade darker, about 2 minutes. Add the sugar and 3/4 cup water and bring to a simmer, stirring constantly, to dissolve the sugar, and until the mixture is reduced by about 1/2, about 3 minutes. Remove from the heat and steep 10 minutes.\n            \n\n              In a blender or food processor and working in batches, puree the watermelon with the fennel syrup, lemon juice, and a pinch of salt, transferring the batches to a pitcher as blended. Stir well to combine. Serve the cooler in a glass over ice and garnish with a lemon wedge.\n            \n", "ingredients": [{"food": "fennel seed", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "coconut water", "quantity": 0.75}, {"food": "watermelon seed krnls", "quantity": 10.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 1}], "title": "\nFennel-Scented Watermelon Cooler\n"}, {"directions": "\n\n              Cut store-bought pie dough into holiday shapes and fry in 350 degree vegetable oil until golden. Cool on paper towels and dust with confectioners' sugar.\n            \n", "ingredients": [], "title": "\nFestive Fritters\n"}, {"directions": "\n\n              Position a rack in the center of the oven and preheat to 350 degrees. Whisk the eggs, milk and cayenne together in a bowl; add 1 teaspoon Kosher salt and freshly ground pepper to taste. Fold in the cheese and dill.\n            \n\n              Heat 1 tablespoon olive oil in an ovenproof 6- or 8-inch nonstick skillet over medium-low heat, swirling to coat the pan. Add the cauliflower, 1/4 teaspoon Kosher salt and pepper to taste; cook until crisp-tender, about 5 minutes. Pour the egg mixture into the skillet and stir gently with a rubber spatula to distribute the filling. Cook until the bottom is just set but not brown, about 4 minutes. Transfer the skillet to the oven and bake until the frittata is almost set on top, about 15 minutes. Remove from the oven, cover and set aside for 5 minutes to finish cooking.\n            \n\n              Season the greens with salt and pepper and toss with the remaining 2 tablespoons oil and the vinegar. Slide the frittata onto a cutting board and slice into wedges. Sprinkle generously with more dill; serve warm or at room temperature with the salad.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "eggs", "quantity": 10.0}, {"food": "milk", "quantity": 0.25}, {"food": "hearts of palm", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "dill seed", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}, {"food": "mixed nuts", "quantity": 6.0}, {"food": "vinegar", "quantity": 1.0}], "title": "\nFeta-and-Cauliflower Frittata\n"}, {"directions": "\n\n              For the dough: Warm the milk and 1/2 cup water in a medium saucepan over low heat to about 100 degrees F (but no more than 110 degrees F). Remove the saucepan from the heat, and sprinkle the yeast over the liquid. Sprinkle a pinch of the sugar over the top, and let sit without stirring until foamy, about 5 minutes. Then whisk in the butter and egg yolk.\n            \n\n              Whisk together the flour, remaining sugar and salt in a large bowl. Make a well in the center, and stir in the yeast mixture with a wooden spoon until you have a thick, sticky dough. Turn the dough onto a floured work surface, and knead until soft and elastic, about 6 minutes. Shape the dough into a ball.\n            \n\n              Brush the inside of a large bowl with butter. Add the dough ball, turning to coat lightly. Cover the bowl with plastic wrap, trace a circle the size of the dough ball on the plastic and note the time. Let the dough rise in a warm place until doubled in size, about 1 hour 30 minutes.\n            \n\n              Turn the dough out of the bowl, and knead briefly to release excess air. Re-form it into a ball, and return it to the bowl. Lightly butter a large piece of plastic wrap, and lay it on the dough. Cover the entire bowl tightly with the rest of the plastic, and refrigerate for 4 hours or overnight to let the dough proof.\n            \n\n              For the filling: Melt the butter in a medium nonstick skillet over medium heat. Add the chopped shallots, and cook until soft, about 3 minutes. Add the spinach, and cook until it is cooked through and nearly all the liquid has evaporated, 5 to 7 minutes. Remove the skillet from the heat, and stir in the feta, 1/4 cup of the Parmesan, lemon zest, nutmeg, 1/2 teaspoon salt and a few grinds of pepper. Transfer the filling to a medium bowl, and let cool completely. (The filling will firm up a bit, but if it's too warm, it will be difficult to form the buns.)\n            \n\n              To fill and form the buns: Butter a 9-by-13-inch baking pan with 2 tablespoons softened butter. Turn the dough onto a floured work surface, and press it flat. Roll it into a 10-by-18-inch rectangle, with a long side facing you. Spread the filling evenly over the dough, leaving about a 1-inch border on the side opposite you. Sprinkle the remaining 2 tablespoons Parmesan evenly over the filling. Starting from the side facing you, roll the dough up into a tight roll. Lightly brush the 1-inch border with water, and continue rolling to seal the roll. Fold the ends in just a bit, and if any spots look thicker than others, even out the roll with your hands.\n            \n\n              Cut the roll every 1 1/2 inches with a serrated knife, to make 12 buns. Place the buns cut-side down (except for the end pieces) in the prepared pan, spacing them 1 inch apart. Cover them loosely with plastic wrap, and set in a warm place to rise until the buns double in size, leaving no gaps in between, 1 hour 30 minutes to 2 hours.\n            \n\n              For the topping: Stir together the butter, dill, lemon zest and a pinch each of salt and pepper in a small bowl; set aside.\n            \n\n              Position an oven rack in the center of the oven, and preheat to 350 degrees F. Bake the buns until they're golden brown and the tops spring back when pressed lightly, 25 to 30 minutes. Spread the topping evenly over the buns, and return them to the oven until the butter is melted and the topping is fragrant, 5 minutes more. Let them cool in the pan for 10 minutes before serving.\n            \n", "ingredients": [{"food": "whole milk", "quantity": 0.5}, {"food": "yeast extract spread", "quantity": 2.25}, {"food": "sugar", "quantity": 2.0}, {"food": "healthy request microwavable bowl", "quantity": 4.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "potato flour", "quantity": 2.75}, {"food": "salt", "quantity": 1.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "", "quantity": 0.5}, {"food": "mustard spinach", "quantity": 10.0}, {"food": "", "quantity": 0.5}, {"food": "", "quantity": 0.25}, {"food": "lemon juice", "quantity": 1.0}, {"food": "nutmeg", "quantity": 0.25}, {"food": "black bean mango", "quantity": 1}, {"food": "butter oil", "quantity": 4.0}, {"food": "dill seed", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nFeta-and-Spinach Buns\n"}, {"directions": "\n\n              1. Put the cauliflower, broth, and 1 cup water in a small pot; bring to a boil over medium-high heat. Adjust the heat to maintain a simmer and cook until the cauliflower is very soft, 25 to 30 minutes. Remove from the heat and cool 5 minutes. Carefully puree cauliflower and all the liquid in a blender until very smooth; set aside.\n            \n\n              2. Meanwhile, bring a large pot of salted water to a boil and cook the pasta until al dente, 8 minutes. Drain well, reserving about 1 cup pasta cooking water.\n            \n\n              3. Heat the oil in a large skillet over medium heat. Add the garlic and cook until fragrant, about 30 seconds. Add the cauliflower puree and evaporated milk and bring to a simmer. Cook until slightly thickened, 5 minutes and season with salt and pepper. Stir in the peas until heated through, 2 minutes. Toss in the cooked pasta, Parmesan cheese and about 1/2 cup of pasta water until the noodles are coated but the sauce is still loose. Remove from the heat and toss in the butter, chopped parsley and lemon zest. (If the sauce seems thick, adjust the consistency with the remaining pasta water). Serve immediately sprinkled with chopped parsley.\n            \n", "ingredients": [{"food": "cauliflower", "quantity": 2.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "italian veg medley pasta", "quantity": 8.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "milk", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "pigeon peas", "quantity": 0.75}, {"food": "macaroni cheese", "quantity": 0.25}, {"food": "butter oil", "quantity": 1.0}, {"food": "parsley", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.5}], "title": "\nFettuccine Alfredo\n"}, {"directions": "\n\n              Bring a large pot of water to a boil and salt generously. Boil the pasta until al dente, tender but still slightly firm.\n            \n\n              Meanwhile in a large skillet over medium heat melt the butter and whisk in the cream and nutmeg and bring just to a simmer. Lower the heat to keep the mixture just warm.\n            \n\n              Drain the pasta in a colander and reserve some of the cooking water. Add the pasta to the cream mixture, toss with the cheese, and season with salt and pepper to taste. If the pasta mixture has become thick and tight, thin it with some of the reserved cooking water. Serve immediately in heated bowls.\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "egg substitute", "quantity": 1.0}, {"food": "butter oil", "quantity": 0.3333333333333333}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "nutmeg", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 1.5}, {"food": "black bean mango", "quantity": 1}], "title": "\nFettuccine Alfredo\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the pasta and cook as the label directs. Reserve 1/2 cup cooking water, then drain.\n            \n\n              Meanwhile, combine the heavy cream and butter in a large skillet. Bring to a simmer over medium-high heat, whisking to combine. Whisk in the nutmeg and 1/2 teaspoon each salt and pepper. Keep warm over low heat.\n            \n\n              Add the pasta and cheese to the sauce. Increase the heat to medium and toss to coat, adding the reserved cooking water as needed to loosen the sauce. Transfer the pasta to bowls and top with more parmesan.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1.5}, {"food": "butter oil", "quantity": 6.0}, {"food": "nutmeg", "quantity": 0.25}, {"food": "pepper", "quantity": 1}, {"food": "parmesan cheese", "quantity": 1.0}], "title": "\nFettuccine Alfredo\n"}, {"directions": "\n\n              Pulse the onion, celery, carrot, garlic and rosemary in a food processor until finely chopped.\n            \n\n              Heat the olive oil in a large saucepan over medium-high heat. Add the chopped vegetables and cook, stirring, until softened and golden, 3 to 5 minutes. Add the veal, 1 teaspoon salt and 1/2 teaspoon pepper and cook, breaking up the meat with a wooden spoon, until no longer pink, about 3 minutes. Add the tomatoes, milk, 1 cup water and 1/2 teaspoon salt. Bring to a boil, then reduce the heat and simmer until slightly thickened, about 20 minutes.\n            \n\n              Meanwhile, bring a large pot of salted water to a boil and cook the fettuccine as the label directs. Drain the pasta, then toss with half of the ragu (about 3 cups). Top with Parmesan. Reserve the remaining ragu for another use.\n            \n\n              Per serving: Calories 484; Fat 12 g (Saturated 3 g); Cholesterol 48 mg; Sodium 462 mg; Carbohydrate 71 g; Fiber 5 g; Protein 25 g\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "onion powder", "quantity": 0.5}, {"food": "celery seed", "quantity": 1.0}, {"food": "carrot juice", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "rosemary", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "ground turkey", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "tomatoes", "quantity": 1.0}, {"food": "whole milk", "quantity": 0.5}, {"food": "", "quantity": 12.0}, {"food": "macaroni cheese", "quantity": 1}], "title": "\nFettuccine With Quick Ragu\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Toss the tomato, squash, chives, lemon zest and 2 tablespoons olive oil in a large bowl. Season with salt. Sprinkle in half of the goat cheese. Add the pasta to the boiling water and cook as the label directs, adding the wax beans to the pot during the last 3 minutes of cooking. Reserve 1/4 cup of the cooking water, then drain the pasta and beans and add to the bowl with the vegetables. Drizzle with the reserved cooking water and the remaining 1 tablespoon olive oil and toss until the goat cheese begins to melt. Add the parmesan and toss. Divide among bowls and top with the remaining goat cheese. \n            \n\n              Photograph by Andrew Purcell\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "chives", "quantity": 0.5}, {"food": "", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "egg substitute", "quantity": 12.0}, {"food": "fava beans", "quantity": 4.0}, {"food": "parmesan cheese", "quantity": 0.25}], "title": "\nFettuccine With Summer Vegetables and Goat Cheese\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the pasta and cook as the label directs, adding the snap peas during the last 2 minutes of cooking. Reserve 1 cup of the cooking water, then drain.\n            \n\n              Meanwhile, heat 2 tablespoons butter in a large skillet over medium-high heat. Add the shallot and cook, stirring, until slightly softened, about 2 minutes. Add the salmon; season with 3/4 teaspoon salt and a few grinds of pepper. Cook, turning once, until the salmon is just cooked through, about 3 minutes. Transfer to a plate.\n            \n\n              Add the pasta and snap peas to the skillet along with 1/2 cup of the reserved pasta cooking water, the remaining 2 tablespoons butter, the herbs and lemon juice. Cook, tossing and adding more of the reserved cooking water if necessary, until the pasta is coated, about 1 more minute. Season with salt and pepper. Top with the salmon.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "", "quantity": 12.0}, {"food": "pigeon peas", "quantity": 8.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "wild rice", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "mixed nuts", "quantity": 0.25}, {"food": "", "quantity": 0.5}], "title": "\nFettuccine with Salmon and Snap Peas\n"}, {"directions": "\n\n              Combine the oil and garlic in a medium heavy-bottomed saucepan and heat over medium heat, swirling, until the garlic is soft and fragrant but not brown, about 3 minutes. Add the cauliflower, nutmeg, 2 3/4 cups water and 1 teaspoon each salt and pepper. Cover and cook until the cauliflower is completely soft, 15 to 20 minutes. Add the yeast or Parmesan and puree with an immersion blender until the sauce is very smooth.\n            \n\n              Meanwhile, bring a large pot of salted water to a boil and add the fettucine. Cook according to the package directions. Reserve at least 1/4 cup of the pasta water, then drain the pasta and add to the cauliflower sauce. Toss to coat the pasta and heat over medium low until the sauce is warmed through. Add some of the reserved pasta water to adjust the consistency if needed. Season with salt and pepper.\n            \n\n              Divide among 4 serving bowls and sprinkle with parsley, nutritional yeast or Parmesan and crushed red pepper if using.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.25}, {"food": "garlic powder", "quantity": 4.0}, {"food": "cauliflower", "quantity": 1.0}, {"food": "nutmeg", "quantity": 0.25}, {"food": "black bean mango", "quantity": 1}, {"food": "yeast extract spread", "quantity": 2.0}, {"food": "", "quantity": 12.0}, {"food": "parsley", "quantity": 1}, {"food": "ruby red grapefruit juice blend", "quantity": 1}], "title": "\nFettucine with Cauliflower Alfredo Sauce\n"}, {"directions": "\n\n              Pierce 3 russet potatoes a few times with a fork. Bake on an oven rack at 350 degrees F until tender, 1 hour; let cool. Increase the oven temperature to 450 degrees F. Quarter the potatoes lengthwise and scoop out most of the flesh. Brush the potato wedges on both sides with melted butter; season with salt and pepper. Bake skin-side up on a baking sheet until crisp, 15 minutes. Flip, sprinkle with a mix of grated sharp cheddar and habanero cheese and bake until melted, 3 more minutes. Top with sour cream and chopped scallions.\n            \n", "ingredients": [], "title": "\nFiery Potato Skins\n"}, {"directions": "\n\n              1. Preheat a grill to medium. \n            \n\n              2. For walnut dressing: Whisk vinegar, mustard, 1/2 teaspoon salt, and black pepper in a small bowl. Gradually whisk in oils until smooth and slightly thick. Stir in shallot and thyme. \n            \n\n              3. For salad: Lightly brush figs with olive oil and grill, turning occasionally, until soft and lightly charred, about 6 minutes. Remove from grill and season with salt and black pepper to taste. Brush sliced bread with olive oil and grill until lightly toasted. \n            \n\n              4. Toss frisee, watercress, and walnuts with dressing. Add goat cheese and toss lightly. Divide salad among 4 plates, top with warm figs, and serve with toasted bread.\n            \n", "ingredients": [{"food": "vinegar", "quantity": 1.0}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "", "quantity": 1.5}, {"food": "thyme", "quantity": 1.0}, {"food": "figs", "quantity": 8.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "black bean mango", "quantity": 1}, {"food": "luncheon slices", "quantity": 8.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "watercress", "quantity": 1.0}, {"food": "walnuts", "quantity": 0.25}, {"food": "macaroni cheese", "quantity": 4.0}], "title": "\nFig & Goat Cheese Salad\n"}, {"directions": "\n\n              Trim store-bought pie dough into an 8-inch square. Pulse 1 cup dried figs, 1/2 cup pitted dates, a pinch of cinnamon, 1/2 teaspoon orange zest, 1 1/2 teaspoons orange juice and 1 tablespoon butter in a food processor. Spread over the dough and roll into a log; chill 30 minutes. Cut into 1/2-inch-thick slices and bake 12 to 15 minutes at 375 degrees.\n            \n", "ingredients": [], "title": "\nFig Pinwheels\n"}, {"directions": "\n\n              Put the bacon in a medium skillet. Turn the heat to medium and cook, stirring occasionally, until the bacon renders its fat and is crisp but not dry, about 12 minutes. Using a slotted spoon, transfer the bacon to a mixing bowl. Reserve 2 tablespoons of the bacon drippings; discard the rest.\n            \n\n              Add the shallot to the hot skillet and cook, stirring, until softened, another 3 minutes. Turn the heat to low and add the vinegar, stirring to scrape up any browned bits from the bottom of the pan. Stir into the bacon.\n            \n\n              Add the frisee to the bacon mixture and toss to coat with the bacon drippings. Taste, season with salt, if necessary, add a very generous amount of black pepper and toss again. Now add the figs and toss. Transfer to a large platter and serve immediately.\n            \n", "ingredients": [{"food": "bacon", "quantity": 4.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "black bean mango", "quantity": 1}, {"food": "figs", "quantity": 12.0}], "title": "\nFig, Bacon and Frisee Salad\n"}, {"directions": "\nSpecial equipment: 8-ounce canning jars with lids and bands; canning pot or other large pot with a lid; canning rack or other rack that fits inside the pot; saucepan; jar lifter or tongs; kitchen towels\n\n              Bring 1 pound chopped fresh figs, 1 1/2 cups sugar, the seeds from 1/2 vanilla bean and a pinch of salt to a boil in a saucepan over medium heat and stir until the sugar melts. Continue cooking, stirring occasionally, until a drop of the mixture sets on a chilled plate, about 20 minutes. Remove from the heat. Stir in 1 tablespoon each lemon juice and ruby port, and a pinch of pepper. Fill sterilized jars, leaving a 1/2-inch headspace, then seal and process (see Cook's Note) for 15 minutes. Serve this with goat cheese, prosciutto and crackers.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [], "title": "\nFig-Ruby Port Preserves\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F and line a baking sheet with foil. Whisk the eggs, milk, vanilla and salt in a shallow dish.\n            \n\n              Combine the dried figs, dried apricots, nuts, granulated sugar and cinnamon in a small bowl and toss to combine.\n            \n\n              Dip 4 of the bread slices in the egg mixture, then transfer to a clean surface. Top each slice with one-quarter of the fruit-nut mixture, then dip the remaining bread slices in the egg mixture and press on top to make 4 sandwiches.\n            \n\n              Melt 1 tablespoon butter in a large skillet over medium-high heat. Working in batches, cook the sandwiches until golden brown, about 4 minutes per side, adding more butter to the skillet as needed. Transfer the sandwiches to the prepared baking sheet and bake until puffy and cooked through, 7 to 8 minutes.\n            \n\n              Meanwhile, wipe out the skillet. Add the brown sugar, the remaining 4 tablespoons butter and 3 tablespoons water; cook over medium heat, stirring, until the sugar dissolves, about 3 minutes. Cut each sandwich in half and drizzle with the brown sugar sauce.\n            \n\n              Photograph by James Wojcik\n            \n", "ingredients": [{"food": "eggs", "quantity": 4.0}, {"food": "milk", "quantity": 1.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "figs", "quantity": 0.5}, {"food": "apricots", "quantity": 0.5}, {"food": "walnuts", "quantity": 0.5}, {"food": "sugar", "quantity": 2.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "garlic bread", "quantity": 8.5}, {"food": "butter oil", "quantity": 5.0}, {"food": "sugar", "quantity": 0.5}], "title": "\nFigs in a Blanket\n"}, {"directions": "\n\n              1. Heat 2 tablespoons butter in a large, heavy nonstick skillet over medium-high heat until hot. Add the mushrooms and 1/2 teaspoon salt and 1/2 teaspoon pepper. Cook, stirring occasionally, until browned, about 6 minutes. \n            \n\n              2. Wipe out the skillet. Heat the remaining 1 tablespoon butter in the skillet over high heat until hot. Sprinkle the beef generously with salt and pepper. Sear over medium-high heat, turning once halfway through, until browned, about 12 minutes for medium. Transfer the beef to a platter. \n            \n\n              3. Add the shallots to the skillet and cook over medium heat, stirring, until golden, about 3 minutes. Add the mustard and heavy cream and bring to a boil, cooking until slightly thickened, about 3 minutes. Stir in the parsley. Spoon the sauce on a plate; place the beef on the sauce and scatter the mushrooms over top. Garnish with additional parsley, if desired.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 3.0}, {"food": "mixed nuts", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "frankfurter beef", "quantity": 4.0}, {"food": "", "quantity": 1.0}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "parsley", "quantity": 2.0}], "title": "\nFilet Mignon with Mustard Cream and Wild Mushrooms\n"}, {"directions": "\n\n              Combine the vinegar, soy sauce, pepper and smashed garlic in a blender and puree until smooth. Pour the mixture into a 12-inch wide, 2 1/4-inch deep nonstick skillet, stir in the bay leaves and submerge the wings in the marinade. Refrigerate for at least 2 hours and up to 6 hours.\n            \n\n              Meanwhile, make the Banana Ketchup: Heat the oil in a small saucepan over medium heat. Add the onion and cook, stirring until softened, about 5 minutes. Stir in the ginger, turmeric, allspice, garlic and jalapeno and cook, stirring until fragrant, about 1 minute. Add the tomato paste and cook, stirring until lightly caramelized, about 1 minute. Add the mashed bananas, vinegar, brown sugar, soy sauce and rum, if using, and simmer, stirring occasionally, until slightly thickened, about 10 minutes. Scrape the sauce into a bowl, press a sheet of plastic wrap against the surface and let cool. You should have about 1 cup.\n            \n\n              Remove the skillet from the refrigerator and place over high heat. Once the marinade begins to bubble, cook the wings, gently moving them around and flipping occasionally, until cooked through, about 25 minutes. Use tongs to transfer the chicken wings to a bowl and set aside. Stir the onion into the sauce and continue cooking over high heat, stirring occasionally, until the sauce is reduced to a glaze and the onions are soft, 5 to 10 minutes. Pour the glaze and onions over the chicken wings and stir to coat evenly.\n            \n\n              Transfer the wings to a serving platter and top with parsley. Serve with banana ketchup on the side.\n            \n", "ingredients": [{"food": "vinegar", "quantity": 2.0}, {"food": "soy sauce", "quantity": 2.0}, {"food": "black bean mango", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 12.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.25}, {"food": "ginger", "quantity": 1.5}, {"food": "turmeric", "quantity": 0.25}, {"food": "allspice", "quantity": 0.125}, {"food": "garlic powder", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "pasta with tomato sauce", "quantity": 1.5}, {"food": "silk very vanilla", "quantity": 2.0}, {"food": "vinegar", "quantity": 0.25}, {"food": "sugar", "quantity": 0.25}, {"food": "soy sauce", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}], "title": "\nFilipino Adobo Chicken Wings\n"}, {"directions": "\n\n              Heat the oil in a small saucepan over medium heat. Add the onion and cook, stirring until softened, about 5 minutes. Stir in the ginger, turmeric, allspice, garlic and jalapeno and cook, stirring until fragrant, about 1 minute. Add the tomato paste and cook, stirring until lightly caramelized, about 1 minute. Add the mashed bananas, vinegar, brown sugar, soy sauce and rum, if using, and simmer, stirring occasionally, until slightly thickened, about 10 minutes. Scrape the sauce into a bowl, press a sheet of plastic wrap on the top and let cool. Refrigerate in an airtight container for up to 2 weeks.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "ginger", "quantity": 1.0}, {"food": "turmeric", "quantity": 0.5}, {"food": "allspice", "quantity": 0.25}, {"food": "garlic powder", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "silk very vanilla", "quantity": 4.0}, {"food": "vinegar", "quantity": 0.5}, {"food": "sugar", "quantity": 0.5}, {"food": "soy sauce", "quantity": 2.0}, {"food": "", "quantity": 2.0}], "title": "\nFilipino-Style Banana Ketchup\n"}, {"directions": "\n\n              Pulse the flour, granulated sugar, 1/2 teaspoon salt and the baking powder in a food processor. Add the shortening and 4 tablespoons butter; pulse until pea-size pieces form. Add the lemon juice and 5 tablespoons ice water; pulse to combine. Gradually pulse in 1 more tablespoon water until the dough clumps together. Turn out onto a sheet of plastic wrap; shape into a disk. Wrap and refrigerate until firm, at least 1 hour.\n            \n\n              Combine the dried fruit, the remaining 2 tablespoons butter and 1/3 cup water in a microwave-safe bowl. Cover and microwave until softened, about 3 minutes. Let stand 10 minutes, then transfer the fruit and liquid to a food processor. Add the honey, cinnamon and a pinch of salt; pulse to make a paste.\n            \n\n              Position racks in the upper and lower thirds of the oven; preheat to 375 degrees F. Line 2 baking sheets with parchment. Roll out the dough on a floured surface until 1/8 inch thick. Cut out circles with a 3-inch cookie cutter. Reroll the scraps and cut out more circles.\n            \n\n              Spoon 1 teaspoon filling onto each circle; brush the edges with the beaten egg. Fold the dough over the filling and press the edges to seal; transfer to the baking sheets. Brush with more beaten egg and sprinkle with coarse sugar; cut slits in the tops. Chill until firm, 15 minutes.\n            \n\n              Bake, switching the pans halfway through, until the cookies are golden brown, 25 minutes. Let cool completely on the baking sheets.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.0}, {"food": "sugar", "quantity": 2.0}, {"food": "salt", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "diced chicken", "quantity": 6.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "fruit cocktail", "quantity": 0.75}, {"food": "honey smoked ham", "quantity": 2.0}, {"food": "cinnamon", "quantity": 0.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "sugar", "quantity": 1}], "title": "\nFinnish Crescents\n"}, {"directions": "\n\n              In this order, put the cilantro, tomatoes, garlic, jalapeno, onion, lime juice and 1 1/2 teaspoons salt in a blender. Pulse until broken down but still chunky, scraping the inside of the carafe as necessary.\n            \n", "ingredients": [{"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "diced chicken", "quantity": 15.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "", "quantity": 1.0}, {"food": "salt", "quantity": 1}], "title": "\nFire Roasted Tomato Blender Salsa\n"}, {"directions": "\n\n              Stir together the apple cider and cinnamon liquor in a medium saucepan. Sprinkle the gelatin over the mixture and let it sit until the gelatin softens and blooms, about 5 minutes. Heat the mixture over medium-high heat, stirring frequently, until the gelatin completely dissolves.\n            \n\n              Pour the mixture into a 9-inch pie plate and refrigerate until set, at least 2 hours or up to overnight. Decorate the rim of the pie with a ring of cinnamon candies. Just inside the candies add a ring of orange sprinkles; inside that, add a ring of yellow sprinkles. Refrigerate until ready to serve. Cut the pie into 8 slices and serve with a generous dollop of whipped cream.\n            \n", "ingredients": [{"food": "apple", "quantity": 2.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.25}, {"food": "", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "ice cream swich", "quantity": 1}], "title": "\nFireball Pie Jelly Shots\n"}, {"directions": "\n\n              Make the cake: Preheat the oven to 325 degrees F. Butter a 10- to 12-cup Bundt pan, making sure to get in all the crevices; dust with flour and tap out the excess. Whisk the flour, baking powder, baking soda and salt in a medium bowl; set aside.\n            \n\n              Beat the butter and granulated sugar in a large bowl with a mixer on medium-high speed until light and fluffy, about 5 minutes. Beat in the eggs one at a time, then beat in the sour cream and vanilla. (The batter may look curdled.) Reduce the mixer speed to medium low and add the flour mixture in three batches, alternating with the buttermilk; beat until combined.\n            \n\n              Pour the batter into the prepared pan and smooth the top. Bake until the cake is golden and a toothpick inserted into the center comes out clean, about 55 minutes. Transfer to a rack and let cool 15 minutes in the pan; loosen the edge of the cake with a knife and invert onto the rack to cool completely.\n            \n\n              Make the glaze: Whisk the confectioners' sugar, lemon juice, vanilla and 1 tablespoon water in a bowl; add a splash more water if the glaze is too thick. Spoon over the cake, letting it drip down the sides. Decorate with nonpareils. Let stand until set, 5 to 10 minutes. Put rock candy sticks in the center of the cake.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "butter oil", "quantity": 2.0}, {"food": "potato flour", "quantity": 2.75}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 0.5}, {"food": "sugar", "quantity": 1.6666666666666665}, {"food": "eggs", "quantity": 4.0}, {"food": "sour cream", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.75}, {"food": "sugar", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "martha white foods", "quantity": 1}, {"food": "martha white foods", "quantity": 1}], "title": "\nFireworks Bundt Cake\n"}, {"directions": "\nSpecial equipment: 6 rocket-shaped frozen pop molds 6 wooden ice pop sticks\n\n              Combine 1 cup water and the sugar in a small saucepan. Simmer over medium-high heat until all of the sugar dissolves. Remove from the heat, pour into a large liquid measuring cup and let cool completely.\n            \n\n              Pour 1/2 cup of the sugar syrup in a blender. Add the strawberries, red food coloring and 1 tablespoon of the lemon juice. Blend until smooth. Let sit, stirring occasionally, until all the froth settles. Evenly divide among 6 rocket-shaped frozen pop molds. Take care to not to pour down the side of the molds or it will streak the pops; pour directly in the middle. Freeze until about halfway frozen and still slushy, about 40 minutes. Press a wooden ice pop stick into each about 1 inch from the bottom of the mold (the sticks should stand up straight in the middle of the mold). Return to the freezer and freeze until completely solid, about 40 minutes.\n            \n\n              Meanwhile, stir the coconut milk and remaining 1 tablespoon lemon juice into the remaining sugar syrup. Divide the mixture in half and add the blue food coloring to one.\n            \n\n              Once the red layer in the pop molds is frozen solid, pour in the white mixture, dividing evenly among the molds. Freeze until completely solid, about 45 minutes. Then divide the blue mixture among the molds and freeze until completely solid, about 45 minutes.\n            \n\n              To serve, run the frozen molds under warm water before unmolding.\n            \n", "ingredients": [{"food": "sugar", "quantity": 0.3333333333333333}, {"food": "strawberries", "quantity": 4.0}, {"food": "ruby red grapefruit juice blend", "quantity": 8.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "coconut milk", "quantity": 0.3333333333333333}, {"food": "", "quantity": 8.0}], "title": "\nFireworks Pop\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Begin by making the red layer: Put the frozen strawberries, watermelon, lime juice, rum, sugar and ice in the carafe of a blender. Blend until thick and smooth. Stir in 1 to 2 tablespoons water if the consistency is too thick. Transfer to a large measuring cup or small bowl and place in the freezer while you make the next layer.\n            \n\n              For the white layer: Rinse out the blender and add the coconut sorbet, rum, lime juice and ice. Blend until thick and smooth. Transfer to another large measuring cup or small bowl and place in the freezer while you make the final layer.\n            \n\n              For the blue layer: Rinse out the blender and add the passion fruit liqueur, lime juice, blue curacao, rum, sugar and ice cubes. Blend until slushy and there are no chunks of ice left.\n            \n\n              Pour the red layer into the bottom of six 8-ounce glasses, about 1/3 cup each. Gently spoon 1/3 cup of the white layer over the red layer so they stay separate. Finish by spooning 1/3 cup of the blue layer over the second layer in each glass.\n            \n", "ingredients": [{"food": "strawberries", "quantity": 1.0}, {"food": "watermelon seed krnls", "quantity": 1.0}, {"food": "lime juice", "quantity": 2.0}, {"food": "martha white foods", "quantity": 2.0}, {"food": "sugar", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "coconut water", "quantity": 1.0}, {"food": "", "quantity": 0.25}, {"food": "lime juice", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "fruit cocktail", "quantity": 0.3333333333333333}, {"food": "lime juice", "quantity": 0.25}, {"food": "", "quantity": 2.0}, {"food": "martha white foods", "quantity": 2.0}, {"food": "sugar", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 2.0}], "title": "\nFireworks Red, White and Blue Daiquiris\n"}, {"directions": "\n\n              Make Potato Chowder (below) with just 2 ounces bacon. Omit sage; swap the cream with half-and-half. Add 1 pound white fish chunks and 1/2 pound flaked smoked trout during the last 5 minutes of cooking.\n            \n\n              Potato Chowder Saute 4 ounces chopped bacon; add 2 tablespoons butter, 2 sliced leeks and 2 teaspoons each sage and thyme. Add 4 cups chicken broth, 1 1/2 cups cream, a bay leaf and 3 chopped potatoes. Simmer until tender; top with chives.\n            \n\n              See all 50 Easy Soups\n            \n", "ingredients": [], "title": "\nFish Chowder\n"}, {"directions": "\n\n              Put the milk in a medium bowl and season with salt and pepper. Add the fish and set aside to soak until ready to fry. Put the cornmeal in a baking dish and add 1/2 teaspoon each salt and pepper.\n            \n\n              Combine the scallions, mayonnaise, mustard, jalapenos and 1/2 tablespoon pickling juice in a bowl. Heat about 2 inches vegetable oil in a large pot over medium heat until a deep-fry thermometer registers 350 degrees F. Remove 2 fillets from the milk, shaking off the excess, and dredge in cornmeal to coat. Carefully lower into the oil and fry until golden and just cooked through, 4 to 5 minutes. Transfer to a paper towel-lined plate and season with salt. Repeat with the remaining fillets.\n            \n\n              Toss the lettuce with the jalapeno dressing and season with salt, pepper and more pickling juice, if desired. Divide the fish and slaw among the rolls.\n            \n", "ingredients": [{"food": "milk", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "vegetarian fillets", "quantity": 4.0}, {"food": "cornmeal", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "mayonnaise dressing", "quantity": 0.25}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "grape juice", "quantity": 2.5}, {"food": "vegetable oil", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.5}, {"food": "pizza rolls", "quantity": 4.0}], "title": "\nFish Sandwiches With Jalapeno Slaw\n"}, {"directions": "\n\n              Preheat the oven to 250 degrees F. Combine 2 cups water, the rice, ginger and 3/4 teaspoon salt in a large pot. Bring to a boil, then stir and reduce the heat to low. Cover and cook until the liquid is absorbed and the rice is tender, 16 to 18 minutes. Remove from the heat and add the broccoli (do not stir). Cover and set aside to let the broccoli steam.\n            \n\n              Meanwhile, heat 2 inches of vegetable oil in a separate large pot or Dutch oven over medium heat until a deep-fry thermometer registers 375 degrees F. Whisk the flour, mustard powder, 1/4 teaspoon salt and the seltzer in a large bowl until smooth. Season the cod with salt. Working in batches, dip the cod in the batter, allowing the excess to drip off, and fry until golden brown and crisp, 6 to 7 minutes. Remove to a wire rack set over a baking sheet and season with salt; transfer to the oven to keep warm. Return the oil to 375 degrees F between batches.\n            \n\n              Gently fluff the rice with a fork. Discard the ginger and stir in the sesame oil and scallions; season with salt. Serve the cod with the chili sauce, broccoli rice and lemon wedges.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "crisped rice bar", "quantity": 1.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "broccoli raab", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "potato flour", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "cod", "quantity": 1.5}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "Worcestershire sauce", "quantity": 1}], "title": "\nFish Sticks with Broccoli Rice\n"}, {"directions": "\n\n              Prepare a paper towel-lined baking pan and set aside. Cut each fillet into 1-inch strips. Toss the panko, flour, and 2 teaspoons salt in 1 shallow bowl or pie plate, and beat the eggs lightly in another.\n            \n\n              Heat about 1/4-inch of oil in a large skillet over medium-high heat. Season the fish all over with salt and pepper, dip in the eggs, and then press into the panko mixture to coat evenly, shaking off any excess. Carefully place the fish in the hot oil, taking care not to crowd the pan. Adjust the heat as necessary to maintain a constant sizzle. Fry the fish, turning once, until evenly brown, about 2 to 3 minutes total. Transfer to paper towels to absorb excess oil, and, if necessary, keep warm in the oven on the rack. Repeat with the rest of the fish. Serve hot with the dipping sauce.\n            \n\nTartar Sauce:\n\n\n              Stir together the mayonnaise, relish, and lemon juice. Chill for 10 minutes. Serve.\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 1.0}, {"food": "bread crumbs", "quantity": 2.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "seasoning mix", "quantity": 2.0}, {"food": "eggs", "quantity": 3.0}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "mayonnaise dressing", "quantity": 0.6666666666666666}, {"food": "pickle relish", "quantity": 0.25}, {"food": "grape juice", "quantity": 0.5}], "title": "\nFish Sticks with Tartar Sauce\n"}, {"directions": "\n\n              Prepare a paper towel-lined baking pan and set aside. Cut each fillet into 1-inch strips. Toss the panko, flour, and 2 teaspoons salt in 1 shallow bowl or pie plate, and beat the eggs lightly in another. \n            \n\n              Heat about 1/4-inch of oil in a large skillet over medium-high heat. Season the fish all over with salt and pepper, dip in the eggs, and then press into the panko mixture to coat evenly, shaking off any excess. Carefully place the fish in the hot oil, taking care not to crowd the pan. Adjust the heat as necessary to maintain a constant sizzle. Fry the fish, turning once, until evenly brown, about 2 to 3 minutes total. Transfer to paper towels to absorb excess oil, and, if necessary, keep warm in the oven on the rack. Repeat with the rest of the fish. Serve hot with the dipping sauce.\n            \n\nTartar Sauce:\n\n\n              Stir together the mayonnaise, relish, and lemon juice. Chill for 10 minutes. Serve. \n            \n", "ingredients": [{"food": "diced chicken", "quantity": 1.0}, {"food": "bread crumbs", "quantity": 2.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "seasoning mix", "quantity": 2.0}, {"food": "eggs", "quantity": 3.0}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "mayonnaise dressing", "quantity": 0.6666666666666666}, {"food": "pickle relish", "quantity": 0.25}, {"food": "grape juice", "quantity": 0.5}], "title": "\nFish Sticks with Tartar Sauce\n"}, {"directions": "\n\n              Make the salsa: Mix the tomatillo, tomato, onion, cilantro, lime juice and jalapeno in a bowl and season with salt.\n            \n\n              Heat 1/2 inch vegetable oil in a deep skillet or pot over medium-high heat. Season the fish with 1/2 teaspoon salt and 1/4 teaspoon pepper, then toss with the flour in a bowl. Fry the fish in 2 batches, turning as needed, until golden brown and just cooked through, 3 to 4 minutes per batch. Transfer to a paper towel-lined plate to drain; season with salt.\n            \n\n              Fill the tortillas with the fish, lettuce and salsa. Serve the tacos with lime wedges.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "", "quantity": 3.0}, {"food": "lime juice", "quantity": 2.0}, {"food": "seeds", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1}, {"food": "catfish", "quantity": 1.25}, {"food": "pepper", "quantity": 1}, {"food": "barley flour or meal", "quantity": 0.25}, {"food": "corn bran", "quantity": 8.0}, {"food": "lettuce", "quantity": 1.0}], "title": "\nFish Tacos With Fresh Salsa\n"}, {"directions": "\n\n              Make the watermelon salsa: Combine the watermelon, red onion, cilantro, lime juice and jalapeno in a bowl. Toss with 1 tablespoon olive oil and 1/2 teaspoon salt and set aside.\n            \n\n              Preheat a grill to high. Sprinkle the fish on both sides with the chile powder and 1/2 teaspoon salt; drizzle both sides with the remaining 2 teaspoons olive oil. Brush the grill with olive oil, then add the fish and grill until marked and cooked through, 4 to 5 minutes per side. Transfer the fish to a plate and break into bite-size pieces.\n            \n\n              Meanwhile, toss the lettuce with 2 tablespoons of the juices from the watermelon salsa and a pinch of salt. Warm the tortillas on the grill and fill with the fish, watermelon salsa, avocado and lettuce. Serve with lime wedges.\n            \n\n              Per serving: Calories 437; Fat 18 g (Saturated 3 g); Cholesterol 93 mg; Sodium 636 mg; Carbohydrate 45 g; Fiber 6 g; Protein 25 g\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 4.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "", "quantity": 0.5}, {"food": "lime", "quantity": 2.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "bass", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "corn bran", "quantity": 8.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}], "title": "\nFish Tacos With Watermelon Salsa\n"}, {"directions": "\n\n              Put the eggs in a small saucepan and cover with water by 1/2 inch. Bring to a boil over medium-high heat, then remove from the heat, cover and let stand 10 minutes. Remove the eggs with a slotted spoon and transfer to a bowl of ice water to cool, about 5 minutes. Carefully peel the eggs; halve lengthwise and scoop out the yolks into a medium bowl. \n            \n\n              Add the mayonnaise, mustard and Old Bay to the yolks and whisk until smooth. Stir in the corn and chives; season with salt. Transfer the mixture to a pastry bag fitted with a large star tip (big enough for the corn kernels to fit through). Pipe into the egg white halves. Refrigerate until ready to serve. \n            \n\n              Slice the potatoes into 10 rounds, slightly less than 1/2 inch thick. Heat 1/2 inch vegetable oil in a medium skillet over medium heat until it registers 300 degrees F on a deep-fry thermometer. Fry the potato rounds 4 minutes, then remove with a slotted spoon and drain on paper towels. Increase the oil temperature to 375 degrees F; fry the potatoes again until golden brown and crisp, about 3 more minutes. Drain on clean paper towels and season with salt. \n            \n\n              Place a deviled egg on each fried potato round. Top with the crabmeat, some chives and more Old Bay. \n            \n\n              Photograph by Sam Kaplan\n            \n", "ingredients": [{"food": "eggs", "quantity": 5.0}, {"food": "mayonnaise dressing", "quantity": 3.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "dessert topping", "quantity": 0.25}, {"food": "sunflower seed kernels", "quantity": 3.0}, {"food": "dessert topping", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "sweet potatoes", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "", "quantity": 3.0}], "title": "\nFish and Chicks\n"}, {"directions": "\n\n              Slice the potatoes about 1/16 of an inch thin with a vegetable slicer or mandolin. Transfer to a large bowl and soak in tepid water for 30 minutes.\n            \n\n              In a large mixing bowl, whisk together the flour, baking powder, and the 2 teaspoons salt. Pour in the beer and whisk to form a smooth batter. Set aside.\n            \n\n              Pat the fish very dry. Cut the fish lengthwise into 1 by 3-inch strips.\n            \n\n              Pour enough oil into a tall heavy-bottomed pot so it comes about a third of the way up the sides. Heat the oil over medium heat until a deep frying thermometer inserted in the oil registers 360 degrees F. While the oil heats, drain and spin the potatoes dry in a salad spinner. Spread them out on a pan and pat completely dry with paper towels.\n            \n\n              Preheat the oven to 200 degrees F. Working in small batches, fry the potatoes until golden brown, about 2 to 2 1/2 minutes. With a slotted spoon, carefully transfer the chips to a paper towel-lined pan to drain. Season with fine salt to taste. (Make sure to let the oil come back to 360 degrees before frying each batch.) Transfer the potatoes to the oven to keep warm.\n            \n\n              Season the fish with the salt and pepper. Working in batches, dip the fish strips in the batter to coat evenly. Carefully add to the oil. Fry the fish, turning once, until golden and crisp, about 3 to 4 minutes. Transfer to a paper towel-lined pan to drain. Keep the fish warm on a heatproof platter in the oven while you fry the remaining fish. (Just like with the potatoes, make sure the oil returns to temperature before adding more fish.)\n            \n\n              Serve the fish with the chips and malt vinegar and/or tartar sauce.\n            \n\nTartar Sauce\n\n\n              In a small mixing bowl, stir together the mayonnaise, capers, cornichons, parsley, lemon juice, tarragon, lemon zest, hot sauce, and scallion. Refrigerate for 30 minutes for the flavors to come together. Serve.\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 2.0}, {"food": "potato flour", "quantity": 3.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 2.0}, {"food": "", "quantity": 12.0}, {"food": "cod", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "black bean mango", "quantity": 1}, {"food": "vinegar", "quantity": 1}, {"food": "Worcestershire sauce", "quantity": 1}, {"food": "mayonnaise dressing", "quantity": 1.0}, {"food": "capers", "quantity": 1.5}, {"food": "", "quantity": 1.0}, {"food": "parsley", "quantity": 1.0}, {"food": "lemon juice", "quantity": 0.5}, {"food": "", "quantity": 0.25}, {"food": "lemon juice", "quantity": 0.25}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "martha white foods", "quantity": 1.0}], "title": "\nFish and Chips\n"}, {"directions": "\n\n              Combine the Swiss cheese, 1/2 cup of the mayonnaise, the mustard, cream cheese, 1/4 teaspoon salt and a few grinds of black pepper in a food processor. Blend until very smooth. Remove and set aside. Rinse out the food processor bowl. \n            \n\n              Combine the coleslaw, sauerkraut, vinegar, 1/4 teaspoon salt and a few grinds of black pepper in a food processor. Pulse until coarsely chopped. Remove and set aside. Rinse out the food processor bowl. \n            \n\n              Add the corned beef to the food processor and pulse until coarsely chopped. \n            \n\n              Whisk together the remaining 1/2 cup mayonnaise, the chili sauce, ketchup and a few grinds of black pepper for the sauce. \n            \n\n              Layer the dip in your favorite 3-quart serving dish. Spread out the cheese mixture on the bottom. Then top with, in even layers, the corned beef, rye bread, sauce and sauerkraut mixture. \n            \n\n              Wrap and refrigerate until chilled, at least 1 hour or overnight. Serve with rye bread toasts, rye crackers or potato chips.\n            \n\n              Copyright 2013 Television Food Network, G.P. All rights reserved\n            \n\n              From Food Network Kitchens\n            \n", "ingredients": [{"food": "", "quantity": 1.5}, {"food": "mayonnaise dressing", "quantity": 1.0}, {"food": "spicy black bean enchilada", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "black bean mango", "quantity": 1}, {"food": "cheesecake mix", "quantity": 2.0}, {"food": "sauerkraut", "quantity": 2.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "frankfurter beef", "quantity": 8.0}, {"food": "Worcestershire sauce", "quantity": 0.5}, {"food": "", "quantity": 0.5}, {"food": "garlic bread", "quantity": 4.0}, {"food": "potato chips", "quantity": 1}], "title": "\nFive-Layer Reuben Dip\n"}, {"directions": "\n\n              Mix 1 cup ketchup, the juice of 1 lime and 2 teaspoons five-spice powder. Season with salt and pepper.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [], "title": "\nFive-Spice Ketchup\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Toss the broccoli, onion, ginger, garlic and orange with 2 tablespoons vegetable oil, 3/4 teaspoon salt, and pepper to taste in a shallow baking dish. Set aside.\n            \n\n              Pat the pork dry and sprinkle all over with the five-spice powder, 1 teaspoon salt, and pepper to taste. Heat the remaining 2 teaspoons vegetable oil in a large skillet over medium-high heat. Add the pork and sear, turning, until golden brown on all sides, about 8 minutes.\n            \n\n              Add the pork to the baking dish with the broccoli-orange mixture and roast until a thermometer inserted into the center of the pork registers 145 degrees F, 15 to 20 minutes. Transfer the pork to a cutting board and let rest 5 minutes before slicing. Meanwhile, return the broccoli-orange mixture to the oven and roast 5 more minutes. Serve the pork with the roasted broccoli and orange wedges.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "orange", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "pork skins", "quantity": 1.25}, {"food": "onion powder", "quantity": 1.0}], "title": "\nFive-Spice Pork With Roasted Oranges and Broccoli\n"}, {"directions": "\n\n              Whisk 2 tablespoons olive oil and the lemon zest and juice in a large bowl; season with salt and black pepper. Peel the carrots into long ribbons using a vegetable peeler; add to the bowl along with the red onion and half of the chives. Toss well to coat and set aside.\n            \n\n              Combine the five-spice powder, cayenne and 1/2 teaspoon each salt and black pepper in a small bowl; rub on the flesh side of the fish fillets. Heat 1/2 tablespoon olive oil in a medium nonstick skillet over medium-high heat. Add 2 fillets, skin-side down, and cook until crisp, about 2 minutes. Gently flip and cook until cooked through, about 2 more minutes. Transfer to a paper towel-lined baking sheet, skin-side down. Repeat with the remaining olive oil and fish.\n            \n\n              Add the beets to the bowl with the carrots and toss. Divide the fish among plates; top with the creamy horseradish and the remaining chives. Serve with the carrot salad and lemon wedges.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "grape juice", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "carrots", "quantity": 3.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "chives", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.75}, {"food": "pepper", "quantity": 0.25}, {"food": "vegetarian fillets", "quantity": 4.0}, {"food": "beets", "quantity": 1.0}, {"food": "horseradish", "quantity": 0.25}], "title": "\nFive-Spice Trout with Carrot Salad\n"}, {"directions": "\n\n              Toppings: Cincinnati-style chili, kidney beans, chopped onion, shredded cheddar and oyster crackers\n            \n\n              How to Make Classic Potato Skins:\n            \n\n              Pierce 4 large russet potatoes with a fork. Bake directly on the oven rack at 350 degrees until tender, about 1 hour. Let cool, then quarter lengthwise and scoop out the flesh, leaving a 1/4-inch shell. Brush both sides with melted butter and season with salt and pepper. Bake, skin-side up, at 450 degrees until crisp, about 15 minutes. Add your favorite team toppings. (For cheesy skins, flip the baked shells over before topping, sprinkle with 1 cup grated cheddar cheese and bake an extra 5 minutes.)\n            \n\n              Photograph by Karl Juengel/Studio D\n            \n", "ingredients": [], "title": "\nFive-Way Chili Potato Skins\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: Pastry bag Rosette tip\n\n              For the cake: Preheat the oven to 350 degrees F. Coat a 9-by-13-inch rectangular baking pan with nonstick cooking spray. Line the bottom of the pan with parchment paper and coat again with the spray. Combine the flour, cornmeal, baking powder, baking soda and salt in a small bowl. Whisk together and set aside.\n            \n\n              Beat the granulated sugar and butter in a large bowl with an electric mixer on medium-high speed until smooth and fluffy, 3 minutes. Beat in the eggs, 1 at a time until combined, then beat in the vanilla. Reduce the speed to low and beat in one-third of the flour mixture until just combined. Beat in half the buttermilk and then repeat, adding the flour in 2 more increments and alternating with the second half of the buttermilk. Stir in the sprinkles. Transfer to the prepared pan and spread the batter evenly. Bake until the cake is golden brown and the top springs back to a light touch, 30 to 35 minutes. Cool 15 minutes in the pan.\n            \n\n              Run a small knife around the edges of the cake to release the sides and turn the cake out onto a baking sheet. Remove the parchment paper and then flip again onto a serving platter or cutting board so the top of the cake is back on top. Cool completely before frosting.\n            \n\n              For the frosting: Beat the butter and salt in a large bowl with an electric mixer on medium speed until fluffy. Add the white chocolate and beat until fluffy. Gradually beat in the confectioners' sugar and vanilla. Increase the speed to medium-high and beat until very smooth and fluffy.\n            \n\n              Transfer 1/2 cup of the frosting to a pastry bag fitted with a small rosette tip. Frost the top and sides of the cake with the remaining frosting.\n            \n\n              For the garnish: Place the blueberries in 6 rows of 6 berries each in the top left-hand corner of the cake. Trim and halve the strawberries lengthwise and make 4 rows of strawberries across the cake. Pipe 13 stars between the blueberries and use the remaining frosting to pipe a border around the bottom of the cake. Brush the berries with the melted jelly. Cut and serve.\n            \n", "ingredients": [{"food": "pan dulce", "quantity": 1}, {"food": "potato flour", "quantity": 2.5}, {"food": "martha white foods", "quantity": 0.3333333333333333}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "sugar", "quantity": 2.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "eggs", "quantity": 5.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 3.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "salt", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "sugar", "quantity": 2.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "blueberries", "quantity": 1.0}, {"food": "strawberries", "quantity": 16.0}, {"food": "apple", "quantity": 1.0}], "title": "\nFlag Cake\n"}, {"directions": "\nSpecial equipment: a 2 1/2-inch-wide heart-shaped cookie cutter and a deep-frying thermometer\n\n              Put the unwrapped mozzarella blocks in the freezer for 30 minutes to firm. Meanwhile, pour the cheese-flavored snacks into a food processor and pulse until finely ground. Reserve 1 cup for sprinkling at the end and transfer the rest to a large bowl. Put the eggs in a separate large bowl.\n            \n\n              Unwrap the cold blocks of mozzarella and use a long, thin knife to cut them in thirds lengthwise through their narrow sides (like sandwich bread), so you have 6 thinner blocks of mozzarella. Using a 2 1/2-inch-wide heart-shaped cookie cutter, cut out 2 hearts of cheese from each thin block; you should have 12 hearts total. Using the tip end of the heart cutter, cut out a deeper cleave in the top of each cheese heart to make the heart shape more defined. Save the scraps for another use.\n            \n\n              Dip each cheese heart in the beaten egg, then toss in the cheese dust until fully coated. Repeat 2 more times to create a very thick coating, then transfer to a baking sheet. Freeze the cheese hearts for at least 1 hour and up to 3 days.\n            \n\n              Pour enough oil into a large heavy pot to come 2 inches up the side and attach a deep-frying thermometer to the pot. Heat the oil over medium heat to 350 degrees F. Using a slotted spoon or strainer and working in 3 batches, lower the hearts into the oil and fry until browned at the edges and the cheese is fully melted, about 4 minutes. Lift the hearts from the oil and transfer to paper towels to drain.\n            \n\n              Transfer the hearts to a platter and sprinkle with the reserved cheese dust. Pour the ranch dressing into a small serving bowl and pour the hot sauce in the center of the ranch dressing. Drag the tip of a knife straight through the center of the dressing and hot sauce to form a heart shape. Serve the fried hearts while hot with the spicy ranch dipping sauce.\n            \n", "ingredients": [{"food": "", "quantity": 1.0}, {"food": "spicy black bean enchilada", "quantity": 8.5}, {"food": "eggs", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "dressing", "quantity": 0.5}, {"food": "Worcestershire sauce", "quantity": 2.0}], "title": "\nFlamin' Hot Cheeto Mozzarella Hearts\n"}, {"directions": "\n\n              Sprinkle the steak with 2 teaspoons chili powder and 3/4 teaspoon salt. Heat 1/2 tablespoon olive oil in a large skillet over medium-high heat. Add the steak; cook about 5 minutes per side for medium rare. Meanwhile, make the slaw: Toss the cabbage with the lime juice, mayonnaise, 2 tablespoons cilantro, the remaining 1 teaspoon chili powder, and salt to taste. Chill until ready to serve. Transfer the steak to a cutting board and let rest 10 minutes. Meanwhile, heat the remaining 1/2 tablespoon olive oil in the same skillet over medium heat. Add the onion and tomato paste and cook, stirring, until the onion is soft, 2 to 3 minutes. Add the chicken broth and beans and bring to a simmer. Coarsely mash the beans with a spoon; continue cooking until slightly thickened, about 4 more minutes. Add the remaining 2 tablespoons cilantro and salt to taste. Slice the steak; top with the black beans and serve with the slaw. \n            \n\n               Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "", "quantity": 1.25}, {"food": "chili powder", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "swamp cabbage", "quantity": 4.5}, {"food": "lime juice", "quantity": 2.0}, {"food": "mayonnaise dressing", "quantity": 2.0}, {"food": "", "quantity": 4.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "fava beans", "quantity": 1.0}], "title": "\nFlank Steak With Black Beans and Slaw\n"}, {"directions": "\n\n              Bring a medium saucepan of salted water to a boil. Rub the steak with the chili powder and season with salt and black pepper. Heat the vegetable oil in a large skillet over medium-high heat. Add the steak, reduce the heat to medium and cook until browned, about 4 minutes per side for medium rare. Add the butter and thyme and cook, spooning the butter over the steak as it melts, about 30 seconds. Remove the steak to a cutting board and let rest.\n            \n\n              Meanwhile, add the pasta to the boiling water and cook as the label directs, adding the broccoli during the last minute of cooking. Reserve 1/4 cup cooking water, then drain. Add the milk to the saucepan and bring to a gentle simmer over medium heat. Add the cheese and cayenne and cook, stirring, until smooth. Add the pasta and broccoli and cook, stirring, until coated, adding the reserved cooking water as needed to loosen. Stir in the pimientos and season with salt.\n            \n\n              Thinly slice the steak against the grain. Serve with the mac and cheese.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "", "quantity": 1.25}, {"food": "chili powder", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "thyme", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "broccoli raab", "quantity": 2.0}, {"food": "milk", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 6.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "", "quantity": 0.25}], "title": "\nFlank Steak with Broccoli Mac and Cheese\n"}, {"directions": "\n\n              Combine the chard, onions and 1/2 cup water in a large pot. Bring to a simmer over high heat, then lower the heat to medium. Cover and cook, stirring frequently, until the chard is very tender, about 15 minutes.\n            \n\n              Meanwhile, combine the cream cheese, nutmeg and 1/4 cup water in a medium saucepan. Place over medium heat and cook, whisking frequently, until the cheese melts and the mixture just bubbles around the edges. With a slotted spoon, add the cooked chard to the cheese mixture (discarding any excess liquid). Mix well and season with 1/4 teaspoon salt and some pepper. Garnish with the pine nuts. Set aside, covered, and keep warm.\n            \n\n              Heat the oil in a medium skillet over medium heat. Sprinkle the steaks all over with 1/2 teaspoon salt and some pepper. When the oil is hot and shimmering, add the steaks and cook, turning once, until seared and rich mahogany, about 6 minutes per side. Transfer the steaks to a plate.\n            \n\n              Add the garlic to the pan and cook, stirring occasionally, until aromatic, about 1 minute. Pull the skillet from the heat, add the vinegar, and use a wooden spoon to scrape up any browned bits that cling to the pan. Add in the butter, oregano and any juices from the steak. Stir until the butter melts.\n            \n\n              Slice the meat against the grain into thin slices. Divide the steak evenly among four plates and pour the pan juices over. Divide the Swiss chard evenly among the four plates and serve each with a dinner roll and 1/2 cup of strawberries.\n            \n", "ingredients": [{"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 6.333333333333333}, {"food": "nutmeg", "quantity": 0.25}, {"food": "pine nuts", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.25}, {"food": "black bean mango", "quantity": 1}, {"food": "garlic powder", "quantity": 1.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "pizza rolls", "quantity": 4.0}, {"food": "strawberries", "quantity": 2.0}], "title": "\nFlank Steak with Creamed Swiss Chard and Pine Nuts\n"}, {"directions": "\n\n              Position a broiler pan on the rack closest to the broiler and preheat to high for at least 10 minutes.\n            \n\n              Pulse the anchovies, garlic, Dijon mustard, herbes de Provence, salt and pepper in a small food processor. Add the olive oil and pulse to mix. Rub the paste all over the steak.\n            \n\n              Carefully pull the preheated pan from the broiler, set the steak in the center of the rack (it should sizzle when it hits the pan), and return to the broiler. Cook until the meat feels firm but still gives gently when pressed, 8 to 10 minutes for medium rare. (If your pan rack has preheated properly, it will not be necessary to turn the meat. However, if your broiler doesn't have a high output of heat, turn the meat 3/4 of the way through cooking to finish off the other side.)\n            \n\n              Remove the meat from the broiler, remove it to a cutting board and let it rest for 5 to 10 minutes. Thinly slice the meat, against the grain, set on a platter. Serve warm with lemon wedges.\n            \n", "ingredients": [{"food": "", "quantity": 10.0}, {"food": "garlic powder", "quantity": 8.0}, {"food": "mustard spinach", "quantity": 4.0}, {"food": "dulce de leche", "quantity": 2.0}, {"food": "salt", "quantity": 1.0}, {"food": "black bean mango", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 1}], "title": "\nFlank Steak with Provencal Style Rub\n"}, {"directions": "\n\n              Heat the olive oil in a large skillet over medium heat. Season both sides of the steaks with salt and pepper. Cook in 2 batches if necessary. When the oil is hot and shimmering, add the steaks and cook, tuning each once, until seared and rich mahogany, about 6 minutes per side for medium-rare. Transfer the steaks to a plate.\n            \n\n              Add the garlic to the pan and cook, stirring occasionally, until aromatic, about 1 minute. Pull the skillet from the heat, add the vinegar, and use a wooden spoon to scrape up any brown bits that cling to the pan. Stir in the oregano, butter, and any juices from the steak, until the butter melts. Add the greens to the skillet, season with salt and pepper, and toss until they begin to wilt, about 30 seconds.\n            \n\n              Slice the meat against the grain into thin slices, divide between 4 plates, top with the greens and the pan juices. Serve.\n            \n\n              Copyright (c) 2004 Television Food Network, G.P., All Rights Reserved.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "garlic powder", "quantity": 2.0}, {"food": "vinegar", "quantity": 0.25}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 10.0}], "title": "\nFlank Steak with Red Wine Vinegar and Greens\n"}, {"directions": "\n\n              Heat the olive oil in a medium skillet over medium heat. Season both sides of the steaks with salt and pepper to taste. When the oil is hot and shimmering, add the steaks and cook, tuning each once, until seared and rich mahogany, about 6 minutes per side. Transfer the steaks to a plate. Add the garlic to the pan and cook, stirring occasionally, until aromatic, about 1 minute. Pull the skillet from the heat, add the vinegar, and use a wooden spoon to scrape up any browned bits that cling to the pan. Stir in the oregano, butter, and any juices from the steak, until the butter melts. Add the greens to the skillet, season with salt and pepper, and toss just until they begin to wilt, about 30 seconds. Slice the meat against the grain into thin slices, divide between 2 plates, top with the greens and the pan juices. Serve.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "garlic powder", "quantity": 1.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 5.5}], "title": "\nFlank Steak with Red Wine Vinegar and Greens: Low Carb\n"}, {"directions": "\n\n              Make the salsa verde: Pulse the parsley, scallions, capers, lemon zest and juice, anchovies, garlic, mustard and olive oil in a food processor until slightly chunky. Pour into a bowl and season with salt.\n            \n\n              Preheat a grill to high or place a grill pan over high heat. Pierce the steak all over with a fork and season with salt and pepper. Oil the grill or pan; grill the steak, 4 to 5 minutes per side for medium-rare, turning once. Transfer to a cutting board and let rest for 5 minutes.\n            \n\n              Slice the tomatoes and season with salt and pepper. Thinly slice the steak against the grain. Serve with the tomatoes and salsa verde.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "parsley", "quantity": 2.0}, {"food": "", "quantity": 3.0}, {"food": "capers", "quantity": 2.0}, {"food": "grape juice", "quantity": 0.5}, {"food": "anchovy", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "tomatoes", "quantity": 2.0}], "title": "\nFlank Steak with Salsa Verde\n"}, {"directions": "\n\n              Marinate the steak. Poke the steak all over with the tines of a fork; cut in half, against the grain, to make 2 steaks (one steak may be slightly thicker). In a dish large enough to hold the steaks, combine the olive oil, wine vinegar, shallot, garlic, and the thyme. Season with pepper to taste. Add the steaks and turn to coat evenly. Cover, and marinate the steaks at room temperature for 1 hour, turning once, or refrigerate, for up to 12 hours. \n            \n\n              Make the mushroom sauce. Heat a medium saute pan over high heat, add the butter, and when the foam subsides, add the mushrooms. Reduce the heat to medium-high and cook, the mushrooms, tossing frequently, until browned, about 5 minutes. Season with the 1/2 teaspoon salt and pepper to taste. Add the garlic, shallot, thyme, and rosemary, and cook for 2 minutes more. Pour the red wine into pan, scraping up any browned bits on the bottom of the pan with a wooden spoon. Cook until almost all the liquid has evaporated. Add the cream, parsley, and chives and stir to combine. Set aside. \n            \n\n              Heat a large grill pan over medium-high heat or an outdoor grill to medium-high. Remove the steaks from the marinade and pat dry. Season with salt and pepper. Cook the steaks for 3 to 5 minutes on each side for rare to medium-rare. Set aside on a cutting board for 5 minutes. Cut the steak against the grain on an angle into very thin slices. Arrange the slices on a warmed platter or plates. Reheat the mushroom sauce if needed and add any accumulated meat juices. Pour the sauce over the steak and serve immediately.\n            \n", "ingredients": [{"food": "", "quantity": 1.5}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 2.0}, {"food": "barley flour or meal", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "garlic powder", "quantity": 2.0}, {"food": "shallots", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 0.25}, {"food": "black bean mango", "quantity": 1}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}], "title": "\nFlank Steak with Saucey Mushrooms\n"}, {"directions": "\n\n              Put the potatoes in a medium pot and cover with cold water by 1 inch; season with salt. Bring to a boil and cook until fork-tender, 15 to 20 minutes; drain.\n            \n\n              Meanwhile, combine the parsley, scallion, jalapeno, garlic, lemon zest and juice, 2 tablespoons olive oil and 1/2 teaspoon salt in a mini food processor; pulse until finely chopped. Transfer to a small bowl and set aside.\n            \n\n              Heat a large skillet over high heat and add 1 tablespoon olive oil. Season the steak with salt and pepper. Add to the skillet and cook until browned, 5 to 6 minutes per side for medium rare. Transfer to a cutting board and let rest 5 minutes.\n            \n\n              Add the remaining 1 tablespoon olive oil and the potatoes to the same skillet; gently smash the potatoes with the back of a wooden spoon. Cook, stirring occasionally, until golden brown and slightly crisp, about 5 minutes. Season with salt and pepper.\n            \n\n              Thinly slice the steak against the grain. Top with the parsley sauce and serve with the potatoes.\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "parsley", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "pepper", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "grape juice", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "", "quantity": 1.25}, {"food": "pepper", "quantity": 1}], "title": "\nFlank Steak with Smashed Potatoes\n"}, {"directions": "\n\n              In a large bowl, whisk together the flour, sugar, baking powder, salt, and nutmeg.\n            \n\n              In another bowl, beat the eggs and then whisk in the milk and vanilla.\n            \n\n              Melt the butter in a large cast-iron skillet or griddle over medium to medium-low heat.\n            \n\n              Whisk the butter into the milk mixture, add to the flour mixture, and whisk until a thick batter is just formed.\n            \n\n              Keeping the skillet at medium to medium low heat, ladle about 1/4 cup of the batter onto the skillet, to make a pancake. Make one or two more pancakes, taking care to keep them evenly spaced apart. Cook, until bubbles break the surface of the pancakes, and the undersides are golden brown, about 2 minutes. Flip with a spatula and cook about 1 minute more on the second side. Serve immediately or transfer to a platter and cover loosely with foil to keep warm. Repeat with the remaining batter, adding more butter to the skillet as needed.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.75}, {"food": "sugar", "quantity": 3.0}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "salt", "quantity": 0.25}, {"food": "nutmeg", "quantity": 0.125}, {"food": "butter oil", "quantity": 3.0}, {"food": "eggs", "quantity": 2.0}, {"food": "milk", "quantity": 1.25}, {"food": "vanilla extract", "quantity": 0.5}], "title": "\nFlapjacks\n"}, {"directions": "\n\n              Puree 2 cups thawed frozen strawberries, peaches or mixed berries and 3 tablespoons white grape juice concentrate with no added sugar in a blender. Stir about 1/3 cup of the fruit puree into 1 cup low-fat milk. Cover and refrigerate the remaining puree for up to 5 days.\n            \n\n              Photographs by Charles Masters\n            \n", "ingredients": [], "title": "\nFlavored Milks\n"}, {"directions": "\n\n              Combine the tequila, sherry, maraschino liqueur, elderflower liqueur and orange bitters in a cocktail shaker with ice; stir. Strain into a chilled martini glass and garnish with a cherry.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [{"food": "barley flour or meal", "quantity": 1.5}, {"food": "", "quantity": 1.0}, {"food": "maraschino cherries", "quantity": 0.25}, {"food": "", "quantity": 0.25}, {"food": "orange", "quantity": 2.0}, {"food": "silk black cherry soy yogurt", "quantity": 1}], "title": "\nFlor Delice\n"}, {"directions": "\n\n              Preheat oven to 350 degrees F.\n            \n\n              In a food processor, pulse the pecans until they resemble fine crumbs. Be careful not to over grind and create a paste. In a small saucepan, melt the butter. Add the brown sugar and the corn syrup. Bring to boil. Remove from the heat and add the ground pecans, and flour. Mix well. Drop teaspoonfuls onto a greased cookie sheet. Bake for 5 to 8 minutes or until brown around the edges and lace-like in appearance. Remove from the oven and allow to cool for 5 minutes. Transfer to wire rack. Place chocolate chips in a small plastic bag. Immerse the bag into barely simmering water until the chips melt. Once the chips are melted, snip a small corner off the bag. Pipe a chocolate squiggle onto each cookie. Allow chocolate to harden before storing cookies.\n            \n\n              Copyright © 2004 Television Food Network, G.P., All Rights Reserved\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 0.75}, {"food": "corn bran", "quantity": 0.5}, {"food": "pecans", "quantity": 0.5}, {"food": "potato flour", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 1.0}], "title": "\nFlorentine Cookies\n"}, {"directions": "\n\n              1. Position a rack closest to the broiler and preheat to high. Bring a large pasta pot filled with salted water to a boil. \n            \n\n              2. Meanwhile, put the butter and garlic in large skillet and cook over medium-high heat until the garlic toasts lightly, 2 to 3 minutes. Add the lemon juice, hazelnuts, and season with salt and pepper. \n            \n\n              3. Pat the scallops dry with paper towel. Arrange the scallops on a broiler pan and brush generously with some of the scampi sauce and season with salt and pepper. Put the pan under the broiler and cook until golden and just cooked through, about 3 minutes. Pour any scallop juices from the broiler pan into the pan sauce.\n            \n\n              4. While the scallops broil, cook the pasta and cook according to package direction. Drain pasta and combine with scampi sauce. Add spinach and parsley and up to 1/3 cup pasta cooking water so the sauce evenly coats the pasta. Toss to incorporate. Divide pasta evenly into bowls and top with scallops, serve. \n            \n", "ingredients": [{"food": "", "quantity": 0.5}, {"food": "garlic powder", "quantity": 5.0}, {"food": "", "quantity": 2.3333333333333335}, {"food": "hazelnuts or filberts", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "sea lion", "quantity": 1.0}, {"food": "", "quantity": 12.0}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 0.5}], "title": "\nFlorentine Scallop Scampi with Fettuccine\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Position a rack in the center of the oven and preheat to 350 degrees F. Line a baking sheet with a silicone baking mat or parchment paper.\n            \n\n              Pulse the almonds in a food processor until finely chopped, but not pasty. Stir together the nuts, flour, zest and salt in a large bowl.\n            \n\n              Put the sugar, cream, corn syrup and butter in a small saucepan. Cook over medium heat, stirring occasionally, until mixture comes to a rolling boil and sugar is completely dissolved. Continue to boil for 1 minute. Remove from heat and stir in the vanilla, then pour mixture into almond mixture and stir just to combine. Set aside until cool enough to handle, 30 minutes.\n            \n\n              Scoop rounded teaspoons (for 3-inch cookies) or rounded tablespoons (for 6-inch cookies) of batter and roll into balls. Place on prepared baking sheet, leaving about 3 to 4 inches between each cookie since they spread.\n            \n\n              Bake 1 pan at a time, until the cookies are thin and an even golden brown color throughout, rotating pans halfway through baking time, about 10 to 11 minutes. Cool on baking sheet for 5 minutes, then transfer to racks to cool. Repeat with remaining batter. Serve.\n            \n\n              Optional chocolate topping: Put the chocolate in a medium heatproof bowl. Bring a saucepan filled with 1 inch or so of water to a very low simmer; set the bowl over, but not touching, the water. Stir the chocolate occasionally until melted and smooth. (Alternatively, put the chocolate in a medium microwave-safe bowl. Melt at 50 percent power in the microwave until soft, about 1 minute. Stir, and continue heat until completely melted, about 1 to 2 minutes more.)\n            \n\n              For sandwiches: Drop about 1/2 teaspoon chocolate onto on the flat side of half of the cookies and press together with remaining halves. Return to rack and let chocolate set.\n            \n\n              For chocolate decor: Drizzle melted chocolate over Florentines as desired. Set aside at room temperature until chocolate is set.\n            \n", "ingredients": [{"food": "pasta with sliced franks in tomato sauce", "quantity": 1.75}, {"food": "potato flour", "quantity": 3.0}, {"food": "", "quantity": 1.0}, {"food": "salt", "quantity": 0.25}, {"food": "sugar", "quantity": 0.75}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "silk light vanilla", "quantity": 2.0}, {"food": "butter oil", "quantity": 5.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 2.0}], "title": "\nFlorentines (Italy)\n"}, {"directions": "\n\n              Make the cake: Position a rack in the lower third of the oven and preheat to 325 degrees F. Brush the bottom and side of a 9-inch springform pan with olive oil and line the bottom with parchment. Brush the parchment with more olive oil and dust with almond flour, tapping out the excess.\n            \n\n              Whisk the almond flour, potato starch and salt in a medium bowl. Combine 1/2 cup sugar, 1/3 cup honey, the lemon zest, 4 egg yolks, vanilla and almond extracts, and the olive oil in a large bowl; beat with a mixer on medium-high speed until smooth and creamy, about 3 minutes. Reduce the speed to low; beat in the almond flour mixture until just incorporated.\n            \n\n              In a separate bowl, beat the 6 egg whites with a mixer on medium speed until foamy, about 1 minute. Gradually beat in 1/2 cup sugar until stiff glossy peaks form, about 3 more minutes. Gently fold about one-third of the beaten egg whites into the batter, then fold in the rest until just incorporated (it's OK if some white streaks remain). Pour the batter into the prepared pan. Bake until the cake is golden and springs back when lightly pressed, 50 to 55 minutes. Transfer to a rack to cool completely. (Don't worry if the cake falls slightly in the center.)\n            \n\n              Meanwhile, make the topping: Place the lemon slices in a small saucepan, cover with water and bring to a simmer over high heat, about 3 minutes; drain and return to the pan. Cover with fresh water; bring to a simmer and drain. Repeat one more time with fresh water. Return to the saucepan and add the remaining 1/2 cup sugar, 1/3 cup honey, the lemon juice and 1 cup water. Bring to a simmer over high heat, then reduce the heat to medium and cook, stirring occasionally, until the lemon slices are tender and the liquid is syrupy, about 20 minutes. Set aside.\n            \n\n              Run a thin knife around the edge of the cake, then remove the springform ring. Use a spatula to transfer the cake to a serving plate (remove the parchment). Remove the candied lemon slices from the syrup with a fork. Brush the cake all over with some of the lemon-honey syrup, then top with the candied lemon, almonds and pomegranate seeds. Serve with the remaining syrup on the side.\n            \n\n              Photograph by Andrew Purcell\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.25}, {"food": "potato flour", "quantity": 1.75}, {"food": "potato flour", "quantity": 0.3333333333333333}, {"food": "salt", "quantity": 0.5}, {"food": "sugar", "quantity": 1.5}, {"food": "honey smoked ham", "quantity": 0.6666666666666666}, {"food": "grape juice", "quantity": 2.0}, {"food": "eggs", "quantity": 4.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 0.25}, {"food": "pomegranate", "quantity": 1}], "title": "\nFlourless Almond-Honey Cake with Candied Lemon\n"}, {"directions": "\n\n              Make the cake: Preheat the oven to 375 degrees F. Coat a 10-inch Bundt pan with cooking spray. \n            \n\n              Whisk the almond flour, potato starch, orange zest, cinnamon, ginger and salt in a large bowl; stir in the carrots. \n            \n\n              Combine the whole eggs and 1 cup granulated sugar in another large bowl. Beat with a mixer on medium-high speed until pale and thick, about 3 minutes. Gently fold in the carrot mixture. \n            \n\n              Put the egg whites in another large bowl and beat with a mixer on medium-high speed until just foamy. Gradually add the remaining 1/4 cup granulated sugar and beat until stiff, glossy peaks form, 6 to 8 more minutes. \n            \n\n              Gently fold the beaten egg white mixture into the carrot mixture in 3 additions until just combined. Scrape the batter into the prepared pan. Bake until the cake springs back when pressed and a toothpick inserted into the center comes out clean, 25 to 30 minutes. Transfer to a rack and let cool completely in the pan, then invert onto a platter. \n            \n\n              Make the glaze: Whisk the confectioners' sugar, orange juice, vanilla seeds and salt in a bowl. Drizzle over the cake and let set slightly before serving. \n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 2.0}, {"food": "potato flour", "quantity": 0.5}, {"food": "orange", "quantity": 1.0}, {"food": "cinnamon", "quantity": 0.5}, {"food": "ginger", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "carrots", "quantity": 2.0}, {"food": "eggs", "quantity": 2.0}, {"food": "sugar", "quantity": 1.25}, {"food": "sugar", "quantity": 1.0}, {"food": "orange juice", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}], "title": "\nFlourless Carrot Bundt Cake\n"}, {"directions": "\n\n              Preheat oven to 325 degrees F. Spray a 9 by 2-inch spring form pan with nonstick spray. \n            \n\n              Put the chocolate, butter, and salt in a large microwave safe bowl. Melt in the microwave on 75 percent power for 2 minutes. Stir and microwave again until completely melted, about 2 minutes more. Alternatively, put the chocolate and butter in a heatproof bowl. Bring a saucepan filled with an inch or so of water to a very slow simmer; set the bowl on the pan without touching the water. Stir occasionally until melted. \n            \n\n              Beat the eggs and sugar with a standing or handheld mixer until light and thickened, about 8 to 10 minutes. Fold the melted chocolate into the whipped eggs until evenly combined. \n            \n\n              Pour the batter into the prepared pan and bake until a toothpick inserted into the center comes out wet but not gooey, about 1 hour and 25 minutes. Remove cake from the oven and cool on a rack. \n            \n\n              When ready to serve remove ring from spring form mold. Dust cake with confectioners' sugar or cocoa powder. Serve with whipped cream or ice cream if desired. \n            \n\nReally Vanilly Whipped cream:\n\n\n              Beat the cream and vanilla in a chilled non-reactive bowl with a whisk or an electric mixer just until they hold a loose peak. (Lift the beater from the cream and look at the shape of the peak at the end of the whisk; it should hold a lazy curve.) Sift the sugar over the cream and continue to beat just until it holds a soft peak. Take care not to over beat the cream or it will be look curdy. Serve, or refrigerate covered for up to 4 hours. \n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 12.0}, {"food": "butter oil", "quantity": 12.0}, {"food": "salt", "quantity": 0.25}, {"food": "eggs", "quantity": 6.0}, {"food": "sugar", "quantity": 1.5}, {"food": "onion powder", "quantity": 1}, {"food": "ice cream swich", "quantity": 1}, {"food": "ice cream swich", "quantity": 1.5}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "sugar", "quantity": 2.0}], "title": "\nFlourless Chocolate Cake\n"}, {"directions": "\nSpecial equipment: A 9-inch spring-form pan\n\n              Preheat the oven to 325 degrees F and butter the inside of a spring-form pan. Melt the chocolate and butter in a medium saucepan over medium-low heat; stirring frequently until smooth. Stir in the sugar, cocoa powder and salt until all of the lumps are gone. Remove from the heat and let cool for a few minutes.\n            \n\n              Meanwhile, beat the egg whites in a large bowl with an electric mixer on medium-high speed until they form stiff peaks, 2 to 3 minutes.\n            \n\n              Stir the egg yolks into the cooled chocolate mixture, then stir in about a quarter of the whipped egg whites. Scrape this lightened chocolate mixture into the remaining whipped egg whites and gently fold until mostly combined (it's ok if there are some streaks of egg white). Pour into the prepared pan and bake until the center of the cake no longer wiggles, 40 to 45 minutes. Let cool completely in the pan, on a wire rack (the cake will deflate slightly). Unlock the pan and dust the top of the cake with some cocoa powder. Cut into slices and serve with whipped cream.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 8.0}, {"food": "baking chocolate", "quantity": 8.0}, {"food": "sugar", "quantity": 0.75}, {"food": "onion powder", "quantity": 0.3333333333333333}, {"food": "salt", "quantity": 0.25}, {"food": "eggs", "quantity": 6.0}, {"food": "ice cream swich", "quantity": 1}], "title": "\nFlourless Chocolate Cake\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Lightly butter the bottom and side of a 9-inch springform pan. Combine the chocolate and 1 1/2 sticks butter in a heatproof bowl. Place the bowl over a saucepan of simmering water (do not let the bowl touch the water) and stir until melted and combined. Remove the bowl from the saucepan and let cool slightly.\n            \n\n              Combine the eggs, sugar and salt in a large bowl. Beat with a mixer on medium-high speed until pale and thick, 5 to 8 minutes.\n            \n\n              Gently fold half of the melted chocolate mixture into the egg mixture until just combined, then gently fold in the rest. Pour the batter into the prepared pan and bake until the top is no longer shiny and barely jiggles and a toothpick inserted into the center comes out with only a few crumbs, 35 to 45 minutes. Transfer to a rack and let cool completely in the pan. Remove the springform ring and transfer to a platter; dust with cocoa powder.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "margarine spread", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 12.0}, {"food": "eggs", "quantity": 6.0}, {"food": "sugar", "quantity": 0.5}, {"food": "hearts of palm", "quantity": 1}, {"food": "onion powder", "quantity": 1}], "title": "\nFlourless Chocolate Torte\n"}, {"directions": "\n\n              Make the cake: Preheat the oven to 350 degrees F. Coat the bottom and sides of a 9-inch-round cake pan with cooking spray and line with parchment paper. Put the walnuts, cinnamon and 1/4 cup sugar in a food processor; pulse until finely ground but not powdery. Whisk the egg yolks, orange zest and vanilla, if using, in a small bowl.\n            \n\n              Beat the egg whites and salt in a large bowl with a mixer on medium-high speed until foamy. Beat in the remaining 1/4 cup sugar, 1 tablespoon at a time, until soft peaks form, about 8 minutes. Fold in the yolk mixture and dates, then fold in the ground walnut mixture. Scrape the batter into the prepared pan. Bake until the cake is golden and a toothpick comes out clean, 23 to 25 minutes. Let cool in the pan on a rack, then run a knife along the sides and invert the cake onto a platter.\n            \n\n              Make the glaze: Put the chocolate, margarine and honey in a microwave-safe bowl, cover with plastic wrap and microwave until the margarine melts, about 2 minutes. Whisk until smooth. Cool slightly, then pour over the cake. Top with walnuts.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "", "quantity": 3.0}, {"food": "cinnamon", "quantity": 0.75}, {"food": "sugar", "quantity": 0.5}, {"food": "eggs", "quantity": 4.0}, {"food": "orange", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "dates", "quantity": 0.75}, {"food": "", "quantity": 1}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "margarine spread", "quantity": 4.0}, {"food": "honey smoked ham", "quantity": 1.0}, {"food": "walnuts", "quantity": 1}], "title": "\nFlourless Walnut-Date Cake\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Line two baking sheets with parchment paper. Place the lollipops 2 inches from the edge of the pan and 4 inches apart.\n            \n\n              Mix the cookie dough with the flour until it is an even texture. Use a round teaspoon measuring spoon to form leveled half circles. Use your finger to gently ease the dough out of the spoon. Place 5 of the half circles, rounded-side up, around each lollipop, leaving a little space so that they are not quite touching.\n            \n\n              Bake the cookies, rotating the pans top to bottom and front to back midway through baking, until the candy melts and the cookies are slightly puffed and just golden, 12 to 14 minutes. Let cool on the pans until the candy hardens, about 10 minutes.\n            \n", "ingredients": [{"food": "pasta with sliced franks in tomato sauce", "quantity": 14.0}, {"food": "sugar", "quantity": 16.0}, {"food": "potato flour", "quantity": 2.0}], "title": "\nFlower Cookie Pops\n"}, {"directions": "\n\n              For the cookies: Beat the butter in a large bowl with a handheld mixer until fluffy. Scrape down the sides of the bowl, add brown sugar, and continue beating until light, 2 to 3 minutes. Add egg and vanilla extract, beating until smooth. Gradually add the 2 cups flour and salt while mixing slowly to make a rough dough. Press dough into a ball by hand. Lightly dust the cookie dough with flour and roll it between 2 pieces of waxed paper into a 1/4-inch-thick disk. Slide the disk in the paper onto a cookie sheet and freeze until firm, about 20 minutes (or refrigerate about 1 hour).\n            \n\n              Evenly space the racks in the oven and preheat to 350 degrees F.\n            \n\n              Transfer the dough to the work surface and remove the top sheet of paper. Cut into cookies with a 4-inch flower or other decorative cutter and transfer them to a parchment-lined or nonstick baking sheet. Press excess dough together and roll and cut into cookies as well. Bake until cookies' edges are golden, about 20 minutes. Cool on a rack.\n            \n\n              For the icing: Whisk the water and egg white powder in a medium bowl until foamy and smooth. Gradually whisk in the confectioners' sugar to make a smooth icing. Spread a layer of icing over the entire surface of the cookies (or just in the center, if desired) with the back of a teaspoon. Place sprinkles, chocolate chips, or candies in the center of the cookies. Let rest until the icing sets, about 30 minutes.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "salt", "quantity": 0.25}, {"food": "coconut water", "quantity": 0.25}, {"food": "onion powder", "quantity": 3.0}, {"food": "sugar", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1}], "title": "\nFlower Sugar Cookies\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Line a 6-inch-round and an 8-inch-round cake pan with parchment paper; coat with cooking spray. Prepare the cake mix as directed; divide between the pans and bake 25 to 30 minutes. Let cool. \n            \n\n              Level the tops of the cakes with a serrated knife (save the trimmings). Halve the cakes horizontally. Working on a cake board or plate, stack the 8-inch layers, then the 6-inch layers, frosting between each layer. \n            \n\n              Hold a serrated knife at an angle and trim the edges of the layer cake all the way around to make an upside-down pot shape. Cover the cake with all but 1/2 cup of the remaining frosting; freeze 30 minutes. \n            \n\n              Sprinkle 3 tablespoons cocoa powder on a sheet of parchment; put the fondant on top, make a small well in the middle and put the food coloring in the well. Knead until the color is even.\n            \n\n              Dust a surface with cocoa powder; roll out the colored fondant into a 24-by-6 1/2-inch rectangle, trimming the edges to make them straight. Cut off a 24-by-1 1/4-inch strip of fondant; set aside. \n            \n\n              Wrap the wide piece of fondant around the cake, pressing and smoothing it with your fingers. Trim the excess with a paring knife.\n            \n\n              Reroll the fondant scraps and cut out a 5-inch circle; press the fondant circle on top of the cake to form the pot bottom. Invert the cake onto a board. Lightly brush the thin strip of fondant with water; attach to the top edge of the cake, allowing the strip to come slightly above the edge. Trim the ends. \n            \n\n              Cover the top of the cake with the remaining 1/2 cup frosting, then crumble the cake trimmings on top. \n            \n\n              When ready to serve, stick mint sprigs and edible flowers into the cake. \n            \n\n              Photograph by Lisa Shin\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "shortening cake mix", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "onion powder", "quantity": 3.0}, {"food": "martha white foods", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.75}, {"food": "orange", "quantity": 0.25}, {"food": "pumpkin flowers", "quantity": 1}], "title": "\nFlowerpot Cake\n"}, {"directions": "\n\n              Line 2 large baking sheets with parchment paper. Whisk the flour, baking powder, baking soda, cinnamon, nutmeg, cloves and salt in a medium bowl.\n            \n\n              Beat the butter and brown sugar in a large bowl with a mixer on medium speed until light and fluffy, 3 minutes. Beat in the eggs one at a time, fully incorporating each before adding the next. Add the molasses, yogurt, ginger and lemon zest and beat until smooth, scraping the sides of the bowl as needed. Reduce the mixer speed to low and beat in the flour mixture to make a sticky batter (do not overmix). Fold in the oats and half of the raisins, cranberries and walnuts. Mix the remaining dried fruit and nuts in a small bowl and set aside.\n            \n\n              Drop heaping tablespoonfuls of batter onto the prepared baking sheets. Top each with some of the reserved dried-fruit-and-nut mixture and chill for 30 minutes. Meanwhile, preheat the oven to 375 degrees.\n            \n\n              Bake the cookies until dark golden but still soft, 10 to 12 minutes; cool on a rack. Store in an airtight container for up to 1 week.\n            \n\n              Photograph by Marko Metzinger\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.25}, {"food": "baking chocolate", "quantity": 1.25}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "cinnamon", "quantity": 0.75}, {"food": "nutmeg", "quantity": 0.5}, {"food": "hearts of palm", "quantity": 1}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "molasses", "quantity": 0.25}, {"food": "silk plain soy yogurt", "quantity": 0.25}, {"food": "ginger", "quantity": 1.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "oats", "quantity": 0.5}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 1.25}, {"food": "cranberries", "quantity": 1.25}, {"food": "walnuts", "quantity": 1.25}], "title": "\nFlu-Fighter Cookies\n"}, {"directions": "\n\n              Slowly beat the butter and sugar, in another medium bowl, with an electric mixer until incorporated. Raise the speed to high and mix until light and fluffy, about 5 to 7 minutes. (Occasionally turn the mixer off, and scrape the sides of the bowl down with a rubber spatula.) Add the fluff and salt and reduce the speed to low. Add the milk and vanilla mixture, scrape the bowl down, and mix until fully incorporated. Raise the mixer to high and beat briefly until fluffy, about 1 to 2 minutes. Use immediately.\n            \n", "ingredients": [{"food": "whole milk", "quantity": 0.25}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "butter oil", "quantity": 10.0}, {"food": "sugar", "quantity": 5.0}, {"food": "", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "vanilla extract", "quantity": 1}], "title": "\nFluff Frosting\n"}, {"directions": "\n\n              For the cake: Preheat the oven to 350 degrees F. Butter the bottoms and sides of two 9-inch round cake pans; dust with flour, then tap out the excess.\n            \n\n              Whisk together the flour, baking powder and salt in a medium bowl; set aside.\n            \n\n              Beat the butter, granulated sugar and oil in a large bowl with an electric mixer on medium-high speed until light in color and fluffy, about 5 minutes. Beat in the eggs, 1 at a time, then beat in the vanilla until combined.\n            \n\n              Alternate folding the flour mixture and milk into the batter with a spatula, adding the flour in 3 additions and the milk in 2, starting and ending with the flour, until just smooth. Add the sprinkles and fold 3 or 4 times until just blended to prevent the colors from bleeding too much. Divide the batter evenly between the prepared pans.\n            \n\n              Bake the cakes on the same oven rack, rotating the pans about halfway if they seem to be browning unevenly, until golden on top and the centers spring back to the touch, 35 to 40 minutes. Let cool in the pans about 10 minutes, then turn out onto cooling racks and let cool completely.\n            \n\n              For the frosting: While the cakes cool, beat the butter and salt in a large bowl with an electric mixer on medium speed until smooth. Gradually beat in the confectioners' sugar. Once it's all been added, increase the speed to medium-high, and beat until white and fluffy. Beat in the vanilla until blended. Add 2 tablespoons of the milk, and beat to incorporate. Beat in the remaining milk, 1 tablespoon at a time (the frosting will be spreadable but not runny).\n            \n\n              To assemble: Place 1 cake layer right-side up on a cake plate or stand, and spread with 1 cup of the frosting. Top with the second cake layer. Frost the top and sides of the cake with the remaining frosting. Decorate the top with additional sprinkles.\n            \n\n              The cake layers can be made a day ahead; wrap the cooled layers in plastic and aluminum foil and store at room temperature overnight. You can also assemble and frost the cake the day before serving; let it stand at room temperature overnight, covered by a large bowl or cake dome (if your kitchen is very hot, chill the cake and let it stand at room temperature for at least 1 hour before serving).\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.0}, {"food": "potato flour", "quantity": 2.75}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "eggs", "quantity": 5.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "milk", "quantity": 1.0}, {"food": "barley flour or meal", "quantity": 3.0}, {"food": "butter oil", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "sugar", "quantity": 3.25}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "milk", "quantity": 0.25}], "title": "\nFluffy Confetti Birthday Cake\n"}, {"directions": "\nSpecial equipment: four 3-inch-wide-by-2 1/2-inch-high ring molds\n\n              Whisk together the flour, confectioners' sugar, baking powder and salt in a large bowl.\n            \n\n              Whisk together the milk, melted butter, vanilla and egg yolk in a medium bowl until combined. \n            \n\n              Beat the egg whites and cream of tartar in another large bowl with an electric mixer on medium-high speed until stiff peaks form, about 2 minutes. \n            \n\n              Stir the milk mixture into the flour mixture until just combined (it's OK if there are a few lumps). Stir one-third of the beaten egg whites into the flour-milk mixture. Then gently fold in the remaining egg whites until just combined (take care not to overmix). \n            \n\n              Lightly spray the inside of four 3-inch-wide-by-2 1/2-inch-high ring molds with nonstick cooking spray\n            \n\n              Heat a large nonstick skillet over medium-low heat. Coat with nonstick cooking spray. Put the prepared ring molds in the middle of the skillet and fill each with 1/2 cup of batter (it should fill each ring mold about halfway). Cover the skillet with the lid and cook until the batter rises to the tops of the ring molds and is golden on the bottom, about 5 minutes. Release the bottom of the pancakes with a spatula. Grasp the sides of the ring molds with tongs to stabilize them and then carefully flip. Cover and cook until golden on the other side, about 5 minutes more. Transfer to a plate and remove the mold. Serve with butter and maple syrup. The pancakes should be eaten before they deflate.\n            \n\n              Lightly spray the ring molds and coat the skillet with nonstick cooking spray and repeat the cooking method with the remaining batter. \n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.5}, {"food": "sugar", "quantity": 3.0}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "salt", "quantity": 0.5}, {"food": "milk", "quantity": 1.25}, {"food": "butter oil", "quantity": 4.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 0.25}, {"food": "", "quantity": 1}, {"food": "syrup", "quantity": 1}], "title": "\nFluffy Japanese Pancakes\n"}, {"directions": "\n\n              Whisk the flour, confectioners' sugar, baking powder and salt in a large bowl. Whisk the milk, egg yolk, melted butter and vanilla in a medium bowl until combined. In a separate large bowl, beat the 3 egg whites with a mixer on medium-high speed until stiff peaks form, about 2 minutes.\n            \n\n              Stir the milk mixture into the flour mixture with a rubber spatula until just combined (it's OK if there are a few lumps). Stir in one-third of the beaten egg whites, then gently fold in the rest until just combined (do not overmix).\n            \n\n              Heat a griddle or large nonstick skillet over medium-low heat; lightly brush with butter. Pour 1/4 cup batter onto the griddle for each pancake; cook until bubbles form on top and the bottom is lightly browned, about 3 minutes. (If the pancakes are browning too quickly, reduce the heat to low.) Flip and continue cooking until golden on the other side, about 1 more minute. Transfer to a plate. Repeat with the remaining batter, brushing the pan with more butter as necessary. Serve with butter and syrup.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.5}, {"food": "sugar", "quantity": 3.0}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "salt", "quantity": 0.5}, {"food": "milk", "quantity": 1.25}, {"food": "egg substitute", "quantity": 1.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "syrup", "quantity": 1}], "title": "\nFluffy Pancakes\n"}, {"directions": "\nSpecial equipment: nonstick foil\n\n              Preheat an oven to 350 degrees F. Line a quarter baking sheet with nonstick foil, then generously oil the bottom and sides of the pan with oil. Set aside.\n            \n\n              Beat the egg whites, cream of tartar and salt in a large bowl with an electric mixer on high speed until the mixture becomes shiny and stiff peaks form, about 2 minutes. Beat together the egg yolks, garlic, cream cheese and agave nectar in a separate large bowl on medium speed until completely combined and smooth, 2 to 3 minutes (the mixture may appear broken but it will come together after a few minutes). Gently fold the egg whites into the egg yolk mixture until combined, making sure not to deflate the egg whites and keeping the mixture as light and airy as possible.\n            \n\n              Pour the batter into the prepared baking sheet and top with the sliced tomato. Bake, rotating the pan halfway through, until the top is deep golden brown and the bread bounces back when touched, about 20 minutes. (See Cook's Note.)\n            \n\n              Cool completely on a wire rack and store in an airtight container overnight. Before serving, drizzle with oil and sprinkle with flaky sea salt, the basil leaves and grated Parmesan; cut into squares.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1}, {"food": "eggs", "quantity": 6.0}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "garlic powder", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 3.0}, {"food": "silk light vanilla", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "sea lion", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 1}, {"food": "", "quantity": 2.0}], "title": "\nFocaccia Cloud Bread\n"}, {"directions": "\nSpecial equipment: nonstick foil\n\n              Preheat an oven to 350 degrees F. Line a quarter baking sheet with nonstick foil, then generously oil the bottom and sides of the pan with oil. Set aside.\n            \n\n              Beat the egg whites, cream of tartar and salt in a large bowl with an electric mixer on high speed until the mixture becomes shiny and stiff peaks form, about 2 minutes. Beat together the egg yolks, garlic, cream cheese and agave nectar in a separate large bowl on medium speed until completely combined and smooth, 2 to 3 minutes (the mixture may appear broken but it will come together after a few minutes). Gently fold the egg whites into the egg yolk mixture until combined, making sure not to deflate the egg whites and keeping the mixture as light and airy as possible.\n            \n\n              Pour the batter into the prepared baking sheet and top with the sliced tomato. Bake, rotating the pan halfway through, until the top is deep golden brown and the bread bounces back when touched, about 20 minutes. (See Cook's Note.)\n            \n\n              Cool completely on a wire rack and store in an airtight container overnight. Before serving, drizzle with oil and sprinkle with flaky sea salt, the basil leaves and grated Parmesan; cut into squares.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1}, {"food": "eggs", "quantity": 6.0}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "garlic powder", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 3.0}, {"food": "silk light vanilla", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "sea lion", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 1}, {"food": "", "quantity": 2.0}], "title": "\nFocaccia Cloud Bread\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: 18-inch-wide heavy duty non-stick aluminum foil\n\n              Whisk together the chili powder, sugar, chipotle powder, 1 teaspoon salt and 1/2 teaspoon pepper in a medium bowl to make a dry spice rub. Place the wings in a large bowl, toss with the oil, and sprinkle with the dry spice rub. Toss the wings to evenly coat, cover with plastic wrap and refrigerate for at least 1 hour and up to 2 hours.\n            \n\n              Prepare a grill for high heat.\n            \n\n              Tear off four 18-by-18-inch sheets of heavy duty non-stick aluminum foil. Remove the wings from the bowl, making sure to leave any excess liquid behind. Divide the wings among the foil pieces, centering them on each piece in a single layer. Sprinkle the wings with a generous pinch of salt and pepper. Bring two opposite ends of the foil together and fold twice to seal, then fold in the other sides to create leak-proof packets. Grill over high heat, turning once, until the wings are cooked through, about 25 minutes. Carefully open the packets (hot steam will escape). Scatter the cilantro over the tops and serve with the lime wedges.\n            \n", "ingredients": [{"food": "chili powder", "quantity": 0.25}, {"food": "sugar", "quantity": 0.25}, {"food": "chili powder", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "diced chicken", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "", "quantity": 0.5}, {"food": "lime", "quantity": 1.0}], "title": "\nFoil-Pack Grilled Sweet-and-Spicy Chicken Wings\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Season the chicken with salt and pepper. Lay out four 12-by-18-inch sheets of foil. Drizzle each sheet with olive oil, then top each with a chicken breast.\n            \n\n              Combine the tomatoes, artichokes, olives, capers, 2 minced garlic cloves, 1 tablespoon olive oil, 1/2 teaspoon salt and 1/4 teaspoon red pepper flakes in a bowl; divide evenly over the chicken. Fold up the edges of the foil and seal each to form a packet; set on a baking sheet. Bake until the chicken is cooked through, about 30 minutes.\n            \n\n              Meanwhile, combine the remaining 3 tablespoons olive oil, 2 minced garlic cloves and 1/4 teaspoon red pepper flakes, and a pinch of salt in a bowl; spread over the baguette halves and sprinkle with the parmesan and parsley. Bake until the bread is golden around the edges, 8 to 10 minutes. Cut each piece in half.\n            \n\n              Open the foil packets and serve with the garlic bread.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "silk black cherry soy yogurt", "quantity": 1.0}, {"food": "artichoke hearts", "quantity": 1.0}, {"food": "olives", "quantity": 0.3333333333333333}, {"food": "capers", "quantity": 2.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "split pea soup", "quantity": 1.5}, {"food": "parmesan cheese", "quantity": 2.0}, {"food": "parsley", "quantity": 1.0}], "title": "\nFoil-Packet Chicken Puttanesca\n"}, {"directions": "\n\n              Toss 1 pound small shallots, 1 tablespoon sugar, 2 tablespoons each chopped parsley and chives, and salt and pepper on a large piece of foil. Dot with butter and drizzle with red wine vinegar. Tightly seal into a flat packet; grill over indirect heat, flipping once, 45 minutes.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [], "title": "\nFoil-Packet Shallots\n"}, {"directions": "\n\n              Rub a small pot with garlic; add 1 cup white wine and simmer. Whisk in 1 tablespoon cornstarch mixed with a splash of cognac, then 1/4 pound each gruyere and emmentaler cheese; add salt, pepper and nutmeg. Serve hot with apples and bread.\n            \n\n              See all 50 Game-Day Dips\n            \n\n              Photographs by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nFondue\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Set a rack on a rimmed baking sheet. Toss the mushrooms with the olive oil; season with salt and pepper. Arrange open-side down on the rack. Bake until tender, about 30 minutes.\n            \n\n              Meanwhile, melt the butter in a medium skillet over medium heat. Add the garlic and cook until softened, about 2 minutes. Add the panko and cook, stirring occasionally, until golden, about 5 minutes. Stir in the parsley, lemon zest and 1/2 teaspoon salt.\n            \n\n              Turn the mushrooms open-side up. Fill each with 1/2 teaspoon of the panko mixture and a cube of cheese; sprinkle with more of the panko mixture. Bake until the cheese is melted and the panko is golden, 5 minutes.\n            \n\n              Photograph by Ryan Liebe\n            \n", "ingredients": [{"food": "mushrooms", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "dessert topping", "quantity": 0.75}, {"food": "parsley", "quantity": 0.25}, {"food": "", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 6.0}], "title": "\nFondue Stuffed Mushrooms\n"}, {"directions": "\n\n              Bring the broth and 4 cups water to a simmer in a saucepan; keep warm.\n            \n\n              Meanwhile, melt 4 tablespoons butter in a pot over medium-high heat. Add the onion; cook until translucent, about 4 minutes. Add the rice and thyme; cook, stirring, until the rice is glossy, about 1 minute. Add the wine and cook, stirring, until the liquid is absorbed. Add 1 teaspoon Kosher salt. Ladle in the hot broth, about 1/2 cup at a time, stirring constantly, allowing all of the liquid to be absorbed before adding more. Continue until the rice is just tender, 20 to 25 minutes.\n            \n\n              Remove the thyme. Stir in the parmigiano, the remaining 1 tablespoon butter, 1/2 teaspoon Kosher salt and pepper to taste. Gently stir in the fontina and chicken. Reserve about 2 cups risotto for Risotto Cakes. Divide the rest among bowls; top with parsley and more fontina.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 4.0}, {"food": "butter oil", "quantity": 5.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "crisped rice bar", "quantity": 2.5}, {"food": "thyme", "quantity": 3.0}, {"food": "martha white foods", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "diced chicken", "quantity": 8.0}, {"food": "parsley", "quantity": 0.25}], "title": "\nFontina Risotto with Chicken\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F.\n            \n\n              Bring a large pot of water to a boil over high heat and salt it generously. Add the lasagna noodles and boil, stirring occasionally, until al dente, about 8 to 10 minutes. Drain.\n            \n\n              Meanwhile, heat the olive oil and garlic in a saucepan over medium heat until the garlic begins to brown. Add the spinach, season with salt and pepper and stir until the spinach dries out and the garlic is fragrant, about 3 minutes. Cool.\n            \n\n              Mix the cottage cheese, goat cheese, Parmesan/Pecorino, 2 cups of the mozzarella cheese, lemon zest, nutmeg, cayenne, and cooled spinach in a bowl. Season with salt and pepper, to taste. Stir in the egg.\n            \n\n              Cover the bottom of a 9- by 13-inch casserole with a thin layer of Tomato Sauce. Cover with 3 of the noodles placed side-to-side, but not overlapping. Top with a 1/4 of the cheese mixture and about a half cup of Tomato Sauce. Season lightly with salt and pepper. Repeat to make 2 more layers. Cover lasagna layers with remaining noodles, dollop remaining cheese mixture on top. Drizzle with remaining Tomato Sauce, then scatter the remaining 2 cups mozzarella on top. Bake, uncovered, until the lasagna is hot and bubbly, about 40 to 45 minutes. Let lasagna stand for 10 minutes before serving.\n            \n\nTomato Sauce with Basil:\n\n\n              Put the olive oil and garlic in a saucepan and cook until fragrant, 2 minutes. Add tomatoes and salt. Break up the tomatoes into small chunks with a wooden spoon and bring to a boil over high heat, lower heat to a brisk simmer, and cook until thickened, about 30 to 40 minutes. While sauce cooks, tear basil leaves into small pieces. Remove the sauce from the heat, stir in the basil, and adjust seasoning with salt and pepper, to taste.\n            \n", "ingredients": [{"food": "black bean mango", "quantity": 1}, {"food": "lasagna", "quantity": 12.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "garlic powder", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 10.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "barley flour or meal", "quantity": 0.75}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "nutmeg", "quantity": 0.5}, {"food": "", "quantity": 0.125}, {"food": "egg substitute", "quantity": 1.0}, {"food": "barley flour or meal", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "garlic powder", "quantity": 4.0}, {"food": "pasta with tomato sauce", "quantity": 28.0}, {"food": "salt", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 0.6666666666666666}, {"food": "black bean mango", "quantity": 1}], "title": "\nFour Cheese and Spinach Lasagna\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F.\n            \n\n              Bring a large pot of water to a boil over high heat and salt it generously. Add the lasagna noodles and boil, stirring occasionally, until al dente, about 8 to 10 minutes. Drain.\n            \n\n              Meanwhile, heat the olive oil and garlic in a saucepan over medium heat until the garlic begins to brown. Add the spinach, season with salt and pepper and stir until the spinach dries out and the garlic is fragrant, about 3 minutes. Cool.\n            \n\n              Mix the cottage cheese, goat cheese, Parmesan/Pecorino, 2 cups of the mozzarella cheese, lemon zest, nutmeg, cayenne, and cooled spinach in a bowl. Season with salt and pepper, to taste. Stir in the egg.\n            \n\n              Cover the bottom of a 9 by 13-inch casserole with a thin layer of tomato sauce. Cover with 3 of the noodles placed side-to-side, but not overlapping. Top with a 1/4 of the cheese mixture and about a half cup of tomato sauce. Season lightly with salt and pepper. Repeat to make 2 more layers. Cover lasagna layers with remaining noodles, dollop remaining cheese mixture on top. Drizzle with remaining tomato sauce, then scatter the remaining 2 cups mozzarella on top. Bake, uncovered, until the lasagna is hot and bubbly, about 40 to 45 minutes. Let lasagna stand for 10 minutes before serving.\n            \n\nTomato Sauce with Basil:\n\n\n              Put the olive oil and garlic in a saucepan and cook until fragrant, 2 minutes. Add tomatoes and salt. Break up the tomatoes into small chunks with a wooden spoon and bring to a boil over high heat, lower heat to a brisk simmer, and cook until thickened, about 30 to 40 minutes. While sauce cooks, tear basil leaves into small pieces. Remove the sauce from the heat, stir in the basil, and adjust seasoning with salt and pepper, to taste.\n            \n", "ingredients": [{"food": "black bean mango", "quantity": 1}, {"food": "lasagna", "quantity": 12.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "garlic powder", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "barley flour or meal", "quantity": 0.75}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "nutmeg", "quantity": 0.5}, {"food": "", "quantity": 0.125}, {"food": "egg substitute", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "garlic powder", "quantity": 4.0}, {"food": "pasta with tomato sauce", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 0.6666666666666666}, {"food": "black bean mango", "quantity": 1}], "title": "\nFour Cheese and Spinach Lasagna\n"}, {"directions": "\n\n              Make the sauce: Heat the olive oil in a large skillet over medium heat; add the chicken and cook until browned, turning, 5 minutes. Add the onion, garlic and tomato paste and cook, stirring, until the onion softens, about 5 minutes. Add the wine and cook until mostly evaporated, about 5 minutes. Stir in 3 cups water, the tomatoes, bay leaves, parsley, 1 teaspoon salt and 1/4 teaspoon pepper; bring to a boil. Reduce the heat to medium low and simmer 50 minutes. Break up the chicken with a spoon. Cook until thickened, 20 more minutes. Remove the bay leaves.\n            \n\n              Prepare the lasagna: Preheat the oven to 350 degrees F. Bring a large pot of salted water to a boil. Add the noodles and cook as the label directs. Drain the noodles and drizzle with olive oil; set aside.\n            \n\n              Meanwhile, place the kale in a large microwave-safe bowl; add 1/2 cup water and a pinch of salt. Cover with plastic wrap and microwave until tender, 5 minutes. Drain and rinse under cold water; squeeze dry, then return to the bowl. Stir in the eggs, ricotta, half of the parmesan and the parsley. Add 1/2 teaspoon salt and a few grinds of pepper. Toss the mozzarella, asiago and the remaining parmesan in a separate bowl.\n            \n\n              Spread 3/4 cup of the sauce in a 9-by-13-inch baking dish. Top with one-third of the noodles, overlapping them slightly. Cover with half of the kale mixture, then 2 more cups sauce. Sprinkle with one-third of the mozzarella mixture. Repeat the layers (noodles, kale mixture, sauce, mozzarella mixture). Top with a final layer of noodles, the remaining sauce and the remaining mozzarella mixture. Set on a baking sheet.\n            \n\n              Loosely cover with foil and bake 40 minutes, then uncover and bake until golden and bubbly, about 25 more minutes. Let stand 30 minutes before serving.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "diced chicken", "quantity": 1.5}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "pasta with tomato sauce", "quantity": 3.0}, {"food": "martha white foods", "quantity": 0.5}, {"food": "whole milk", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 3.0}, {"food": "parsley", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "lasagna", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "kale", "quantity": 2.0}, {"food": "eggs", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 2.0}, {"food": "parmesan cheese", "quantity": 0.75}, {"food": "parsley", "quantity": 0.25}, {"food": "pepper", "quantity": 1}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "macaroni cheese", "quantity": 2.0}], "title": "\nFour Cheese-Chicken Lasagna\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Halve the garlic crosswise to expose the cloves. Wrap the bottom half in foil and roast until very soft, about 20 minutes. Meanwhile, remove the skins from the top half and chop the garlic.\n            \n\n              Heat 2 tablespoons olive oil in a large Dutch oven or pot over medium heat. Add the onion and sliced fennel and cook, stirring occasionally, about 3 minutes. Add the chopped garlic and red pepper flakes and cook, stirring, until the garlic softens, about 2 more minutes. Add the tomato paste and 1 teaspoon salt. Cook, stirring, until the vegetables are tender, about 3 more minutes. Add the tomatoes and 4 cups water; stir. Increase the heat to medium high and bring to a boil, then reduce the heat to medium low and simmer until the sauce thickens slightly, about 30 minutes.\n            \n\n              Meanwhile, bring a large pot of salted water to a boil. Add the pasta and cook as the label directs. Drain, rinse under cold water and set aside.\n            \n\n              Pulse the focaccia in a food processor to make coarse crumbs. Squeeze the roasted garlic from its skin and add to the food processor along with 1/4 cup each parmesan and parsley; pulse a few more times until combined. Set the breadcrumbs aside.\n            \n\n              Lightly brush a 9-by-13-inch baking dish with olive oil. Add the pasta and sun-dried tomatoes to the sauce along with the fennel fronds, mozzarella, asiago and the remaining 1/4 cup each parmesan and parsley; toss. Transfer to the prepared baking dish. Top with spoonfuls of the ricotta and sprinkle with the breadcrumbs.\n            \n\n              Cover the dish loosely with foil and bake 30 minutes. Uncover and continue baking until golden and bubbling, about 15 more minutes. Let rest 10 minutes before serving.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "plum", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "focaccia", "quantity": 4.0}, {"food": "parmesan cheese", "quantity": 0.5}, {"food": "parsley", "quantity": 0.5}, {"food": "tomatoes", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 1.5}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "fennel seed", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "pasta with tomato sauce", "quantity": 2.0}], "title": "\nFour-Cheese Baked Pasta with Sun-Dried Tomatoes\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the pasta and cook until very al dente, about 8 minutes, adding the peas in the last 2 minutes of cooking.\n            \n\n              Meanwhile, whisk the eggs, egg white, evaporated milk and 1/2 teaspoon salt in a bowl.\n            \n\n              Drain the pasta and peas; wipe the pot dry and return the pasta and peas to the pot. Add the butter and stir to coat. Add the cheddar, mozzarella, fontina and the egg mixture. Place the pot over medium-low heat and cook, stirring constantly, until thickened, 8 to 10 minutes, adding the ham halfway through cooking (don't let the mixture boil or the eggs will scramble). Remove the pot from the heat and stir in the parmesan.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "", "quantity": 12.0}, {"food": "pigeon peas", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "milk", "quantity": 1.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "cheddar cheese", "quantity": 3.0}, {"food": "macaroni cheese", "quantity": 3.0}, {"food": "macaroni cheese", "quantity": 3.0}, {"food": "diced chicken", "quantity": 3.0}, {"food": "parmesan cheese", "quantity": 1.5}], "title": "\nFour-Cheese Pasta With Peas and Ham\n"}, {"directions": "\n\n              Position a rack in the upper third of the oven and preheat to 425 degrees F. Generously brush a large skillet with butter, then rub with the garlic. Combine the mozzarella, asiago and raclette in a bowl.\n            \n\n              Heat the skillet over medium-high heat. Add half of the potatoes, spreading them out. Sprinkle with 3/4 teaspoon salt, half of the cut-up butter, half of the shredded cheese blend, and pepper to taste. Arrange the remaining potatoes on top. Sprinkle with 3/4 teaspoon salt, and pepper to taste. Pour the cream over the potatoes, then add the nutmeg and bay leaves; simmer 3 minutes. Dot the potatoes with the remaining cut-up butter.\n            \n\n              Generously brush a shallow baking dish with butter; slide the potatoes into the dish; arrange with a fork, if desired. (If your skillet is ovenproof, you can skip this step and bake the potatoes in the skillet.)\n            \n\n              Sprinkle the potatoes with the parmesan and the remaining shredded cheese blend. Bake until golden, about 25 minutes. Let rest 5 minutes before serving. Discard the bay leaves.\n            \n\n              Photograph courtesy Anna Williams\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.5}, {"food": "garlic powder", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 0.3333333333333333}, {"food": "macaroni cheese", "quantity": 0.3333333333333333}, {"food": "macaroni cheese", "quantity": 0.3333333333333333}, {"food": "sweet potatoes", "quantity": 2.125}, {"food": "salt", "quantity": 1}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "nutmeg", "quantity": 0.25}, {"food": "chrysanthemum leaves", "quantity": 4.0}, {"food": "parmesan cheese", "quantity": 0.25}], "title": "\nFour-Cheese Scalloped Potatoes\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              For the crusts: Preheat the oven to 350 degrees F. Unroll 3 of the pie crusts on a lightly floured work surface. Stack them on top of each other. Roll out the thick, layered dough to a 15-by-21-inch rectangle. Press into a rimmed baking sheet so that the crust comes up the sides and hangs over slightly. This will be the bottom crust. Chill until ready to use, at least 30 minutes.\n            \n\n              Use the remaining crust for the top of the pie. Unroll it on a lightly floured work surface and roll it to a 14-by-18-inch rectangle. Cut the dough in half so you have two 7-by-9-inch pieces. One half will be the top crust for the apple portion of the pie. Cut the other half into 1-inch diagonal strips to use for the lattice on the cherry pie. Place the rectangle and strips on a parchment-lined baking sheet and chill until ready to use. \n            \n\n              For the apple pie: Toss the apples in a medium bowl with the sugar and lemon juice. Melt the butter in a large skillet over medium-high heat, add the apples and cook, stirring occasionally, until tender, about 10 minutes. Stir in the flour, cinnamon and a pinch of salt and cook until thickened, about 1 minute more. Cool completely. \n            \n\n              For the sour cherry pie: Place the cherries in a medium bowl. Whisk 1/4 cup cherry juice with the cornstarch in a small saucepan until completely smooth. Add the remaining cherry juice and sugar and bring to a boil over medium-high heat. Cook, whisking constantly, until thick and glossy, about 30 seconds. Pour the sauce over the cherries and gently fold to combine. Cool completely. \n            \n\n               For the pumpkin pie: Whisk together the pumpkin, evaporated milk, sugar, pumpkin pie spice and the egg and in a medium bowl until smooth. Set aside. \n            \n\n              For the pecan pie: Whisk together the brown sugar, corn syrup, butter, vanilla, eggs and a pinch of salt in a medium bowl until smooth. Fold in the pecans and set aside. \n            \n\n              Once all fillings are made, begin assembling the pie. Remove both baking sheets with dough from the refrigerator. \n            \n\n              Visualize the sheet pan is divided in half lengthwise and then crosswise so you have 4 equal quadrants. Each quadrant will hold a different pie filling. Prick the bottom crust all over with a fork.\n            \n\n              Add the pie fillings in this order: Add the apple pie filling to the upper left quadrant of the crust; spread it to cover a 7-by-9-inch rectangle. Moving counter clockwise, pour the pumpkin filling right under the apple pie filling and spread it the same size as the apple filling. Spread out the cherry filling next to the pumpkin filling. Fill the top right empty space with the pecan filling. \n            \n\n              Cover the apple pie quadrant with the reserved rectangle of dough. Lay the pie strips out diagonally over the cherry pie quadrant. Press any remaining strips of dough around the edge of the pie to thicken the rim. Crimp the edge of the pie, making sure to incorporate and crimp together the dough from the apple quadrant. Brush the edges and the dough on top of the pie with egg and sprinkle with turbinado sugar. Cut decorative slits in the apple pie crust. \n            \n\n              Bake until all pies are set and the crust on the apple pie and cherry pie is golden brown and crisp, 55 minutes to 1 hour 5 minutes. \n            \n", "ingredients": [{"food": "pie fillings", "quantity": 14.0}, {"food": "potato flour", "quantity": 1}, {"food": "egg substitute", "quantity": 1.0}, {"food": "sugar", "quantity": 0.25}, {"food": "mixed nuts", "quantity": 2.25}, {"food": "sugar", "quantity": 0.25}, {"food": "lemon juice", "quantity": 1.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "cinnamon", "quantity": 0.75}, {"food": "salt", "quantity": 1}, {"food": "grape juice", "quantity": 2.75}, {"food": "cornstarch", "quantity": 2.0}, {"food": "sugar", "quantity": 0.25}, {"food": "pumpkin flowers", "quantity": 1.3333333333333333}, {"food": "milk", "quantity": 0.6666666666666666}, {"food": "sugar", "quantity": 0.5}, {"food": "pumpkin pie spice", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "silk light vanilla", "quantity": 0.5}, {"food": "butter oil", "quantity": 4.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 0.75}], "title": "\nFour-Flavor Sheet Pan Pie\n"}, {"directions": "\n\n              Make the cake: Position a rack in the lower third of the oven and preheat to 350 degrees F. Butter four 9-inch-round pans and line the bottoms with parchment paper. Combine the granulated sugar and vegetable oil in a large bowl and beat with a mixer on medium-high speed until thick and creamy, about 3 minutes. Beat in the eggs, one at a time, then add the vanilla and beat on high speed until the batter is light and fluffy, about 2 minutes.\n            \n\n              Sift the flour, baking soda and salt into a medium bowl. With the mixer on low speed, beat the flour mixture into the sugar mixture in 3 additions, alternating with the buttermilk, beginning and ending with the flour mixture, until the batter is smooth, about 2 minutes. Tint with gel food coloring (see below).\n            \n\n              Divide the batter among the prepared pans and bake, 2 pans at a time, until a toothpick inserted into the centers comes out clean, about 15 minutes. Let cool 15 minutes in the pans, then invert onto racks to cool completely.\n            \n\n              Make the frosting: Beat the butter and salt in a large bowl with a mixer on medium speed until smooth and fluffy, about 2 minutes. Gradually beat in the confectioners' sugar until smooth. Add the vanilla, increase the mixer speed to medium high and beat until thick, 2 more minutes. Beat in the milk, a little at a time, until the frosting is spreadable.\n            \n\n              Assemble the cake: Spread about 1 1/2 cups frosting between the cake layers, then cover the outside of the cake with the remaining frosting and coat with toppings (see below).\n            \n\n              How to Color the Batter:\n            \n\n              Use gel food coloring for cakes: You don't need to add as much, and the colors are brighter.\n            \n\n              Solid: Tint the batter 1 color; divide among 4 pans.\n            \n\n              Striped: Divide the batter between 2 bowls; tint each one a different color. Divide each color between 2 pans.\n            \n\n              Ombre: Divide the batter among 4 bowls; tint in varying shades of the same color. Pour into 4 pans.\n            \n\n              Rainbow: Divide the batter among 4 bowls; tint each one a different color. Pour into 4 pans.\n            \n\n              The Toppings:\n            \n\n              Mini Marshmallows: You'll need about one 10 1/2-ounce bag. For a multicolored look, use fruit-flavored mini marshmallows.\n            \n\n              Chocolate Rocks: You'll need about 3 cups. Find them at specialty candy stores, or order online.\n            \n\n              Ombre Coconut: Divide one 7-ounce bag coconut among 3 resealable plastic bags. Add an increasing number of drops of the same food coloring to each bag and shake.\n            \n\n              Nonpareils: Use rainbow or single-color nonpareils; you'll need about 3/4 cup. Set your cake on a cake plate in the sink or on a large rimmed baking sheet to catch loose nonpareils.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1}, {"food": "sugar", "quantity": 2.25}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "eggs", "quantity": 4.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "potato flour", "quantity": 3.75}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "salt", "quantity": 0.5}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 1.5}, {"food": "", "quantity": 1}, {"food": "butter oil", "quantity": 8.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "sugar", "quantity": 10.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "milk", "quantity": 6.0}, {"food": "", "quantity": 1}], "title": "\nFour-Layer Birthday Cake\n"}, {"directions": "\n\n              1. Heat the butter in a medium saucepan over medium heat. Add the shallots, cumin and salt. Cook, stirring, until the shallots are tender, 2 to 3 minutes. Stir in the rice until the grains are well coated with the buttery shallot mixture.\n            \n\n              2. Add the broth, orange zest and cinnamon stick. Bring to a boil, cover and reduce the heat to medium-low. Cook until all the liquid has been absorbed and the rice is tender, about 15 minutes. Remove from the heat and let stand for 5 minutes. Fluff with a fork, discarding the zest and cinnamon stick. Transfer to a serving dish and sprinkle with the cashews and scallions.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 2.0}, {"food": "", "quantity": 1.3333333333333333}, {"food": "seeds", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "crisped rice bar", "quantity": 2.0}, {"food": "diced chicken", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "cinnamon", "quantity": 0.5}, {"food": "", "quantity": 0.3333333333333333}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}], "title": "\nFragrant Jasmine Rice Pilaf\n"}, {"directions": "\n\n              For the Frankenshake: Melt the chocolate chips in a small bowl in the microwave for 30 seconds. Stir, then heat until fully melted, about another 30 seconds.\n            \n\n              Tip a pint glass or beer stein on its side. Using a toothpick, skewer or clean paintbrush, draw a mouth and eyes on the inside of the glass with the melted chocolate. (Add a few stitches to resemble a Frankenstein face.) Stand the glass upright and brush chocolate on the rim of the glass and about a quarter of the way down the outside of the glass in a zig-zag pattern to resemble the hairline. Press the crushed chocolate wafer cookies on the chocolate on the outside of the glass to coat. Put 2 dollops of chocolate on the sides of the glass where the bolts will be, then stick 2 of the chocolate-covered caramels on top and press to adhere. Place the glass in the freezer until the chocolate has hardened, about 10 minutes or up to overnight.  \n            \n\n              For the Bride-of-Frankenshake: Melt the candy melts in a small bowl in the microwave for 30 seconds. Stir, then heat until fully melted, about another 30 seconds.\n            \n\n              Tip a pint glass or beer stein on its side. Using a toothpick, skewer or clean paintbrush, draw red lips. Draw eyes on the inside of the glass using the melted chocolate. Stand the glass upright and brush chocolate on the rim of the glass and about a quarter of the way down the outside of the glass to resemble the hairline. Press the crushed chocolate wafer cookies on the chocolate on the outside of the glass to coat. Put 2 dollops of chocolate on the sides of the glass where the bolts will be, then stick the remaining 2 chocolate-covered caramels on top and press to adhere. Place the glass in the freezer until the chocolate has hardened, about 10 minutes or up to overnight. \n            \n\n              Meanwhile, make the milkshakes. Blend the ice cream and milk in a blender until smooth. Pour half into the Bride-of-Frankenshake glass and chill in the freezer. Add the peppermint extract and green food coloring to the remaining milkshake in the blender and blend until just combined. Pour into the Frankenshake glass. Cover the top of each glass with the remaining crushed wafer cookies. Swirl the whipped cream on top of the Bride's glass. Serve immediately. \n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 3.0}, {"food": "chocolate chip cookies", "quantity": 20.0}, {"food": "", "quantity": 4.0}, {"food": "ruby red grapefruit juice blend", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "milk", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 0.25}, {"food": "", "quantity": 3.0}, {"food": "whipped cream substitute", "quantity": 1}], "title": "\nFrankenshake and Bride of Frankenshake\n"}, {"directions": "\n\n              Toast all the pine nuts in a dry skillet over medium-low heat, stirring, until evenly brown and fragrant, about 2 to 3 minutes. Cool. \n            \n\n              Pulse the 3/4 cup cool pine nuts and sugar in a food processor until finely ground, about 15 times. Add the flour, cornmeal, salt, and butter and pulse until combined, about 10 more times. Add the egg and pulse until mixture comes together in a soft dough, about 5 times. \n            \n\n              Lay out an 8 by 11-inch sheet of waxed or parchment paper. Divide dough equally into 6 balls and place on the paper, leaving at least 4 inches between each. Press down lightly to make even disks, and cover with another sheet of paper. With a rolling pin lightly roll over the entire sheet to make rounds about 5 inches in diameter. Slide paper onto a baking sheet and refrigerate for at least 1 hour or up to 3 days. \n            \n\n              Remove top sheet of paper and cut the parchment into 6 squares (around the dough circles). Place 2 heaping tablespoons of jam on each circle and spread it evenly with the back of a spoon over the crust, leaving a 1 1/2-inch border around the edges. Fold and loosely pleat the dough over the edge of the jam, to make a rustic free-form pie. (Use the edge of the parchment or a bench scraper to lift the edges of dough over; it's easier that way. See photo.) Repeat with the remaining disks.\n            \n\n              Whisk the egg yolk with a teaspoon of water and brush over the edges of the crusts with it. Sprinkle remaining pine nuts onto the egg wash. Refrigerate pies for 30 minutes. \n            \n\n              Position a rack in the middle of the oven and preheat to 375 degrees F. Bake pies until golden brown, about 30 minutes. Let set for 5 minutes before transferring with the paper onto a rack to cool. \n            \n\n              Serve warm or at room temperature, with ice cream, whipped cream or yogurt, if desired. \n            \n", "ingredients": [{"food": "pine nuts", "quantity": 0.75}, {"food": "sugar", "quantity": 0.25}, {"food": "potato flour", "quantity": 0.75}, {"food": "yellow rice", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 3.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "fruit cocktail", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}], "title": "\nFree-Form Fruit and Nut Pies\n"}, {"directions": "\n\n              Whisk together the coconut milk, curry powder, tomato paste, chile flakes, ginger, garlic, 1 teaspoon salt and several grinds black pepper in a large microwave-safe bowl. Add the peas and cauliflower and toss to coat. Cover the bowl with plastic wrap and microwave until the cauliflower is crisp-tender, about 4 minutes. Uncover and let cool to room temperature.\n            \n\n              Transfer the vegetables with the marinade to a large resealable plastic bag and add the chicken. Squeeze out most of the air and seal, then toss gently to coat the chicken with the marinade. Freeze until ready to use. Thaw in the refrigerator for at least 24 hours before cooking. \n            \n\n              Pour the chicken, vegetables and marinade into a large skillet and heat over high heat. Cook. stirring often, until the chicken is cooked through, about 12 minutes. Season with salt and pepper.\n            \n\n              Divide the chicken and vegetables among 4 plates. Serve each with naan and garnish with cilantro leaves and yogurt.\n            \n", "ingredients": [{"food": "coconut milk", "quantity": 15.0}, {"food": "curry powder", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.75}, {"food": "ginger", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "pigeon peas", "quantity": 10.0}, {"food": "cauliflower", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.25}, {"food": "", "quantity": 4.0}, {"food": "silk plain soy yogurt", "quantity": 1}], "title": "\nFreezer Bag Chicken Curry Stir-Fry\n"}, {"directions": "\n\n              Whisk together the oil, chili powder, cumin, 1 teaspoon salt and several grinds black pepper in a large microwave-safe bowl. Add the garlic, peppers and onion and toss to coat. Cover with plastic wrap and microwave until the vegetables are crisp-tender, about 2 minutes. Remove the plastic wrap and let cool completely.\n            \n\n              Transfer the vegetables with the marinade to a large resealable plastic bag and add the chicken. Squeeze out most of the air and seal, then toss gently to coat the chicken with the marinade. Freeze until ready to use. Let thaw in the refrigerator for at least 24 hours before cooking. \n            \n\n              Pour the chicken, vegetables and marinade into a large skillet and heat over high heat. Cook, stirring often, until the chicken is cooked through, about 12 minutes. Season with salt and pepper.\n            \n\n              Divide the chicken and vegetables among 4 plates. Serve with 3 tortillas each and the guacamole, salsa, sour cream and lime wedges on the side.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.25}, {"food": "chili powder", "quantity": 2.0}, {"food": "cumin seed", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "garlic powder", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "pepper", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.25}, {"food": "potato flour", "quantity": 12.0}, {"food": "sour cream", "quantity": 1}], "title": "\nFreezer Bag Chicken Fajita Stir-Fry\n"}, {"directions": "\n\n              Whisk together the butter, mustard, garlic, 1 teaspoon salt and several grinds black pepper in a large microwave-safe bowl. Add the green beans, tomatoes and peppers and toss to coat. Cover with plastic wrap and microwave until the green beans are crisp-tender and still bright green, about 2 minutes. Remove the plastic wrap and let cool completely.\n            \n\n              Transfer the vegetables with the marinade to a large resealable plastic bag and add the chicken. Squeeze out most of the air and seal, then toss gently to coat the chicken with the marinade. Freeze until ready to use. Let thaw in the refrigerator for at least 24 hours before cooking\n            \n\n              Pour the chicken, vegetables and marinade into a large skillet and heat over high heat. Cook, stirring often, until the chicken is cooked through, about 12 minutes. Season with salt and pepper.\n            \n\n              Divide the chicken and vegetables among 4 plates. Sprinkle with the parsley and Parmesan and serve with a piece of baguette.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 4.0}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "fava beans", "quantity": 12.0}, {"food": "grape juice", "quantity": 6.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.25}, {"food": "parsley", "quantity": 1}, {"food": "", "quantity": 1.0}], "title": "\nFreezer Bag Chicken Primavera Stir-Fry\n"}, {"directions": "\n\n              Whisk together the orange juice, soy sauce, honey, cornstarch, sesame oil, ginger, 1 teaspoon salt and several grinds black pepper in a large microwave-safe bowl. Add the broccoli and toss to coat. Cover with plastic wrap and microwave until the broccoli is crisp-tender and still bright green, about 4 minutes. Remove the plastic wrap and let cool completely.\n            \n\n              Transfer the broccoli with the marinade to a large resealable plastic bag and add the chicken. Squeeze out most of the air and seal, then toss gently to coat the chicken with the marinade. Freeze until ready to use. Thaw in the refrigerator for at least 24 hours before cooking. \n            \n\n              Pour the chicken, broccoli and marinade into a large skillet and heat over high heat. Cook, stirring often, until the chicken is cooked through, about 12 minutes. Season with salt and pepper.\n            \n\n              Divide the chicken and broccoli among 4 plates. Serve with rice and garnish with scallions and sesame seeds.\n            \n", "ingredients": [{"food": "orange juice", "quantity": 0.5}, {"food": "soy sauce", "quantity": 0.5}, {"food": "honey smoked ham", "quantity": 0.25}, {"food": "cornstarch", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "ginger", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "broccoli raab", "quantity": 6.0}, {"food": "diced chicken", "quantity": 1.25}, {"food": "sesame seeds", "quantity": 1}], "title": "\nFreezer Bag Chicken and Broccoli Stir-Fry\n"}, {"directions": "\n\n              For the muffins: Line a 12-cup muffin tin with foil muffin cup liners. \n            \n\n              Toss the berries with 2 tablespoons of the flour in a small bowl. Whisk the remaining flour, granulated sugar, baking powder and salt in a large bowl. Beat the eggs in a medium bowl until frothy, and then whisk in the milk, melted butter and vanilla. Make a well in the dry ingredients and pour the wet ingredients into the well. Stir the batter with a rubber spatula until just combined. \n            \n\n              For the topping: Combine the flour and brown sugar in a medium bowl. Either using a fork or your fingers, mix in the butter to form large and medium crumbs.\n            \n\n              Scoop the batter into the muffin cups, filling just above three-quarters full. Divide the blueberries among the cups. Divide the topping among the muffins, pressing lightly. Freeze until set, about 3 hours. The muffins can be removed to zippered freezer bags at this point and stored for up to 2 months. \n            \n\n              When ready to bake, preheat the oven to 325 degrees F. Place the muffins in a muffin tin or directly on a baking sheet and bake until they are lightly golden and a tester inserted in the center comes out clean, 35 to 40 minutes. \n            \n\n              These muffins can also be baked immediately. Preheat the oven to 350 degrees F, and bake until lightly golden and a tester inserted in the center comes out clean, 20 to 25 minutes.\n            \n", "ingredients": [{"food": "blueberries", "quantity": 0.75}, {"food": "potato flour", "quantity": 1.75}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "salt", "quantity": 0.5}, {"food": "eggs", "quantity": 2.0}, {"food": "milk", "quantity": 1.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "potato flour", "quantity": 0.5}, {"food": "sugar", "quantity": 0.5}, {"food": "butter oil", "quantity": 4.0}], "title": "\nFreezer to Oven Berry Muffins\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Position a rack in the middle of the oven and preheat oven to 350 degrees F. Line a baking sheet with a silicone baking mat or parchment.\n            \n\n              Pulse the nuts in a food processor to finely chop, allowing some larger pieces of nuts to remain. In a large bowl, combine butter, almonds, flour, sugar, salt and cinnamon. In a small bowl, beat egg yolks with 1 tablespoon of the milk. Add the extract. Drizzle yolk mixture over almond mixture and toss with fingers to combine and get everything moistened. (If needed add up to 1 more tablespoon of milk.) Mixture should still be crumbly, but not dry, like a crisp topping.\n            \n\n              Sprinkle 1 cup (about half of the crumbs) on the prepared baking sheet and press lightly to create a thin, even 8-inch round. Sprinkle remaining crumbs over the top to give the cookie some texture. Bake until golden brown and crisp, rotating baking sheet halfway through baking, about 30 minutes. For an extra crispy cookie, turn oven off at this point and let the pan rest in oven for 10 minutes.\n            \n\n              Cool on a rack until easy to handle. Slip the fregolata on the paper onto a rack to cool completely. When cool, sift confectioners' sugar over top.\n            \n\n              To serve, place a whole almond or overturned demitasse spoon under the center of the fregolata and rap the top with a spoon or the side of a knife to crack into serving pieces.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.0}, {"food": "whole milk", "quantity": 0.6666666666666666}, {"food": "potato flour", "quantity": 0.6666666666666666}, {"food": "sugar", "quantity": 0.5}, {"food": "salt", "quantity": 0.25}, {"food": "cinnamon", "quantity": 0.25}, {"food": "egg substitute", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "whole milk", "quantity": 1.0}, {"food": "sugar", "quantity": 1}], "title": "\nFregolata: Crumb Cookie (Italy)\n"}, {"directions": "\n\n              Shake 2 ounces gin, 1 tablespoon lemon juice and 1 teaspoon superfine sugar in a cocktail shaker with ice. Strain into a coupe glass; top with champagne. Garnish with a lemon twist.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [], "title": "\nFrench 75\n"}, {"directions": "\n\n              In a cocktail shaker, combine 1 ounce gin, 1/4 ounce lemon juice and 1 teaspoon confectioners' sugar. Shake with ice for 30 seconds, then strain into a chilled flute; top with sparkling wine.\n            \n", "ingredients": [], "title": "\nFrench 75\n"}, {"directions": "\nSpecial equipment: Candy thermometer\n\n              Place the whole eggs and yolks in the bowl of an electric mixer fitted with a whisk attachment. Beat on medium-high speed until the eggs are pale yellow and thick, about 5 minutes. (The eggs will hold an indent made with your finger for a few seconds.)\n            \n\n              Meanwhile, pour the sugar and 1/3 cup water in a medium saucepan set over medium heat. Attach a candy thermometer to the side of the pan and bring to the soft-ball stage, without stirring, 240 degrees F.\n            \n\n              Begin whipping the eggs again on medium-high speed and slowly drizzle in the hot syrup, aiming the syrup between the side of the bowl and the beaters. Continue to whip until both the bottom of the bowl and the mixture are cool, 10 to 15 minutes. The mixture should be thick, but will not form a peak at this point. Beat in the salt.\n            \n\n              While still beating on medium-high, add the butter, a few pieces at a time. As the butter is added, the buttercream may appear to thin out some, but it will thicken into firm peaks once all of the butter is added. Beat in the vanilla extract.\n            \n\n              Use right away or refrigerate in an airtight container overnight. The buttercream may need to be beaten again to smooth out before using.\n            \n", "ingredients": [{"food": "egg substitute", "quantity": 2.0}, {"food": "sugar", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 12.0}, {"food": "vanilla extract", "quantity": 1.0}], "title": "\nFrench Buttercream\n"}, {"directions": "\n\n              Pulse the scallions, thyme, garlic, 1 teaspoon each salt and pepper, the celery seeds and allspice in a food processor to make a paste. Pierce the roast all over with a paring knife; rub the spice paste into the meat. Tie the roast with kitchen twine so it keeps its shape.\n            \n\n              Spread the carrots in a 6-quart slow cooker and set the roast on top. Insert an instant-read thermometer at an angle into the center of the roast; position the thermometer so it can be easily read through the lid of the slow cooker.\n            \n\n              Combine 1 1/2 cups water, the Worcestershire sauce and bouillon cube in a microwave-safe bowl; microwave until hot, 2 to 4 minutes. Add to the slow cooker. Cover and cook on low until the meat registers 120 to 130 degrees F for medium rare, about 2 hours. Transfer the meat to a cutting board and cover with foil; let rest 15 minutes. Skim off the excess fat from the cooking liquid.\n            \n\n              Remove the twine and slice the meat very thinly. Spoon some cooking liquid onto the cut sides of each roll; sandwich with the meat, horseradish and/or mustard. Serve with more cooking liquid for dipping.\n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [{"food": "silk light vanilla", "quantity": 3.0}, {"food": "thyme", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "celery seed", "quantity": 0.25}, {"food": "allspice", "quantity": 0.25}, {"food": "roast beef", "quantity": 1.0}, {"food": "carrots", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "frankfurter beef", "quantity": 1.0}, {"food": "pizza rolls", "quantity": 6.0}, {"food": "spicy black bean enchilada", "quantity": 1}], "title": "\nFrench Dip Sandwiches\n"}, {"directions": "\n\n              Melt 1 tablespoon butter in a large nonstick skillet over medium-high heat. Add the onion and 1/4 teaspoon salt; cook, stirring, until golden brown, about 10 minutes. Transfer to a bowl; reserve the skillet.\n            \n\n              Meanwhile, make the dip: Bring the beef broth and nutmeg to a simmer in a small saucepan; remove from the heat and add the horseradish and 1/2 tablespoon butter. Cover and keep warm.\n            \n\n              Layer half of the cheese, then the roast beef, onion and the remaining cheese on the rolls. Melt 1 tablespoon butter in the skillet over medium heat. Add 2 sandwiches and top with a heavy skillet. Cook, pressing down on the top skillet to flatten the sandwiches, until the bread is golden brown and the cheese melts, about 4 minutes per side. Repeat with the remaining 1 tablespoon butter and 2 sandwiches. Serve with the dip.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [{"food": "butter oil", "quantity": 3.5}, {"food": "onion powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "frankfurter beef", "quantity": 1.5}, {"food": "nutmeg", "quantity": 0.25}, {"food": "horseradish", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "roast beef", "quantity": 0.75}, {"food": "pizza rolls", "quantity": 4.0}], "title": "\nFrench Dip Sandwiches\n"}, {"directions": "\n\n              Make the onion spread: Heat the vegetable oil in a large skillet over medium-low heat. Add the onion and a pinch of salt; cover and cook, stirring, until golden, about 35 minutes. Add the shallots and scallion whites; cover and cook, stirring, until browned, about 25 more minutes. Stir in the scallion greens, then remove from the heat and let cool.\n            \n\n              Chop the onion mixture and transfer to a bowl. Add the sour cream, mayonnaise, vinegar, Worcestershire sauce and 1 teaspoon salt. Cover and refrigerate at least 2 hours and up to 1 day.\n            \n\n              Make the beef for the sandwiches: Mince the garlic, then sprinkle with 1 teaspoon salt and mash into a paste with the flat side of a large knife. Transfer to a bowl; add the olive oil, celery salt, cayenne and 1/2 teaspoon black pepper. Cut small slits all over the beef with a knife, then use your fingers to push the garlic paste into the slits. Cover; refrigerate at least 1 hour or overnight.\n            \n\n              Preheat the oven to 425 degrees F. Bring the beef to room temperature. Sprinkle with 2 teaspoons salt and 1/2 teaspoon pepper. Place on a rack in a roasting pan; add 1 cup broth, 3/4 cup water, the celery, onion and parsley to the pan. Roast 10 minutes, then reduce the oven temperature to 350 degrees F and roast until a thermometer inserted into the center of the beef registers 115 degrees F, about 45 more minutes. Transfer to a cutting board; let rest 20 minutes. Strain the pan juices; reserve.\n            \n\n              Meanwhile, make the jus: Melt the butter in a medium saucepan over medium heat. Add the flour and cook, stirring, 1 minute. Whisk in the reserved pan juices and the remaining 3 cups broth and bring to a boil, whisking. Remove the pan from the heat and stir in the sherry.\n            \n\n              Brush the rolls with some of the onion spread. Thinly slice the beef against the grain. Dunk the slices in the jus, then layer on the rolls. Serve the remaining jus in small bowls for dipping.\n            \n\n              Photograph by Jonny Valiant\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 6.0}, {"food": "turnip greens", "quantity": 2.0}, {"food": "sour cream", "quantity": 1.5}, {"food": "mayonnaise dressing", "quantity": 1.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "garlic powder", "quantity": 6.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "celery seed", "quantity": 0.5}, {"food": "hearts of palm", "quantity": 1}, {"food": "black bean mango", "quantity": 1}, {"food": "roast beef", "quantity": 1.0}, {"food": "frankfurter beef", "quantity": 4.0}, {"food": "celery seed", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "parsley", "quantity": 3.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "pizza rolls", "quantity": 6.0}], "title": "\nFrench Dip Sandwiches\n"}, {"directions": "\n\n              Bake the french fries as the label directs until crisp. Let cool.\n            \n\n              Meanwhile, heat a large skillet over medium heat. Add the bacon and cook until crisp, about 4 minutes per side; transfer to a paper towel-lined plate. Cool slightly, then break the bacon into pieces. Make the dressing: Whisk the mustard, pickle, pickle juice, ketchup, mayonnaise, vinegar, sugar and 2 tablespoons water in a large bowl. Add 1/4 teaspoon salt, and pepper to taste. Add the french fries, bacon, tomatoes, red onion, romaine and cheddar cheese to the bowl with the dressing and toss to combine. Season with salt and pepper. Divide the salad among bowls. Sprinkle with sesame seeds, if desired.\n            \n\n               Photograph by Charles Masters\n            \n", "ingredients": [{"food": "french toast", "quantity": 3.0}, {"food": "bacon", "quantity": 4.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "pickle loaf", "quantity": 3.0}, {"food": "", "quantity": 1.5}, {"food": "mayonnaise dressing", "quantity": 3.0}, {"food": "vinegar", "quantity": 1.5}, {"food": "sugar", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "grape juice", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.25}, {"food": "hearts of palm", "quantity": 2.0}, {"food": "cheddar cheese", "quantity": 0.25}, {"food": "sesame seeds", "quantity": 1}], "title": "\nFrench Fry Deluxe Salad\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Make the franks: Whisk the flour, cornmeal, sugar and paprika in a large bowl. Add the egg and milk and whisk to make a thick batter, adding more milk if the mixture is too dry. Add 1/4 teaspoon salt, and pepper to taste.\n            \n\n              Heat about 2 inches vegetable oil in a large pot over medium-high heat until a deep-fry thermometer registers 375 degrees F. Dip the franks in the batter, then carefully wrap a long curly fry around each. (If desired, thread the franks on wooden skewers before wrapping with fries.)\n            \n\n              Working in batches, fry the franks in the hot oil, turning, until golden on all sides, 3 to 4 minutes. Remove with a slotted spoon and drain on paper towels; sprinkle with salt.\n            \n\n              Meanwhile, make the dip: Whisk the Sriracha, lime juice and mayonnaise in a bowl. Serve with the franks.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [{"food": "potato flour", "quantity": 0.5}, {"food": "cornmeal", "quantity": 0.3333333333333333}, {"food": "sugar", "quantity": 1.0}, {"food": "paprika", "quantity": 0.25}, {"food": "egg substitute", "quantity": 1.0}, {"food": "milk", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1}, {"food": "low fat big franks", "quantity": 18.0}, {"food": "french toast", "quantity": 5.0}, {"food": "Worcestershire sauce", "quantity": 1.5}, {"food": "mayonnaise dressing", "quantity": 0.25}], "title": "\nFrench Fry Franks\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Spread the french fries on a baking sheet and bake until golden and warmed through, about 10 minutes.\n            \n\n              Put the garlic, almonds and olive oil in a food processor and pulse until finely ground. Add the french fries, lemon juice, 1 1/4 cups water and 1/2 teaspoon salt and pulse until almost smooth. Season with salt and pepper. Transfer to a bowl and drizzle with olive oil. Serve with pita chips and/or vegetables.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [{"food": "french toast", "quantity": 4.0}, {"food": "garlic powder", "quantity": 6.0}, {"food": "almonds", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 0.75}, {"food": "lemon juice", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1}], "title": "\nFrench Fry Skordalia\n"}, {"directions": "\n\n              Put a rimmed baking sheet in the lower third of the oven and preheat to 425 degrees F. Toss the potatoes and shallots with 2 tablespoons olive oil, 1/4 teaspoon salt and a few grinds of pepper. Spread on the hot baking sheet and roast, tossing halfway through, until tender and golden, 25 to 30 minutes. Let cool.\n            \n\n              Meanwhile, bring a medium saucepan of salted water to a boil. Add the snap peas and cook until bright green but still crisp, 1 to 2 minutes. Transfer to a bowl of ice water; let cool. Drain and pat dry.\n            \n\n              Whisk the vinegar, mustard, honey, 1/2 teaspoon salt and a few grinds of pepper in a large bowl. Slowly whisk in the remaining 1/4 cup olive oil. Add the roasted potatoes and shallots, peas, tomatoes, cucumbers, radishes, parsley, chives and tarragon. Season with salt and pepper and toss.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 1.5}, {"food": "pineapple chunks", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "sugar", "quantity": 1.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "honey smoked ham", "quantity": 1.0}, {"food": "silk black cherry soy yogurt", "quantity": 1.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "parsley", "quantity": 0.5}, {"food": "chives", "quantity": 0.25}, {"food": "", "quantity": 2.0}], "title": "\nFrench Garden Potato Salad\n"}, {"directions": "\n\n              Heat the butter and oil in a medium skillet over medium heat. Add the onions, thyme, 1/2 teaspoon salt and a few grinds of pepper, and cook, stirring occasionally, until the onions are very soft and caramelized, about 15 minutes. Raise the heat a little, and cook to develop a more golden color, about 5 minutes more. Transfer the onions to a small bowl to cool completely.\n            \n\n              Preheat the oven to 350 degrees F. Line a baking sheet with parchment paper.\n            \n\n              Cut each slice of ham into 3 strips about 2 inches by 5 inches. Cut the Brie into 24 pieces about 1/4 inch by 1 inch. On each strip of ham, place 1/4 teaspoon of the caramelized onions and 1 piece of Brie, and roll up tightly.\n            \n\n              Open the tube of dough, and separate it into 8 triangles at the perforations. Cut each triangle into 3 long, thin triangles (for 24 pieces total). Lay 1 ham roll centered on the tip end of a triangle, roll until you reach the flat end and place, seam-side down, on the prepared baking sheet. Repeat with the remaining triangles and ham rolls. Top each finished roll with a dab (about 1/8 teaspoon) of the remaining onions. Bake until the dough is golden brown and cooked through, 25 to 30 minutes. Serve warm with Dijon mustard on the side.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "thyme", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "ham", "quantity": 9.0}, {"food": "", "quantity": 3.0}, {"food": "smoked turkey roll", "quantity": 8.0}, {"food": "mustard spinach", "quantity": 1}], "title": "\nFrench Ham-and-Brie Pigs in Blankets\n"}, {"directions": "\n\n              Cook 1 cup French lentils in salted simmering water until tender, about 25 minutes, adding 1/2 pound chopped haricots verts during the last minute of cooking; drain and let cool. Whisk 3 tablespoons white wine vinegar and 1 tablespoon each minced shallot, Dijon mustard and chopped thyme in a large bowl; whisk in 1/3 cup olive oil. Add the lentils, haricots verts, 8 sliced radishes, 3 slices thick-cut bacon (chopped and cooked), 2 cups torn frisee and 1/2 cup pitted nicoise olives. Season with salt and pepper and toss.\n            \n\n              Photograph by Bobbi Lin\n            \n", "ingredients": [], "title": "\nFrench Lentil Salad\n"}, {"directions": "\nSpecial equipment: Oven with convection setting, 4 baking sheets, 3 silicone baking mats, Fine-mesh sieve, Pastry bag with 1/4-inch round tip\n\n              Preheat the oven to 300 degrees F using the convection setting. Line 3 baking sheets with silicone mats. Measure the confectioners' sugar and almond flour by spooning them into measuring cups and leveling with a knife. Transfer to a bowl; whisk to combine.\n            \n\n              Sift the sugar-almond flour mixture, a little at a time, through a fine-mesh sieve into a large bowl, pressing with a rubber spatula to pass through as much as possible. It will take a while, and up to 2 tablespoons of coarse almond flour may be left; just toss it.\n            \n\n              Beat the egg whites, cream of tartar and salt with a mixer on medium speed until frothy. Increase the speed to medium high; gradually add the superfine sugar and beat until stiff and shiny, about 5 more minutes.\n            \n\n              Transfer the beaten egg whites to the bowl with the almond flour mixture. Draw a rubber spatula halfway through the mixture and fold until incorporated, giving the bowl a quarter turn with each fold.\n            \n\n              Add the food coloring and extract (see below). Continue folding and turning, scraping down the bowl, until the batter is smooth and falls off the spatula in a thin flat ribbon, 2 to 3 minutes.\n            \n\n              Transfer the batter to a pastry bag fitted with a 1/4-inch round tip. Holding the bag vertically and close to the baking sheet, pipe 1 1/4-inch circles (24 per sheet). Firmly tap the baking sheets twice against the counter to release any air bubbles.\n            \n\n              Let the cookies sit at room temperature until the tops are no longer sticky to the touch, 15 minutes to 1 hour, depending on the humidity. Slip another baking sheet under the first batch (a double baking sheet protects the cookies from the heat).\n            \n\n              Bake the first batch until the cookies are shiny and rise 1/8 inch to form a \"foot,\" about 20 minutes. Transfer to a rack to cool completely. Repeat, using a double sheet for each batch. Peel the cookies off the mats and sandwich with a thin layer of filling (see below).\n            \n\n              Almond-Raspberry:\n            \n\n              Tint the batter with 2 drops neon pink gel food coloring; flavor with almond extract. Fill with seedless raspberry jam (you'll need about 3/4 cup).\n            \n\n              Mint-White Chocolate:\n            \n\n              Tint the batter with 2 drops mint green gel food coloring; flavor with mint extract. For the filling, microwave 3 ounces chopped white chocolate, 2 tablespoons heavy cream and 1 tablespoon butter in 30-second intervals, stirring, until smooth. Stir in 1/4 teaspoon mint extract and 1 drop mint green gel food coloring.\n            \n\n              Blueberry Cheesecake:\n            \n\n              Tint the batter with 3 drops royal blue gel food coloring; flavor with vanilla extract. For the filling, mix 4 ounces softened cream cheese and 3 tablespoons blueberry jam.\n            \n\n              Lavender-Honey:\n            \n\n              Tint the batter with 2 drops violet gel food coloring; flavor with almond or vanilla extract. For the filling, mix 3/4 cup mascarpone cheese, 2 tablespoons honey and 1 teaspoon ground dried lavender.\n            \n\n              Pineapple:\n            \n\n              Tint the batter with 2 drops lemon yellow gel food coloring; flavor with vanilla extract. For the filling, press 3/4 cup pineapple jam through a sieve, discarding any large pieces.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "sugar", "quantity": 1.75}, {"food": "potato flour", "quantity": 1.0}, {"food": "egg substitute", "quantity": 3.0}, {"food": "ice cream swich", "quantity": 0.25}, {"food": "hearts of palm", "quantity": 1}, {"food": "sugar", "quantity": 0.25}, {"food": "", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "pie fillings", "quantity": 1}], "title": "\nFrench Macaroons\n"}, {"directions": "\n\n              Combine the eggs, milk, salt, and pepper in a medium bowl and mix very well with a fork or a whisk.\n            \n\n              Set a plate by the stove. Heat a small (about 6 inches) seasoned omelet pan or non-stick skillet over medium-high heat. When the pan is warm, add the butter (it should sizzle gently). Swirl the pan to distribute the butter as it melts. When the butter stops sizzling and the foam subsides add the eggs. Pause to let the eggs heat slightly and then stir vigorously, with a heatproof spatula, making sure you include the sides of the egg mixture occasionally so the omelet cooks evenly. Once the eggs are just set, bang the pan gently on the burner to release the omelet from the pan. Check to see that it is not sticking to the sides or bottom of the pan, if so release the omelet with a heat proof spatula. Hold the pan at a 45-degree angle to the stove and carefully fold the omelet like a business letter. Cook just until the desired degree of doneness lifting the pan or reducing the heat to prevent browning. (A classic omelet doesn't have any browning on it.) Transfer to a warm plate and serve.\n            \n\n              Omelet Filling Suggestions: There are many omelet fillings, both raw and cooked, sweet and savory. Here is a starting point, but feel free to improvise. Once the eggs are set add any of these ingredients before folding. An alternative method, to use with delicate fillings, like creme fraiche and herbs, fresh fruits or caviar; is it to roll the omelet and then slice the top open, as you would a baked potato, and then fill it.\n            \n\n              - 1 tablespoon finely chopped fresh herbs, like Italian parsley, basil, dill, tarragon, chives, thyme, and chervil. Use the herbs alone or in combination, like the classic combination fine herbs (equal parts parsley, chervil, chives and tarragon.) Brush the finished omelet with butter and sprinkle with additional herbs. Herbs can also be added to the omelet mixture to flavor the eggs more fully. \n            \n\n              - 2 to 3 tablespoons cooked vegetables like, chopped asparagus, spinach or other greens, zucchini, mushrooms, eggplant or peppers \n            \n\n              - 2 tablespoons diced fresh tomato or avocado \n            \n\n               - 2 tablespoons grated cheese, like Gruyere, Goat cheese, Cheddar, Monterey Jack, Gouda, Feta \n            \n\n               - 1 tablespoon currant jelly, then dust omelet with confectioner's sugar \n            \n\n              - 2 tablespoons chopped proscuitto or other ham, crumbled cooked bacon or other cured meat \n            \n\n              - 1 to 2 tablespoons chopped smoked salmon or trout, with a tablespoon sour cream, cream cheese or creme fraiche \n            \n\n              - 1 tablespoon honey with 1 tablespoon ricotta cheese \n            \n\n              - 2 to 3 tablespoons sliced apples, pears or strawberries, alone or with a complimentary cheese\n            \n", "ingredients": [{"food": "eggs", "quantity": 2.0}, {"food": "milk", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "butter oil", "quantity": 1.0}, {"food": "", "quantity": 1}], "title": "\nFrench Omelet\n"}, {"directions": "\n\n              Heat the olive oil in a large skillet over medium-high heat. Add the onion and cook, stirring, until it starts to brown, 3 to 4 minutes. Add the sugar and 1/2 teaspoon salt, reduce the heat to medium low and cook, stirring occasionally, until deep golden, 15 more minutes. Add the chicken broth and 1 teaspoon Worcestershire sauce and simmer until the onion is tender and the liquid is almost evaporated, 8 minutes.\n            \n\n              Preheat the broiler. Mix the beef, onion powder and the remaining 2 tablespoons Worcestershire sauce in a bowl with your hands. Form into four 3/4-inch-thick patties and place on a broiler pan. Make an indentation in the center of each with your thumb; season the patties with salt. Broil, turning once, 5 minutes.\n            \n\n              Place the buns cut-side up on a baking sheet. Sprinkle with both cheeses and broil until melted, about 1 minute. Spread mustard on the buns; sandwich with lettuce, the burgers and caramelized onion. Serve with potato chips.\n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 0.5}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "frankfurter beef", "quantity": 1.5}, {"food": "onion powder", "quantity": 1.0}, {"food": "split pea soup", "quantity": 4.0}, {"food": "macaroni cheese", "quantity": 2.0}, {"food": "parmesan cheese", "quantity": 2.0}, {"food": "potato chips", "quantity": 1}], "title": "\nFrench Onion Burgers\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Heat the oil over medium heat in a large skillet. Add the onions and thyme and cook, stirring occasionally, until onions are very soft and browned, about 15 minutes.\n            \n\n              Meanwhile, stir together the sour cream, mayonnaise and Worcestershire sauce; season with salt and pepper. Fold in the onion mixture until well combined. Cover and chill for at least 1 hour or up to overnight. Mixture can be stored in an airtight container for up to 3 days.\n            \n\n              Arrange the bread in an even layer on a baking sheet. Sprinkle each slice with about 1 tablespoon cheese. Bake until the bread is golden brown and crisp and the cheese is melted, 6 to 8 minutes. Serve dip with the cheese toasts and endive leaves.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "sour cream", "quantity": 1.25}, {"food": "mayonnaise dressing", "quantity": 0.5}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "luncheon slices", "quantity": 1.25}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}], "title": "\nFrench Onion Dip with Gruyere Toasts\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: four 12-ounce soup crocks\n\n              For the soup: Melt the butter in a large Dutch oven or pot over medium heat. Add half of the onions and season with 1/4 teaspoon salt and a few grinds of pepper. Top with the remaining onions and season with 1/4 teaspoon salt and a few more grinds of pepper. Add the bay leaves and thyme. Cook, stirring occasionally, until all of the liquid evaporates the onions are very soft and just begin to turn golden, 45 minutes to 1 hour.\n            \n\n              Add the white wine, bring to a simmer and cook, stirring, until almost completely evaporated, about 6 minutes. Pour in the beef broth and 1 cup water, bring to a high simmer and cook until the soup has reduced to 5 cups, 30 to 40 minutes. Season with salt and a few grinds of pepper. Remove the bay leaves and thyme. Either keep warm on a low burner or cool completely, refrigerate and reheat later. (The soup can be made and refrigerated up to 2 days in advance or frozen for up to 1 month).\n            \n\n              For the mac 'n' cheese: Bring a medium pot of water to a boil, add the macaroni and cook according to package instructions. Drain, reserving 1/2 cup of the cooking liquid.\n            \n\n              Melt the butter in a medium saucepan over medium heat. Whisk in the flour until smooth, about 2 minutes. Gradually whisk in the milk and reserved pasta water and stir until thick, about 4 minutes. Stir in 1 cup each of the cheeses, 1/2 teaspoon salt and a few grinds of pepper; stir until melted and smooth. Remove from the heat and stir in the cooked pasta until coated. Let cool slightly, stirring frequently.\n            \n\n              Preheat the oven to broil. Place the soup crocks on a rimmed baking sheet and divide the hot soup among the crocks, filling about three-quarters of the way. Top each with a quarter of the mac 'n' cheese (some will sink into the soup, which is fine). Evenly sprinkle with the remaining cheeses and the panko. Broil until the cheese is melted and golden brown in spots, 2 to 3 minutes (the soup will bubble and some may spill out). Serve hot.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 4.5}, {"food": "onions", "quantity": 4.0}, {"food": "black bean mango", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "thyme", "quantity": 2.0}, {"food": "martha white foods", "quantity": 1.0}, {"food": "frankfurter beef", "quantity": 4.0}, {"food": "", "quantity": 4.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "milk", "quantity": 0.75}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 1.75}, {"food": "yellow rice", "quantity": 1.75}, {"food": "", "quantity": 2.0}], "title": "\nFrench Onion Macaroni and Cheese Soup\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 350 degrees F.\n            \n\n              Melt 3 tablespoons butter in a large skillet over medium-high heat. Add the onions and sprinkle with 1 teaspoon salt and 1/2 teaspoon pepper and cook, stirring occasionally, until the onions are very soft and just begin to brown, about 20 minutes. Add 1 tablespoon thyme and cook for an additional minute. Set aside.\n            \n\n              Meanwhile, bring a large pot of salted water to a boil. Cook the noodles according to the package directions. Reserve 1/2 cup of the pasta water. Drain the noodles and return them to the pot.\n            \n\n              While the noodles are still warm, add the cooked onions, sour cream, cream cheese, reserved pasta water and 1/2 cup Gruyere. Stir until the sauce is smooth and creamy and coats the noodles. Fold in the chicken. Season with salt and pepper. Transfer to a 2-quart baking dish.\n            \n\n              Microwave the remaining 5 tablespoons butter in a medium microwave-safe bowl until melted. Add the fried onions, breadcrumbs, remaining 1/2 cup Gruyere and 1 tablespoon thyme to the butter and toss until the breadcrumbs are coated. Sprinkle the buttered breadcrumb mixture evenly over the noodles to cover completely.\n            \n\n              Bake until the topping is golden brown, 35 to 40 minutes.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 8.0}, {"food": "onions", "quantity": 3.0}, {"food": "black bean mango", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "egg substitute", "quantity": 6.0}, {"food": "sour cream", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "fried chicken", "quantity": 1.0}, {"food": "silk plain soy yogurt", "quantity": 0.5}], "title": "\nFrench Onion Noodle Casserole\n"}, {"directions": "\n\n              Cook 4 sliced onions and 2 thyme sprigs in butter, covered, 20 minutes. Uncover; cook 1 hour, or until caramelized, stirring occasionally. Add 6 cups beef broth; simmer 10 minutes. Add cognac, salt and pepper. Top with gruyere toasts.\n            \n\n              See all 50 Easy Soups\n            \n", "ingredients": [], "title": "\nFrench Onion Soup\n"}, {"directions": "\nSpecial equipment: Eight 12-ounce soup crocks\n\n              Melt the butter in a very large Dutch oven or pot over medium heat. Add half the onions and sprinkle with 1/2 teaspoon salt and a few grinds of black pepper. Top with the remaining onions and sprinkle with 1/2 teaspoon salt and more pepper. Add the bay leaves and thyme and cook, stirring occasionally, until the onions are very soft and just begin to turn brown, about 1 hour. (The onions will begin to stick to the bottom of the pan and turn brown after about 30 minutes; just keep scraping them up and stirring them into the rest of the onions.)\n            \n\n              Add the wine to the pot, bring to a simmer and cook until it has almost completely evaporated, about 4 minutes. Add the beef broth and 1 cup of water, bring to a simmer and cook until the flavors have come together and the soup is rich, about 45 minutes. Season with 1/2 teaspoon salt and a few grinds of black pepper. Either keep the soup warm on a low burner or cool completely, refrigerate and reheat later. (The cooked soup can be refrigerated for up to 2 days or cooled and frozen for up to 1 month.)\n            \n\n              Preheat the broiler. Place four soup crocks on a rimmed baking sheet and fill them about 3/4 of the way with hot soup. Float a slice of bread on top of each and cover with Gruyere. Broil until the Gruyere is golden brown (don't be alarmed if some soup bubbles out), 2 to 3 minutes. Repeat with the remaining soup, bread and Gruyere.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 6.0}, {"food": "onions", "quantity": 8.0}, {"food": "black bean mango", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 3.0}, {"food": "thyme", "quantity": 3.0}, {"food": "martha white foods", "quantity": 2.0}, {"food": "frankfurter beef", "quantity": 8.0}, {"food": "hearts of palm", "quantity": 8.0}, {"food": "", "quantity": 3.0}], "title": "\nFrench Onion Soup\n"}, {"directions": "\nSpecial equipment: six 8-ounce ramekins\n\n              Preheat the oven to 350 degrees F. Grease six 8-ounce ramekins with butter and set aside on a rimmed baking sheet.\n            \n\n              Cut six 1/2-inch thick slices from the baguette and place them on the baking sheet. Cut the remaining baguette into 1/2-inch cubes (you should have about 4 1/2 cups) and spread them out on the same baking sheet. Bake, tossing the cubes and flipping the slices halfway through, until lightly browned, about 15 minutes.\n            \n\n              Meanwhile, melt the butter in a large skillet over medium-high heat. Add the onions, thyme, 1 teaspoon salt and a generous amount of black pepper and cook, stirring occasionally, until the onions begin to soften, about 6 minutes. Reduce the heat to medium-low and cook, stirring occasionally, until the onions are very soft and caramelized, 35 to 40 minutes. Add the wine, turn the heat to medium-high, bring to a boil and cook until the wine has evaporated, about 5 minutes. Add 2 cups water and the bouillon cube and stir until the cube dissolves. Bring the mixture to a boil and let cook until thickened slightly, about 5 minutes.\n            \n\n              Whisk together the heavy cream, chives, eggs and 1/2 teaspoon salt in a medium bowl. Add 1/2 cup bread cubes to each ramekin, sprinkle each with 1/4 cup Gruyere and top each with 1/4 cup bread cubes. Pour the egg mixture over the top. Divide the onion mixture among the ramekins. Top each ramekin with a slice of bread and 3/4 cup Gruyere.\n            \n\n              Set aside at room temperature for 15 minutes to allow the bread to absorb the egg mixture. Bake on the baking sheet until the custard is set and the bread pudding is puffed and golden, about 20 minutes. Let stand 5 minutes before serving.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.0}, {"food": "", "quantity": 24.0}, {"food": "onions", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "martha white foods", "quantity": 1.0}, {"food": "frankfurter beef", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "chives", "quantity": 0.25}, {"food": "eggs", "quantity": 4.0}, {"food": "", "quantity": 6.0}], "title": "\nFrench Onion Soup Bread Pudding\n"}, {"directions": "\nSpecial equipment: a 3-quart baking dish\n\n              Melt the butter and oil in a large Dutch oven or pot over medium heat. Add half the onions and celery, 1/2 teaspoon salt and a few grinds of pepper. Top with the remaining onions and celery, 1/2 teaspoon salt, a few grinds of pepper, the bay leaves and the thyme sprigs. Cook, uncovered and stirring occasionally, until all the liquid evaporates and the onions are very soft and golden brown, 45 minutes to 1 hour. (If the onions are soft but could be more golden, increase the heat slightly for a few minutes toward the end of cooking.)\n            \n\n              Add the flour, and stir until completely absorbed, about 1 minute. Add the broth and wine, and simmer until almost completely evaporated, about 2 minutes. Remove from the heat, and let cool for a few minutes. Remove the bay leaves and thyme stems. (The onions can be made, cooled and refrigerated up to 2 days ahead.)\n            \n\n              Meanwhile, preheat the oven to 350 degrees F. Bake the baguette slices on a baking sheet until they're slightly toasted but not golden, 2 to 3 minutes per side. Let cool.\n            \n\n              Shingle and slightly overlap half the bread slices in a 3-quart baking dish. Top with the onion mixture in 1 layer. Shingle, overlapping, with the remaining bread. Sprinkle the Gruyere over the top. Cover with foil, and bake until the onion mixture is hot and the cheese is melted, about 40 minutes. Remove the foil, switch the oven from bake to broil and broil until the top is golden in spots. Sprinkle the thyme leaves over the top. Serve hot.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "onions", "quantity": 4.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "frankfurter beef", "quantity": 1.0}, {"food": "martha white foods", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 4.0}], "title": "\nFrench Onion Soup Casserole\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 425 degrees F. Remove the stems from 24 large cremini mushrooms.\n            \n\n              Wipe the caps clean with a damp paper towel, then toss with 2 tablespoons olive oil and season with salt. Arrange on a baking sheet.\n            \n\n              Melt 3 tablespoons butter in a large skillet over medium heat. Add 2 thinly sliced onions and 2 teaspoons chopped thyme; season with salt and pepper and cook, stirring, until the onions are caramelized, about 20 minutes. Add 1/4 cup red wine; cook until evaporated, 1 minute. Add 1/2 cup beef broth; simmer until the onions are glazed, 3 minutes. Sprinkle breadcrumbs inside the mushroom caps; fill with the onion mixture, then sprinkle with 1 cup shredded gruyere and 2 tablespoons grated parmesan.\n            \n\n              Bake until the mushrooms are tender and the filling is golden, 15 to 17 minutes. Let cool 5 minutes, then remove from the baking sheet. Top with parsley.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [], "title": "\nFrench Onion Soup Stuffed Mushrooms\n"}, {"directions": "\n\n              Preheat the broiler. Generously season the steak with salt and pepper. Heat the olive oil in a large skillet over high heat. Add the steak and cook until browned, about 4 minutes per side for medium rare. Transfer to a cutting board and let rest.\n            \n\n              Pour off any excess fat from the skillet and reduce the heat to medium. Melt the butter in the skillet, then add the onions, thyme, 1/2 teaspoon salt and a few grinds of pepper. Cook, stirring occasionally, until the onions start caramelizing, about 10 minutes. Stir in the chicken broth and cook until slightly reduced, about 5 minutes.\n            \n\n              Meanwhile, trim off any excess fat from the steak; thinly slice against the grain. Put the rolls cut-sides up on a baking sheet and broil until toasted, about 2 minutes.\n            \n\n              Remove the roll tops to a plate. Divide the onion mixture among the roll bottoms, top with the steak and sprinkle with the gruyere. Return to the broiler until the cheese is melted but not browned, 3 to 5 minutes. Top with the toasted roll tops and serve with the pickled vegetables.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 2.0}, {"food": "thyme", "quantity": 1.0}, {"food": "diced chicken", "quantity": 0.3333333333333333}, {"food": "pizza rolls", "quantity": 4.0}, {"food": "macaroni cheese", "quantity": 2.0}, {"food": "barley flour or meal", "quantity": 1.0}], "title": "\nFrench Onion Steak Sandwiches\n"}, {"directions": "\n\n              Toss 2 sliced sweet onions with 3 tablespoons Worcestershire sauce, 2 tablespoons olive oil, 1/4 cup water, and salt and pepper in a baking dish. Cover; roast at 425 degrees F until tender, 25 minutes. Toss 1 cup croutons and 1/2 cup grated gruyere with some parsley, olive oil, salt and pepper; sprinkle over the onions and bake 5 more minutes.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nFrench Onions\n"}, {"directions": "\n\n              Slice the potatoes 1/3-inch thick and put in a saucepan with 1 teaspoon of the salt, the water, and the wine. Tie the parsley stems, peppercorns, and thyme in a piece of cheesecloth and add to the pot. Bring the liquid to a boil over high heat and immediately lower the heat to maintain a simmer. Cook until the potatoes are tender but not mushy, about 12 minutes. Drain; discard the herb bundle and transfer the potatoes to a bowl. While the potatoes are cooking make the dressing. In a small bowl, whisk together the vinegar, shallots, the remaining 2 teaspoons of the salt and pepper. Gradually whisk in the oil to make a dressing. Toss the warm potatoes with the dressing gently so as not to break up the potatoes. Allow the salad to sit at room temperature for one hour to marinate, tossing several times to coat the potatoes. Add the parsley. Season with salt and pepper to taste. Serve at room temperature.\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 2.0}, {"food": "salt", "quantity": 1.0}, {"food": "coconut water", "quantity": 4.0}, {"food": "martha white foods", "quantity": 1.0}, {"food": "parsley", "quantity": 4.0}, {"food": "black bean mango", "quantity": 6.0}, {"food": "thyme", "quantity": 2.0}, {"food": "martha white foods", "quantity": 3.0}, {"food": "shallots", "quantity": 0.3333333333333333}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "chrysanthemum leaves", "quantity": 0.3333333333333333}], "title": "\nFrench Potato Salad\n"}, {"directions": "\n\n              1. Heat the butter and oil together in a Dutch oven over medium heat. Add the onions, shallots and leek, and season with salt and pepper, to taste. Stir to combine and cover. Cook, without stirring until the onions are soft and beginning to brown, about 10 to 15 minutes.\n            \n\n              2. Uncover, and continue to cook, stirring often, until the onions are a rich brown color and well caramelized, about 25 to 30 minutes. (If the onions begin to stick to the bottom of the pan or burn add about a 1 tablespoon water at a time.) Meanwhile, tie the reserved leek top with the thyme and rosemary using a piece of kitchen twine.\n            \n\n              3. Sprinkle the flour over the onions and cook, stirring, to cook out the raw flour taste, about 2 to 3 minutes. Stir in the broth and 2 cups water, scraping any browned bits from the bottom of the pan; add the herb bundle. Reduce the heat and simmer until thickened, 20 to 25 minutes. Stir in the Worcestershire and remove from the heat. Discard the herb bundle, stir in the sherry and season, to taste, with salt and pepper.\n            \n\n              4. Preheat the broiler. Divide the soup between 4 (16-ounce) oven proof bowls or ramekins and arrange them on a baking sheet. Top each bowl evenly with 2 baguette slices and top with the cheese. Put under the broiler until the cheese is melted and lightly browned, about 1 minute. Sprinkle with the chives and serve.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.5}, {"food": "shallots", "quantity": 6.0}, {"food": "silk light vanilla", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "thyme", "quantity": 3.0}, {"food": "rosemary", "quantity": 1.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "frankfurter beef", "quantity": 4.0}, {"food": "coconut water", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "", "quantity": 0.25}, {"food": "luncheon slices", "quantity": 8.25}, {"food": "", "quantity": 0.5}, {"food": "chives", "quantity": 1.0}], "title": "\nFrench Three Onion Soup\n"}, {"directions": "\n\n              Cut the bread lengthwise into 1-inch-thick strips, cutting as far down through the loaf as you can without cutting all the way through. Rotate the bread 90 degrees and cut 1-inch strips in the other direction, without cutting all the way through. Put the loaf into a 1 1/2-quart oval baking dish.\n            \n\n              Whisk the milk, brown sugar, cinnamon and eggs in a medium bowl until smooth. Pour the egg mixture over the bread, making sure it gets in all the crevices. Stuff the chocolate pieces in between the rows. Cover and refrigerate for 6 hours and up to overnight.\n            \n\n              Preheat the oven to 325 degrees F.\n            \n\n              Uncover the bread and drizzle with the butter. Put the baking dish in a larger baking dish and pour hot water into the larger dish until it comes 1 inch up the sides of the smaller dish. Bake until the eggs mixture is completely cooked and the top of the bread is dark golden brown and crispy, 60 to 65 minutes. Remove from the oven and sprinkle with confectioners' sugar. Serve with maple syrup on the side for dipping.\n            \n", "ingredients": [{"food": "barbecue loaf", "quantity": 1.0}, {"food": "whole milk", "quantity": 0.75}, {"food": "sugar", "quantity": 0.25}, {"food": "cinnamon", "quantity": 1.0}, {"food": "eggs", "quantity": 4.0}, {"food": "baking chocolate", "quantity": 3.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "sugar", "quantity": 1}, {"food": "syrup", "quantity": 1}], "title": "\nFrench Toast Bread Pudding\n"}, {"directions": "\n\n              For the casserole: Generously butter a 3-quart casserole dish. Arrange the bread slices over the bottom of the dish in three rows of 6 slices, shingling slightly.\n            \n\n              Whisk the eggs, granulated sugar, vanilla, cinnamon, nutmeg and 1/2 teaspoon salt in large bowl until combined and smooth. Whisk in the milk and heavy cream. Pour the egg mixture evenly over the bread slices, making sure that all slices have been coated. Cover the dish and refrigerate for at least 8 hours or up to 12.\n            \n\n              Position an oven rack in the center of the oven, and preheat to 350 degrees F.\n            \n\n              For the crumble: Toss the brown sugar, flour, cinnamon, nutmeg and 1/4 teaspoon salt together in a medium bowl. Add the butter and work it in with your fingers until the mixture is crumbly with pea-sized bits of butter. Mix in the walnuts.\n            \n\n              To assemble: Give the bread slices in the casserole dish a gentle push into the custard. Sprinkle the crumble evenly over the top.\n            \n\n              Bake the casserole until the top is puffed and browned and a knife inserted in the center comes out clean, about 45 minutes (it will still be a little wiggly but will continue to cook a bit out of the oven); check halfway through the baking time and tent with foil if the topping is browning too quickly. Serve hot.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.0}, {"food": "barbecue loaf", "quantity": 1.0}, {"food": "eggs", "quantity": 6.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "cinnamon", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "whole milk", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "sugar", "quantity": 0.75}, {"food": "potato flour", "quantity": 0.25}, {"food": "cinnamon", "quantity": 0.5}, {"food": "nutmeg", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 1.0}, {"food": "walnuts", "quantity": 1.0}], "title": "\nFrench Toast Casserole with Brown Sugar-Walnut Crumble\n"}, {"directions": "\n\n              Adjust an oven rack to the middle position and preheat to 375 degrees F. Lightly butter a 9- by 13-inch baking dish.\n            \n\n              Lay 6 slices of the bread in a single layer on the bottom of the baking dish (trim if needed). Sprinkle 2 heaping tablespoons of the gruyere on top of each slice. Then top each with 2 slices of the ham, folding the ham if needed to fit on top of the bread. Place the remaining 6 slices of bread on top of the of the ham to form 6 sandwiches. Sprinkle the remaining gruyere on top and on the sides of the sandwiches. Set aside.\n            \n\n              Whisk together 4 of the eggs, the half-and-half, cinnamon, nutmeg, 1 teaspoon salt and 1/2 teaspoon pepper in a large mixing bowl. Pour on top of the sandwiches. Use your hands to lightly press the sandwiches down into the custard.\n            \n\n              Spray a large piece of foil with nonstick spray. Place the foil, sprayed-side down, on top of the baking dish, crimping the sides of the foil around the dish. Bake for 30 minutes. Remove the foil and bake until the custard is set but still slightly jiggly, about 10 minutes. Switch the oven to broil and broil until the top is light golden brown, 3 to 5 minutes.\n            \n\n              Allow the casserole to rest at room temperature for 20 minutes.\n            \n\n              Meanwhile, heat the butter in a large nonstick pan over medium heat. Crack 3 eggs into the pan (it's ok if they stick together) and lightly sprinkle with salt and pepper. Cook until the whites start to set, 2 to 3 minutes, and then cover and continue cooking until the whites are set but the yolks are still runny, 1 to 2 minutes. Place each on top of a sandwich. Repeat with the remaining 3 eggs.\n            \n\n              Use a metal spatula to remove a sandwich with egg from the casserole and place on a serving plate. Serve with warm maple syrup for drizzling.\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 2.0}, {"food": "garlic bread", "quantity": 12.5}, {"food": "", "quantity": 1.0}, {"food": "ham", "quantity": 12.0}, {"food": "eggs", "quantity": 10.0}, {"food": "", "quantity": 2.0}, {"food": "cinnamon", "quantity": 0.5}, {"food": "nutmeg", "quantity": 1}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "syrup", "quantity": 1}], "title": "\nFrench Toast Croque Madame Casserole\n"}, {"directions": "\n\n              For the French toast: Preheat the oven to 325 degrees F. Place a wire rack inside a rimmed baking sheet. Lay the bread slices on the rack; set aside to air-dry. Whisk the cream, eggs, Parmesan, nutmeg and some salt and pepper in a large casserole dish until smooth; set aside.\n            \n\n              For the Florentine sauce: Melt the butter in a small saucepan over medium heat. Whisk in the flour until the mixture is smooth and lump-free. Cook, whisking constantly, until light brown, about 1 minute. Slowly whisk in the milk and 1/4 cup of the heavy cream. Continue to cook, whisking, until the mixture has thickened, about 1 minute. Reduce the heat to low, stir in the spinach, 1/2 cup of the Parmesan, 1/4 teaspoon salt, a few grinds of pepper and the nutmeg. Turn off the heat, and cover to keep warm.\n            \n\n              Heat a large nonstick skillet over medium-low heat. Transfer the bread slices to a plate. Transfer the baking sheet with the wire rack to the oven. Place 2 bread slices in the egg mixture, and let them completely soak on both sides, about 30 seconds to 1 minute per side, checking after 30 seconds. (The bread should feel heavy and soaked through but hold its shape without breaking apart.) Melt 1 tablespoon of the butter in the skillet. Add the 2 soaked slices, and cook until the outside is golden brown and crisp and the inside is cooked through, 3 to 4 minutes per side. You will need to watch and adjust the heat between medium and medium-low if the bread is browning too quickly or not browning quickly enough. Keep the finished French toast slices warm on the rack in the baking sheet in the oven. Repeat with the remaining slices.\n            \n\n              Toss the remaining 2 tablespoons grated Parmesan with the parsley in a small bowl; set aside. Place the Florentine sauce back over medium-low heat, whisk in the remaining 2 tablespoons cream and the lemon juice and heat through, about 1 minute. Arrange 2 slices of French toast per plate, and divide the Florentine sauce evenly over the toasts (a generous 1/4 cup per serving). Garnish with a tablespoon of the Parmesan-parsley mixture and a few grinds of pepper, and serve.\n            \n", "ingredients": [{"food": "garlic bread", "quantity": 0.75}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "eggs", "quantity": 4.0}, {"food": "", "quantity": 2.0}, {"food": "nutmeg", "quantity": 0.125}, {"food": "black bean mango", "quantity": 1}, {"food": "butter oil", "quantity": 4.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "whole milk", "quantity": 0.75}, {"food": "ice cream swich", "quantity": 0.25}, {"food": "chrysanthemum leaves", "quantity": 3.0}, {"food": "", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "nutmeg", "quantity": 1}, {"food": "parsley", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}], "title": "\nFrench Toast Florentine\n"}]