[{"directions": "\n\n              Bring a large pot of salted water to a boil. Add the pasta and cook as the label directs. Reserve 1/2 cup cooking water, then drain.\n            \n\n              Meanwhile, heat the olive oil in a Dutch oven or large pot over medium-high heat. Add the bell pepper and cook, stirring occasionally, until just tender, about 3 minutes. Add the chickpeas, garlic, red pepper flakes and 1/2 teaspoon salt and cook, stirring occasionally, until the garlic is lightly browned, about 3 minutes.\n            \n\n              Add the olives, pasta and the reserved pasta cooking water to the pot; cook 1 minute. Remove from the heat and stir in the arugula and oregano until wilted. Season with salt and pepper. Top with the feta and drizzle with olive oil.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "italian veg medley pasta", "quantity": 12.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "yellow rice", "quantity": 1.0}, {"food": "chickpeas", "quantity": 1.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "olives", "quantity": 0.5}, {"food": "arugula", "quantity": 5.0}, {"food": "", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "macaroni cheese", "quantity": 0.75}], "title": "\n\"Greek Salad\" Penne\n"}, {"directions": "\n\n              Galaxy cakes have exploded on Instagram, but making the mirror glaze on top can be tricky. We created this easy version using store-bought frosting instead. Place a round layer cake on an upside-down cake pan set on a baking sheet and cover with a thin, even layer of white frosting. Tint 2 cups frosting dark blue using gel food coloring, then tint another 1/2 cup teal, 1/2 cup purple and 1/2 cup royal blue. Microwave the dark blue frosting in 30-second intervals until it's very runny, then repeat with the other colors. Working quickly, pour the dark blue frosting over the cake to cover completely, letting it drip down the side. Drizzle a few lines of the other colors over the cake, then smooth over them with an offset spatula. Using a small pastry brush, splatter the top with white food coloring, sprinkle with edible glitter and let set.\n            \n\n              Photograph by Jeffrey Westbrook\n            \n", "ingredients": [], "title": "\nGalaxy Cake\n"}, {"directions": "\nSpecial equipment: an immersion blender and instant-read thermometer\n\n              Whisk together the gelatin and 3 tablespoons water in a small bowl and set aside to bloom.\n            \n\n              Combine the sugar, corn syrup and 1/3 cup water in a medium saucepan, bring to a boil and cook until the sugar is dissolved and the mixture is clear, about 2 minutes. Remove from the heat and whisk in the bloomed gelatin to dissolve. Add the white chocolate and allow to sit 1 minute to melt. Add the condensed milk and combine with an immersion blender until emulsified and smooth.\n            \n\n              Put 1/2 cup of the glaze into each of 3 small bowls. Using an immersion blender to combine (cleaning the blender attachment between each color), color one with the turquoise, one with the yellow and one with the white gel food coloring. Color the remaining glaze in the saucepan with the dark blue. Let cool to 95 degrees F, checking with an instant-read thermometer.\n            \n\n              Starting at the center of the frozen frosted layer cake, pour the dark blue glaze over it. Drizzle with the remaining colors and swirl them together with a small spatula. Dust with edible glitter and allow to set in the refrigerator for 1 to 2 hours.\n            \n", "ingredients": [{"food": "", "quantity": 25.0}, {"food": "sugar", "quantity": 1.0}, {"food": "silk light vanilla", "quantity": 0.3333333333333333}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "milk", "quantity": 0.5}, {"food": "yellow rice", "quantity": 1}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 1.0}, {"food": "", "quantity": 1}], "title": "\nGalaxy Mirror Glaze\n"}, {"directions": "\nSpecial equipment: Plastic goal posts, available a specialty baking stores\n\nIcing:\n\n\n              For the cake: Position a rack in the lower third of the oven and preheat to 350 degrees F. Butter and line the bottom of 9 by 13-inch cake pan with parchment paper, overlapping on 2 sides to create flaps. \n            \n\n              Put chopped the chocolate in a bowl. Heat cola just to a simmer over low heat and pour over chocolate. Let stand for 5 minutes; stir until smooth. \n            \n\n              Whisk together the flour, cocoa powder, baking soda and salt in a medium bowl. \n            \n\n              In another large bowl, beat the eggs and sugar with an electric mixer on medium speed until slightly thickened and pale, about 3 minutes. Gradually add the oil, buttermilk, vanilla, and melted chocolate mixture to eggs. Beat on low until combined well, but not aerated. Add the flour mixture and continue to beat until just combined. (Stir lightly with a rubber spatula to remove any pockets of flour.) Pour the batter into the prepared pan and bake until the cake springs back lightly when touched, and a tester inserted in center comes out clean, about 40 minutes. \n            \n\n              Cool cake completely in the pan on a rack. Run a knife around edge of the pan and invert cake onto a rack. Carefully remove parchment paper and cool completely. (The cake may be made in advance, tightly wrapped and kept at room temperature for up to 2 days.)\n            \n\nFootball Sugar Cookies:\n\n\n              Whisk the flour and salt in a medium bowl. \n            \n\n              Beat the butter and sugar in another medium bowl with an electric mixer on medium-high speed until light and fluffy, about 3 minutes. Add the egg and vanilla mixing until fully incorporated. Slowly add the flour mixture, and continue beating just until the dough comes together, stopping and scraping down the sides of the bowl as needed. \n            \n\n              Divide dough in half, pat into disks, wrap in plastic wrap and refrigerate until firm, at least 4 hours and up to overnight. \n            \n\n              Generously flour a clean work surface. (Tip: for a nice, even layer of flour, sift flour over work station.) Roll chilled dough about 1/4-inch thick. Cut into desired shape using a cookie cutter, working quickly enough that the dough stays chilled. (If dough gets warm and soft, put it in refrigerator on a lined baking sheet to chill, about 30 minutes.) Transfer cut cookies to un-greased baking sheets, leaving about 1-inch between cookies. Lightly dust off excess flour with a dry pastry brush. Refrigerate the formed cookies for at least 30 minutes. (Excess dough can be gathered together, pressed into a disk, chilled and rerolled.) \n            \n\n              Preheat the oven to 325 degrees F. Bake the cookies, until the bottoms and sides are barely golden, about 12 to 15 minutes depending on shape. Cool on the baking sheets until firm enough to transfer to a rack to cool. Decorate as desired and serve. Store in an airtight container at room temperature for up to 1 week. \n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 3.0}, {"food": "", "quantity": 1.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 1.5}, {"food": "salt", "quantity": 1.0}, {"food": "eggs", "quantity": 3.0}, {"food": "sugar", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 0.75}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "sugar", "quantity": 2.25}, {"food": "egg substitute", "quantity": 9.0}, {"food": "lemon juice", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 1.25}, {"food": "onion powder", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "barley flour or meal", "quantity": 1}, {"food": "potato flour", "quantity": 2.5}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 1.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}], "title": "\nGame Day Chocolate Cake\n"}, {"directions": "\n\n              Place a wire rack in a rimmed baking sheet and set aside. Fill a large Dutch oven halfway with oil and heat over medium-high heat to a temperature of 350deg;F.\n            \n\n              Whisk together the honey, sriracha, soy sauce, lime juice and sesame oil in a small saucepan and bring to a boil over medium heat. Reduce the heat to low and simmer until the sauce comes together, about 5 minutes. Transfer to a large bowl and set aside.\n            \n\n              Whisk together the cornstarch, flour, 1¾ cups cold water, 2 teaspoons salt and ¼ teaspoon pepper in a large bowl until smooth. Add the chicken and toss until completely coated.\n            \n\n              Lift the chicken pieces out of the batter one at a time, letting the excess batter drip back into the bowl, and gently place in the hot oil; try to keep the pieces separated. Fry in batches until golden, adjusting the heat as necessary to keep the oil temperature at 350°F, about 8 or 9 minutes per batch. Remove the chicken with a spider or slotted spoon and set on the rack on the baking sheet to drain. While the wings are still hot, toss them in the honey sauce to evenly coat. Transfer them to a dutch oven and serve with sesame seeds and scallions scattered over the top.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1}, {"food": "meat drippings ", "quantity": 1}, {"food": "meat drippings ", "quantity": 1}, {"food": "silk vanilla soy yogurt ", "quantity": 1}, {"food": "meat drippings ", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "cornstarch", "quantity": 1.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "diced chicken", "quantity": 2.0}, {"food": "sesame seeds", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}], "title": "\nGame Day Korean-Style Chicken Wings\n"}, {"directions": "\n\n              Beat 2 sticks butter, 3/4 cup dark brown sugar and 3/4 cup granulated sugar until fluffy; beat in 1 teaspoon vanilla and 2 eggs. Whisk 2 1/2 cups flour, 1/2 teaspoon baking soda and 1 teaspoon salt, then stir into the butter mixture. Add 2 cups chocolate chunks, 1/2 cup crushed pretzels and 1/2 cup peanuts. Press into a 9-by-13-inch pan; sprinkle with more pretzels. Bake 40 to 45 minutes at 350 degrees.\n            \n", "ingredients": [], "title": "\nGame-Day Bars\n"}, {"directions": "\n\n              Soak the diced onion in cold water, 10 minutes.\n            \n\n              Whisk the vinegar, sugar and 1/2 teaspoon salt in a large bowl, then whisk in the olive oil. Drain the onion and pat dry, then add to the dressing. Stir in the white beans.\n            \n\n              Bring a saucepan of salted water to a boil. Add the green and/or wax beans and cook until crisp-tender, 4 to 5 minutes. Drain the beans, then plunge into a bowl of ice water to stop the cooking. Drain again, pat dry and add to the salad. Marinate at room temperature, tossing occasionally, about 1 hour.\n            \n\n              Before serving, stir the parsley and chives into the salad and season with salt and pepper.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "onion powder", "quantity": 1.0}, {"food": "vinegar", "quantity": 0.25}, {"food": "sugar", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "fava beans", "quantity": 1.0}, {"food": "fava beans", "quantity": 0.75}, {"food": "parsley", "quantity": 2.0}, {"food": "chives", "quantity": 2.0}, {"food": "pepper", "quantity": 1}], "title": "\nGarden Bean Salad\n"}, {"directions": "\n\n              Preheat a grill to medium high. Make the dressing: Puree the yogurt, mayonnaise, lemon juice, Worcestershire sauce, chives, basil, and salt and pepper to taste in a blender. Transfer to a small bowl, cover and refrigerate until ready to use.\n            \n\n              Make the burgers: Form the beef into four 6-ounce patties, about 3/4 inch thick; press the center of each patty with your thumb to make a 1/2-inch-deep indentation. Season the patties on both sides with salt and pepper. Lightly brush the grill grates with vegetable oil, then grill the patties, indentation-side up, until marked on the bottom, about 5 minutes. Flip and cook until marked and slightly firm, about 3 more minutes for medium doneness. Remove the patties to a plate and let rest 5 minutes. Grill the buns, cut side down, until lightly toasted, about 1 minute.\n            \n\n              Top the bun bottoms with the lettuce, tomatoes, burger patties, alfalfa sprouts and avocado. Drizzle with the dressing, then cover with the bun tops.\n            \n", "ingredients": [{"food": "silk plain soy yogurt", "quantity": 0.3333333333333333}, {"food": "mayonnaise dressing", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "chives", "quantity": 0.25}, {"food": "basil", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "frankfurter beef", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1}, {"food": "split pea soup", "quantity": 4.0}, {"food": "chrysanthemum leaves", "quantity": 1}, {"food": "plum", "quantity": 2.0}, {"food": "brussels sprouts", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}], "title": "\nGarden Burgers\n"}, {"directions": "\n\n              1.Put the chicken in a bowl and add the zucchini, carrot, scallion, hummus, parsley, garlic, coriander and cumin. Mix the meat and flavorings together by hand, or with a wooden spoon, until evenly combined. Form into four burgers, about 1/2-inch thick. (If the mixture is very soft, transfer the burgers to a plate and refrigerate for 10 minutes.)\n            \n\n              2. Heat a nonstick skillet over medium heat. Brush burgers lightly with olive oil and season with 1 1/2 teaspoons salt and some pepper. Add burgers to the pan and cook until browned and cooked through, about 5 to 8 minutes on each side, or until an instant-read thermometer inserted into the sides of the burgers registers between 165 and 170 degrees F. Set aside to rest for 5 minutes. Serve burgers on a toasted bun or in a pita with toppings as desired.\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "carrot juice", "quantity": 0.5}, {"food": "martha white foods", "quantity": 4.0}, {"food": "hummus", "quantity": 0.25}, {"food": "parsley", "quantity": 0.25}, {"food": "garlic powder", "quantity": 2.0}, {"food": "ground turkey", "quantity": 2.0}, {"food": "cumin seed", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "whole milk", "quantity": 4.0}, {"food": "silk plain soy yogurt", "quantity": 1}], "title": "\nGarden Chicken Burger\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Put the eggs in a saucepan with enough cold water to cover. Bring to a boil, cover, and remove from the heat. Set aside for 12 minutes. Drain the eggs and roll them between your palm and the counter to crack the shell, then peel under cool running water.\n            \n\n              Dice the eggs. Combine the eggs with mayonnaise, mustard and season with the salt and pepper. Stir in the scallions, celery, and radish.\n            \n\n              Divide the egg salad among the lettuce leaves, top with the sprouts and roll up. Serve 2 rolls per serving.\n            \n", "ingredients": [{"food": "eggs", "quantity": 6.0}, {"food": "mayonnaise dressing", "quantity": 0.5}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "celery seed", "quantity": 1.5}, {"food": "hearts of palm", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 8.0}, {"food": "brussels sprouts", "quantity": 1.0}], "title": "\nGarden Egg Salad\n"}, {"directions": "\n\n              Make the blackberry syrup: Combine the blackberries, sugar and 1/2 cup water in a small saucepan over medium-high heat. Bring to a boil, then reduce the heat and simmer until the syrup is dark red, about 8 minutes. Remove from the heat and stir in the basil sprig; let cool. (Makes 10 ounces; refrigerate up to 1 week.)\n            \n\n              Combine the vodka, lime juice and 1 ounce blackberry syrup in a cocktail shaker; fill with ice. Shake well and strain into an ice-filled glass. Garnish with blackberries and basil.\n            \n", "ingredients": [{"food": "blackberries", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "basil", "quantity": 1.0}, {"food": "", "quantity": 2.0}, {"food": "lime juice", "quantity": 0.5}], "title": "\nGarden Gimlet\n"}, {"directions": "\n\n              Make the dressing: Bring a small saucepan of water to a boil; add the garlic and cook 2 minutes. Remove the garlic and place in a blender with the cherry tomatoes, vinegar and basil; puree until smooth. With the motor running, add the olive oil in a slow, steady stream and blend until smooth. Season with salt and pepper.\n            \n\n              Make the salad: Bring a large pot of salted water to a boil. Add the pasta and cook until al dente (about 2 minutes less than the label directs). Drain and rinse under cool water; shake off the excess. Transfer the pasta to a bowl and toss with the dressing.\n            \n\n              Shave the zucchini into strips with a vegetable peeler or mandoline; halve the strips crosswise and add to the pasta. Add the tomatoes, bocconcini, pine nuts and basil and toss. Season with salt and pepper. Serve immediately or refrigerate, covered, up to 6 hours. (Bring to room temperature before serving.)\n            \n\n              Photograph by Yunhee Kim\n            \n", "ingredients": [{"food": "garlic powder", "quantity": 1.0}, {"food": "mixed nuts", "quantity": 0.5}, {"food": "vinegar", "quantity": 3.0}, {"food": "basil", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "salt", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "italian veg medley pasta", "quantity": 8.0}, {"food": "", "quantity": 1.0}, {"food": "silk black cherry soy yogurt", "quantity": 1.5}, {"food": "melon balls", "quantity": 1.0}, {"food": "pine nuts", "quantity": 0.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}, {"food": "pepper", "quantity": 1}], "title": "\nGarden Pasta With Bocconcini\n"}, {"directions": "\n\n              Make the dressing: Bring a small saucepan of water to a boil; add the garlic and cook 2 minutes. Remove the garlic and place in a blender with the cherry tomatoes, vinegar and basil; puree until smooth. With the motor running, add the olive oil in a slow, steady stream and blend until smooth. Season with salt and pepper.\n            \n\n              Make the salad: Bring a large pot of salted water to a boil. Add the pasta and cook until al dente (about 2 minutes less than the label directs). Drain and rinse under cool water; shake off the excess. Transfer the pasta to a bowl and toss with the dressing.\n            \n\n              Shave the zucchini into strips with a vegetable peeler or mandoline; halve the strips crosswise and add to the pasta. Add the tomatoes, bocconcini, pine nuts and basil and toss. Season with salt and pepper. Serve immediately or refrigerate, covered, up to 6 hours. (Bring to room temperature before serving.)\n            \n\n              Photograph by Yunhee Kim\n            \n", "ingredients": [{"food": "garlic powder", "quantity": 1.0}, {"food": "mixed nuts", "quantity": 0.5}, {"food": "vinegar", "quantity": 3.0}, {"food": "basil", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "salt", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "italian veg medley pasta", "quantity": 8.0}, {"food": "", "quantity": 1.0}, {"food": "silk black cherry soy yogurt", "quantity": 1.5}, {"food": "melon balls", "quantity": 1.0}, {"food": "pine nuts", "quantity": 0.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}, {"food": "pepper", "quantity": 1}], "title": "\nGarden Pasta With Bocconcini\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the pasta and cook as the label directs, adding the snap peas during the last 2 minutes. Reserve 1/2 cup cooking water, then drain the pasta and peas.\n            \n\n              Meanwhile, heat 3 tablespoons butter in a large skillet over medium-high heat. Add the garlic, 1/2 teaspoon salt and a few grinds of pepper; cook until the garlic is softened, about 1 minute. Add the radishes and bell pepper; cook, stirring, until softened, about 2 minutes. Add half of the reserved pasta cooking water and cook until the vegetables are tender, 2 more minutes. Season with salt and pepper.\n            \n\n              Add the pasta and snap peas to the skillet along with the remaining 3 tablespoons butter, the parmesan and all but a few tablespoons of the herbs; toss to coat, adding enough of the reserved pasta cooking water to loosen. Season with salt and pepper.\n            \n\n              Combine the ricotta, 1 tablespoon water, the lemon zest and a pinch of salt in a bowl. Top each serving with the lemon ricotta and the remaining herbs.\n            \n\n              Photograph by David Malosh\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "italian veg medley pasta", "quantity": 12.0}, {"food": "sugar", "quantity": 2.0}, {"food": "butter oil", "quantity": 6.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "pepper", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 6.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "parmesan cheese", "quantity": 0.5}, {"food": "mixed nuts", "quantity": 0.6666666666666666}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}], "title": "\nGarden Pasta with Lemon Ricotta\n"}, {"directions": "\n\n              Mellow the harsh taste of the raw onion by soaking it in cold water for about 10 minutes.\n            \n\n              Meanwhile, put the lemon zest, juice, salt, and pepper in a large bowl. Gradually whisk in the olive oil, starting with a few drops and then adding the rest in a steady stream to make a smooth, slightly thick vinaigrette. Add the radishes, celery, cucumber, tomato, herbs and greens. Drain the onion and add to the salad. Add the tuna and toss again, keeping the tuna in nice even pieces.\n            \n\n              Divide between two plates and serve.\n            \n\n              Copyright © 2004 Television Food Network, G.P., All Rights Reserved\n            \n", "ingredients": [{"food": "onion powder", "quantity": 0.25}, {"food": "lemon juice", "quantity": 0.5}, {"food": "", "quantity": 0.5}, {"food": "salt", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "celery seed", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 0.5}, {"food": "diced chicken", "quantity": 1.0}, {"food": "dill seed", "quantity": 0.25}, {"food": "turnip greens", "quantity": 3.0}, {"food": "tuna salad", "quantity": 1.0}], "title": "\nGarden Tuna Salad\n"}, {"directions": "\n\n              Position a rack in the lower third of the oven and preheat to 425 degrees F. Toss the potatoes with 1 tablespoon olive oil, the cumin seeds, 3/4 teaspoon salt, and pepper to taste. Spread in a large baking dish and roast until the potatoes begin to brown, 25 to 30 minutes. \n            \n\n              Meanwhile, heat the remaining 2 tablespoons olive oil in a small skillet over medium heat. Add the garlic and cook, stirring frequently, until lightly golden, about 2 minutes. Remove from the heat and stir in the brown sugar, lemon juice and red pepper flakes. Remove the baking dish from the oven, push the potatoes to the sides and arrange the chicken breasts in the middle. Season the chicken with salt and drizzle with the garlic mixture. Return to the oven and bake until the chicken is cooked through and the potatoes are tender, about 20 minutes. \n            \n\n              Remove from the oven; transfer the chicken to a cutting board and slice. Add the cilantro to the baking dish and toss with the potatoes. Serve the chicken with the potatoes and lemon wedges. Drizzle with the pan juices. \n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "seeds", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "garlic powder", "quantity": 4.0}, {"food": "sugar", "quantity": 2.0}, {"food": "", "quantity": 1.5}, {"food": "hearts of palm", "quantity": 1}, {"food": "diced chicken", "quantity": 4.0}, {"food": "barley flour or meal", "quantity": 2.0}], "title": "\nGarlic Chicken and Potatoes\n"}, {"directions": "\n\n              Bake 1 1/2 pounds frozen crinkle-cut fries as the label directs. Toss with 2 tablespoons melted butter, 3 tablespoons chopped parsley and 1 minced garlic clove; season with salt and pepper. For dipping, mix 1/2 cup mayonnaise with the grated zest and juice of 1 lemon; sprinkle with paprika.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [], "title": "\nGarlic Fries with Lemon Mayonnaise\n"}, {"directions": "\n\n              Toast 4 sliced garlic cloves and a pinch of cayenne pepper in a skillet with butter. Add 1 1/4 pounds green beans, season with salt and a pinch of sugar and cook 2 minutes. Add 1/4 cup water, cover and cook 6 minutes, then uncover and boil until the water evaporates. Season with salt and pepper and toss with chopped pecans.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nGarlic Green Beans\n"}, {"directions": "\n\n              Cook 1 sliced onion, 8 whole garlic cloves and 1/2 teaspoon smoked paprika in a large pot with 3 tablespoons olive oil, about 2 minutes. Add 1 bunch each chopped mustard greens and kale, 2 cups water and a pinch each of sugar and salt. Simmer, covered, until tender, about 15 minutes. Add hot sauce to taste.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [], "title": "\nGarlic Greens\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the potatoes, cover and cook over medium-high heat until just tender, about 6 minutes; drain.\n            \n\n              Heat the butter and olive oil in a large cast-iron skillet over medium heat; add the potatoes and spread into a single layer. Cook, undisturbed, until they start browning on the bottom, about 5 minutes. Add the onion and sprinkle with the paprika; flip the potatoes and cook 5 more minutes. Stir once, then continue cooking until the potatoes are mostly golden brown, about 5 more minutes.\n            \n\n              Meanwhile, roughly chop the garlic, pile the parsley on top and sprinkle with 1 teaspoon salt. Chop and mash together until finely minced. When the potatoes are done, add the garlic mixture to the skillet and toss to coat; cook until heated through, about 2 minutes. Season with salt and pepper.\n            \n\n              Photograph by Ralph Smith\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "sweet potatoes", "quantity": 2.5}, {"food": "butter oil", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "paprika", "quantity": 0.5}, {"food": "garlic powder", "quantity": 1.0}, {"food": "parsley", "quantity": 0.25}, {"food": "pepper", "quantity": 1}], "title": "\nGarlic Home Fries\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Heat 2 tablespoons olive oil in a large ovenproof skillet over medium heat. Add the onion and cook, stirring occasionally, until softened, about 3 minutes. Add the garlic, chopped thyme, 1 teaspoon salt, and pepper to taste and continue cooking, stirring occasionally, until the garlic and onion are slightly golden, about 5 minutes. Add the wine and cook until mostly evaporated, about 2 minutes. \n            \n\n              Meanwhile, combine the breadcrumbs or matzo meal, parsley, chives, the remaining 1 tablespoon olive oil, and salt and pepper to taste in a bowl; reserve 2 tablespoons for topping.\n            \n\n              Arrange one-third of the potatoes over the onion in the skillet. Sprinkle with half of the remaining crumb mixture; top with another layer of potatoes. Repeat with another layer of the crumb mixture and potatoes. Pour the broth on top. Cover, bring to a boil and cook, undisturbed, 5 minutes.\n            \n\n              Uncover, sprinkle with the reserved crumb mixture, drizzle with olive oil and season with salt. Transfer the skillet to the oven; bake until the potatoes are golden brown and crisp on top, about 45 minutes. Let rest 5 to 10 minutes before serving. \n            \n\n              Photograph by Christina Holmes\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "thyme", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "martha white foods", "quantity": 0.25}, {"food": "barley flour or meal", "quantity": 0.25}, {"food": "parsley", "quantity": 1.0}, {"food": "chives", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 2.25}, {"food": "diced chicken", "quantity": 1.75}], "title": "\nGarlic Potato Gratin\n"}, {"directions": "\n\n              Position a rack in the upper third of the oven and preheat to 450 degrees F. Toss the chickpeas with 1 tablespoon olive oil and 1/2 teaspoon salt in a large baking dish, then spread out in a single layer. Bake until golden, about 20 minutes.\n            \n\n              Meanwhile, toss the shrimp with 4 tablespoons olive oil, the garlic, lemon zest, red pepper flakes and 1 teaspoon salt in a medium bowl. Marinate 10 minutes.\n            \n\n              Remove the baking dish from the oven and scatter the shrimp over the chickpeas. Return to the oven and bake until the shrimp are pink, 5 to 8 minutes. Drizzle with the remaining 1 tablespoon olive oil and sprinkle with the parsley. Serve with lemon wedges.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "chickpeas", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 6.0}, {"food": "salt", "quantity": 1}, {"food": "shrimp", "quantity": 1.25}, {"food": "garlic powder", "quantity": 3.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "parsley", "quantity": 0.5}, {"food": "", "quantity": 1}], "title": "\nGarlic Shrimp and Chickpeas\n"}, {"directions": "\n\n              Heat 1 tablespoon olive oil in a medium saucepan over medium heat. Add the smashed garlic and onion and cook, stirring, until soft and lightly golden, about 8 minutes. Add the wine, thyme, bay leaf, 1/2 teaspoon salt, pepper to taste and the cheese rind. Bring to a simmer and cook until reduced by half, about 5 minutes. Add 5 cups water, reduce the heat to low and bring to a gentle simmer; cook until the garlic is very soft, about 30 minutes. Remove from the heat, add the bread and let soak, 10 minutes.\n            \n\n              Remove the thyme, bay leaf and cheese rind from the saucepan; stir in the grated cheese, sour cream and 1/2 teaspoon salt. Transfer the soup to a blender in batches and puree until smooth. Season with salt and pepper.\n            \n\n              Combine the remaining 3 tablespoons olive oil, the sliced garlic and a pinch of salt in a skillet over low heat; cook until the garlic is golden and crisp, 12 to 15 minutes.\n            \n\n              Divide the soup among bowls. Top with the fried garlic, some of the garlic oil, and dill.\n            \n\n              Photograph by Christina Holmes\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.25}, {"food": "garlic powder", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "martha white foods", "quantity": 1.0}, {"food": "thyme", "quantity": 2.0}, {"food": "corier leaf", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "parmesan cheese", "quantity": 1.5}, {"food": "garlic bread", "quantity": 2.0}, {"food": "sour cream", "quantity": 0.3333333333333333}, {"food": "dill seed", "quantity": 1}], "title": "\nGarlic Soup\n"}, {"directions": "\n\n              Smash 1 garlic clove and sprinkle with kosher salt, then mash and smear into a paste with the flat side of a knife. Mix with 1 1/4 cups low-fat plain Greek yogurt and thin with water. Drizzle with olive oil and sprinkle with salt, pepper, smoked paprika and cumin. Serve with the couscous or add a dollop to the pot-au-feu.\n            \n\n              Photograph by Marcus Nilsson\n            \n", "ingredients": [], "title": "\nGarlic Yogurt\n"}, {"directions": "\n\n              Roll and stretch the dough into a 12-inch square on a lightly floured surface. Combine the butter, parsley, garlic, red pepper flakes and a big pinch each of salt and pepper in a bowl. Spread over the dough; sprinkle with 3/4 cup grated asiago, pressing lightly. Cut the dough into 16 small squares and make 4 stacks of 4 squares each.\n            \n\n              Place each stack on its side in a buttered 9-by-5-inch loaf pan. Gently separate the dough layers so the dough fills the pan. Sprinkle with the remaining 1/4 cup asiago.\n            \n\n              Cover the loaf loosely with plastic wrap and set aside in a warm place until the dough rises by half its size, 1 to 2 hours.\n            \n\n              Preheat the oven to 350. Bake the loaf until it's browned and cooked through, 40 to 45 minutes (tent with foil if it's browning too quickly). Let cool 15 minutes in the pan, then loosen the edges with a knife. Remove to a plate and let cool 30 minutes.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "garlic bread", "quantity": 1.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "parsley", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "macaroni cheese", "quantity": 1.0}], "title": "\nGarlic-Asiago Pull-Apart Bread\n"}, {"directions": "\n\n              Boil 1 pound mixed green and wax beans in salted water until crisp-tender, 6 minutes; drain. Chop 3 garlic cloves, 2 tablespoons capers and the zest of 1 lemon and mash together to make a coarse paste; saute in olive oil, 2 minutes. Add the juice of the lemon and bring to a boil. Add the beans and toss until glazed, 2 minutes. Season with salt and pepper.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nGarlic-Caper String Beans\n"}, {"directions": "\n\n              Put 3/4 cup warm water in a food processor. Sprinkle the yeast on top and let sit until foamy, about 5 minutes. Add the sugar and 1 teaspoon salt and pulse until dissolved. Add the flour, olive oil and 1 tablespoon butter and pulse until the dough forms a ball, about 1 minute. Continue to process with the motor running until smooth, about 2 more minutes.\n            \n\n              Line 2 baking sheets with parchment paper; brush with olive oil. Turn the dough out onto a floured surface. Divide into 12 pieces, then roll each piece into a 12-to-16-inch rope. Arrange the ropes 1 1/2 inches apart on the prepared baking sheets, rolling them to coat with the oil. Cover each baking sheet with a damp cloth and set aside in a warm place until the breadsticks double in size, 45 minutes to 1 hour.\n            \n\n              Preheat the oven to 400 degrees F. Put the remaining 3 tablespoons butter and the garlic in a microwave-safe bowl and microwave until melted, about 1 minute. Brush the breadsticks with the garlic butter; sprinkle with herbs and salt. Bake until golden, 15 to 20 minutes.\n            \n\n              Photograph by Steve Giralt\n            \n", "ingredients": [{"food": "yeast extract spread", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "salt", "quantity": 1.0}, {"food": "potato flour", "quantity": 2.25}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "rosemary", "quantity": 1}], "title": "\nGarlic-Herb Breadsticks\n"}, {"directions": "\n\n              Put 1 halved, seeded spaghetti squash in a microwave-safe dish; add 2 tablespoons water, cover and microwave until tender, 16 minutes. Let cool slightly, then scrape into strands with a fork into a bowl. Cook 2 sliced garlic cloves in olive oil until golden. Add to the squash along with 2 tablespoons each chopped parsley, chives and pickled cherry peppers; toss. Season with salt and pepper.\n            \n", "ingredients": [], "title": "\nGarlic-Herb Spaghetti Squash\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Heat the olive oil in a large ovenproof skillet over medium-high heat. Season the chicken with salt and pepper and cook, skin-side down, until browned, about 5 minutes. \n            \n\n              Separate the heads of garlic into cloves but do not peel. Flip the chicken; add the garlic and rosemary to the skillet and transfer to the oven. Roast until the chicken is cooked through but still moist, 15 to 20 more minutes.\n            \n\n              Place the bread on a platter and top each slice with a chicken breast. Add the vinegar to the skillet and scrape up any browned bits with a wooden spoon. Add 3 tablespoons water and simmer until the sauce thickens slightly, about 2 minutes. Pour the sauce and garlic over the chicken and bread. \n            \n\n              Tip: You can squeeze the garlic out of its skin and spread on the chicken or bread. \n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "garlic powder", "quantity": 2.0}, {"food": "rosemary", "quantity": 4.0}, {"food": "garlic bread", "quantity": 4.0}, {"food": "vinegar", "quantity": 2.0}], "title": "\nGarlic-Roasted Chicken\n"}, {"directions": "\n\n              Whisk 3 eggs with 3/4 cup each flour and milk and 1 teaspoon kosher salt; let sit 5 minutes. Saute 6 thinly sliced garlic cloves and 1 tablespoon chopped rosemary in 6 tablespoons butter in a large ovenproof nonstick skillet, 1 minute. Add the batter and sprinkle with more rosemary. Bake at 425 degrees F until puffed and golden around the edge, 18 to 20 minutes. Sprinkle with sea salt. \n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [], "title": "\nGarlic-Rosemary Dutch Baby\n"}, {"directions": "\n\n              Position an oven rack in the lowest position (remove the other racks); preheat to 350 degrees F. Remove the neck and giblets from the turkey and set aside for the gravy. Pat the turkey dry with paper towels and rub inside and out with 1 tablespoon each salt and pepper. Stuff the cavity with the onion, smashed garlic and rosemary sprigs. Tie the legs together with kitchen twine. Put the turkey on a rack set in a large roasting pan and tuck the wings under the body. Let sit at room temperature while you make the porcini butter.\n            \n\n              Soak the porcini in 1 cup hot water until softened, about 10 minutes; drain. Put half of the porcini in a food processor (finely chop the rest to use in the gravy). Add the whole garlic cloves and chopped rosemary to the food processor; pulse to make a paste. Add the butter, Worcestershire sauce, 2 teaspoons salt and a generous amount of pepper; pulse until smooth. Rub the turkey inside and out with the butter. Transfer to the oven and roast 1 hour. Meanwhile, start your gravy, adding the chopped porcini in along with the stock.\n            \n\n              After the turkey has roasted 1 hour, baste with the drippings. Continue roasting, basting every 30 minutes, until the skin is golden brown and a thermometer inserted into the thigh registers 165 degrees F, 1 1/2 to 2 more hours.\n            \n\n              Transfer the turkey to a cutting board and let rest 30 minutes before carving; use the drippings for the gravy.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "smoked turkey roll", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "onion powder", "quantity": 1.0}, {"food": "cloves", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 4.0}, {"food": "mushrooms", "quantity": 2.0}, {"food": "butter oil", "quantity": 1.5}, {"food": "Worcestershire sauce", "quantity": 2.0}], "title": "\nGarlic-Rosemary Turkey with Porcini\n"}, {"directions": "\n\n              Cook 8 to 10 garlic cloves and a pinch of red pepper flakes in a skillet with vegetable oil until the garlic is golden. Add 10 cups baby spinach and cook until wilted; add a big splash of water and some salt. Top with toasted sesame seeds and drizzle with sesame oil.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nGarlic-Sesame Spinach\n"}, {"directions": "\n\n              Thinly slice a baguette; arrange in a single layer on a baking sheet. Brush with olive oil and sprinkle with salt. Bake at 425 degrees F until lightly golden, about 7 minutes. Let cool slightly.\n            \n\n              Cut off the top inch of 2 heads of garlic. Drizzle with olive oil, wrap in foil and roast 1 hour at 400 degrees F. Squeeze the garlic out of its skin and mash. Meanwhile, fry sage leaves in olive oil until crisp. Spread softened butter on the toast rounds. Top with the roasted garlic, sliced sun-dried tomatoes, the fried sage and sea salt.\n            \n\n              Photograph by Andrew McCaul\n            \n", "ingredients": [], "title": "\nGarlic-Sun-Dried Tomato Bruschetta\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Heat the olive oil in a large skillet over medium heat. Add the garlic and cook, stirring constantly, until the edges start turning golden, about 1 minute. Add the tomato paste to the skillet and cook, stirring, 1 minute. Add the red pepper flakes, then add 1 1/2 cups of the boiling water; stir to dissolve the tomato paste. Simmer until reduced by half, about 5 minutes, adding the peas halfway through. Season with salt.\n            \n\n              Meanwhile, add the pasta to the boiling water and cook until softened but not cooked through, 2 to 4 minutes. Reserve 1/2 cup cooking water, then drain. Add the pasta to the skillet along with the basil; toss over medium heat, adding more of the reserved cooking water if needed, until the pasta is al dente. Remove from the heat and stir in 1/4 cup parmesan. Top each serving with basil and the remaining parmesan.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "garlic powder", "quantity": 6.0}, {"food": "pasta with tomato sauce", "quantity": 3.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "pigeon peas", "quantity": 1.0}, {"food": "italian veg medley pasta", "quantity": 10.0}, {"food": "basil", "quantity": 0.5}, {"food": "parmesan cheese", "quantity": 0.5}], "title": "\nGarlic-Tomato Pasta with Peas\n"}, {"directions": "\n\n              Brush 6 slices crusty bread on both sides with olive oil; broil until golden. Rub with a garlic clove and the cut side of a tomato. Sprinkle with kosher salt and drizzle with more olive oil.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [], "title": "\nGarlic-Tomato Toast\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Meanwhile, cook the garlic in the olive oil in a large skillet over medium-high heat, stirring occasionally, until golden brown and crisp, about 3 minutes. (Be careful not to over-brown the garlic or it will taste bitter.) Using a slotted spoon, transfer the garlic chips to a paper-towel-lined plate. Pour off all but 2 tablespoons oil into a small bowl to use as a dip for crusty bread, if desired. Add the onions and red pepper flakes to the oil in the pan; cook, stirring, until the onions are light brown, about 10 minutes. Season with 1 1/2 teaspoons Kosher salt.\n            \n\n              When the onions are almost done, add the greens to the boiling water and cook, uncovered, until just tender, about 2 minutes. Using tongs, remove the greens, shaking off the excess water; add them to the skillet with the onions (set the pot of water aside). Cook, stirring occasionally, until tender, about 5 minutes.\n            \n\n              Return the cooking water to a boil. Add the spaghetti and cook until al dente, 8 to 10 minutes. Remove and reserve about 1 cup cooking water; drain the pasta and transfer to a serving bowl. Add the cheese and toss. Add the greens and some of the reserved pasta water and toss, adding more water as necessary to keep the pasta from clumping. Top with the garlic chips.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "garlic powder", "quantity": 16.0}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "onions", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.125}, {"food": "salt", "quantity": 1}, {"food": "mustard greens", "quantity": 12.0}, {"food": "spaghetti", "quantity": 12.0}, {"food": "macaroni cheese", "quantity": 0.25}], "title": "\nGarlic-and-Greens Spaghetti\n"}, {"directions": "\n\n              Preheat 1 to 2 tablespoons peanut oil in a wok or large pan until rippling. Halve 6 heads baby bok choy lengthwise, keeping the stems and leaves intact, and place in the wok with chopped or sliced garlic and fresh ginger. Stir-fry until fragrant; season with salt.\n            \n", "ingredients": [], "title": "\nGarlicky Bok Choy\n"}, {"directions": "\n\n              Cook 1/3 cup olive oil, 6 whole garlic cloves and a rosemary sprig in a pot over medium-low heat, stirring, until the garlic is golden, 7 minutes. Season with salt and pepper. Cook 2 bunches broccoli rabe in salted boiling water until wilted, about 5 minutes. Drain and return to the pot, then pour in the garlic oil. Cover and cook, stirring occasionally, until the greens are tender, 5 minutes. Season with salt and pepper, and top with shaved parmesan.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [], "title": "\nGarlicky Broccoli Rabe\n"}, {"directions": "\n\n              Preheat a grill to medium-high heat. In a medium bowl, stir the chopped tomatoes with 1 tablespoon olive oil, the vinegar, 1/2 teaspoon salt and 1/4 teaspoon pepper. Toss well and let stand to become juicy and soft while you make the pizza.\n            \n\n              Divide the dough into 2 pieces. Stretch each piece of dough into a large rectangle on a lightly floured work surface using your hands or a rolling pin, about 10-inches long by 6-inches wide. Transfer to the back of a large baking sheet using your hands and reshape the rectangle, if necessary. In a small bowl, mix the remaining 3 tablespoons oil with the grated garlic and lightly brush the top of each piece of dough.\n            \n\n              Working with one piece of dough at a time, place the dough, oiled-side down, on the grill until the dough puffs and the bottom is lightly charred with deep grill marks, 2 to 3 minutes. Flip the dough, using heatproof tongs and a spatula. Brush what is now the top of the pizza with half the oil and sprinkle with half the Parmesan. Grill until the cheese is melted and the pizza is crisped, about 2 minutes. Transfer to a large cutting board. Repeat with the second dough rectangle.\n            \n\n              Cut the grilled pizza into 2-inch wide strips and cut each in half crosswise. Mash the tomato mixture, using a potato masher, to form a chunky sauce and stir in the basil. Serve the flatbread strips with the tomato sauce on the side.\n            \n", "ingredients": [{"food": "tomatoes", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "vinegar", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "pizza rolls", "quantity": 1.0}, {"food": "potato flour", "quantity": 1}, {"food": "garlic powder", "quantity": 2.0}, {"food": "", "quantity": 0.5}, {"food": "basil", "quantity": 0.25}], "title": "\nGarlicky Grilled Flatbread Strips with Fresh Tomato Sauce\n"}, {"directions": "\n\n              Melt the butter in a medium saucepan over medium-low heat and add the minced garlic. Cook to infuse the garlic flavor into the butter and until the butter turns brown, about 15 minutes. Remove from the heat and strain.\n            \n\n              Lay out 4 slices of the bread on a work surface. Layer each with 1 slice of the cheese, some ham and then some of the cornichons. Top with 1 more slice of cheese. Close the sandwiches with the remaining bread and brush with butter until fully coated on both sides.\n            \n\n              Place 2 sandwiches into a medium skillet over medium heat. Cover the skillet with a lid and cook until the bread is evenly golden brown, about 2 minutes. Flip, cover again and cook until the bread is golden brown and the cheese is visibly melted, about 2 minutes more. Repeat with the remaining sandwiches. If desired, rub the outside of the toasted bread with the garlic halves to add a little more garlic flavor.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 4.0}, {"food": "garlic bread", "quantity": 2.0}, {"food": "garlic bread", "quantity": 0.8333333333333333}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "ham", "quantity": 4.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}], "title": "\nGarlicky Ham and Swiss\n"}, {"directions": "\n\n              Blend the tomatoes, peppers, mayonnaise, tarragon, garlic and 1/2 teaspoon salt in a blender until creamy and smooth. Refrigerate in an airtight container for up to 3 days.\n            \n", "ingredients": [{"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "mayonnaise dressing", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}], "title": "\nGarlicky Tomato-Pepper Dip\n"}, {"directions": "\n\n              Mix the sugar and salt in a shallow dish. Wet the rims of 4 to 6 rocks glasses with water and then dip in the sugar-salt mixture to coat.\n            \n\n              Combine the sports drink, limeade concentrate, tequila and blue curacao in a large pitcher and stir. Fill the rocks glasses with ice, pour the margarita over and garnish each with an orange slice.\n            \n", "ingredients": [{"food": "sugar", "quantity": 0.25}, {"food": "salt", "quantity": 0.25}, {"food": "meat drippings ", "quantity": 20.0}, {"food": "frozen yogurt", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 0.3333333333333333}, {"food": "luncheon slices", "quantity": 1}], "title": "\nGatorade Margarita\n"}, {"directions": "\n\n              On a cutting board, lightly sprinkle the garlic with a pinch of salt and smash it into a paste with the flat side of a large knife.\n            \n\n              Mix the smashed garlic, tomatoes, roughly chopped cucumbers, scallions, bell peppers, jalapenos, parsley and mint in a large bowl. Add salt and pepper to taste. Stir in the olive oil and sherry, and toss well.\n            \n\n              Add half of the vegetable mixture to a blender and pulse. Add half of the tomato juice and 2 ice cubes. Pour into a large bowl. Repeat with the remaining ingredients. Refrigerate for at least 1 hour for the flavors to come together.\n            \n\n              Divide among chilled soup bowls, drizzle with olive oil, garnish with cubed cucumbers if using and serve.\n            \n", "ingredients": [{"food": "garlic powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "tomatoes", "quantity": 1.5}, {"food": "", "quantity": 8.0}, {"food": "martha white foods", "quantity": 2.0}, {"food": "pepper", "quantity": 0.5}, {"food": "pasta with tomato sauce", "quantity": 0.25}, {"food": "parsley", "quantity": 0.25}, {"food": "", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "tomato juice", "quantity": 1.5}, {"food": "ice cream swich", "quantity": 4.0}, {"food": "cucumber", "quantity": 4.0}], "title": "\nGazpacho\n"}, {"directions": "\n\n              Preheat a grill to high. Soak the minced shallot in cold water, about 10 minutes. Meanwhile, mix 1 tablespoon lime juice, 2 tablespoons olive oil, and salt and pepper to taste in a shallow dish; add the chicken and turn to coat. Grill the chicken until golden and cooked through, about 3 minutes per side. Let cool, then slice. \n            \n\n              Crush half of the croutons; set aside. Soak the remaining croutons in 1/4 cup water, 5 minutes, then squeeze out the water and put in a blender. Drain the shallot and add to the blender along with half each of the diced tomatoes, cucumber and bell pepper. With the motor running, drizzle in the remaining 3 tablespoons plus 1 teaspoon olive oil. Add 2 cups ice and blend until smooth. Stir in half of the cilantro and the remaining lime juice; season with salt and pepper. \n            \n\n              Divide the soup among bowls. Top with the chicken, the remaining tomatoes, cucumber, bell pepper and cilantro and the crushed croutons. Drizzle with olive oil and serve with the lime wedges. \n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "", "quantity": 1.0}, {"food": "", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 1.25}, {"food": "croutons", "quantity": 0.5}, {"food": "diced chicken", "quantity": 3.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "", "quantity": 0.25}], "title": "\nGazpacho With Lime Chicken\n"}, {"directions": "\n\n              Combine 1 cup prosecco and the sugar in a small saucepan and bring to a boil, stirring until the sugar dissolves.\n            \n\n              Meanwhile, pour the remaining prosecco into a medium bowl. Sprinkle the gelatin on top and let stand 1 minute. Pour in the hot prosecco mixture and whisk until the gelatin dissolves. Skim off most of the foam. Divide the mixture among 6 champagne glasses and refrigerate until slightly set, about 1 hour. Push a peach slice into each one, then return the glasses to the refrigerator until the gelatin is fully set, about 3 more hours.\n            \n\n              Photograph by Jonathan Kantor\n            \n", "ingredients": [{"food": "", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "onion powder", "quantity": 2.25}, {"food": "silk peach soy yogurt", "quantity": 1.0}], "title": "\nGelatin Bellinis\n"}, {"directions": "\n\n              Put the milk, half-and-half, salt and whatever flavors you are steeping with in a medium saucepan. Heat to a gentle simmer, remove from the heat and let steep for 30 minutes.\n            \n\n              Whisk the sugar, vanilla and egg yolks in a medium bowl. Gradually strain in and whisk about half of the warm milk mixture into the eggs. Then, while whisking constantly, add the warmed eggs to the remaining milk mixture. \n            \n\n              Return to the heat and cook the gelato base, stirring constantly with a wooden spoon, until thick and it coats a spoon, about 10 minutes. Transfer the mixture into a bowl set over an ice bath to stop the cooking and bring down the temperature. \n            \n\n              Strain the mixture again through a fine strainer, pushing to extract all the liquid. Churn the gelato in a gelato/ice cream maker, following manufacturer's instructions. \n            \n\n              Fold in desired mix-ins once the gelato has finished spinning in the machine. Transfer to a container and freeze until solid and ready to serve. \n            \n", "ingredients": [{"food": "milk", "quantity": 1.5}, {"food": "", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "spices", "quantity": 1}, {"food": "sugar", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "egg substitute", "quantity": 6.0}, {"food": "mixed nuts", "quantity": 1}], "title": "\nGelato\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the pasta and cook as the label directs; add the beans during the last 2 minutes of cooking. Reserve 3/4 cup cooking water, then drain. Set the pot aside.\n            \n\n              Meanwhile, pierce the potatoes all over with a fork. Microwave until tender, about 5 minutes. Let cool slightly, then chop.\n            \n\n              Heat the olive oil in the reserved pot over medium-high heat. Add the potatoes, season with salt and pepper and cook, stirring occasionally, until lightly browned, about 5 minutes. Add the pasta and green beans and stir to coat. Remove from the heat and add the pesto, lemon zest and 1/4 cup reserved cooking water; toss to coat, adding more cooking water as needed to loosen. Season with salt and pepper. \n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "italian veg medley pasta", "quantity": 10.0}, {"food": "fava beans", "quantity": 8.0}, {"food": "sweet potatoes", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "pesto pasta primavera", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}], "title": "\nGemelli with Pesto, Potatoes and Green Beans\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: a deep-fry thermometer\n\n              Heat 2 tablespoons of the peanut oil in a medium saucepan over high heat. Stir in the chiles, scallions, garlic and orange zest and cook, stirring, until the garlic has turned golden and the chiles brighten, about 1 minute. Add the sugar, soy sauce, vinegar, sesame oil, ginger and 3 tablespoons water. Bring to a boil and cook until the sugar dissolves completely and the sauce become fragrant, 2 to 3 minutes.\n            \n\n              Stir 2 teaspoons cornstarch into 1/4 cup cold water in a small bowl or measuring cup. Whisk the mixture into the boiling sauce until thickened, about 1 minute. Remove from the heat and cover to keep warm.\n            \n\n              Fill a large Dutch oven halfway with peanut oil and heat over medium-high heat to 350 degrees F. Set a wire rack in a rimmed baking sheet and set aside. Beat the eggs in a large bowl with 1/2 teaspoon salt and a few grinds of pepper. Add the cauliflower florets to the bowl and toss with the egg mixture. Sprinkle in the remaining 3/4 cup cornstarch a little bit at a time until the cauliflower is well coated.\n            \n\n              Fry the cauliflower in 3 batches; gently place the cauliflower in the hot oil and cook, keeping the pieces separated and adjusting the heat as necessary to keep the oil temperature at 350 degrees F, until light brown and crisp, about 6 minutes. Remove the cauliflower with a spider or slotted spoon and set on the prepared wire rack to drain briefly. Transfer the cauliflower to a large bowl while it is still hot and toss with the sauce to evenly coat. Transfer to a serving plate and top with scallions. Serve with the rice and orange slices.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "sugar", "quantity": 0.25}, {"food": "soy sauce", "quantity": 3.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "ginger", "quantity": 0.25}, {"food": "cornstarch", "quantity": 2.75}, {"food": "eggs", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "barley flour or meal", "quantity": 1.0}, {"food": "crisped rice bar", "quantity": 1}], "title": "\nGeneral Tso's Cauliflower\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F.\n            \n\n              Toss the chicken in a bowl with the egg white and 1/2 teaspoon salt. Let sit covered for 10 minutes. Mix 2 teaspoons vegetable oil into the ground rice cereal, rubbing it in with your fingers. Dredge the chicken strips in the cereal. Place the coated strips in one layer on a rack set in a baking sheet and coat lightly with the nonstick cooking spray. Bake until the chicken has an internal temperature of 165 degrees F, about 20 minutes. Let rest for 5 minutes, then cut into large bite-size pieces.\n            \n\n              Heat the remaining teaspoon of oil in a small saucepan over medium heat. Add the garlic, ginger and dried chiles. Stir for a couple of minutes, then add the chicken broth, soy sauce, agave and vinegar. Mix the corn starch with 3 tablespoons water, and whisk into the sauce. Simmer gently for 8 to 10 minutes. The sauce should be thick, but pourable. Keep warm.\n            \n\n              Put the broccoli florets in a microwave-safe bowl with 2 tablespoons water. Cover loosely with plastic wrap and microwave until crisp-tender, about 3 minutes.\n            \n\n              Divide the chicken and broccoli evenly among four plates and drizzle the sauce over the top. Serve the rice on the side. Garnish with the sliced scallions.\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "crisped rice bar", "quantity": 2.5}, {"food": "", "quantity": 1}, {"food": "garlic powder", "quantity": 2.0}, {"food": "ginger", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 2.0}, {"food": "diced chicken", "quantity": 0.75}, {"food": "soy sauce", "quantity": 2.5}, {"food": "syrup", "quantity": 2.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "cornstarch", "quantity": 2.0}, {"food": "broccoli raab", "quantity": 4.0}, {"food": "crisped rice bar", "quantity": 4.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}], "title": "\nGeneral Tso's Chicken\n"}, {"directions": "\n\n              Whisk the egg white with 1 tablespoon each rice wine, soy sauce and cornstarch in a large bowl. Add the shrimp and toss; refrigerate until ready to fry. Whisk the chili sauce, the remaining 2 tablespoons each rice wine and soy sauce, 1 tablespoon cornstarch and 1 cup water in a bowl; set aside.\n            \n\n              Heat 2 tablespoons oil in a wok or large Dutch oven over medium-high heat. Add the broccolini; stir-fry until charred in spots, 3 minutes. Add 1/2 cup water and stir-fry until crisp-tender, 1 to 2 minutes; transfer to a plate. Reduce the heat to medium; add the remaining 1 tablespoon oil, the scallions, garlic and red pepper flakes. Stir-fry until tender, 2 minutes. Add the chili sauce mixture and cook, stirring occasionally, until thickened, 1 minute. Cover and set aside.\n            \n\n              Heat 1 inch of oil in a deep saucepan over medium-high heat until a deep-fry thermometer registers 365 degrees F. Working in batches, toss the shrimp in cornstarch to coat, then fry until crisp and golden, about 3 minutes. Remove with a slotted spoon and drain on paper towels.\n            \n\n              Return the wok to medium heat and reheat the sauce if needed. Add the broccolini and shrimp and cook, tossing, until warmed through, 2 minutes. (Add up to 1/2 cup water if the sauce is too thick.) Serve with the rice.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [{"food": "egg substitute", "quantity": 1.0}, {"food": "crisped rice bar", "quantity": 3.0}, {"food": "soy sauce", "quantity": 3.0}, {"food": "cornstarch", "quantity": 2.75}, {"food": "shrimp", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 0.3333333333333333}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "crisped rice bar", "quantity": 4.0}], "title": "\nGeneral Tso's Shrimp with Broccolini\n"}, {"directions": "\n\n              Toss 8 ounces green beans with olive oil, salt and pepper on a baking sheet. Quarter 1 pound small red-skinned potatoes; toss with olive oil, salt and pepper on a separate baking sheet. Roast at 425 degrees F until the vegetables are browned, 15 minutes for the green beans and 25 to 30 minutes for the potatoes; let cool. Cook 8 ounces gemelli as the label directs. Drain, then toss with 1/4 cup olive oil and the zest of 1 lemon; let cool. Add the beans and potatoes, the juice of 1/2 lemon, 1/2 cup chopped basil and 1/4 cup toasted pine nuts; toss. Top with shaved Parmesan.\n            \n\n              Photograph by Bobbi Lin\n            \n", "ingredients": [], "title": "\nGenovese Pasta Salad\n"}, {"directions": "\n\n              Toppings: Peach preserves mixed with yellow mustard, cubed ham and canned fried onions on cheesy skins\n            \n\n              How to Make Classic Potato Skins:\n            \n\n              Pierce 4 large russet potatoes with a fork. Bake directly on the oven rack at 350 degrees until tender, about 1 hour. Let cool, then quarter lengthwise and scoop out the flesh, leaving a 1/4-inch shell. Brush both sides with melted butter and season with salt and pepper. Bake, skin-side up, at 450 degrees until crisp, about 15 minutes. Add your favorite team toppings. (For cheesy skins, flip the baked shells over before topping, sprinkle with 1 cup grated cheddar cheese and bake an extra 5 minutes.)\n            \n\n              Photograph by Karl Juengel/Studio D\n            \n", "ingredients": [], "title": "\nGeorgia Peach Potato Skins\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: a pizza stone\n\n              For the dough: Lightly oil a medium bowl. Heat the milk with 1/2 cup water in a small saucepan over low heat to between 110 and 115 degrees F. Transfer it to a small bowl and stir in the sugar, then sprinkle over the yeast and let stand until foamy, 5 to 10 minutes. (Cover the bowl if the room or the yeast is cold.)\n            \n\n              Put a pizza stone on the lowest rack in your oven, removing the second rack if there is one. Preheat the oven to 500 degrees F. Cut two 10-by-7-inch pieces of parchment paper. \n            \n\n              Put the flour in a medium bowl and whisk in the salt. Make a well in the center and pour in the yeasty mixture and the oil. Stir with a wooden spoon until the flour is incorporated and the mixture forms a shaggy ball -- it will be soft and sticky. Flour your work surface, scrape the dough onto it and knead until smooth, elastic and still slightly sticky, about 5 minutes. Put the dough in the oiled bowl, turn it to coat with oil and cover the bowl loosely with plastic wrap. Set the bowl in a warm place until doubled in size, 1 hour to 1 hour and 15 minutes.  \n            \n\n              For the filling and topping: Work the mozzarella and feta together with a fork in a medium bowl. Make a little well in the center and add 1 egg. Beat the egg a bit with a fork, and mix and mash well to combine with the cheeses. \n            \n\n              Lightly flour your work surface. Turn the dough onto the floured surface and cut it in half. Round the halves gently back into rough rounds. Put 1 piece of parchment paper on your work surface and flour it lightly. Press and use a rolling pin to roll 1 piece of dough into a round 1/8-inch thick and 10-inches across. Slide it onto the paper -- it will hang over the long edges -- and then slide it, paper and all, onto the back of a baking sheet. (Alternatively, use a pizza peel.) Repeat with the other piece of dough, transferring it to the back of a second baking sheet. \n            \n\n              Spoon half of the cheese mixture on the first round, spreading some 1/2-inch from the edge and mounding the rest in the middle (there will be a big mound). Roll the sides up tightly to make a shape like a cheese-filled canoe -- it should be about 10 inches long and 4 inches wide. Pinch the ends together and twist to seal tightly. Repeat with the other piece of dough and remaining cheese. Let rest 10 minutes.\n            \n\n              Slide the khachapuris on their papers onto the pizza stone, leaving a few inches of space between them. Bake, turning them 180 degrees after about 8 minutes, until golden and crisp, about 12 minutes total. Crack 1 egg in each khachapuri and continue to bake until the white is just set around the edges, but some of the white and the yolk are still a bit raw, about 3 minutes. Remove to a serving platter, dot each khachapuri with 1 tablespoon butter and stir the eggs into the hot cheese¿they will continue to cook. Serve immediately, tearing off pieces of bread to scoop up the hot, buttery, eggy, gooey cheese.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "milk", "quantity": 0.25}, {"food": "sugar", "quantity": 1}, {"food": "yeast extract spread", "quantity": 1.0}, {"food": "potato flour", "quantity": 1.75}, {"food": "salt", "quantity": 1.25}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 8.0}, {"food": "eggs", "quantity": 3.0}, {"food": "butter oil", "quantity": 2.0}], "title": "\nGeorgian Cheese and Egg Bread (Adjaruli Khachapuri)\n"}, {"directions": "\nSpecial equipment: A pastry bag fitted with a star tip\n\n              For the cake: Preheat the oven to 350 degrees F. Lightly coat two 9-inch round cake pans with oil and dust with flour. Whisk together the flour, cocoa, baking soda and salt in a small bowl; set aside.\n            \n\n              Microwave the chocolate in a small microwave-safe bowl on high power for 45 seconds; remove and stir. Microwave again at high power in 30-second increments, stirring in between, until the chocolate has melted completely; set aside.\n            \n\n              Beat the granulated sugar, oil and eggs in a large bowl with an electric mixer on medium speed until smooth. Beat in the melted chocolate. Alternate beating in the flour mixture and the milk, adding the flour in three additions and the milk in two, starting and ending with the flour, until just incorporated. Add half the milk, and mix until just incorporated. Repeat with the remaining flour mixture and milk, making sure not to overmix. Divide the batter evenly between the prepared pans.\n            \n\n              Bake until a toothpick inserted in the center comes out with moist crumbs, 30 to 35 minutes. Let cool in the pans for 10 minutes, run a thin spatula around the edges and then turn the cakes out onto a cooling rack to cool completely. (They will have a sugary \"crust\" on the top. This is from the melted chocolate and is not a problem. It will soften once the cake is assembled or if the layers are baked the day before.)\n            \n\n              For the filling: While the cakes cool, spread the pecans on a baking sheet and bake, tossing once, until toasted, 8 to 10 minutes. Finely chop. Whisk together the milk and egg yolks in a medium saucepan until smooth. Add the brown sugar, butter, corn syrup, vanilla and salt, and cook over medium heat, stirring constantly, until the mixture has thickened and coats the back of a spoon, 5 to 6 minutes. (It will be similar to the thickness of eggnog.) Pour the mixture into a large bowl. (Don't worry if it seems thin. The coconut and nuts will bind it.) Stir in the coconut and pecans; set aside to cool.\n            \n\n              For the frosting: Put the chocolate in a medium bowl. Heat 1 cup of the cream in a small saucepan over medium heat until steaming but not boiling, and pour over the chocolate. Let stand a few minutes, and then whisk until smooth; let stand at room temperature (or put in the refrigerator if your kitchen is hot) until thick but not set, 20 minutes to 1 hour. Add the remaining 2 tablespoons cream to the chocolate mixture, and beat with an electric mixer on medium speed until lightened in color and fluffy, about 1 minute (do not overbeat, or it will become hard and grainy). The frosting should hold medium peaks and will continue to firm up a bit as it stands. Spoon about 1 cup frosting into a pastry bag fitted with a star tip.\n            \n\n              To assemble: Put one cake layer right-side up on a serving plate, and top with half the filling. Top with the second cake layer and the remaining filling, spreading it to about 1/2 inch from the edge. Frost the sides, and decorate around the top edge of the cake with the frosting in the pastry bag.\n            \n\n              Loosely cover the cake with plastic wrap and leave at room temperature overnight. Unwrap and serve.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "potato flour", "quantity": 2.5}, {"food": "onion powder", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 4.0}, {"food": "sugar", "quantity": 2.0}, {"food": "eggs", "quantity": 3.0}, {"food": "milk", "quantity": 1.0}, {"food": "pecans", "quantity": 1.5}, {"food": "milk", "quantity": 1.0}, {"food": "egg substitute", "quantity": 3.0}, {"food": "sugar", "quantity": 0.75}, {"food": "butter oil", "quantity": 4.0}, {"food": "corn bran", "quantity": 0.25}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "salt", "quantity": 0.25}, {"food": "coconut water", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 8.0}, {"food": "ice cream swich", "quantity": 1.0}], "title": "\nGerman Chocolate Cake\n"}, {"directions": "\n\n              Position a rack in the center of the oven and preheat to 350 degrees. Lightly grease a 13-by-18-inch jelly-roll pan; line with parchment paper, letting it come up the short sides by about 2 inches. Brush the paper with oil or melted butter and lightly dust with flour. \n            \n\n              For the filling, whisk the evaporated milk, 1 cup sugar, 3 egg yolks and the cubed butter in a saucepan over medium heat. Cook, stirring constantly, until thick and creamy, about 10 minutes. Remove from the heat; stir in 1 teaspoon vanilla, the coconut and pecans. Set aside to cool completely, stirring occasionally. \n            \n\n              Meanwhile, whisk the flour, baking soda and salt in a medium bowl. Whisk the cocoa and chocolate in another bowl. Add the hot coffee to the cocoa mixture, stirring until smooth; stir in the buttermilk and the remaining 2 teaspoons vanilla. \n            \n\n              Using a mixer, beat the softened butter and the remaining 1 1/4 cups sugar in a large bowl on high speed until fluffy, about 4 minutes. Reduce the speed to low; add the 3 whole eggs, 1 at a time, incorporating each before adding the next. Add the flour mixture in 3 parts, alternating with the cocoa mixture in 2 parts, beginning and ending with the flour. Beat until just blended; if necessary, fold the batter together with a rubber spatula. \n            \n\n              Spread the batter evenly in the prepared pan. Bake until the cake springs back when pressed lightly, about 16 minutes. Cool slightly in the pan. \n            \n\n              Run a knife around the edge and slide the cake with its paper onto a work surface. Spread the coconut filling evenly over the cake. Roll the cake from one of the short ends, pulling it away from the parchment into a tight cylinder; transfer to a platter. Cool completely and dust with the confectioners' sugar or cocoa.\n            \n", "ingredients": [{"food": "milk", "quantity": 1.0}, {"food": "sugar", "quantity": 2.25}, {"food": "egg substitute", "quantity": 3.0}, {"food": "", "quantity": 1.25}, {"food": "vanilla extract", "quantity": 3.0}, {"food": "coconut water", "quantity": 1.6666666666666665}, {"food": "pecans", "quantity": 1.0}, {"food": "potato flour", "quantity": 1.25}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "onion powder", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "hot pockets ham cheese stuffed swich", "quantity": 0.3333333333333333}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.3333333333333333}, {"food": "sugar", "quantity": 1}], "title": "\nGerman Chocolate Cake Roll\n"}, {"directions": "\n\n              Position racks in the middle and lower third of the oven; preheat to 350 degrees F. Make the crust: Wrap the outside (bottom and side) of a 9-inch springform pan with foil. Coat the inside of the pan with cooking spray and line the bottom with parchment paper. Pulse the graham crackers, butter, sugar and salt in a food processor until fine moist crumbs form, about 1 minute. Press evenly into the bottom and 1/4 inch up the side of the prepared pan. Bake until set, about 15 minutes; transfer to a rack and let cool completely.\n            \n\n              Make the topping: Line 2 baking sheets with foil. Spread the coconut on one and the pecans on the other. Bake, stirring the coconut once or twice, until the coconut and pecans are toasted, 12 to 15 minutes; let cool. Pulse the pecans in the food processer until coarsely chopped; transfer to a small bowl. Combine the butter, egg yolks, sugar, evaporated milk, vanilla and salt in a large saucepan. Bring to a simmer over medium heat and cook, stirring constantly, until the mixture reduces and caramelizes slightly, about 10 minutes. Stir in the chopped pecans and 1 1/2 cups coconut (reserve the remaining coconut for topping). Set aside to cool.\n            \n\n              Make the cheesecake: Fill a roasting pan halfway with water and set on the lower oven rack. Put the chocolate in a microwave-safe bowl and microwave in 30-second intervals, stirring after each, until melted; let cool to lukewarm. Wipe out the food processor; add the cream cheese, sugar, eggs, cocoa powder and salt and pulse until smooth, about 2 minutes, scraping down the sides. Add the melted chocolate, sour cream and vanilla; pulse until combined.\n            \n\n              Transfer about half of the batter to the prepared crust; smooth with a spatula. Spoon about two-thirds of the topping evenly over the batter. Top with the remaining batter; smooth the top. Set on the middle oven rack (directly over the pan of water) and bake until set around the edge but the center still jiggles slightly, 1 hour to 1 hour 15 minutes. Transfer to a rack and let cool to room temperature, then cover and refrigerate until cold and set, at least 8 hours or overnight.\n            \n\n              Run a thin knife around the edge of the cheesecake and remove the springform ring. Microwave the remaining topping to soften, about 30 seconds (stir in 1 to 2 tablespoons water to loosen, if necessary). Spread on top of the cheesecake; top with the reserved coconut.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "baking chocolate", "quantity": 9.0}, {"food": "butter oil", "quantity": 6.0}, {"food": "sugar", "quantity": 2.0}, {"food": "salt", "quantity": 0.25}, {"food": "dessert topping", "quantity": 1}, {"food": "coconut water", "quantity": 1.0}, {"food": "pecans", "quantity": 1.5}, {"food": "butter oil", "quantity": 1.5}, {"food": "egg substitute", "quantity": 4.0}, {"food": "sugar", "quantity": 1.3333333333333333}, {"food": "milk", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "cheesecake mix", "quantity": 1}, {"food": "baking chocolate", "quantity": 8.0}, {"food": "macaroni cheese", "quantity": 3.0}, {"food": "sugar", "quantity": 1.0}, {"food": "eggs", "quantity": 3.0}, {"food": "onion powder", "quantity": 0.25}, {"food": "salt", "quantity": 0.5}, {"food": "sour cream", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}], "title": "\nGerman Chocolate Cheesecake\n"}, {"directions": "\n\n              Position an oven rack in the center of the oven, and preheat to 325 degrees F. Whisk together the butter, brown sugar, maple syrup, vanilla and salt in a large bowl. Add the oats, and toss until evenly coated. Spread out on a rimmed baking sheet.\n            \n\n              Bake the oat mixture until golden and toasted, 30 to 35 minutes, stirring about halfway through. Let cool completely on the baking sheet. Stir in the coconut, pecans and chocolate chips. (The granola can be stored in an airtight container at room temperature for up to 5 days.)\n            \n", "ingredients": [{"food": "butter oil", "quantity": 4.0}, {"food": "sugar", "quantity": 3.0}, {"food": "syrup", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "oats", "quantity": 1.75}, {"food": "coconut water", "quantity": 1.0}, {"food": "pecans", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}], "title": "\nGerman Chocolate Granola\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. \n            \n\n              In a medium bowl, whisk together the eggs, salt, sugar, milk, vanilla, and butter. Whisk in the flour to make a smooth batter. Set aside. \n            \n\n              Heat a well-seasoned 10-inch cast-iron skillet in the oven for 10 minutes. Remove and brush the inside with the shortening. Pour in the batter and bake for 15 minutes. \n            \n\n              Lower the oven to 350 degrees F. and continue baking until puffed and golden brown, about 13 to 15 minutes more. Run a knife around the edge of the skillet. Sift the confectioners' sugar over the pancake. Serve immediately in the skillet with maple syrup, marinated berries, or glazed apples and pears.\n            \n\nMarinated Berries:\n\n\n              In a small saucepan, combine the sugar, vanilla bean and seeds, citrus zests, and water. Bring to a boil and then reduce the heat to low. Simmer very gently until syrupy, about 25 minutes. Remove from the heat and add the citrus juices. Combine the berries in a bowl. Strain the warm syrup over the berries and marinate at room temperature for 30 minutes. Serve. \n            \n\nGlazed Apples and Pears Compote:\n\n\n              Peel, core, and cut both the apples and pears into 3/4-inch wedges. In a medium bowl, toss the fruit with the lemon juice. \n            \n\n              Melt the butter in a medium skillet over medium heat. Add the sugar, orange zest, and cinnamon sticks and stir until sugar is dissolved. Add the fruit, increase the heat to medium-high, and cook, shaking the pan frequently, until glazed, about 10 minutes. Raise the heat to high, add the orange juice, and cook until the fruit is easily pierced with a paring knife, about 1 minute more. If desired, add the Calvados. If cooking on a gas burner, carefully tip the pan toward the flame to flambe the alcohol; if cooking over an electric element, hold a long match near the mixture. Swirl the pan over the heat until the flame subsides. Serve warm. \n            \n", "ingredients": [{"food": "eggs", "quantity": 3.0}, {"food": "salt", "quantity": 0.5}, {"food": "sugar", "quantity": 3.0}, {"food": "milk", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "sugar", "quantity": 1}, {"food": "barley flour or meal", "quantity": 1}, {"food": "syrup", "quantity": 1}, {"food": "sugar", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "", "quantity": 0.5}, {"food": "coconut water", "quantity": 1.0}, {"food": "orange juice", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "raspberries", "quantity": 0.5}, {"food": "blueberries", "quantity": 0.5}, {"food": "strawberries", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 3.0}, {"food": "prickly pears", "quantity": 3.0}, {"food": "", "quantity": 1.0}, {"food": "butter oil", "quantity": 0.25}, {"food": "grape juice", "quantity": 2.0}, {"food": "cinnamon", "quantity": 3.0}, {"food": "barley flour or meal", "quantity": 2.0}], "title": "\nGerman Pancake\n"}, {"directions": "\n\n              Simmer 1 1/2 pounds diced red potatoes in salted water until tender; drain. Cook 4 slices chopped bacon until crisp; drain, reserving 2 tablespoons drippings. Add 1 bunch chopped scallions; saute. Whisk in 1/4 cup water, 2 tablespoons white wine vinegar and 2 teaspoons each dijon mustard and sugar; bring to a simmer. Toss in 1/4 cup each chopped parsley and cornichons, the potatoes and bacon; season with salt and pepper.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [], "title": "\nGerman Potato Salad\n"}, {"directions": "\n\n              In a large saucepan, place the potatoes and cover with cold water by 1 inch. Stir in 2 tablespoons salt. Bring to a boil, lower the heat, and simmer until just tender, about 30 minutes. Drain, transfer to a large bowl, and cover with plastic wrap to keep warm.\n            \n\n              Meanwhile in a small saucepan, over medium-high heat, add the bacon and cook, stirring frequently, until crispy and its fat has been released, about 3 minutes. Lower the heat to medium, add the onion and cook, stirring, until translucent, about 6 minutes. Stir in the flour and cook for 45 seconds more. Add the remaining 2 teaspoons salt, broth, vinegar, mustard, and sugar. Bring to a boil while whisking constantly. Remove from the heat.\n            \n\n              Using your hands, rub the skins off the potatoes. Cut the potatoes in half lengthwise, then cut crosswise into 1/4-inch slices. Return the potatoes to the large bowl. Pour over the vinegar mixture and toss to coat the potatoes. Toss in the parsley and season with pepper to taste. Transfer to a serving platter and serve immediately.\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 4.0}, {"food": "salt", "quantity": 2.0}, {"food": "bacon", "quantity": 3.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "potato flour", "quantity": 1.0}, {"food": "diced chicken", "quantity": 0.75}, {"food": "vinegar", "quantity": 0.3333333333333333}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "sugar", "quantity": 1.5}, {"food": "black bean mango", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 2.0}], "title": "\nGerman-Style Potato Salad\n"}, {"directions": "\n\n              Melt the shortening in a small saucepan over medium heat. Set aside to cool slightly but still liquid. \n            \n\n              In a standing mixer fitted with the paddle attachment, beat the sugar and shortening together on medium speed, until just combined. Add the eggs, one at a time, beating well after each addition. Add the milk and vanilla, and continue beating until the mixture is light, about 2 minutes. \n            \n\n              Meanwhile, sift the flour, baking powder, nutmeg, mace, and salt into a medium bowl. \n            \n\n              Reduce the mixer's speed to low, add the flour mixture until just combined. (The texture of the dough will be soft and loose.) Transfer the dough to a large piece of plastic wrap and wrap it well. (Make sure you scrap off all the dough clinging to the paddle.) Refrigerate the dough for 4 hours or overnight. \n            \n\n              On a lightly floured work surface, roll the chilled dough out into a rectangle about 1/2-inch thick. Dip the edges of a 2 1/2-inch-round doughnut cutter in flour and cut the dough into doughnuts. Place the doughnuts and holes on a baking sheet lined with parchment. \n            \n\n              Put enough vegetable shortening into a tall, heavy-bottomed pot to fill it about a third of the way up. Heat the shortening over medium heat until a deep-fry thermometer inserted in the oil registers 375 degrees F. Line a baking sheet with paper towels. \n            \n\n              Working in batches, fry the doughnuts and holes, turning once, until they are golden brown, about 2 to 3 minutes. Using a slotted spoon, transfer the doughnuts to the paper towels to drain and cool. Repeat until all the doughnuts and holes are fried. (Make sure the shortening returns to 375 degrees F. between batches.) \n            \n\n              For sugared doughnuts, roll the doughnuts in sugar or cinnamon sugar while they are still warm. To cover the doughnuts with confectioners' sugar, allow them to cool completely before rolling in the sugar. \n            \n", "ingredients": [{"food": "shortening frying ", "quantity": 0.25}, {"food": "sugar", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "milk", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "potato flour", "quantity": 4.0}, {"food": "baking chocolate", "quantity": 4.0}, {"food": "nutmeg", "quantity": 1.5}, {"food": "mace", "quantity": 0.25}, {"food": "salt", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}], "title": "\nGerry's Doughnuts\n"}, {"directions": "\n\n              Preheat the oven to 200 degrees F. Line a baking sheet with parchment paper. Beat the egg whites and cream of tartar in a large bowl with a mixer on medium speed until frothy. Beat in the sugar; increase the mixer speed to high and beat until stiff peaks form, 5 to 6 minutes.\n            \n\n              Transfer to a pastry bag fitted with a large round tip. Pipe 8 to 10 swirls on the prepared baking sheet. Bake until dry, 1 hour to 1 hour, 15 minutes. Transfer the baking sheet to a rack and let cool completely.\n            \n\n              Put the chocolate chips in a microwave-safe bowl; microwave on 50 percent power until melted, about 1 minute, stirring halfway. Transfer the melted chocolate to a zip-top bag and snip a corner. Pipe the chocolate on the meringues to look like eyes.\n            \n\n              Photograph by Raymond Hom\n            \n", "ingredients": [{"food": "egg substitute", "quantity": 3.0}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "sugar", "quantity": 0.75}, {"food": "baking chocolate", "quantity": 0.5}], "title": "\nGhastly Meringues\n"}, {"directions": "\nSpecial equipment: one 2 1/2- to 3-inch metal ghost-shaped cookie cutter\n\n              Preheat the oven to 400 degrees F. Trim the hard crusts from both ends of the loaf of bread. Slice the remaining loaf into 1/2- to 3/4-inch slices; you will have between 14 and 16 slices. Using the cookie cutter, cut 1 to 2 ghosts from each slice of bread, depending on the size. Reserve the scraps for making fresh breadcrumbs, stuffing or bread pudding.\n            \n\n              Lay the ghosts on a rimmed baking sheet and lightly brush with 1 tablespoon of the olive oil. Season all the slices with 1/4 teaspoon salt and 1/4 teaspoon pepper. Bake in the oven until toasted, flipping halfway, 10 to 12 minutes. Set aside to cool. \n            \n\n              While the bread toasts, put the olives, parsley, sundried tomatoes, flavored oil, capers, remaining 1/4 cup olive oil, 2 tablespoons water and 1/4 teaspoon pepper in the bowl of a food processor. Pulse until chunky and then process until mostly smooth. Add the lemon juice and pulse a few times to incorporate. \n            \n\n              Serve with the ghostinis on the side plus additional grissini breadsticks and/or flatbread crackers.\n            \n", "ingredients": [{"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "barbecue loaf", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "black bean mango", "quantity": 1}, {"food": "olives", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "crackers", "quantity": 1}], "title": "\nGhostinis with Bloody Murder Sundried Tomato Tapenade\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F.\n            \n\n              Line a 12-cup muffin pan with paper liners. Whisk together the flour, baking powder and salt in a bowl. Beat the butter and sugar in a bowl with an electric mixer on medium-high speed until fluffy, about 4 minutes. Beat in the eggs, one at a time, scraping down the bowl as needed. Beat in the vanilla. Reduce the mixer speed to medium-low; beat in half of the flour mixture, then all of the milk, then the remaining flour mixture until just combined.\n            \n\n              Divide the batter among the muffin cups, filling each three-quarters full. Bake, rotating the pan halfway through, until a toothpick inserted into the center of a cupcake comes out clean, 18 to 20 minutes. Transfer the pan to a rack and let cool 5 minutes, then remove the cupcakes to the rack to cool completely. Using a serrated knife, trim off the tops of the cupcakes so that they are flat.\n            \n\n              Place the dark chocolate and white chocolate chips in two separate bowls. Add 4 teaspoons coconut oil to the dark chocolate and the remaining 1 1/2 teaspoons coconut oil to the white chocolate. Melt each bowl of chocolate in the microwave at medium power, stirring every 30 seconds, until just liquid and smooth.\n            \n\n              Working with one cupcake a time, spoon 1 heaping tablespoon of the dark chocolate on top, spreading it evenly over the top with the back of the spoon. While the dark chocolate is still liquid, spoon 1 teaspoon of the white chocolate in the center of the cupcake. Drag a toothpick or skewer through the center of the white chocolate outward to form a \"tail.\" Repeat with the remaining cupcakes. \n            \n\n              Rewarm the dark chocolate until liquid again, if necessary. Scrape the chocolate into a resealable plastic bag, snip off one corner and pipe small dots of dark chocolate on the white chocolate ghosts to form 2 eyes. Pipe a third dot twice as big to form a mouth. Let the chocolate set for 10 minutes before serving.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 1.25}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "whole milk", "quantity": 0.6666666666666666}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "vegetable oil", "quantity": 5.5}], "title": "\nGhostly Cupcakes\n"}, {"directions": "\n\n              For pudding: Put 1 tablespoon of cold water in a large bowl. Sprinkle gelatin over the surface, do not stir, and set aside until gelatins softens and blooms\n            \n\n              Bring a few inches of water to a boil in a saucepan that can hold a stand mixer's bowl above the water. Whisk milk, sugar, yolks, cinnamon and salt in a heat-proof bowl. Set the bowl above the boiling water and cook, stirring constantly with a heat-proof spatula, until mixture begins to thicken and coats the back of a spoon and almost boils, 10 to 12 minutes. Immediately remove from the heat and pour over the gelatin, whisking constantly until gelatin is completely dissolved and evenly distributed. Whisk in pumpkin until combined and completely smooth.\n            \n\n              Evenly divide mixture into 12 small 3-ounce cups (paper works fine) and refrigerate until set, about 4 to 8 hours.\n            \n\n              For topping: Bring a few inches of water to a boil in a saucepan that can hold a stand mixer's bowl above the water. Whisk the 2 egg whites, sugar, cream of tarter, and salt in the bowl by hand. Set the bowl above the boiling water and continue whisking until the mixture is hot to the touch and the sugar dissolves, about 1 to 2 minutes. Transfer bowl to mixer and beat with the whisk attachment at medium-high speed until eggs hold a stiff peak, about 5 minutes.\n            \n\n              Spoon topping onto puddings in the shape of a ghost. Decorate with candy eyes and refrigerate until ready to serve.\n            \n", "ingredients": [{"food": "", "quantity": 1.0}, {"food": "whole milk", "quantity": 2.0}, {"food": "sugar", "quantity": 1.0}, {"food": "egg substitute", "quantity": 6.0}, {"food": "cinnamon", "quantity": 0.25}, {"food": "salt", "quantity": 0.25}, {"food": "pumpkin flowers", "quantity": 1.0}, {"food": "egg substitute", "quantity": 2.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "salt", "quantity": 1.0}, {"food": "", "quantity": 1}], "title": "\nGhostly Pumpkin Pudding\n"}, {"directions": "\nSpecial equipment: 12 cup standard muffin tin\n\n              Preheat the oven to 350 degrees F. Line standard muffin tins with cupcake liners or spray footed cupcake holders with nonstick spray. \n            \n\n              Put the butter, root beer, and cocoa in a microwave-safe bowl, cover with plastic wrap, and microwave on HIGH until the butter melts, about 2 minutes. Whisk to combine. \n            \n\n              Meanwhile, whisk the flour, sugar, baking powder, baking soda, and salt together in a large bowl. Whisk the sour cream, eggs, and vanilla together in a small bowl.\n            \n\n              Whisk the hot cocoa mixture into the dry ingredients. Stir in the sour cream mixture just to combine; take care not to overmix. Divide the batter evenly between the prepared muffin cups, filling each one about 3/4 of the way full, about 1/4 cup per cupcake. Bake cupcakes until a toothpick inserted in the center of the cake comes out clean, about 25 minutes. Cool the cupcakes completely in the tin on a rack. Remove from liners and return cakes to a rack. \n            \n\n              For Frosting: Bring a few inches of water to a boil in a saucepan that can hold a mixer's bowl above the water. Whisk the egg whites, sugar, cream of tartar, and salt in the bowl by hand. Set the bowl above the boiling water and continue whisking until the mixture is hot to the touch and the sugar dissolves, about 1 to 2 minutes. Transfer the mixture to a standing mixer fitted with the whisk attachment and beat at medium-high speed until eggs beat up into a cool stiff meringue, about 5 minutes. Add a few drops of desired extract and/or food coloring and lightly beat into the meringue. \n            \n\n              To decorate: Using a spoon, offset spatula or piping bag, dollop, spread or pipe about 1/2 cup meringue on top of each cupcake to make a ghost or monster of your choice. Decorate with candied eyeballs or other candies. These can be finished 2 to 3 hours in advance and held at room temperature. \n            \n", "ingredients": [{"food": "butter oil", "quantity": 0.75}, {"food": "lotus root", "quantity": 0.5}, {"food": "cocoa mix", "quantity": 0.3333333333333333}, {"food": "potato flour", "quantity": 1.25}, {"food": "sugar", "quantity": 1.25}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 0.25}, {"food": "sour cream", "quantity": 0.25}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "egg substitute", "quantity": 8.0}, {"food": "sugar", "quantity": 1.5}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "salt", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 1}], "title": "\nGhouly Cupcakes\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: a 10-inch springform pan and a pizza cutter\n\n              For the dough: Warm the milk and 1/2 cup of water in a small saucepan over low heat until a thermometer registers 100 to 110 degrees F. Remove from the heat and sprinkle the yeast and a pinch of granulated sugar over top. Set aside undisturbed until foamy, about 5 minutes.\n            \n\n              Whisk together the salt, 2 3/4 cups flour and remaining granulated sugar in a large bowl. Generously butter a 10-inch springform pan.\n            \n\n              Combine the melted butter, vanilla and egg yolk in the bowl of an electric mixer fitted with a paddle attachment and mix on low until combined. Add the yeast mixture and continue to mix on low until combined. Add the flour mixture and mix on low until a thick and slightly sticky dough forms. Once the dough comes together, switch to the dough hook and knead on medium speed, adding up to 1/4 cup more flour if needed, to make a soft, smooth ball that sticks to the hook, 3 to 4 minutes.\n            \n\n              Coat a large bowl generously with cooking spray. Add the dough, turning to coat. Cover with plastic wrap and let rise at room temperature until the dough is doubled in size, about 1 hour.\n            \n\n              For the filling: Meanwhile, heat a large skillet over medium-high heat. Add the butter and cook, swirling, until melted. Add the diced apples and cook, stirring occasionally, until tender, about 8 minutes. Turn off the heat and stir in the apple butter. Transfer to a medium bowl to cool completely.\n            \n\n              When the dough is ready, punch it down and turn out onto a lightly floured surface. Knead a few times, then roll into a rectangle 12 inches by 18 inches, keeping the longer side closest to you. Spread the cooled apple filling evenly all over the dough. Sprinkle with the granulated sugar. Use a pizza cutter to cut the dough crosswise into 1-inch strips. Starting on the left side, roll 1 strip up jelly roll style. When you get to the end, press another strip to the first one and continue rolling. Repeat this with 2 more strips. Carefully transfer the rolled dough to the center of the prepared pan. The spiral should be facing up. Continue coiling the remaining strips of dough filling-side in around the middle roll until the pan is filled. This might get messy, but that's part of the fun. Loosely cover the pan with plastic wrap and let rise until doubled in size, about 30 minutes.\n            \n\n              Position an oven rack in the center of the oven and preheat to 350 degrees F. Bake until the cinnamon roll is puffed and golden brown, about 50 minutes. Let cool on a rack for 10 minutes.\n            \n\n              For the glaze: Meanwhile, microwave the cream cheese in a microwave-safe bowl until softened, 10 to 15 seconds. Add the confectioners' sugar and milk and whisk until smooth.\n            \n\n              Remove the outer ring from the springform pan. Pour the glaze on top of the cinnamon roll, then use a spatula to spread it all over. Cut into 8 to 10 wedges.\n            \n", "ingredients": [{"food": "whole milk", "quantity": 0.5}, {"food": "yeast extract spread", "quantity": 0.25}, {"food": "sugar", "quantity": 0.25}, {"food": "salt", "quantity": 0.75}, {"food": "potato flour", "quantity": 2.75}, {"food": "butter oil", "quantity": 4.5}, {"food": "vanilla extract", "quantity": 1.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "healthy request microwavable bowl", "quantity": 1}, {"food": "butter oil", "quantity": 8.0}, {"food": "apples", "quantity": 2.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "sugar", "quantity": 0.75}, {"food": "whole milk", "quantity": 2.0}], "title": "\nGiant Apple Cinnamon Roll\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Line a baking sheet with parchment paper.\n            \n\n              Melt the butter in a small skillet over medium heat. Add the walnuts and cook, tossing occasionally, until lightly toasted, 1 to 2 minutes. Add the thyme, season lightly with salt and toss. Stir in the brandy and remove from the heat. Transfer to a small bowl and stir in the dried apricots and preserves. Let cool to room temperature.\n            \n\n              Place the Brie on the center of the prepared baking sheet and cut off the rind on top. Spread the apricot compote evenly over the top of the Brie.\n            \n\n              Unroll the puff pastry sheets on a floured work surface. Brush a 2-inch strip down the long edge of one sheet with the egg and line up the second sheet with the first, overlapping the edge brushed with egg so that the two stick together. Flour the pastry well and roll with a floured rolling pin to make a 14-inch square. Trim the corners from the pastry to make a circle (you want to make the largest circle possible). Reserve the trimmings. Transfer the pastry to the baking sheet and cover the Brie. Tuck the edges underneath the Brie.\n            \n\n              Reroll the pastry scraps and cut out five or six 2-inch leaf shapes, then score them with the back of a butter knife to create simple veins in the leaf. Brush the pastry-wrapped Brie with the egg. Arrange the leaves decoratively on top of the Brie and brush with the egg.\n            \n\n              Bake the brie until the pastry is puffed and deep golden, about 40 minutes. Let stand about 20 minutes before serving with apple and pear slices and crackers.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.0}, {"food": "walnuts", "quantity": 1.0}, {"food": "thyme", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "apple", "quantity": 2.0}, {"food": "hearts of palm", "quantity": 2.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "apricot nectar", "quantity": 0.5}, {"food": "puff pastry", "quantity": 17.0}, {"food": "potato flour", "quantity": 1}, {"food": "egg substitute", "quantity": 1.0}, {"food": "crackers", "quantity": 1}], "title": "\nGiant Baked Brie with Apricots and Walnuts\n"}, {"directions": "\n\n              For the batter: Preheat the oven to 375 degrees F. Line a 12-inch deep dish pizza pan or 10-inch cast-iron skillet with aluminum foil and spray with nonstick cooking spray.\n            \n\n              Whisk the flour, oatmeal, baking soda, salt and cinnamon together in a medium bowl and set aside. Beat the butter, brown sugar and granulated sugar with an electric mixer on medium-high speed in a large bowl until well combined, about 2 minutes. Add the vanilla and eggs and beat until light in color, 2 to 3 minutes. Add the flour mixture and mix on low speed until well incorporated. Fold in the chocolate chips by hand using a rubber spatula.\n            \n\n              Press the dough into the prepared pan and arrange 12 to 15 peanut butter cups on the top, pressing flush into the dough. Bake until deep golden brown and set, 20 to 25 minutes for the pizza pan or 30 to 35 minutes for the skillet. Cool in the pan 10 minutes. If removing from the pan, invert the cookie onto a large plate and remove foil, then upright onto a cutting board.\n            \n\n              For the frosting: Beat the butter with the confectioners' sugar, milk and vanilla extract until firm enough to pipe. Transfer to a piping bag fitted with a round or star tip. When the cookie has cooled, drizzle with melted chocolate if using, then decorate as desired with the frosting and finish with sprinkles.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 2.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "salt", "quantity": 0.5}, {"food": "cinnamon", "quantity": 0.125}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "eggs", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "peanut butter ", "quantity": 12.0}, {"food": "butter oil", "quantity": 6.0}, {"food": "sugar", "quantity": 1.0}, {"food": "milk", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1}], "title": "\nGiant Chocolate Chip Party Cookie\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: a 2-quart ramekin/souffle dish\n\n              Preheat the oven to 350 degrees F. Butter and lightly flour a 2-quart ramekin/souffle dish. Tap out the excess flour. Put the ramekin on a baking sheet.\n            \n\n              Combine the butter and chocolate in a large microwave-safe bowl. Microwave in 30-second intervals, stirring in between, until the mixture is melted and well combined. \n            \n\n              Combine the granulated sugar, salt and eggs in a large bowl and beat on high speed with an electric mixer until thick and pale, 1 to 2 minutes. Add the chocolate mixture and flour to the egg mixture and fold with a rubber spatula until well combined. \n            \n\n              Pour 2 1/2 cups of the batter into the ramekin and stack the ice cream bars on top of each other in the middle. Pour the remaining batter around the sides and over the top of the ice cream bars. \n            \n\n              Bake until the cake is set and the center is still jiggly, about 45 minutes. Let the cake cool in the ramekin for 15 minutes. Dust with confectioners' sugar.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 2.0}, {"food": "potato flour", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 10.0}, {"food": "sugar", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "eggs", "quantity": 6.0}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "sugar", "quantity": 1}], "title": "\nGiant Chocolate Lava Cake\n"}, {"directions": "\nSpecial equipment: a 10-inch heat-safe bowl, a candy thermometer and a 9-inch springform cake pan\n\n              For the marshmallow: Line a 10-inch heat-safe bowl with a large piece of plastic wrap, leaving a 5 inch overhang. Coat the plastic wrap with cooking spray and then add a large scoop of confectioners' sugar. Pat and rotate the bowl on an angle so that the plastic wrap is coated in sugar. Tap out any excess and set aside.\n            \n\n              Stir together the gelatin and 1/2 cup cold water in the bowl of stand mixer fitted with a whisk attachment. \n            \n\n              Combine the granulated sugar, corn syrup, 1/2 cup water and salt in a small saucepan and cook over medium-low heat, stirring occasionally, until the sugar completely dissolves. (If any granules of sugar stick to the side of the pan, brush them back into the sugar-water mixture with a wet pastry brush.) Attach a candy thermometer to the pan and increase the heat to medium-high. Cook until the mixture reaches 240 degrees F. \n            \n\n              With the mixer on low speed, slowly pour the sugar syrup into the softened gelatin. Once all the syrup is added, increase the speed to high and beat until the mixture is very thick and holds soft peaks, about 15 minutes. Beat in the vanilla.\n            \n\n              Coat a rubber spatula with cooking spray and scrape the marshmallow into the prepared bowl. Smooth out the top and dust with confectioners' sugar. Let sit at room temperature until the marshmallow is completely cool and set, about 1 hour. \n            \n\n              Meanwhile, for the crust: Preheat the oven to 375 degrees F. Coat the inside of an 9-inch springform pan with cooking spray.\n            \n\n              Pulse the graham crackers, flour, baking powder and salt in a food processor until finely crushed. Add the butter and eggs and pulse until the mixture clumps together. Press into the prepared pan and bake until golden and no longer shiny, 15 to 20 minutes. Let cool completely. Unlock and remove the side of the pan.\n            \n\n              For the chocolate coating: Microwave the chocolate and coconut oil together in a medium microwave-safe bowl in 30-second increments, stirring after each, until the chocolate is smooth. Let cool at room temperature until the mixture coats a spoon and drips off slowly. \n            \n\n              Build the cookie: Line a baking sheet with a wire rack. Place the crust on the rack and pour about 1/3 cup of the chocolate coating onto the center of the crust. Using an offset spatula, spread the chocolate to the edges of the crust ensuring that the chocolate drips and coats the sides of the crust evenly. Use the sides of the plastic wrap to remove the marshmallow and invert onto the crust. \n            \n\n              Pour the remaining chocolate coating all over the top of the cookie and let it drip to coat completely. Let sit at room temperature until the coating is hard and set, about 30 minutes. \n            \n\n              Transfer to a cake stand or serving platter. Coat a knife with cooking spray and slice (this will help keep the marshmallow from sticking to the knife). \n            \n", "ingredients": [{"food": "healthy request microwavable bowl", "quantity": 1}, {"food": "sugar", "quantity": 1}, {"food": "", "quantity": 0.25}, {"food": "sugar", "quantity": 1.5}, {"food": "silk light vanilla", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "pan dulce", "quantity": 1}, {"food": "crackers", "quantity": 2.0}, {"food": "potato flour", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 12.0}, {"food": "vegetable oil", "quantity": 3.0}], "title": "\nGiant Chocolate-Coated Marshmallow Cookie\n"}, {"directions": "\nSpecial equipment: a small offset spatula\n\n              Preheat the oven to 375 degrees F.\n            \n\n              For the cookies: Whisk together the flour, cocoa powder, baking soda and salt in a large bowl. Beat the butter and brown sugar with an electric mixer on medium-high speed in a second large bowl until light and fluffy, about 6 minutes. Add the eggs to the butter mixture, one at a time, beating after each addition to incorporate; beat in the vanilla. Reduce the speed to medium, add the flour mixture, and beat until just incorporated. Fold in the chocolate chips by hand.\n            \n\n              Roll the dough into 6 balls (about 1 1/2 cups each). Divide 4 of the balls between 2 rimmed baking sheets (2 balls per sheet). Flatten them into 6-inch circles using your hands; make sure the circles are 2 inches apart. Bake until just set, 12 to 14 minutes. Let cool on the baking sheet for 10 minutes, then transfer to a rack to cool completely. Repeat with the remaining 2 balls of dough.\n            \n\n              For the frosting: Meanwhile, beat the butter and peanut butter with an electric mixer on medium speed in a large bowl until light and fluffy. Slowly add the confectioners' sugar about 1/2 cup at a time, beating between additions, until incorporated.\n            \n\n              Assemble the cake: Place a cookie on a cake stand or serving plate and spread the top with some frosting. Top with another cookie and more frosting; repeat with the remaining cookies and frosting, making sure the frosting on the top layer is spread smooth.\n            \n\n              For the ganache: Put the chocolate in a medium bowl. Bring the cream and butter to a boil in a small saucepan over medium heat. Pour over the chocolate and let stand for 5 minutes; stir until melted and smooth.\n            \n\n              Pour the ganache over the top of the cake, smoothing the top with a small offset spatula and letting it drip over the sides. Decorate the rim of the cake with the peanuts. Let stand at room temperature until the chocolate hardens, about 10 minutes.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 4.5}, {"food": "onion powder", "quantity": 0.6666666666666666}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "salt", "quantity": 2.0}, {"food": "butter oil", "quantity": 3.0}, {"food": "sugar", "quantity": 3.0}, {"food": "eggs", "quantity": 4.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 3.0}, {"food": "peanuts", "quantity": 0.5}, {"food": "butter oil", "quantity": 2.0}, {"food": "peanut butter ", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 4.0}, {"food": "ice cream swich", "quantity": 0.3333333333333333}, {"food": "butter oil", "quantity": 1.0}], "title": "\nGiant Chocolate-Peanut Butter Cookie Cake\n"}, {"directions": "\n\n              Put a rimmed baking sheet in the oven and preheat the oven to 450 degrees F.\n            \n\n              Cook the ground beef with the taco seasoning according to the package instructions on the taco seasoning. Set aside until ready to use.\n            \n\n              Meanwhile, in a microwave-safe bowl, heat the cheese sauce in the microwave in 30-second intervals until warm and pourable.\n            \n\n              On a work surface, lay out 5 flour tortillas in a circle, overlapping slightly. Add a tortilla to the middle, on top of the others. Spread the ground beef evenly over the center tortilla. Pour the cheese onto the beef (it's okay if it's not completely covered). Cover the cheese with a layer of 4 tostada rounds. Press them down, breaking them a little, to make a flat layer. Spread the sour cream in an even layer over the tostadas. Sprinkle the lettuce over the top of the sour cream, then sprinkle with the tomatoes. Add the final tortilla over the tomato. Fold the sides of the tortillas up and over to wrap around the layers. The top should be covered in overlapping folds. Press the wrap down so that it is even and not domed. Brush the top with canola oil.\n            \n\n              Remove the rimmed baking sheet from the oven. Brush the baking sheet with canola oil, then carefully transfer the wrap to the baking sheet meat-side down. Bake immediately until the top is golden brown, 4 to 5 minutes.\n            \n\n              Invert the crunch wrap onto a serving platter or cutting board. Cut into wedges and serve with hot sauce if using.\n            \n", "ingredients": [{"food": "frankfurter beef", "quantity": 1.0}, {"food": "seasoning mix", "quantity": 1.0}, {"food": "cheese sauce", "quantity": 1.0}, {"food": "potato flour", "quantity": 12.0}, {"food": "tostada shells", "quantity": 4.0}, {"food": "sour cream", "quantity": 1.0}, {"food": "lettuce", "quantity": 0.5}, {"food": "diced chicken", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "Worcestershire sauce", "quantity": 1}], "title": "\nGiant Crunchy Taco Wrap\n"}, {"directions": "\n\n              To make this muffuletta-style deli sandwich, slice off the top third of a 12-inch round loaf of bread. Hollow out the inside of the loaf, leaving a 1/2-inch border. Fill the loaf with a mix of deli meats and cheeses (we used prosciutto, provolone, turkey, soppressata and mozzarella), fresh basil, roasted peppers and sliced tomatoes. Drizzle with vinaigrette, then replace the bread top. Wrap the sandwich tightly in plastic wrap and weight it down with a heavy skillet; refrigerate at least 4 hours or overnight, then cut into wedges.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [], "title": "\nGiant Deli Sandwich\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Line a baking sheet with parchment paper. \n            \n\n              Mix the cookie dough with the flour until it is an even texture. Turn the dough out onto the prepared baking sheet and form it into the shape of an egg about 1/2-inch thick, 9 inches long and 7 inches wide at its widest point. Bake until golden around the edges, about 25 minutes. Remove the cookie from the oven to cool, about 15 minutes. \n            \n\n              Meanwhile, beat the egg whites and sugar with an electric mixer until combined. Add the lemon juice and continue to beat until thick and glossy, about 5 minutes.\n            \n\n              Fill a pastry bag or plastic baggie with the icing, snip off a small corner and pipe decorations on the cookie. Attach the candies in patterns to make a decorative Easter egg.\n            \n", "ingredients": [{"food": "sugar", "quantity": 16.0}, {"food": "potato flour", "quantity": 3.0}, {"food": "egg substitute", "quantity": 2.0}, {"food": "sugar", "quantity": 1.5}, {"food": "lemon juice", "quantity": 2.0}, {"food": "fava beans", "quantity": 2.0}, {"food": "", "quantity": 1}], "title": "\nGiant Easter Egg Cookie\n"}, {"directions": "\n\n              Put 1 baking sheet on the center rack of the oven and preheat to 350 degrees F.\n            \n\n              Slice 1/4-inch of the crust off the top and bottom of the loaf of bread. Split the loaf evenly in half, horizontally. Cut a piece of parchment paper large enough to accommodate both halves of bread and put both the top and the bottom on the parchment, cut-side up so the inside of the loaf is visible. \n            \n\n              Scoop about a 1/4-inch of the soft middle of the loaf out. Spread the mayonnaise evenly on the crustless top of each half, then flip them over so the mayonnaise-side is face down on the parchment.\n            \n\n               Evenly distribute the 3 cheeses between the 2 bread halves. Use the parchment to transfer your grilled cheese to the preheated baking sheet, using a spatula if the bread is sticking, then remove and discard the parchment. Bake until the crust is golden brown and crunchy and the cheese is melted, about 18 minutes. Remove from the oven and immediately sandwich the 2 halves with the cheese in the middle. Let rest about 10 minutes. Slice and serve while hot.\n            \n", "ingredients": [{"food": "barbecue loaf", "quantity": 1.0}, {"food": "mayonnaise dressing", "quantity": 0.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.3333333333333333}, {"food": "macaroni cheese", "quantity": 0.3333333333333333}, {"food": "low fat big franks", "quantity": 0.3333333333333333}], "title": "\nGiant Grilled Cheese for a Crowd\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Prepare the cookie mix as the label directs for drop cookies, mixing in the cornmeal. Roll out into a 13-inch round on floured parchment paper; trim into a 12-inch circle with a paring knife.\n            \n\n              Cut the cookie in half with the paring knife to make 2 semicircles, then use kitchen shears to cut through the parchment so each semicircle is on its own piece of parchment.\n            \n\n              Slide 1 semicircle (on the parchment) onto a rimmed baking sheet. Press the straight edge of the semicircle up against the rim as shown. Slide the other semicircle flat onto a separate baking sheet. Bake until golden, 12 minutes.\n            \n\n              Remove the cookies from the oven. Use the handle of a wooden spoon to shape the edge of the curved cookie. Let the cookies cool completely on the baking sheets.\n            \n\n              Put the curved cookie on a clean parchment-lined baking sheet. Cut the ice cream out of the carton; slide onto the cookie. Use plastic wrap to gently press the ice cream so that it goes almost to the edge.\n            \n\n              Sprinkle the side of the ice cream with the cereal, pressing to adhere. Transfer to the freezer.\n            \n\n              To make \"lettuce,\" combine the coconut with 3 drops green food coloring, 1 drop yellow food coloring and a small splash of water in a resealable plastic bag; shake and massage until the coconut is light green.\n            \n\n              Slice the Circus Peanuts into thin strips to look like shredded cheese; chop the cherries for the tomatoes.\n            \n\n              Sprinkle the coconut, Circus Peanuts and cherries over the cereal. Place the other cookie on top of the ice cream so the two cookie edges line up. Freeze until firm, at least 2 hours.\n            \n\n              Photograph by Ralph Smith\n            \n", "ingredients": [{"food": "cheesecake mix", "quantity": 1.0}, {"food": "cornmeal", "quantity": 0.5}, {"food": "potato flour", "quantity": 1}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "cereal bar", "quantity": 0.5}, {"food": "coconut water", "quantity": 0.5}, {"food": "yellow rice", "quantity": 1}, {"food": "", "quantity": 5.0}, {"food": "maraschino cherries", "quantity": 4.0}], "title": "\nGiant Ice Cream Taco\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: a jumbo silicone cupcake mold; a silicone pastry brush\n\n              For the cake: Preheat the oven to 325 degrees F. Prepare the cake batter according to the package instructions. Pour into the bottom of a jumbo silicone cupcake mold and bake until a tester comes out clean, about 1 hour. Let cool completely, then unmold the cake onto a cooling rack set in a baking sheet.\n            \n\n              For the filling: Meanwhile, beat together the peanut butter and butter with an electric mixer until completely combined. Slowly add in the confectioners' sugar about a 1/4 cup at a time, beating in between additions, until completely incorporated. Beat in the salt. Set aside until ready to use.\n            \n\n              Cut off the domed top of the cake if one has formed, and save for another use (or eat!). Cut the cake horizontally into 3 layers and put them on a work surface Use a paring knife to cut out a 3 1/2-inch hole from the middle layer; set the cake layer aside (save the cutout for another use). \n            \n\n              Stack the bottom and middle cake layers on the prepared cooling rack. Fill the hole in the center with the peanut butter filling. Place the last cake layer on top. Invert the cake onto a plate and chill in the freezer for 10 minutes.\n            \n\n              Pour some of the hardening chocolate sauce over the top of the cake and use a rubber spatula to gently smooth and level it. Using a silicone brush, apply more of the chocolate sauce on the sides of the cake. Chill in the refrigerator for 10 minutes, then invert the cake onto a serving platter. Spread the remaining chocolate sauce on top of the cake in an even layer and chill in the refrigerator until set.\n            \n\n              Cut the cake into slices, exposing the peanut butter center.\n            \n", "ingredients": [{"food": "shortening cake mix", "quantity": 15.0}, {"food": "peanut butter ", "quantity": 0.75}, {"food": "butter oil", "quantity": 0.25}, {"food": "sugar", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "Worcestershire sauce", "quantity": 1.5}], "title": "\nGiant Peanut Butter Cup Cake\n"}, {"directions": "\nSpecial equipment: a 9-inch tart pan\n\n              Spray a 9-inch tart pan with cooking spray. Melt the chocolate in the top of a double boiler (alternatively, use a heatproof bowl set over-- not in-- a pot of simmering water). Keep the chocolate warm over low heat until ready to use.\n            \n\n              Add the peanut butter, confectioners' sugar, saltines, butter and salt to a large bowl and blend with an electric mixer on medium speed until well combined. Fold in the candy-coated peanut butter candy.\n            \n\n              Pour half of the chocolate into the prepared pan. Freeze until the chocolate is set and hardened, about 10 minutes.\n            \n\n              Spread the peanut butter mixture over the chocolate in the pan with an offset spatula, leaving a 1/2-inch border around the edge. Pour the remaining chocolate over the peanut butter, spreading it over the top so it drips into the open border and no filling is visible. Freeze until set, about 10 minutes. Serve at room temperature.\n            \n", "ingredients": [{"food": "pan dulce", "quantity": 1}, {"food": "baking chocolate", "quantity": 18.0}, {"food": "peanut butter ", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "crackers", "quantity": 0.3333333333333333}, {"food": "butter oil", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "peanut butter ", "quantity": 1.5}], "title": "\nGiant Peanut Butter Cup Stuffed with Reese's Pieces\n"}, {"directions": "\n\n              For the cookies: Stir together the flour and baking soda in a bowl. Cream the butter and both sugars on high speed in an electric mixer fitted with the paddle attachment until light, about 2 minutes. Add the peanut butter and beat until smooth. Add the eggs, one at a time, and beat until incorporated. Beat in the vanilla. Add the flour mixture and beat on low until just combined. Divide the dough in half, form into 2 rectangles, wrap in plastic wrap and refrigerate until firm, about 1 hour.\n            \n\n              Cut a 12-inch peanut shape out of parchment to use as a template. Roll one piece of dough between two pieces of parchment to a rectangle a little bigger than the template. Remove the top piece of parchment and, using a pizza wheel or paring knife, cut the dough into a peanut shape. Reserve the dough scraps. Repeat with the remaining dough piece. Mold the scraps into a rectangle, wrap in plastic and chill along with the peanut shapes until firm, about 30 minutes.\n            \n\n              For the filling: Meanwhile, preheat the oven to 350 degrees F. Beat the peanut butter and butter in a large bowl with an electric mixer on medium speed until combined. Slowly add the confectioners' sugar, about a 1/4 cup at a time, beating in between additions, until completely incorporated.\n            \n\n              To build the cookie: Roll out the chilled rectangle of dough scraps into a large rectangle about 1/4-inch thick. Use a pizza wheel or sharp paring knife to cut long strips about 1/2-inch wide. Transfer the peanut-shaped pieces of dough on their pieces of parchment to 2 baking sheets. Lay the dough strips on top of one of the peanut-shaped pieces of dough in a crisscross, freeform pattern to mimic the lines on a peanut. Use a rolling pin to gently flatten and adhere the strips to the peanut.\n            \n\n              Bake the cookies until lightly golden around the edges and dry on top, about 30 minutes. Cool completely on the baking sheets on a wire rack.\n            \n\n              Turn over the cookie without lines so it sits flat-side up on a flat serving plate. Spread the filling evenly to the edges. Top with the second cookie, lined-side up. Use a serrated knife to cut into squares for serving.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 3.5}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "sugar", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "peanut butter ", "quantity": 1.5}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "peanut butter ", "quantity": 1.5}, {"food": "butter oil", "quantity": 1.5}, {"food": "sugar", "quantity": 3.0}], "title": "\nGiant Peanut Butter Sandwich Cookie\n"}, {"directions": "\n\n              For the sauce: Heat the butter over medium heat in a small saucepan until the milk solids begin to brown and butter smells toasted, about 6 minutes; remove from heat. Pour 6 tablespoons of the butter into a bowl and set aside. To the remaining 2 tablespoons browned butter left in the pan, whisk in the sugar, cornstarch and salt until it forms a thick paste. Add the milk, bourbon and vanilla, whisking until smooth. Return the saucepan to medium heat and cook, stirring often, until the mixture comes to a boil and thickens to the consistency of loose pudding, about 3 minutes. Transfer the sauce to a serving bowl; keep warm.\n            \n\n              For the pancake: Toast the pecans in a large skillet over medium heat until they smell nutty, about 4 minutes. Transfer the pecans to a cutting board to cool for 5 minutes. Roughly chop enough pecans to measure 1/2 cup and reserve for garnish. Finely chop the remaining pecans (you should have about 1 cup) and reserve for the pancake batter.\n            \n\n              Whisk the all-purpose and buckwheat flours, the cornstarch, confectioners' sugar, baking powder, baking soda and salt together in a large bowl. Add the 1 cup finely chopped pecans and whisk again to evenly coat. Whisk the reserved 6 tablespoons browned butter, the milk, vanilla and eggs together in another bowl. Add the milk mixture to the flour mixture and stir until ingredients are just incorporated and form a thick batter (it's okay if there are some lumps). Let the batter rest for 5 minutes. \n            \n\n              Heat a 12-inch nonstick skillet over medium heat for 5 minutes. Pour all the batter into the skillet, smoothing the top. Cook until bubbles break on the surface of the pancake, and the underside is golden brown, about 6 minutes (reduce heat if pancake is browning too quickly). To flip the pancake neatly, use a spatula to lift the edge of one side of the pancake and carefully slide it, batter side up, onto a large plate. Invert the skillet over the plate then use kitchen towels or oven mitts to carefully invert the plate and skillet together, allowing the pancake to fall back into the pan, cooked side up. Return the skillet to the heat and cook until the second side is golden brown and the pancake is completely cooked through in the middle, about 6 minutes more. Transfer the pancake to a rack and let cool for 5 minutes. \n            \n\n              Using a serrated knife, cut the pancake into 8 wedges, placing 2 wedges on each plate. Dust heavily with confectioners' sugar, drizzle with the brown butter sauce and top with reserved roughly chopped pecans. \n            \n", "ingredients": [{"food": "butter oil", "quantity": 8.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "cornstarch", "quantity": 2.0}, {"food": "salt", "quantity": 0.25}, {"food": "milk", "quantity": 0.6666666666666666}, {"food": "whiskey sour mix", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 0.75}, {"food": "", "quantity": 2.0}, {"food": "potato flour", "quantity": 1.5}, {"food": "buckwheat flour", "quantity": 0.25}, {"food": "cornstarch", "quantity": 0.25}, {"food": "sugar", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 0.25}, {"food": "milk", "quantity": 1.25}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "eggs", "quantity": 2.0}, {"food": "sugar", "quantity": 1}], "title": "\nGiant Pecan-Buckwheat Pancake with Brown Butter Sauce\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F and line a rimmed baking sheet with parchment.\n            \n\n              Remove the plastic packaging from the sausage while keeping it together in its original shape. On a work surface, gently roll the sausage log back and forth into a 10-inch log. Transfer the log to the prepared baking sheet and bake until browned and cooked to 155 degrees F, about 25 minutes; transfer the sausage to paper towels to drain. Discard the parchment and reline the baking sheet with a new piece.\n            \n\n              Arrange the ham slices side by side and overlapping by 1 inch on a cutting board to form a 9-inch-long rectangle. Place the sausage log parallel to one long end of the rectangle and roll the sausage up in the ham. Place the crescent dough sheet on a cutting board and pinch the perforated seams closed so the dough is solid. Arrange the ham-wrapped sausage parallel with one short end of the dough sheet and roll it so that the dough wraps around the sausage completely.\n            \n\n              Transfer the pastry-wrapped sausage to the prepared baking sheet seam-side down, brush with the egg mixture and sprinkle with the poppy seeds. Bake until the pastry is golden brown and cooked through, 15 to 20 minutes. Transfer to a cutting board and slice. Serve with honey mustard for dipping.\n            \n", "ingredients": [{"food": "pork turkey sausage", "quantity": 16.0}, {"food": "ham", "quantity": 4.0}, {"food": "phyllo dough", "quantity": 8.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "seeds", "quantity": 1.0}, {"food": "mustard spinach", "quantity": 1}], "title": "\nGiant Pig-in-a-Blanket\n"}, {"directions": "\n\n              Let 2 pounds of pizza dough come to room temperature (this might take up to 2 hours). Roll and stretch into a 5-foot rope, then form into a U shape on a parchment-lined baking sheet, letting the ends hang over the side. Lift the ends and twist them twice, then press the ends down to make a pretzel shape. Brush with beaten egg, sprinkle with coarse salt and bake at 450 degrees F until golden brown, about 30 minutes. Let cool completely, then split in half and fill with pub cheese.\n            \n\n              Photograph by Jeff Harris\n            \n", "ingredients": [], "title": "\nGiant Pretzel\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Make the large graham crackers: Discard 3/4 cup of the cookie mix. Prepare the remaining mix as directed for cut-out cookies, adding the ground graham crackers.\n            \n\n              Divide the dough in half. Roll out each piece of dough into a 9 1/2-inch square on separate sheets of parchment paper; transfer the dough and parchment to 2 baking sheets.\n            \n\n              Bake the graham-cracker cookies until golden and set, 12 to 15 minutes. While still warm, trim the edges with a paring knife to make even 9-inch squares.\n            \n\n              Use a butter knife to score a perforated line across the middle of each cookie, then use a chopstick or skewer to make small holes as shown. Let cool completely.\n            \n\n              Using an offset spatula, spread the fudge sauce into a wavy pool on 1 cookie. Transfer to the freezer.\n            \n\n              Let the ice cream soften slightly, then cut off the carton and place the block of ice cream on its side on a piece of plastic wrap. Cover with more plastic and press the ice cream to flatten slightly. Freeze until firm, about 1 hour.\n            \n\n              Meanwhile, make the meringue: Beat the egg whites and cream of tartar with a mixer on medium-high speed until foamy, then gradually beat in the sugar on high speed until stiff glossy peaks form.\n            \n\n              Remove the plastic and set the ice cream on top of the fudge-covered cookie. Using an offset spatula, cover the ice cream with a smooth layer of meringue, building out the sides slightly.\n            \n\n              Use a kitchen torch to brown the meringue, then gently press the other graham-cracker cookie on top. Freeze until ready to serve, then let soften slightly and slice.\n            \n\n              Photograph by Ralph Smith\n            \n", "ingredients": [{"food": "cheesecake mix", "quantity": 1.0}, {"food": "crackers", "quantity": 0.75}, {"food": "hot pockets ham cheese stuffed swich", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "egg substitute", "quantity": 6.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "sugar", "quantity": 1.0}], "title": "\nGiant S'more Cake\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: an oven-safe thermometer\n\n              Preheat the oven to 250 degrees F. Line a baking sheet with foil.\n            \n\n              Mix together the salt and egg whites in a large bowl until completely combined and moist (the mixture should hold together when squeezed in your hand).  \n            \n\n              Heat the oil in a large skillet over medium-high heat. Sear the brisket, flipping as needed, until a dark crust forms on all sides, 6 minutes to 10 minutes. \n            \n\n              Meanwhile, spread some of the salt mixture onto the prepared baking sheet so that it is a 1/2 inch longer and wider than your brisket. Lay the brisket on top and season with pepper. Insert an oven-safe thermometer into the thickest part of the brisket. Press and pack the remaining salt mixture on top of and around the brisket so that it is fully encased, making sure there are no holes or cracks. Cook until the thermometer reaches 170 degrees F, 2 hours 30 minutes to 3 hours. Let rest for 10 minutes.  \n            \n\n              Meanwhile, stir together the sour cream and horseradish into a small serving bowl and refrigerate until ready to use. \n            \n\n              Crack the salt crust open with a something heavy, like a meat mallet. Remove the crust, wipe away any residual salt on the brisket with a paper towel or brush and transfer to a cutting board. Thinly slice the brisket and serve with the horseradish sauce. \n            \n", "ingredients": [{"food": "", "quantity": 3.0}, {"food": "egg substitute", "quantity": 12.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "frankfurter beef", "quantity": 3.0}, {"food": "black bean mango", "quantity": 1.0}, {"food": "sour cream", "quantity": 0.5}, {"food": "horseradish", "quantity": 3.0}], "title": "\nGiant Salt-Crusted Brisket\n"}, {"directions": "\nSpecial equipment: Pastry bag; Wilton #70 leaf tip\n\n24 Go-To Vanilla Cupcakes \n\n\n              Frost the cupcakes with the buttercream. Create a dip in the center of the cupcake about 3/4-inch across. Adhere the coconut grass to the outer edge of the cupcakes.\n            \n\n              For the petals: Place the egg yolk-tinted frosting in a pastry bag with a #70 leaf tip.\n            \n\n              Hold the bag at a 45 degree angle with the tip lightly touching the surface just inside the dip in the cupcake (with the wide part parallel to the surface). Squeeze hard to build up the base and simultaneously lift the tip slightly. Relax pressure as you pull the tip toward you, drawing the petal to a point near the edge of the cupcake. Stop squeezing and lift the tip away.\n            \n\n              Repeat all the way around the cupcake, slightly overlapping the petals. Repeat with remaining cupcakes.\n            \n\n              Fold a piece of paper in half and place the chocolate sprinkles in the center. Using the folded corner as a guide, pour the sprinkles into the hole in the middle of the cupcake. Repeat with remaining cupcakes.\n            \n\nCoconut Grass:\n\n\n              Preheat the oven to 250 degrees F. Line a baking sheet with parchment paper and top with a rack.\n            \n\n              Toss the coconut with the green and yellow food coloring, depending on desired color. Sprinkle with water if necessary to disperse the color. Drain. Spread evenly on the rack, place in the oven and bake until dry, 10 to 15 minutes. Makes 2 cups.\n            \n", "ingredients": [{"food": "", "quantity": 2.0}, {"food": "", "quantity": 1.5}, {"food": "", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.3333333333333333}, {"food": "coconut water", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "yellow rice", "quantity": 0.5}], "title": "\nGiant Sunflower Cupcakes\n"}, {"directions": "\n\n              Bring the vinegar, sugar, 1 tablespoon salt, the bay leaves, fennel seeds, red pepper flakes and 1 cup water to a boil in a medium saucepan. Add the cauliflower, fennel, red onion, carrots and garlic. Reduce the heat and simmer until the vegetables are crisp-tender, 8 to 10 minutes. Let the vegetables cool in the brine, then refrigerate until chilled. Store in an airtight container in the refrigerator for up to 4 days.\n            \n", "ingredients": [{"food": "vinegar", "quantity": 2.0}, {"food": "sugar", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "fennel seed", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "cauliflower", "quantity": 0.5}, {"food": "fennel seed", "quantity": 1.25}, {"food": "onion powder", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "garlic powder", "quantity": 4.0}], "title": "\nGiardiniera\n"}, {"directions": "\n\n              In a mixing glass, combine 3 ounces gin and 1/2 ounce dry vermouth. Stir with ice for 30 seconds; let sit 1 to 2 minutes. Strain into a chilled martini glass and drop in a few cocktail onions.\n            \n", "ingredients": [], "title": "\nGibson\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Combine the gin, lemon juice and sugar in the almost-empty marmalade jar. Cover tightly with the lid and shake well. Pour the cocktail in a glass and garnish with a strip of orange peel.\n            \n", "ingredients": [{"food": "", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "marmalade", "quantity": 1.0}, {"food": "orange peel", "quantity": 1.0}], "title": "\nGin Marmalade Cocktail\n"}, {"directions": "\n\n              Add the sugar and basil leaves to an old-fashioned glass and muddle gently. Fill the glass with ice, add the gin and stir. Add the Strawberry-Apple Juice and stir. Top with club soda, garnish with the basil sprig and serve.\n            \n\nStrawberry-Apple Juice:\n\n\n              Juice the strawberries, then the apple, following your juicer's specific settings for each. Serve the juice immediately over ice, if desired. \n            \n", "ingredients": [{"food": "sugar", "quantity": 0.5}, {"food": "chrysanthemum leaves", "quantity": 4.0}, {"food": "", "quantity": 2.0}, {"food": "", "quantity": 4.0}, {"food": "", "quantity": 1}, {"food": "strawberries", "quantity": 2.0}, {"food": "apple", "quantity": 1.0}], "title": "\nGin and Juice\n"}, {"directions": "\n\n              Place the ice pop in a glass. Pour the gin, elderflower liqueur and 1 ounce ice water over the pop; top with tonic water. Stir the cocktail with the ice pop and garnish with blueberries.\n            \n", "ingredients": [{"food": "ice cream swich", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "coconut water", "quantity": 1}, {"food": "", "quantity": 1}], "title": "\nGin and Juice Pop\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Pour about half the tonic into a bowl. Scatter the gelatin over the surface, do not stir, set aside until the gelatin blooms (softens). Meanwhile, warm the rest of the tonic over very low heat until just simmering. Whisk hot tonic, then gin and lime juice into the gelatin. Pour jelly into 4 (2- ounce) shot glasses and garnish with lime wedges or citrus of choice. Place in the refrigerator for 2 hours (or overnight) until set.\n            \n", "ingredients": [{"food": "", "quantity": 1.0}, {"food": "coconut water", "quantity": 5.0}, {"food": "", "quantity": 1.5}, {"food": "lime juice", "quantity": 2.0}, {"food": "silk key lime soy yogurt", "quantity": 1}], "title": "\nGin and Tonic Jellies\n"}, {"directions": "\n\n              Make the cake: Preheat the oven to 350 degrees F. Sift the flour, confectioners' sugar and salt onto a sheet of parchment paper. Sift again, then set aside. \n            \n\n              Beat the egg whites in a large bowl with a mixer on medium speed until frothy. Add the cream of tartar and beat until soft peaks form, about 5 minutes. Gradually beat in the granulated sugar, about 1 tablespoon at a time, then increase the speed to medium high and continue beating until stiff, shiny peaks form, 12 to 15 minutes. Add the vanilla, lime zest and ginger and beat a few seconds to combine. \n            \n\n              Sprinkle one-quarter of the flour mixture over the egg mixture and gently fold with a rubber spatula. Fold in the remaining flour mixture in 3 additions. Transfer the batter to an ungreased 10-inch tube pan. Bake until the cake feels springy and a toothpick inserted into the center comes out clean, 40 to 50 minutes. Invert the pan onto a funnel or the neck of a bottle and cool completely. Loosen the edges with a small knife, tap the sides of the pan against the counter and unmold. \n            \n\n              Make the sauce: Puree 2 half pints raspberries in a blender with 2 tablespoons water, the granulated sugar, lime zest and lime juice. Strain to remove the seeds. Top the cake with confectioners' sugar, the sauce and the remaining raspberries. \n            \n\n              SERVES: 8 (Dessert); Calories: 325; Total Fat 0.5 grams; Saturated Fat: 0 grams; Protein: 7 grams; Total carbohydrates: 75 grams; Sugar: 57 grams Fiber: 3 grams; Cholesterol: 0 milligrams; Sodium: 150 milligrams\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.0}, {"food": "sugar", "quantity": 1.5}, {"food": "salt", "quantity": 0.25}, {"food": "egg substitute", "quantity": 11.0}, {"food": "ice cream swich", "quantity": 1.5}, {"food": "sugar", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "lime", "quantity": 1.0}, {"food": "ginger", "quantity": 3.0}, {"food": "raspberries", "quantity": 3.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "lime", "quantity": 0.5}, {"food": "lime juice", "quantity": 1.0}], "title": "\nGinger Angel Food Cake\n"}, {"directions": "\n\n              Bring a large pot of water to a boil. Meanwhile, toss the catfish, 1 tablespoon fish sauce, 1 teaspoon ginger, the turmeric and 1 teaspoon vegetable oil in a large bowl; set aside to marinate 15 minutes. Combine 3 tablespoons water with the remaining 1 tablespoon plus 1 teaspoon fish sauce and 1 teaspoon ginger, the lime juice, sugar and chili-garlic sauce in a small bowl; set aside.\n            \n\n              When the water comes to a boil, turn off the heat, add the vermicelli and stir. Let sit until just tender, 2 to 3 minutes, then drain and rinse under cold water. Shake off as much water as possible and transfer to a large bowl. Add 1 teaspoon vegetable oil and half of the prepared sauce and toss; divide among 4 bowls.\n            \n\n              Heat the remaining 1 tablespoon vegetable oil in a large nonstick skillet over medium-high heat. Add the fish and cook until browned, 2 to 3 minutes per side; remove to a plate. Add the bell pepper and scallions to the skillet and stir-fry until crisp-tender, 1 to 2 minutes. Stir in half of the herbs.\n            \n\n              Top the noodles with the fish, vegetables and remaining herbs. Drizzle some of the remaining sauce on top and serve with more chili-garlic sauce on the side.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "catfish", "quantity": 1.25}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "ginger", "quantity": 2.0}, {"food": "turmeric", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "lime juice", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "rice & vermicelli mix", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "", "quantity": 6.0}, {"food": "dill seed", "quantity": 1.0}], "title": "\nGinger Catfish with Vermicelli\n"}, {"directions": "\n\n              Put all but 2 tablespoons of the scallions in a blender; add the ginger, jalapeno, brown sugar, fish sauce, soy sauce, vinegar, tomato and 1/4 teaspoon salt and blend until smooth. Transfer to a 6-quart slow cooker.\n            \n\n              Add the chicken and mushrooms to the slow cooker and stir to coat. Cover and cook on low, 4 hours.\n            \n\n              Roughly chop the watercress and stir into the slow cooker. Serve the chicken and vegetables with rice; top with the reserved scallions.\n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [{"food": "", "quantity": 1.0}, {"food": "ginger", "quantity": 1.0}, {"food": "seeds", "quantity": 0.5}, {"food": "sugar", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "soy sauce", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "plum", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 6.0}, {"food": "mushrooms", "quantity": 4.0}, {"food": "watercress", "quantity": 2.0}, {"food": "crisped rice bar", "quantity": 1}], "title": "\nGinger Chicken with Watercress\n"}, {"directions": "\n\n              1. Preheat the oven to 350°F. Combine the chocolate and butter in a small microwave-safe dish and microwave in 30-second intervals, stirring after each, until smooth, about 2 minutes. Set aside to cool slightly.\n            \n\n              2. Whisk the almond flour, all-purpose flour, ginger, cinnamon, cloves, nutmeg, baking powder and salt together in a large bowl. Beat the eggs and brown sugar in another large bowl with an electric mixer until pale and fluffy. Add the chocolate mixture and beat until combined. Add the flour mixture and mix on low speed until incorporated. Refrigerate the mixture until firm, at least 1 hour.\n            \n\n              3. Place the granulated sugar in a shallow bowl and the powdered sugar in another shallow bowl. Form the dough into balls ¾-inch in diameter and roll them first in the granulated sugar and then in the powdered sugar, until generously coated like a powdered doughnut. Place on 2 non-stick baking sheets about 2 inches apart and bake for 8 to 10 minutes.\n            \n\n              4. Let the cookies cool for a couple of minutes on the baking sheets before transferring them to a cooling rack.\n            \n", "ingredients": [{"food": "sugar", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 12.0}, {"food": "butter oil", "quantity": 5.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "potato flour", "quantity": 0.5}, {"food": "ginger", "quantity": 1.5}, {"food": "cinnamon", "quantity": 0.5}, {"food": "cloves", "quantity": 0.125}, {"food": "nutmeg", "quantity": 0.125}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "salt", "quantity": 0.25}, {"food": "eggs", "quantity": 3.0}, {"food": "sugar", "quantity": 0.5}, {"food": "sugar", "quantity": 1.0}], "title": "\nGinger Chocolate Crackle Cookies\n"}, {"directions": "\n\n              Whisk the flour, ginger, baking soda, cinnamon, allspice, mustard, salt and black pepper together in a medium bowl.\n            \n\n              Beat the butter and the sugars with a hand mixer electric mixer on medium-high until light and fluffy, about 2 minutes. Scrape down the sides of the bowl. Add the egg yolk and vanilla and beat on medium speed until just incorporated, about 20 seconds. Add the molasses and ginger preserves and continue beating until the batter is an even light brown color, 30 seconds more.\n            \n\n              Add the dry ingredients all at once, beating slowly to make a soft, smooth dough. Use a rubber spatula to make sure all ingredients are combined. Then beat again for 20 seconds. Cover the bowl with plastic and refrigerate the dough until firm, about 25 minutes.\n            \n\n              Put about 1/2 cup sugar in a small bowl. With a cookie scoop or a small ice cream scoop, portion the dough into a slightly heaping tablespoon for each cookie. Roll the dough, by hand, into balls. Roll the tops of the balls in the sugar, and space them 2 inches apart on a nonstick or lightly oiled cookie sheet. Refrigerate until firm, about 25 minutes. (The chilling is what gives this cookie a beautiful, crackly crunch on top, and a soft, chewy center.)\n            \n\n              Preheat oven to 375 degrees F.\n            \n\n              Bake until the top is crackly, and the insides peeking out through are dark and moist but not raw, about 15 to 20 minutes. Briefly cool the cookies on the baking sheets, then transfer to racks to cool completely.\n            \n\n              Serve or store in a tightly sealed container for up to 3 weeks.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.25}, {"food": "ginger", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 1.25}, {"food": "cinnamon", "quantity": 1.0}, {"food": "allspice", "quantity": 0.5}, {"food": "mustard spinach", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "black bean mango", "quantity": 5.0}, {"food": "butter oil", "quantity": 0.75}, {"food": "chocolate chip cookies", "quantity": 0.5}, {"food": "sugar", "quantity": 0.25}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "molasses", "quantity": 0.5}, {"food": "ginger", "quantity": 2.0}], "title": "\nGinger Cookie\n"}, {"directions": "\n\n              With the back of a heavy chef's knife, bruise the lemongrass stalk to expose the inside fibers and cut it into 1-inch lengths. Combine the lemongrass pieces, ginger, sugar and 1/2 cup water in a small saucepan. Bring to a simmer and cook a few minutes until the sugar dissolves. Remove from the heat and steep for 20 minutes. \n            \n\n              Strain the syrup into a bowl, discarding the solids. Place the bowl over a larger bowl filled with ice and whisk the syrup until it cools. Combine the pineapple juice, coconut milk, rum and all of the cooled syrup in a blender and blend; it will make a nice frothy layer on top. Pour into 4 tumblers with or without ice and garnish with the mint or lemongrass.\n            \n", "ingredients": [{"food": "", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.75}, {"food": "sugar", "quantity": 0.5}, {"food": "", "quantity": 1}, {"food": "grape juice", "quantity": 2.0}, {"food": "coconut milk", "quantity": 1.0}, {"food": "martha white foods", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 4.0}], "title": "\nGinger Lemongrass Pina Colada\n"}, {"directions": "\n\n              Fill a cocktail shaker or small pitcher with ice. Add the vodka, ginger syrup, and lime juice. Cover and shake vigorously, or stir, until combined and chilled, about 30 seconds. (In general, by the time the shaker mists up the drink is ready.) Strain into a chilled cocktail glass. Add twist and serve.\n            \n\nGinger Syrup:\n\n\n              Remove the outer peel of the lemon with a vegetable peeler, taking care not to include too much of the bitter white pith. Finely chop the lemon peel and ginger in a food processor.\n            \n\n              Transfer the lemon-ginger mixture to a medium saucepan, add the sugar and water and bring to a boil. Reduce heat, and simmer, partially covered, for 15 minutes. Strain the mixture and cool. Cover and refrigerate for up to 1 week.\n            \n", "ingredients": [{"food": "", "quantity": 3.0}, {"food": "", "quantity": 0.5}, {"food": "lime juice", "quantity": 0.5}, {"food": "lime", "quantity": 1}, {"food": "lemon juice", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 2.0}, {"food": "sugar", "quantity": 1.0}, {"food": "coconut water", "quantity": 2.0}], "title": "\nGinger Martini\n"}, {"directions": "\n\n              Fill a cocktail shaker or small pitcher with ice. Add the vodka, ginger syrup, and lime juice. Cover and shake vigorously, or stir, until combined and chilled, about 30 seconds. (In general, by the time the shaker mists up the drink is ready.) Strain into a chilled cocktail glass. Add twist and serve.\n            \n\nGinger Syrup:\n\n\n              Remove the outer peel of the lemon with a vegetable peeler, taking care not to include too much of the bitter white pith. Finely chop the lemon peel and ginger in a food processor.\n            \n\n              Transfer the lemon-ginger mixture to a medium saucepan, add the sugar and water and bring to a boil. Reduce heat, and simmer, partially covered, for 15 minutes. Strain the mixture and cool. Cover and refrigerate for up to 1 week.\n            \n\n              Yield: 2 cups\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "", "quantity": 3.0}, {"food": "syrup", "quantity": 0.5}, {"food": "lime juice", "quantity": 0.5}, {"food": "lime", "quantity": 1}, {"food": "lemon juice", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 2.0}, {"food": "sugar", "quantity": 1.0}, {"food": "coconut water", "quantity": 2.0}], "title": "\nGinger Martini\n"}, {"directions": "\n\n              Mix 4 tablespoons melted butter, 2 tablespoons sliced crystallized ginger and 3 tablespoons sugar in a large bowl; toss with 4 halved and pitted peaches. Place the fruit on a large sheet of foil; scatter 1 cup raspberries on top. Fold in the sides of the foil and seal to form a packet. Grill over medium-high heat until the peaches are tender and the berries are juicy, 15 to 20 minutes. Turn the peaches to coat in the berry sauce. Serve with vanilla ice cream or yogurt, if desired.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [], "title": "\nGinger Peach Melba\n"}, {"directions": "\n\n              Position a rack in the center of the oven and preheat to 325 degrees F. Lightly spray a 9 by 13 by 2-inch baking dish with vegetable cooking spray. Line the pan with parchment or waxed paper.\n            \n\n              Melt 2 tablespoons of the butter in a medium skillet over medium-high heat. Add the pears and cook, stirring occasionally, until golden brown, about 7 minutes. Stir in 1 tablespoon of the brown sugar and 1 teaspoon of the pumpkin pie spice and remove pan from the heat.\n            \n\n              Whisk the flour, ginger, the remaining 1 teaspoon of pumpkin pie spice, baking soda, baking powder, and salt in a large bowl.\n            \n\n              In another bowl, whisk the milk, molasses, and remaining brown sugar. Add the eggs and whisk until smooth. Use a spatula to stir the molasses mixture into the dry ingredients to make a thick liquid batter.\n            \n\n              Heat the water and remaining 2 tablespoons butter in a small saucepan until just boiling. Whisk the hot water into to the batter until just combined. Stir in the pears. Pour the batter into the prepared pan. Bake in the center of the oven, until a toothpick inserted into the center comes out clean, about 40 minutes.\n            \n\n              Cool cake in the pan on a rack. Cut into 12 squares. Dust with confectioners' sugar before serving, if desired.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 0.25}, {"food": "prickly pears", "quantity": 2.0}, {"food": "sugar", "quantity": 0.5}, {"food": "pumpkin pie spice", "quantity": 2.0}, {"food": "potato flour", "quantity": 1.5}, {"food": "ginger", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.25}, {"food": "milk", "quantity": 0.25}, {"food": "molasses", "quantity": 0.5}, {"food": "eggs", "quantity": 2.0}, {"food": "coconut water", "quantity": 0.25}, {"food": "sugar", "quantity": 1}], "title": "\nGinger Pear Cake\n"}, {"directions": "\n\n              Grind the oatmeal and pecan pieces in a food processor until they resemble cornmeal--reasonably fine but with some texture. Whisk the whole wheat flour, cornstarch, ginger, salt and baking soda together in a medium bowl. Whisk in the oat/nut mixture.\n            \n\n              In another medium bowl, beat the butter with an electric mixer until smooth and light, about 1 minute. Gradually add the granulated and light brown sugar; continue beating until evenly combined, about 3 minutes more. Add the vanilla and the egg.\n            \n\n              Mix in the dry ingredients to make a textured dough. Line a 1 1/2-quart loaf pan or 3 mini loaf pans with plastic wrap and pack dough into the bottom half of the pan. Press to level off the dough. Lay a piece of plastic wrap on top and refrigerate until completely firm, about 2 hours.\n            \n\n              Preheat the oven to 350 degrees F. Line 2 baking sheets with parchment paper or silicone mats.\n            \n\n              Remove dough from the pan and unwrap. Slice dough in half lengthwise if using a large pan. Slice each log crosswise into 1/4-inch thick cookies. Place the cookies about a 1-inch apart on the prepared pans. Bake until golden brown, 15 to 18 minutes. Transfer cookies to a rack to cool and crisp. Serve.\n            \n\n              Store cookies in a tightly sealed container for up to 1 week.\n            \n", "ingredients": [{"food": "", "quantity": 1.0}, {"food": "", "quantity": 0.75}, {"food": "potato flour", "quantity": 1.0}, {"food": "cornstarch", "quantity": 0.25}, {"food": "ginger", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "butter oil", "quantity": 0.75}, {"food": "sugar", "quantity": 0.75}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}], "title": "\nGinger Pecan Oatmeal Crisps\n"}, {"directions": "\n\n              Cook 3/4 pound chopped wax beans and 2 bunches quartered radishes in boiling water, 5 minutes. Remove with a strainer and run under cold water. Add 1 1/2 pounds halved baby potatoes to the boiling water and cook 6 to 8 minutes; drain. Toss the potatoes, beans and radishes with 1/4 cup lime juice and 2 tablespoons sugar. Stir in 3/4 cup each mayonnaise and chopped scallions, 4 teaspoons grated ginger, 1 teaspoon salt and some chopped cilantro and parsley. Chill.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [], "title": "\nGinger Potato Salad\n"}, {"directions": "\n\n              Put 10 mint leaves in a tall glass; add 1/2 ounce ginger syrup and muddle with a wooden spoon. Fill the glass with ice and add 1 1/2 ounces gin and 1/2 ounce fresh lime juice. Top with ginger ale and stir to combine. Garnish with a lime wedge.\n            \n\n              Photograph by Jon Paterson/Studio D\n            \n", "ingredients": [], "title": "\nGinger Rogers\n"}, {"directions": "\n\n              Mix 2 tablespoons each grated ginger, finely chopped ginger and finely chopped scallion in a small bowl. Add 1/2 teaspoon kosher salt and 1/4 teaspoon white pepper. Heat 3 tablespoons vegetable oil in a small saucepan until smoking; pour over the ginger-scallion mixture and stir. Add a splash of water if the sauce is too thick. Season with salt.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [], "title": "\nGinger Sauce\n"}, {"directions": "\n\n              Position racks in the upper and lower thirds of the oven and preheat to 350 degrees F. Coat 2 baking sheets with cooking spray. Whisk the flour, ginger and salt in a medium bowl. Beat the butter, brown sugar and molasses in a large bowl with a mixer on medium speed until light and fluffy, about 3 minutes. Reduce the mixer speed to low and gradually beat in the flour mixture until incorporated.\n            \n\n              Roll out the dough until 1/4 inch thick on a lightly floured surface. Cut out cookies with 3-inch cookie cutters; arrange 1 inch apart on the prepared baking sheets. Gather the scraps and reroll to cut out more cookies. Bake, switching the pans halfway through, until the cookies are lightly browned around the edges, 14 to 16 minutes. Let cool completely on the baking sheets.\n            \n\n              Whisk the confectioners' sugar and lemon juice in a small bowl until smooth and thick. Transfer the icing to a small resealable bag. Snip a small corner and decorate the cookies. Let set 15 minutes.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 23.0}, {"food": "ginger", "quantity": 1.0}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 2.0}, {"food": "sugar", "quantity": 0.5}, {"food": "molasses", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "lemon juice", "quantity": 1.0}], "title": "\nGinger Shortbread Cutouts\n"}, {"directions": "\n\n              For the crumb crust: Preheat the oven to 350 degrees F. Grease the sides of a 9-inch springform pan with butter. Wrap the bottom of the pan in foil to prevent leaking. Combine the sugar, salt, 8 of the gingersnap cookies and the graham crackers in a food processor and pulse until crumbly. Drizzle in the butter and continue pulsing until the mixture is the consistency of wet sand. Pour the mixture into the pan and push into the base and halfway up the sides using a glass with straight edges.\n            \n\n              Bake the crust for about 10 minutes, and then let cool completely while you make the filling.\n            \n\n              For the filling: Stir together the pumpkin, dark brown sugar, cinnamon, eggs, banana, egg white and milk in a large bowl. Pour the filling into the baked crumb crust and bake for about 50 minutes. Let cool completely while you make the ginger whipped cream.\n            \n\n              For the ginger whipped cream: Whip the cream with the sugar until soft peaks form using a hand mixer. Fold in the ginger.\n            \n\n              Run a thin knife around the edge of the pie to release it from the pan. Load the whipped cream into a piping bag with a large star tip. Pipe rosettes around the perimeter of the pie and decorate with the 8 remaining gingersnap cookies.\n            \n\n              Cook's Note: Make sure you use a piping bag with a large star tip so the ginger bits in the whipped cream don't clog the tip.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 5.0}, {"food": "sugar", "quantity": 2.0}, {"food": "salt", "quantity": 0.25}, {"food": "chocolate chip cookies", "quantity": 16.0}, {"food": "crackers", "quantity": 1.0}, {"food": "pumpkin flowers", "quantity": 2.0}, {"food": "sugar", "quantity": 0.25}, {"food": "cinnamon", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "banana", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "milk", "quantity": 5.0}, {"food": "ice cream swich", "quantity": 0.75}, {"food": "sugar", "quantity": 3.0}, {"food": "ginger", "quantity": 3.0}], "title": "\nGinger Snap Pumpkin Pie with Ginger Cream\n"}, {"directions": "\n\n              Puree the ginger in a mini food processor with 2 tablespoons water. Squeeze and strain juice through cheesecloth or a fine mesh strainer. Discard the ginger pulp. Reserve the juice. \n            \n\n              Sift the flour, baking soda, salt and spices into a medium bowl, then whisk in the pepper; set aside. \n            \n\n              Cream the butter and sugar with a handheld mixer until light and fluffy, about 1 1/2 minutes. Add the molasses and ginger juice and beat until evenly incorporated, about 2 minutes. (Stir together with a spatula if needed.) Gradually blend the dry ingredients on low speed into the butter mixture until you have a crumbly mixture. Bring the dough together by hand pressing and kneading lightly until moist, but not tacky. Divide into 2 equal portions, press into disks about 1/2-inch thick. Wrap in plastic and chill for at least 1 hour or overnight. \n            \n\n              Position racks evenly in the oven and preheat to 350 degrees F. \n            \n\n              Dust the dough and a work surface with flour. Roll the dough about 1/4 inch thick. Cut out cookies into desired shapes. Transfer to a parchment lined baking sheet. Bake until the cookies are a rich tawny brown, about 18 to 20 minutes. Cool on a rack. \n            \n\n              For decorating: Whisk the water and egg white powder in a medium bowl until foamy and smooth. Gradually whisk in the confectioners' sugar to make a smooth icing. For multiple colors divide the icing into batches and add a food coloring as desired. Spread or pipe the icing onto the cookies. Finish with sprinkles, or candies. Let rest on a rack until the icing sets, about 30 minutes.\n            \n", "ingredients": [{"food": "ginger", "quantity": 1.0}, {"food": "potato flour", "quantity": 3.5}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "salt", "quantity": 0.5}, {"food": "ginger", "quantity": 1.0}, {"food": "cinnamon", "quantity": 2.0}, {"food": "allspice", "quantity": 2.0}, {"food": "black bean mango", "quantity": 0.5}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "molasses", "quantity": 0.6666666666666666}, {"food": "coconut water", "quantity": 0.25}, {"food": "onion powder", "quantity": 3.0}, {"food": "sugar", "quantity": 2.0}, {"food": "barley flour or meal", "quantity": 1}], "title": "\nGinger Spice Cookies\n"}, {"directions": "\n\n              ;\n            \n", "ingredients": [{"food": "potato flour", "quantity": 3.5}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "salt", "quantity": 0.5}, {"food": "ginger", "quantity": 1.0}, {"food": "cinnamon", "quantity": 2.0}, {"food": "allspice", "quantity": 2.0}, {"food": "black bean mango", "quantity": 0.5}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "molasses", "quantity": 0.6666666666666666}, {"food": "grape juice", "quantity": 2.0}, {"food": "onion powder", "quantity": 3.0}, {"food": "sugar", "quantity": 2.0}, {"food": "barley flour or meal", "quantity": 1}], "title": "\nGinger Spice Cookies\n"}, {"directions": "\n\n              Beat the cream cheese, butter, granulated sugar, grated ginger and salt in a large bowl with a mixer until light and fluffy. Add the flour and mix until combined. Turn the dough out onto a sheet of plastic wrap and pat into a 1-inch-thick rectangle. Wrap in the plastic wrap and refrigerate until firm, about 1 hour.\n            \n\n              Line 2 baking sheets with parchment paper. On a lightly floured surface, roll out the dough into a 1/8-inch-thick rectangle, then fold into thirds like a letter. Roll out again to about 1/3 inch thick. Cut into stars using 1 1/2-to-2-inch cookie cutters and place 1 inch apart on the prepared baking sheets. Reroll the scraps and repeat. (Refrigerate the dough if it gets too soft.)\n            \n\n              Beat the egg and 1 tablespoon water in a small bowl. Lightly brush the cookies with the egg wash, then sprinkle with the crystallized ginger and coarse sugar. Refrigerate the cookies until firm, about 20 minutes.\n            \n\n              Preheat the oven to 350 degrees F. Bake until the cookies are slightly puffed and golden brown, 15 to 20 minutes. Let cool 2 minutes on the baking sheets, then transfer to a rack to cool completely. Store in an airtight container up to 3 days.\n            \n\n              Photograph by Steve Giralt\n            \n", "ingredients": [{"food": "macaroni cheese", "quantity": 8.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "ginger", "quantity": 2.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "potato flour", "quantity": 2.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "ginger", "quantity": 0.5}, {"food": "sugar", "quantity": 1}], "title": "\nGinger Stars\n"}, {"directions": "\n\n              Make the biscuits: Beat the cream cheese, butter, granulated sugar, grated ginger and salt in a large bowl with a mixer on medium-high speed until light and fluffy; reduce the speed to low and beat in the flour and candied ginger until just incorporated. Turn the dough out onto a sheet of plastic wrap; press into a 1-inch-thick disk, tightly wrap and refrigerate until firm, about 1 hour or overnight. On a floured surface, roll out the dough into a 10-inch circle, about 1/2 inch thick. Use a 2 1/2-inch biscuit cutter to cut out rounds; arrange about 1 inch apart on a baking sheet. Reroll the scraps and cut out more biscuits (you should have 12). Brush the tops lightly with the heavy cream and sprinkle with the demerara sugar. Refrigerate until firm, about 20 minutes. Position racks in the upper and lower thirds of the oven and preheat to 350 degrees F. Bake the biscuits until slightly puffed and golden brown, 25 to 30 minutes. Let cool 5 minutes on the baking sheet, then remove to a rack to cool completely.\n            \n\n              Meanwhile, make the toppings: Puree half of the strawberries in a blender with 1/4 cup granulated sugar and the grated ginger until smooth; transfer to a bowl. Dice the remaining strawberries; add to the pureed berries and toss. Beat the sour cream, heavy cream and the remaining 2 tablespoons granulated sugar in a separate bowl with a mixer on medium-high speed until soft peaks form. Serve each person 2 biscuits with the whipped cream and strawberry mixture. Photograph by Anna Williams\n            \n", "ingredients": [{"food": "macaroni cheese", "quantity": 6.0}, {"food": "butter oil", "quantity": 1.5}, {"food": "sugar", "quantity": 0.25}, {"food": "ginger", "quantity": 1.5}, {"food": "hearts of palm", "quantity": 1}, {"food": "potato flour", "quantity": 1.5}, {"food": "ginger", "quantity": 0.25}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "strawberries", "quantity": 1.0}, {"food": "sugar", "quantity": 0.25}, {"food": "ginger", "quantity": 0.5}, {"food": "sour cream", "quantity": 0.3333333333333333}, {"food": "ice cream swich", "quantity": 0.5}], "title": "\nGinger Strawberry Shortcakes\n"}, {"directions": "\n\n              Make the cookies: Sift together the flour, ginger, baking powder and salt in a medium bowl. Beat the butter and granulated sugar in a large bowl with a mixer on medium-high speed until light and fluffy, about 5 minutes. Add the egg and beat until combined. Reduce the mixer speed to low; add the flour mixture in 2 batches and beat until just incorporated. Divide the dough between 2 sheets of plastic wrap; shape each into a disk. Wrap and refrigerate until firm, at least 4 hours.\n            \n\n              Line 2 baking sheets with parchment paper. Working with 1 piece at a time, lightly flour the dough and roll out until 1/8 inch thick. Cut out shapes with a 3-inch cookie cutter and arrange 1 inch apart on the baking sheets. Refrigerate the cutouts 30 minutes.\n            \n\n              Position racks in the upper and lower thirds of the oven; preheat to 350 degrees F. Bake, switching the pans halfway through, until the cookies are light golden around the edges, 15 to 18 minutes. Let cool 5 minutes on the baking sheets; transfer to racks to cool completely.\n            \n\n              Make the icing: Whisk the confectioners¿ sugar and meringue powder in a large bowl. Add 5 tablespoons water; beat with a mixer on medium-high speed until soft peaks form, adding up to 1 more tablespoon water as needed. Tint with food coloring, if desired. Spread or pipe on the cookies. Sprinkle with nonpareils. Let set, about 1 hour.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.25}, {"food": "ginger", "quantity": 0.75}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 2.0}, {"food": "sugar", "quantity": 0.75}, {"food": "egg substitute", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "onion powder", "quantity": 2.0}, {"food": "coconut water", "quantity": 5.0}, {"food": "", "quantity": 1}, {"food": "", "quantity": 1}], "title": "\nGinger Sugar Cookies\n"}, {"directions": "\n\n              Bring 8 cups water and 1 cup thinly sliced unpeeled ginger to a simmer in a saucepan; simmer until reduced to 5 cups, about 25 minutes. Sweeten with 1/4 cup honey and divide among mugs (strain, if desired). Dust with cinnamon.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [], "title": "\nGinger Tea\n"}, {"directions": "\n\n              Position a rack in the lower third of the oven and preheat to 350 degrees F.\n            \n\n              Line a large (4 1/2-inch by 9 1/2-inch) metal loaf pan with parchment paper and spray with nonstick cooking spray.\n            \n\n              Sift the flour, baking soda, ginger and salt into a medium bowl. Whisk the pumpkin, buttermilk, and vanilla in another bowl.\n            \n\n              Beat the butter with an electric mixer at medium speed until smooth, about 1 minute. Add the light brown sugar and continue beating until light and fluffy, about 4 minutes more. Add the eggs, 1 at a time, beating well after each addition. At low speed, add the flour mixture in 3 parts, alternating with the pumpkin mixture in 2 parts, beginning and ending with the flour. Mix briefly at medium-low speed to make a smooth batter. Turn off beaters and add the crystallized ginger. Finish folding batter--which will be thick--by hand with a rubber spatula.\n            \n\n              Scrape batter into the prepared pan and smooth the top. Bake until a cake tester inserted into the cake comes out clean and top springs back when lightly pressed, about 55 minutes. Cool in pan on a rack 10 to 15 minutes, then invert pan to release cake onto rack to cool. Dust with confectioners' sugar, if desired. Serve.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "ginger", "quantity": 1.0}, {"food": "salt", "quantity": 0.25}, {"food": "pumpkin flowers", "quantity": 1.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.25}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "sugar", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "ginger", "quantity": 0.25}, {"food": "sugar", "quantity": 1}], "title": "\nGinger Tea Cake\n"}, {"directions": "\n\n              Melt the shortening and butter together in a medium saucepan. Let cool. \n            \n\n              Sift the flour, sugar, spices, and salt into the bowl of a standing mixer. \n            \n\n              Mix the butter mixture into the flour mixture with the paddle attachment until sandy. Add the corn syrup and vanilla and mix until evenly incorporated, but still crumbly in texture. Press the dough together by hand and divide into 4 equal portions. Press into disks about 1/2-inch thick. wrap in plastic and refrigerate for at least 2 hours or overnight. \n            \n\n              Dust the dough and a work surface with flour. Roll the dough about 1/4-inch thick. Cut into desired shapes. Transfer to a parchment lined baking sheet. Refrigerate until firm, about 30 minutes. \n            \n\n              Position racks evenly in the oven and preheat to 350 degrees F. \n            \n\n              Bake until a rich tawny brown, about 25 to 30 minutes. Cool on a rack. \n            \n\nRoyal Icing:\n\n\n              Combine all the ingredients, except the food coloring, in the bowl of a standing mixer fitted with the paddle attachment. Mix slowly until stiff enough to form peaks. The icing should be pure white and thick, but not fluffy and bubbly. If the frosting is overbeaten, it will get aerated which makes it harder to work with. If this happens, let the icing sit to settle, then use a rubber spatula to vigorously beat and smooth it out. \n            \n\n              Alternatively, combine ingredients in a large bowl, and beat with hand beaters on low speed until the frosting thickens to stiff peaks. \n            \n\n              Add up to 1 tablespoon food coloring and mix with a rubber spatula until the color is uniform. (Adding too much color reduces the sheen of the frosting and can break down the consistency of the frosting over a couple of days.) Store icing, covered, with plastic film on the surface of the icing.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "potato flour", "quantity": 7.0}, {"food": "sugar", "quantity": 1.0}, {"food": "ginger", "quantity": 3.0}, {"food": "cinnamon", "quantity": 5.0}, {"food": "salt", "quantity": 1.5}, {"food": "corn bran", "quantity": 1.5}, {"food": "vanilla extract", "quantity": 4.0}, {"food": "", "quantity": 1}, {"food": "onion powder", "quantity": 0.5}, {"food": "sugar", "quantity": 0.75}, {"food": "", "quantity": 1}], "title": "\nGinger Train Base\n"}, {"directions": "\n\n              Make the crust: Preheat the oven to 325 degrees F. Pulse the cookies, crystallized ginger and brown sugar in a food processor until finely ground. Add the melted butter and pulse to combine. Press the mixture into the bottom and up the side of a 9-inch pie plate. Bake until set and slightly dry around the edge, 10 to 12 minutes. Transfer to a rack and let cool.\n            \n\n              Make the filling: Whisk the pumpkin puree, coconut milk, granulated sugar, eggs, vanilla, ground ginger and salt in a medium bowl until smooth. Pour into the cooled crust. Bake until the filling is set and no longer looks wet, 1 hour 15 minutes. Transfer to the rack and let cool completely, at least 2 hours.\n            \n\n              Make the topping: Beat the heavy cream, brown sugar and pie spice in a bowl with a mixer on medium-high speed until stiff peaks form, 3 minutes. Spread on the pie; sprinkle with more pie spice.\n            \n\n              Photograph by Ryan Liebe\n            \n", "ingredients": [{"food": "chocolate chip cookies", "quantity": 6.0}, {"food": "ginger", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "pumpkin flowers", "quantity": 1.0}, {"food": "coconut milk", "quantity": 1.0}, {"food": "sugar", "quantity": 0.75}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "ginger", "quantity": 0.5}, {"food": "salt", "quantity": 0.25}, {"food": "ice cream swich", "quantity": 0.75}, {"food": "sugar", "quantity": 1.0}, {"food": "pumpkin pie spice", "quantity": 0.25}], "title": "\nGinger-Coconut Pumpkin Pie\n"}, {"directions": "\n\n              Fill a large skillet halfway with water; add a pinch of salt, cover and bring to a boil. Add the pearl onions and cook 1 minute to loosen the skins, then drain and rinse under cold water. Using kitchen shears, trim the root ends of the onions, then peel off the skins. Return the onions to the skillet. \n            \n\n              Add the parsnips, ginger, rosemary, garlic, wine, sugar, 1/2 teaspoon salt and 1 cup water to the skillet with the onions. Bring to a boil over high heat and cook, stirring occasionally, until the liquid evaporates and the vegetables are tender, 15 to 20 minutes. (If the liquid evaporates too quickly, add more water, 1/4 cup at a time.) Discard the ginger, garlic and rosemary. (The vegetables can be made up to 3 hours ahead to this point; cover and refrigerate.) \n            \n\n              Reduce the heat to medium high; add the vinegar, brandy and butter and cook, stirring, until the vegetables just start to brown, 1 to 2 minutes. Add 2 tablespoons water and cook, swirling the pan, until the vegetables are glazed, about 1 more minute. Season with salt and pepper and top with parsley.\n            \n\n              Per serving: Calories: 185; Total Fat: 5 grams; Saturated Fat: 3 grams; Protein: 2 grams; Total carbohydrates: 30 grams; Sugar: 12 grams; Fiber: 7 grams; Cholesterol: 13 milligrams; Sodium: 122 milligrams\n            \n\n              Photograph by Gentl & Hyers\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "onions", "quantity": 10.0}, {"food": "parsnips", "quantity": 1.5}, {"food": "luncheon slices", "quantity": 4.0}, {"food": "rosemary", "quantity": 1.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "martha white foods", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "pepper", "quantity": 1}, {"food": "parsley", "quantity": 1}], "title": "\nGinger-Glazed Pearl Onions and Parsnips\n"}, {"directions": "\n\n              Divide the shrimp between two 8- or 9-inch pie pans and pat them completely dry with a paper towel. Arrange the shrimp so they lay flat and are evenly spaced in the pans.\n            \n\n              Heat 2 large skillets over medium heat. Season the shrimp with salt and pepper; add a teaspoon of butter to each pan and turn the heat to high. When the foam subsides, invert a pie pan of shrimp over the skillet so they fall into the pan all at once. Repeat with the other pan of shrimp. Cook the shrimp, undisturbed, until they turn golden brown on the bottom, about 2 minutes. Add a remaining teaspoon of butter to each pan and turn off the heat. Turn the shrimp over with tongs and cook for 1 minute in the residual heat of the pans. Add half the ginger, lime juice and zest, mint, and basil to each pan, and shake to combine.\n            \n\n              Divide the shrimp among 4 plates or a serving platter and serve hot or at room temperature.\n            \n", "ingredients": [{"food": "shrimp", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 4.0}, {"food": "ginger", "quantity": 1.5}, {"food": "lime juice", "quantity": 2.0}, {"food": "lime", "quantity": 0.5}, {"food": "chrysanthemum leaves", "quantity": 10.0}, {"food": "chrysanthemum leaves", "quantity": 10.0}], "title": "\nGinger-Lime Shrimp\n"}, {"directions": "\n\n              Mix 2 tablespoons white miso, 3/4 cup mayonnaise, 1 tablespoon grated peeled ginger and 2 teaspoons honey.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [], "title": "\nGinger-Miso Mayo\n"}, {"directions": "\n\n              Combine the ginger with the sugar and 1/2 cup water in a small saucepan, bring to a boil, and then reduce the heat and simmer for 10 minutes. Allow the mixture to cool, then strain, reserving the sliced ginger.\n            \n\n              Put 2 tablespoons each of the ginger syrup in 4 tall glasses, add a mint sprig to each and a couple slices of ginger; slightly muddle or crush. Fill the glasses 3/4 of the way with ice cubes. Add 1/2 cup of orange juice and 1 tablespoon of lime juice to each glass and stir. Top off each glass with 1/2 cup seltzer and stir well. Serve.\n            \n", "ingredients": [{"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "coconut water", "quantity": 0.5}, {"food": "", "quantity": 4.0}, {"food": "tangerine juice", "quantity": 2.0}, {"food": "lime juice", "quantity": 0.25}, {"food": "coconut water", "quantity": 2.0}], "title": "\nGinger-Orange Spritzer\n"}, {"directions": "\n\n              Prepare the ham: Combine 3 gallons hot water, the salt, brown sugar, juniper berries, peppercorns, ginger and bay leaves in a large nonreactive container or pot and stir until the salt and sugar dissolve. Let the brine cool. Meanwhile, stand the ham, cut-side down, on a cutting board and score the skin with a sharp knife in a crosshatch pattern. Place the ham in the brine, cover and refrigerate at least 24 hours or up to 2 days. \n            \n\n              Preheat the oven to 450 degrees F. Remove the ham from the brine and dry completely. Strain the brine, reserving the spices. Press some of the juniper berries and peppercorns onto the flat cut side of the ham. Scatter the bay leaves in a large roasting pan and place a rack in the pan. Stand the ham, cut-side down, on the rack and roast 1 hour. Reduce the oven temperature to 325 and roast 2 more hours. \n            \n\n              Make the glaze: Whisk the peach preserves, brown sugar, mustard, vinegar, ginger, and salt and pepper to taste in a bowl. Brush the ham with half of the glaze; continue roasting until deep golden, about 1 more hour. Brush the ham with the remaining glaze, turn it on its side and roast until a thermometer inserted into the center registers 155 and the skin is crisp, 30 to 45 more minutes. Transfer to a cutting board, tent with foil and let rest 20 minutes before carving.\n            \n\n              Skim the fat from the roasting pan juices and discard the bay leaves. Stir to make a sauce. Carve the ham and serve with the sauce. \n            \n\n              Photograph by Roland Bello\n            \n", "ingredients": [{"food": "salt", "quantity": 2.5}, {"food": "sugar", "quantity": 2.5}, {"food": "goji berries", "quantity": 2.0}, {"food": "black bean mango", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 4.0}, {"food": "ham", "quantity": 1.0}, {"food": "silk peach soy yogurt", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "mustard spinach", "quantity": 0.5}, {"food": "vinegar", "quantity": 3.0}, {"food": "ginger", "quantity": 2.0}, {"food": "salt", "quantity": 1}], "title": "\nGinger-Peach Glazed Ham\n"}, {"directions": "\n\n              Put about 1-inch of water in a saucepan and bring to a simmer over medium heat. Beat the egg yolks, sugar, rum, and orange juice in a heatproof bowl that can rest in the saucepan without touching the water (we like stainless steel ones) until foamy and light, about 30 seconds. Set the bowl over the water and whip with an electric mixer or whisk, moving in a circular motion around the bowl, until the eggs thicken, about 2 minutes.\n            \n\n              Remove the bowl from the heat and, with the mixers, beat in the pumpkin, spice, and salt. Continue beating until the mixture is cooled. Stir in about 1/2 the ginger.\n            \n\n              In another bowl, whip the cream until it forms stiff peaks. Fold the whipped cream into the pumpkin mixture. Divide the mousse among 8 bowls or wine glasses, scatter the remaining ginger over the top of each, and cover tightly with plastic wrap. Chill mousses for at least 2 hours and up to 24 hours.\n            \n\n              Please note: If you are restricting sugar in your diet, you can substitute 1/3 cup sugar substitute for the 1/3 cup sugar. The nutrient value per serving will then be 281 calories, 25 g fat (15 g saturated), 4 g protein, 10 g carbohydrate, 2 g fiber.\n            \n", "ingredients": [{"food": "egg substitute", "quantity": 4.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "", "quantity": 2.0}, {"food": "orange juice", "quantity": 0.5}, {"food": "pumpkin flowers", "quantity": 15.0}, {"food": "pumpkin pie spice", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "ginger", "quantity": 0.5}, {"food": "ice cream swich", "quantity": 2.0}], "title": "\nGinger-Pumpkin Mousse\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: parchment paper\n\n              Position 2 racks in the upper and lower thirds of the oven and preheat to 400 degrees F. Cut four 16-inch long sheets of parchment paper. Fold each sheet in half and open like a book. Divide the pieces of parchment between 2 baking sheets (2 pieces per sheet).\n            \n\n              Trim away the tendon attached to the thicker part of the tenderloin with kitchen shears and discard. Sprinkle the chicken all over with 3/4 teaspoon salt.\n            \n\n              Combine the soy sauce, sesame oil, rice vinegar, sambal, scallion whites, ginger, and 1 tablespoon water in a small bowl. Place snow peas and shiitakes in a medium bowl and toss with 2 tablespoons of the soy sauce mixture.\n            \n\n              Mound 3/4 cup brown rice on each parchment sheet, placing it on one side of the fold, and drizzle with 1 tablespoon water. Top with the vegetables, and two chicken tenders per serving, tucking as many of the vegetables as possible under the chicken. Spoon about 2 teaspoons of the soy sauce mixture evenly over each serving of chicken. (You should have some left over for drizzling later.)\n            \n\n              Fold over the top half of the parchment, crimping and overlapping small folds along the open edge to seal tightly. Bake until the parchment puffs, 18 minutes; chicken will be cooked through. Transfer the packets to plates and let stand 2 minutes. Avoiding the hot steam, carefully cut open the packets. Drizzle remaining soy sauce mixture over the chicken and rice. Top with scallion greens, cilantro, and sesame seeds.\n            \n", "ingredients": [{"food": "chicken tenders", "quantity": 8.0}, {"food": "salt", "quantity": 1}, {"food": "soy sauce", "quantity": 5.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "turnip greens", "quantity": 4.0}, {"food": "ginger", "quantity": 2.0}, {"food": "pigeon peas", "quantity": 8.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "crisped rice bar", "quantity": 3.0}, {"food": "", "quantity": 0.5}, {"food": "sesame seeds", "quantity": 2.0}], "title": "\nGinger-Scallion Chicken Parchment Pack\n"}, {"directions": "\n\n              Place 1 halveed seeded spaghetti squash in a microwave-safe bowl with 2 tablespoons water; cover and microwave until tender, 15 minutes. Let cool, then scrape with a fork. Puree 1/2 cup chopped carrots with 1/4 cup water, a 1-inch piece of ginger, the whites from 3 scallions, 2 tablespoons sesame oil, sysauce and rice vinegar and 1 tablespoon brown sugar. Toss with the squash and scallion greens. Top with toasted sesame seeds.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [], "title": "\nGinger-Scallion Spaghetti Squash\n"}, {"directions": "\n\n              Cook 1 pound halved peeled rainbow carrots in a large skillet with 1/4 inch salted boiling water until tender, 7 to 9 minutes. Drain, then return to the skillet. Add 2 tablespoons butter and 2 teaspoons grated peeled ginger; toss. Add 2 teaspoons each lemon juice and soy sauce; season with salt and pepper. Top with chives.\n            \n\n              Photograph by Ryan Liebe\n            \n", "ingredients": [], "title": "\nGinger-Soy Glazed Rainbow Carrots\n"}, {"directions": "\n\n              Pour the ginger ale into a 9-by-13-inch baking dish. Freeze overnight.\n            \n\n              Bring 4 cups water, the sugar and mint to a boil in a saucepan, stirring to dissolve the sugar. Let cool 2 minutes, then add the tea bags and let cool completely, 30 minutes to 1 hour; discard the tea bags.\n            \n\n              Strain the sweet tea into a pitcher and add the bourbon. Refrigerate until ready to serve. Scrape the ginger ale ice with a fork and divide among glasses. Add the cocktail and garnish with mint sprigs.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "ginger", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "", "quantity": 1.0}, {"food": "black bean mango", "quantity": 3.0}, {"food": "", "quantity": 1.5}], "title": "\nGinger-Sweet Tea Juleps\n"}, {"directions": "\n\n              Preheat the oven to 325 degrees F. Lightly spray a 9 by 13 by 2-inch cake pan with cooking spray. Line the pan with parchment or waxed paper.\n            \n\n              Whisk together the applesauce, buttermilk, molasses, and sugar in a medium bowl. Add the eggs and whisk until smooth.\n            \n\n              Whisk the flour, baking soda, baking powder, ginger, cinnamon, salt, cloves, and allspice together in a large bowl. Add the molasses mixture into the flour mixture and whisk until combined.\n            \n\n              Bring the water and butter to a boil in a small saucepan. Add the hot liquid to the batter, and whisk until just combined. Pour the batter into the prepared pan. Bake the cake in the center of the oven, until a toothpick inserted into the center comes out clean, about 40 minutes. Cool the cake in the pan on a rack. Cut into 12 squares and serve with the yogurt sauce.\n            \n\nYogurt Sauce\n\n\n              Line a strainer with cheesecloth or a coffee filter and set over a small bowl. Stir the yogurt, and put it in the strainer. Set aside at room temperature to drain and thicken, about 30 minutes. Discard the excess liquid. In a small bowl, combine the thickened yogurt with the sugar. Serve.\n            \n\n              Serving: 1 tablespoon\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "applesauce", "quantity": 1.0}, {"food": "silk light vanilla", "quantity": 0.5}, {"food": "molasses", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "eggs", "quantity": 2.0}, {"food": "potato flour", "quantity": 3.0}, {"food": "baking chocolate", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "ginger", "quantity": 1.0}, {"food": "cinnamon", "quantity": 2.0}, {"food": "salt", "quantity": 0.5}, {"food": "cloves", "quantity": 0.25}, {"food": "allspice", "quantity": 0.25}, {"food": "coconut water", "quantity": 0.5}, {"food": "butter oil", "quantity": 3.0}, {"food": "", "quantity": 1}, {"food": "silk plain soy yogurt", "quantity": 1.5}, {"food": "sugar", "quantity": 0.25}], "title": "\nGingerbread - Slimmed\n"}, {"directions": "\nSpecial equipment: printed templates or ruler and triangle, assorted cookie cutters, piping bags with medium and fine tips\n\n              Melt the shortening and butter together in a medium saucepan. Let cool.\n            \n\n              Sift the flour, sugar, ginger, cinnamon and salt into a large bowl. Mix the melted butter into the flour mixture with an electric mixer until sandy. Add the corn syrup and vanilla, and mix until evenly incorporated, but still crumbly in texture. Press the dough together by hand and divide into 8 equal parts. Press into rough squares about 1 inch thick. Wrap in plastic and refrigerate for at least 2 hours or overnight.\n            \n\n              Place the dough on top of a flour-dusted sheet of parchment. Roll a square of dough about 1/4-inch thick and into an 8- by 11-inch rectangle. Repeat with all the remaining squares. Stack them up and refrigerate until firm, about 30 minutes.\n            \n\n              Meanwhile, click here to e-mail a link of the template to your desktop or laptop computer for printing. Print the file at 100% on letter size paper and cut out the pieces. Remove the top sheet of parchment from the dough. Lay the templates on the rolled dough slabs and cut out all the pieces with a long, sharp knife or pizza cutter. (You will have a total of 8 cut panels plus 3 extra sheets for cookies. Cut out the remaining dough with cookie cutters of your choice.) Cut a 3 1/2- by 3 1/2-inch square centered at the base of one of the tall walls then cut that piece in half to make the two barn doors. Stack panels on a cookie sheet and chill 45 minutes to set. Preheat the oven to 350 degrees F and position the oven racks evenly. Bake the gingerbread shapes until they are a rich tawny brown, 25 to 30 minutes. Cool on a rack. With a fine kitchen rasp, file the panels to make all the edges straight.\n            \n\n              Thicken about 2 cups of the Royal Icing with either cornstarch and a couple of drops of vinegar, or extra confectioners' sugar, to get the consistency of caulk. Fit a pastry bag with a medium round tip and fill it with the thickened icing.\n            \n\n              Pipe a generous amount of Royal Icing along the bottom and the sides of a short wall. Center the wall 3/4 inch from one edge, directly onto the base. Use a box or can to help support the walls while they dry.\n            \n\n              Pipe Royal Icing along the bottom of a tall wall, and stick it to the base with an edge pressed against the icing on the first wall. Repeat with the remaining two walls in the same manner until the four walls are up, making an open box with a 3/4-inch border all around the base. (The two tall walls will face each other.) Allow the icing to dry completely, about 24 hours, before attaching the roof.\n            \n\n              Ice the sloped edges on one side of the house and attach the big roof piece. (Line up the top of the roof with the peaks of the tall walls.) Use a box or can to prop up the overhang of the roof while it dries in place. Attach the smaller roof piece on the other side of the slope (prop it up with a box or can) leaving the same amount of overhang. Leave the top open for now. The last roof panel is the lid and will go there when all is dry. Attach the doors. Pipe Royal Icing neatly on the outside of the seams to secure them, and allow the house to dry for 24 hours.\n            \n\n              Fit tips into piping bags. Divide the remaining Royal Icing into batches and color as desired. Fill bags with frosting and decorate the house and roof with icing and candies if using.\n            \n\n              Allow to dry. Fill the house with cookies. Rest the remaining roof slab on the house to make a lid. Enjoy.\n            \n\nRoyal Icing:\n\n\n              Combine the confectioners' sugar, meringue powder and 3/4cup water in a large bowl. Mix slowly with an electric mixer until stiff enough to form peaks; the icing should be pure white and thick, but not fluffy and bubbly. If the frosting is over beaten, it will get aerated which makes it harder to work with. If this happens, let the frosting sit to settle, and then use a rubber spatula to vigorously beat and smooth out the frosting.\n            \n\n              Add up to 1 tablespoon food coloring and mix with a rubber spatula until the color is uniform. Gels are best with royal icing. You don't want to thin them with liquid colors. Be careful of adding too much color, which reduces the sheen of the frosting and can break down the consistency of the frosting over a couple of days. Store the icing at room temperature, covered, with plastic wrap on the surface.\n            \n\n              Copyright 2005 Television Food Network, G.P. All rights reserved.\n            \n", "ingredients": [{"food": "shortening confectionery", "quantity": 2.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "potato flour", "quantity": 14.0}, {"food": "sugar", "quantity": 2.0}, {"food": "ginger", "quantity": 0.3333333333333333}, {"food": "cinnamon", "quantity": 3.5}, {"food": "salt", "quantity": 1.0}, {"food": "corn bran", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 2.5}, {"food": "potato flour", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "vinegar", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "sugar", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "", "quantity": 1}], "title": "\nGingerbread Barn\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: Printed templates or ruler and triangle, assorted cookie cutters, 1 1/2-inch circle cookie cutter, piping bags with medium and fine tips\n\n              For the gingerbread birdhouse: Melt the shortening and butter together in a medium saucepan. Let cool. Sift the flour, granulated sugar, ginger, cinnamon and salt into a large bowl. Mix the melted butter into the flour mixture with an electric mixer until sandy. Add the corn syrup and vanilla, and mix until evenly incorporated, but still crumbly in texture. Press the dough together by hand and divide into 8 equal parts. Press into rough squares about 1-inch thick. Wrap in plastic and refrigerate for at least 2 hours or overnight. Place the dough on top of a flour-dusted sheet of parchment. Roll a square of dough about 1/4-inch thick and into an 8- by 11-inch rectangle. Repeat with all the remaining squares. Stack them up and refrigerate until firm, about 30 minutes.\n            \n\n              Meanwhile, click here to e-mail a link of the template to your desktop or laptop computer for printing. Print the file at 100-percent on letter-size paper and cut out the pieces. Remove the top sheet of parchment from the dough. Lay the templates on the rolled dough slabs and cut out all the pieces with a long, sharp knife or pizza cutter. (You will have a total of 8 cut panels plus 3 extra sheets for cookies. Cut out the remaining dough with cookie cutters of your choice.) Use a 1 1/2-inch circle cookie cutter to cut the hole for the door opening into one of the tall walls. Stack panels on a cookie sheet and chill 45 minutes to set.\n            \n\n              Preheat the oven to 350 degrees F and position the oven racks so they are evenly spaced.\n            \n\n              Bake the gingerbread shapes until they are a rich tawny brown, 25 to 30 minutes. Cool on a rack. With a fine kitchen rasp, file the panels to make all the edges straight.\n            \n\n              Thicken about 2 cups of the Royal Icing with either cornstarch and a couple of drops of vinegar, or confectioners' sugar, to get the consistency of caulk. Fit a pastry bag with a medium round tip and fill it with the thickened icing. Pipe a generous amount of Royal Icing along the bottom and the sides of a short wall. Center the wall of the base 3/4 inch from one edge. Use a box or can to help support the walls while they dry. Pipe Royal Icing along the bottom of a tall wall, and stick it to the base with an edge pressed against the icing on the first wall. Repeat with the remaining two walls in the same manner until the four walls are up, making an open box with a 3/4-inch border all around the base. (The two tall walls will face each other.) Allow the icing to dry completely, about 24 hours, before attaching the roof.\n            \n\n              Ice the sloped edges on one side of the house and attach the big roof piece. (Line up the top of the roof with the peaks of the tall walls.) Use a box or can to prop up the overhang of the roof while it dries in place. Attach the smaller roof piece on the other side of the slope (prop it up with a box or can) leaving the same amount of overhang. Leave the top open for now. The last roof panel is the lid and will go there when all is dry. Pipe Royal Icing neatly on the outside of the seams to secure them, and allow the house to dry for 24 hours.\n            \n\n              Fit tips into piping bags. Divide the remaining Royal Icing into batches and color as desired. Fill bags with the icing and decorate the house and roof with icing and candies if using. Allow to dry. Fill the house with cookies. Rest the remaining roof slab on the house to make a lid. Enjoy.\n            \n\nRoyal Icing:\n\n\n              Combine the confectioners' sugar, meringue powder and 3/4 cup water in a large bowl. Mix slowly with an electric mixer until stiff enough to form peaks; the icing should be pure white and thick, but not fluffy and bubbly. If the frosting is over beaten, it will get aerated which makes it harder to work with. If this happens, let the frosting sit to settle, and then use a rubber spatula to vigorously beat and smooth out the frosting. \n            \n\n              Add up to 1 tablespoon food coloring and mix with a rubber spatula until the color is uniform. Gels are best with royal icing. You don't want to thin them with liquid colors. Be careful of adding too much color, which reduces the sheen of the frosting and can break down the consistency of the frosting over a couple of days. Store the icing at room temperature, covered, with plastic wrap on the surface.\n            \n", "ingredients": [{"food": "shortening confectionery", "quantity": 2.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "potato flour", "quantity": 14.0}, {"food": "", "quantity": 1}, {"food": "sugar", "quantity": 2.0}, {"food": "ginger", "quantity": 0.3333333333333333}, {"food": "cinnamon", "quantity": 3.5}, {"food": "salt", "quantity": 1.0}, {"food": "corn bran", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 2.5}, {"food": "potato flour", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "vinegar", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "sugar", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "", "quantity": 1}], "title": "\nGingerbread Birdhouse\n"}, {"directions": "\nSpecial equipment: printed templates or ruler and triangle, assorted cookie cutters, 1 1/2-inch circle cookie cutter, piping bags with medium and fine tips\n\n              Make the basic gingerbread house cookie dough\n            \n\n              Melt the shortening and butter together in a medium saucepan. Let cool.\n            \n\n              Sift the flour, sugar, ginger, cinnamon and salt into a large bowl. Mix the melted butter into the flour mixture with an electric mixer until sandy. Add the corn syrup and vanilla, and mix until evenly incorporated, but still crumbly in texture. Press the dough together by hand and divide into 8 equal parts. Press into rough squares about 1 inch thick. Wrap in plastic and refrigerate for at least 2 hours or overnight.\n            \n\n              Place the dough on top of a flour-dusted sheet of parchment. Roll a square of dough about 1/4-inch thick and into an 8- by 11-inch rectangle. Repeat with all the remaining squares. Stack them up and refrigerate until firm, about 30 minutes.\n            \n\n              Cut the pieces:\n            \n\n              Meanwhile, click here to e-mail a link of the template to your desktop or laptop computer for printing. Print the file at 100% on letter size paper and cut out the pieces. Remove the top sheet of parchment from the dough. Lay the templates on the rolled dough slabs and cut out all the pieces with a long, sharp knife or pizza cutter. (You will have a total of 8 cut panels plus 3 extra sheets for cookies. Cut out the remaining dough with cookie cutters of your choice.) Use a 1 1/2-inch circle cookie cutter to cut the hole for the door opening into one of the tall walls. Stack panels on a cookie sheet and chill 45 minutes to set. Preheat the oven to 350 degrees F and position the oven racks evenly. Bake the gingerbread shapes until they are a rich tawny brown, 25 to 30 minutes. Cool on a rack. With a fine kitchen rasp, file the panels to make all the edges straight.\n            \n\n              Thicken some royal icing:\n            \n\n              Thicken about 2 cups of the Royal Icing with either cornstarch and a couple of drops of vinegar, or extra confectioners' sugar, to get the consistency of caulk. Fit a pastry bag with a medium round tip and fill it with the thickened icing.\n            \n\n              Put up a wall:\n            \n\n              Pipe a generous amount of royal icing along the bottom and the sides of a short wall. Center the wall 3/4 inch from one edge, directly onto the base. Use a box or can to help support the walls while they dry.\n            \n\n              Put up other walls:\n            \n\n              Pipe royal icing along the bottom of a tall wall, and stick it to the base with an edge pressed against the icing on the first wall. Repeat with the remaining two walls in the same manner until the four walls are up, making an open box with a 3/4-inch border all around the base. (The two tall walls will face each other.) Allow the icing to dry completely, about 24 hours, before attaching the roof.\n            \n\n              Attach the roof:\n            \n\n              Ice the sloped edges on one side of the house and attach the big roof piece. (Line up the top of the roof with the peaks of the tall walls.) Use a box or can to prop up the overhang of the roof while it dries in place. Attach the smaller roof piece on the other side of the slope (prop it up with a box or can) leaving the same amount of overhang. Leave the top open for now. The last roof panel is the lid and will go there when all is dry. Pipe royal icing neatly on the outside of the seams to secure them, and allow the house to dry for 24 hours.\n            \n\n              Decorate:\n            \n\n              Fit tips into piping bags. Divide the remaining royal icing into batches and color as desired. Fill bags with frosting and decorate the house and roof with icing and candies if using. Allow to dry. Fill the house with cookies. Rest the remaining roof slab on the house to make a lid. Enjoy.\n            \n", "ingredients": [{"food": "shortening confectionery", "quantity": 2.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "potato flour", "quantity": 14.0}, {"food": "sugar", "quantity": 2.0}, {"food": "ginger", "quantity": 0.3333333333333333}, {"food": "cinnamon", "quantity": 3.5}, {"food": "salt", "quantity": 1.0}, {"food": "corn bran", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 2.5}, {"food": "potato flour", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "vinegar", "quantity": 1}, {"food": "", "quantity": 1}], "title": "\nGingerbread Birdhouse\n"}, {"directions": "\n\n              Lightly butter a 9 by 13 by 2-inch cake pan and line the bottom with a piece of parchment or wax paper. Preheat the oven to 325 degrees F.\n            \n\n              In a large bowl, whisk together the oil, sugar, molasses, and crystallized ginger. Add the eggs and whisk until smooth.\n            \n\n              In another large bowl, whisk together the flour, ground ginger, cinnamon, salt, and cloves. Whisk the molasses mixture into the flour mixture until evenly combined.\n            \n\n              In a small saucepan, bring the water to a boil. Remove from the heat and stir in the baking soda. Whisk the hot water into the batter until just combined. Transfer the batter into the prepared pan. Bake the cake in the center of the oven, until a toothpick inserted into the center comes out clean, about 45 minutes. Cool the cake in the pan on a rack. Cut into squares and serve with whipped cream or ice cream.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "molasses", "quantity": 1.0}, {"food": "ginger", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 2.0}, {"food": "potato flour", "quantity": 3.0}, {"food": "ginger", "quantity": 1.0}, {"food": "cinnamon", "quantity": 2.0}, {"food": "salt", "quantity": 1.0}, {"food": "cloves", "quantity": 0.25}, {"food": "coconut water", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1}], "title": "\nGingerbread Cake\n"}, {"directions": "\n\n              Make the cake: Preheat the oven to 375 degrees F. Coat an 11-by-17-inch rimmed baking sheet or jelly roll pan with cooking spray; line the bottom with parchment paper. Whisk the flour, cinnamon, ginger, allspice, baking powder, baking soda, nutmeg, cloves and salt in a medium bowl.\n            \n\n              Whisk the egg yolks, melted butter and molasses in a large bowl. Beat the egg whites and granulated sugar with a mixer on medium-high speed until stiff peaks form, 5 minutes. Stir the\n            \n\n              flour mixture into the yolk mixture until smooth. Stir one-third of the whites into the batter with a rubber spatula, then fold in the remaining whites in two batches. Spread the batter in the prepared pan; bake until a toothpick inserted into the center comes out with just a few crumbs, 10 to 12 minutes.\n            \n\n              Immediately sift confectioners' sugar generously over the top of the warm cake and loosen the edges with a knife; lay a clean kitchen towel (not terry cloth) over the cake. Place another baking sheet over the towel and flip the cake with the baking sheets to invert it onto the towel. Remove the top baking sheet and parchment. Starting at a short end, roll up the cake and the towel together into a spiral. Transfer seam-side down to a rack and let cool completely.\n            \n\n              Meanwhile, make the filling: Beat the heavy cream and 3/4 cup confectioners' sugar with a mixer on high speed until soft peaks form. Beat in the mascarpone and vanilla. (Do not overbeat.) Fold in the chocolate chips and candied citrus with a rubber spatula.\n            \n\n              Make the topping: Combine the remaining 2 tablespoons confectioners' sugar, the cinnamon, ginger, allspice, nutmeg and cloves in a bowl. Gently unroll the cake. Spread the filling over the cake about 1/4 inch from the edges; reroll (without the towel). Trim the ends with a serrated knife. Transfer to a platter; dust with the spice mixture.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 1.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "ginger", "quantity": 1.0}, {"food": "allspice", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "nutmeg", "quantity": 0.25}, {"food": "cloves", "quantity": 0.25}, {"food": "salt", "quantity": 0.25}, {"food": "eggs", "quantity": 4.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "molasses", "quantity": 0.75}, {"food": "sugar", "quantity": 0.25}, {"food": "sugar", "quantity": 1}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "sugar", "quantity": 0.75}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.3333333333333333}, {"food": "orange peel", "quantity": 0.3333333333333333}, {"food": "cinnamon", "quantity": 0.5}, {"food": "ginger", "quantity": 0.5}, {"food": "allspice", "quantity": 0.25}, {"food": "hearts of palm", "quantity": 1}, {"food": "hearts of palm", "quantity": 1}], "title": "\nGingerbread Cake Roll\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F; line three baking sheets with parchment paper and lightly coat with cooking spray. Sift together the flour, baking powder, cinnamon, ginger, salt, baking soda and cloves in a small bowl and set aside.\n            \n\n              Combine the brown sugar, butter, molasses, milk and egg yolk in the bowl of a stand mixer fitted with a paddle attachment. Beat on medium-high speed until smooth, about 1 minute. Add the flour mixture and mix on low, increasing the speed gradually to medium high, until a ball of dough forms, about 3 minutes.\n            \n\n              Lightly coat two pieces of parchment paper with cooking spray. Sandwich the dough between the two pieces (sprayed side touching the dough). Roll out until about 1/16-inch thick. Freeze so the dough gets really firm, about 30 minutes. Cut out with 2-inch cookie cutters and transfer to the prepared baking sheets. Whisk the egg white in a small bowl, brush onto the tops of the cookies and sprinkle with the crystallized ginger. Re-roll and cut out the scraps if desired.\n            \n\n              Bake until golden, rotating the sheets about halfway through, 10 to 12 minutes. Let cool a few minutes on the sheets, and then transfer to a rack to cool.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "wheat flour", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "cinnamon", "quantity": 0.5}, {"food": "ginger", "quantity": 0.5}, {"food": "salt", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 0.125}, {"food": "cloves", "quantity": 1}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "butter oil", "quantity": 2.0}, {"food": "molasses", "quantity": 2.0}, {"food": "milk", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "ginger", "quantity": 2.0}], "title": "\nGingerbread Cookie Thins\n"}, {"directions": "\n\n              Whisk the flour, baking powder, cinnamon, ginger, cloves, salt and baking soda in a medium bowl. Beat the brown sugar, molasses, melted butter and egg yolks in a large bowl with a mixer on medium-high speed until smooth, about 1 minute. Reduce the mixer speed to low; add the flour mixture and beat, gradually increasing the speed to medium high, until the dough comes together, about 3 minutes.\n            \n\n              Roll out the dough between 2 pieces of parchment paper coated with cooking spray until 1/8 inch thick. Freeze until firm, 30 minutes.\n            \n\n              Position racks in the upper and lower thirds of the oven and preheat to 350 degrees F. Line 2 baking sheets with parchment. Cut out cookies using 2-inch cutters; arrange 1 1/2 inches apart on the baking sheets. Gather the scraps and chill until firm, then reroll once to cut out more cookies. Refrigerate the cutouts until firm, 20 minutes.\n            \n\n              Bake the cookies, switching the pans halfway through, until golden, 10 to 12 minutes. Let cool 2 minutes on the baking sheets, then transfer to racks to cool completely.\n            \n\n              Make the icing: Beat the confectioners' sugar, meringue powder and 3 to 4 tablespoons water in a bowl with a mixer on high speed until smooth and thick. Transfer to a resealable bag and snip a small corner. Pipe onto the cookies and sprinkle with nonpareils. Let set 30 minutes.\n            \n\n              Photograph by Andrew Purcell\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.25}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "cinnamon", "quantity": 0.5}, {"food": "ginger", "quantity": 0.5}, {"food": "hearts of palm", "quantity": 1}, {"food": "salt", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "sugar", "quantity": 0.5}, {"food": "molasses", "quantity": 3.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "egg substitute", "quantity": 2.0}, {"food": "", "quantity": 1}, {"food": "sugar", "quantity": 2.0}, {"food": "onion powder", "quantity": 2.0}, {"food": "", "quantity": 1}], "title": "\nGingerbread Cutouts\n"}, {"directions": "\n\n              Whisk the flour, ginger, cinnamon, baking soda, allspice, salt and pepper in a medium bowl. Beat the butter, molasses and superfine sugar in a large bowl with a mixer on medium-high speed until light and fluffy, about 3 minutes. Reduce the mixer speed to low; add the flour mixture in 2 batches and beat until just incorporated. Divide the dough in half, wrap in plastic wrap and refrigerate until firm, at least 30 minutes or overnight.\n            \n\n              Position racks in the upper and lower thirds of the oven and preheat to 375 degrees F. Working with 1 piece of dough at a time, roll out the dough on a lightly floured surface until about 1/8 inch thick. Cut out shapes using 3-inch cookie cutters and arrange on 2 ungreased baking sheets. Gather the scraps and refrigerate until firm; reroll once to cut out more cookies. Refrigerate the cutouts until firm, about 10 minutes.\n            \n\n              Bake the cookies, switching the position of the pans halfway through, until the edges are just browned and set, 12 to 15 minutes. Let cool 2 minutes on the baking sheets, then transfer to racks to cool completely.\n            \n\n              Meanwhile, make the icing: Whisk the confectioners' sugar with 1 tablespoon boiling water in a small bowl; add 1 teaspoon water if the icing is too thick. Transfer to a resealable plastic bag; snip off a small corner and pipe the icing onto the cookies. Let set, about 30 minutes.\n            \n\n              Photograph by Johnny Miller\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.5}, {"food": "ginger", "quantity": 1.0}, {"food": "cinnamon", "quantity": 0.75}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "allspice", "quantity": 0.25}, {"food": "salt", "quantity": 0.25}, {"food": "pepper", "quantity": 0.25}, {"food": "butter oil", "quantity": 2.0}, {"food": "molasses", "quantity": 0.3333333333333333}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "sugar", "quantity": 1.0}], "title": "\nGingerbread Cutouts\n"}, {"directions": "\nSpecial equipment: printed templates or ruler and triangle, assorted cookie cutters, 2-inch circle cookie cutter, piping bags with medium and fine tips\n\n              Melt the shortening and butter together in a medium saucepan. Let cool.\n            \n\n              Sift the flour, sugar, ginger, cinnamon and salt into a large bowl. Mix the melted butter into the flour mixture with an electric mixer until sandy. Add the corn syrup and vanilla, and mix until evenly incorporated, but still crumbly in texture. Press the dough together by hand and divide into 8 equal parts. Press into rough squares about 1 inch thick. Wrap in plastic and refrigerate for at least 2 hours or overnight.\n            \n\n              Place the dough on top of a flour-dusted sheet of parchment. Roll a square of dough about 1/4-inch thick and into an 8- by 11-inch rectangle. Repeat with all the remaining squares. Stack them up and refrigerate until firm, about 30 minutes.\n            \n\n              Meanwhile, click here to e-mail a link of the template to your desktop or laptop computer for printing. Print the file at 100% on letter size paper and cut out the pieces. Remove the top sheet of parchment from the dough. Lay the templates on the rolled dough slabs and cut out all the pieces with a long, sharp knife or pizza cutter. (You will have a total of 8 cut panels plus 3 extra sheets for cookies. Cut out the remaining dough with cookie cutters of your choice.) Cut a 2- by 3-inch door with a rounded top into one of the tall walls. (We used a 2 inch cookie cutter to make the rounded top, and a sharp knife to cut the rest of the door out.) Stack panels on a cookie sheet and chill 45 minutes to set. Preheat the oven to 350 degrees F and position the oven racks evenly. Bake the gingerbread shapes until they are a rich tawny brown, 25 to 30 minutes. Cool on a rack. With a fine kitchen rasp, file the panels to make all the edges straight.\n            \n\n              Thicken about 2 cups of the Royal Icing with either cornstarch and a couple of drops of vinegar, or extra confectioners' sugar, to get the consistency of caulk. Fit a pastry bag with a medium round tip and fill it with the thickened icing.\n            \n\n              Pipe a generous amount of Royal Icing along the bottom and the sides of a short wall. Center the wall 3/4 inch from one edge, directly \n            \n\n              onto the base. Use a box or can to help support the walls while they dry.\n            \n\n              Pipe Royal Icing along the bottom of a tall wall, and stick it to the base with an edge pressed against the icing on the first wall.\n            \n\n              Repeat with the remaining two walls in the same manner until the four walls are up, making an open box with a 3/4-inch border all around the base. (The two tall walls will face each other.) Allow the icing to dry completely, about 24 hours, before attaching the roof.\n            \n\n              Ice the sloped edges on one side of the house and attach the big roof piece. (Line up the top of the roof with the peaks of the tall walls.) Use a box or can to prop up the overhang of the roof while it dries in place. Attach the smaller roof piece on the other side of the slope (prop it up with a box or can) leaving the same amount of overhang. Leave the top open for now. The last roof panel is the lid and will go there when all is dry. Attach the doors. Pipe Royal Icing neatly on the outside of the seams to secure them, and allow the house to dry for 24 hours.\n            \n\n              Fit tips into piping bags. Divide the remaining Royal Icing into batches and color as desired. Fill bags with frosting and decorate the house and roof with icing and candies if using.\n            \n\n              Allow to dry. Fill the house with cookies. Rest the remaining roof slab on the house to make a lid. Enjoy.\n            \n\nRoyal Icing:\n\n\n              Combine the confectioners' sugar, meringue powder and 3/4cup water in a large bowl. Mix slowly with an electric mixer until stiff enough to form peaks; the icing should be pure white and thick, but not fluffy and bubbly. If the frosting is over beaten, it will get aerated which makes it harder to work with. If this happens, let the frosting sit to settle, and then use a rubber spatula to vigorously beat and smooth out the frosting.\n            \n\n              Add up to 1 tablespoon food coloring and mix with a rubber spatula until the color is uniform. Gels are best with royal icing. You don't want to thin them with liquid colors. Be careful of adding too much color, which reduces the sheen of the frosting and can break down the consistency of the frosting over a couple of days. Store the icing at room temperature, covered, with plastic wrap on the surface.\n            \n\n              Copyright 2005 Television Food Network, G.P. All rights reserved.\n            \n", "ingredients": [{"food": "shortening confectionery", "quantity": 2.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "potato flour", "quantity": 14.0}, {"food": "sugar", "quantity": 2.0}, {"food": "ginger", "quantity": 0.3333333333333333}, {"food": "cinnamon", "quantity": 3.5}, {"food": "salt", "quantity": 1.0}, {"food": "corn bran", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 2.5}, {"food": "potato flour", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "vinegar", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "sugar", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "", "quantity": 1}], "title": "\nGingerbread Doghouse\n"}, {"directions": "\n\n              Combine the milk, cocoa powder, sugar, molasses, ginger, cinnamon nutmeg and allspice in a medium saucepan. Cook over medium heat, stirring occasionally, until the sugar, cocoa powder and spices are dissolved and the milk is steaming, about 5 minutes. Do not let the mixture come to a boil. Whisk in the chopped chocolate a little at a time until smooth. Divide among 6 to 8 mugs and garnish with whipped cream and mini marshmallows.\n            \n", "ingredients": [{"food": "milk", "quantity": 6.0}, {"food": "onion powder", "quantity": 0.25}, {"food": "sugar", "quantity": 0.25}, {"food": "molasses", "quantity": 2.0}, {"food": "ginger", "quantity": 3.0}, {"food": "cinnamon", "quantity": 2.0}, {"food": "nutmeg", "quantity": 0.5}, {"food": "allspice", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 7.0}, {"food": "ice cream swich", "quantity": 1}, {"food": "", "quantity": 1}], "title": "\nGingerbread Hot Chocolate\n"}, {"directions": "\n\n              Melt the shortening and butter together in a medium saucepan. Let cool.\n            \n\n              Sift the flour, sugar, spices, and salt into the bowl of a standing mixer.\n            \n\n              Mix the butter mixture into the flour mixture with the paddle attachment until sandy. Add the corn syrup and vanilla and mix until evenly incorporated, but still crumbly in texture. Press the dough together by hand and divide into 4 equal portions. Press into disks about 1/2-inch thick. Wrap in plastic and refrigerate for at least 2 hours or overnight.\n            \n\n              Dust the dough and a work surface with flour. Roll the dough about 1/4-inch thick. Cut into desired shapes. Transfer to a parchment lined baking sheet. Refrigerate until firm, about 30 minutes.\n            \n\n              Position racks evenly in the oven and preheat to 350 degrees F.\n            \n\n              Bake until a rich tawny brown, about 25 to 30 minutes. Cool on a rack.\n            \n\nRoyal Icing:\n\n\n              Combine all the ingredients, except the food coloring, in the bowl of a standing mixer fitted with the paddle attachment. Mix slowly until stiff enough to form peaks. The icing should be pure white and thick, but not fluffy and bubbly. If the frosting is overbeaten, it will get aerated which makes it harder to work with. If this happens, let the icing sit to settle, then use a rubber spatula to vigorously beat and smooth it out.\n            \n\n              Alternatively, combine ingredients in a large bowl, and beat with hand beaters on low speed until the frosting thickens to stiff peaks.\n            \n\n              Add up to 1 tablespoon food coloring and mix with a rubber spatula until the color is uniform. (Adding too much color reduces the sheen of the frosting and can break down the consistency of the frosting over a couple of days.) Store icing, covered, with plastic film on the surface of the icing.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "potato flour", "quantity": 7.0}, {"food": "sugar", "quantity": 1.0}, {"food": "ginger", "quantity": 3.0}, {"food": "cinnamon", "quantity": 5.0}, {"food": "salt", "quantity": 1.5}, {"food": "corn bran", "quantity": 1.5}, {"food": "vanilla extract", "quantity": 4.0}, {"food": "", "quantity": 1}, {"food": "onion powder", "quantity": 0.5}, {"food": "coconut water", "quantity": 0.75}, {"food": "sugar", "quantity": 2.0}, {"food": "", "quantity": 1}], "title": "\nGingerbread House Base\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F and line two 9-by-13-inch pans with parchment paper; coat with cooking spray. Prepare the cake mixes as directed; divide between the pans and bake as directed. Let cool, then unmold.\n            \n\n              Stack the 2 cakes with chocolate frosting in between. Mark the middle with toothpicks as shown, then cut in half crosswise. Stack the 2 halves with frosting in between to make a 4-layer cake. Freeze 30 minutes.\n            \n\n              Put the cake on cardboard with a short side facing you. Mark the middle with toothpicks as shown. To form the roof, shave off the top 2 layers of cake at an angle, starting 1/2 inch to the right and left of the toothpicks.\n            \n\n              Crumble about 2 cups of the cake trimmings and mix with just enough chocolate frosting so it sticks together. Moisten your fingers, then gently mold the top of the cake to form the tip of the roof.\n            \n\n              Cut the graham crackers by scoring with a small serrated knife, then snapping along the scored line. You will need 16 graham cracker squares, 4 large triangles and 2 small triangles to cover the cake.\n            \n\n              Cover the cake completely with the remaining chocolate frosting. Gently press the graham crackers into the frosting to cover the whole cake except the angled roof.\n            \n\n              Cut 1 whole graham cracker into 4 small rectangles for the chimney. Insert into the roof as shown, making sure the tops of the graham crackers are aligned.\n            \n\n              Arrange the cereal on the roof in rows, starting from the bottom and working your way up; overlap the rows so they look like shingles.\n            \n\n              Decorate the house with vanilla frosting, candies and sanding sugar. To make icicles, pipe a dot of frosting, then drag the pastry bag downward. Top the chimney with cotton candy. Dust with confectioners' sugar.\n            \n\n              Photograph by Andrew Purcell\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "shortening cake mix", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "crackers", "quantity": 11.0}, {"food": "cereal bar", "quantity": 4.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1}, {"food": "sugar", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "sugar", "quantity": 1}], "title": "\nGingerbread House Cake\n"}, {"directions": "\nSpecial equipment: a 9-cup gingerbread house cake mold and 2 pastry bags\n\n              For the cake: Preheat the oven to 350 degrees F and generously spray a 9-cup gingerbread house cake mold with nonstick baking spray.\n            \n\n              Whisk the flour, gingerbread spice and salt in a medium bowl. Set aside. Whisk the molasses, oil and granulated sugar in a large bowl. Combine 1 cup boiling water with the baking soda in a heat-proof measuring cup and stir to dissolve. Whisk the water mixture into the molasses mixture until well combined. Whisk in the flour mixture and then the eggs until combined. \n            \n\n              Pour the batter into the prepared cake mold and bake until the edges are set and a toothpick inserted in the center comes out clean with a few wet crumbs, 50 to 55 minutes. Cool for 10 minutes in the pan before unmolding onto a cooling rack to cool completely. \n            \n\n              For the icing: Combine the confectioners' sugar and meringue powder in the bowl of an electric mixer fitted with the whisk attachment. Add 5 tablespoons water and beat on medium-high speed until the icing forms thick and glossy peaks, about 2 minutes, adding up to 1 tablespoon more water, if needed. \n            \n\n              Transfer 1/2 cup of the icing to a small bowl, add food coloring for desired shade of green and stir to combine. Transfer the green icing to a piping bag and snip off the tip. Transfer the remaining icing to a second piping bag and snip off the tip. \n            \n\n              For the decorations: Transfer the cake to a baking sheet or decorative tray. Use the green icing to pipe trees and shrubbery on the sides of the house. Use the white icing to pipe windows and outline the roof and eaves. Sprinkle with the shredded coconut for snow. Decorate the house and grounds with candies such as gumdrops, candy canes, shaved chocolate, cinnamon sticks, white chocolate chips, cinnamon candies and red sanding sugar.\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 1}, {"food": "potato flour", "quantity": 2.5}, {"food": "pumpkin pie spice", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "molasses", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "coconut water", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "eggs", "quantity": 2.0}, {"food": "sugar", "quantity": 1.0}, {"food": "onion powder", "quantity": 2.0}, {"food": "", "quantity": 5.0}, {"food": "baking chocolate", "quantity": 1}], "title": "\nGingerbread House Cake\n"}, {"directions": "\n\n              Sift the flour, baking soda, salt, ginger, cinnamon, cloves and allspice into a medium bowl; set aside. Melt the butter and shortening in a medium saucepan; remove from the heat and stir in the brown sugar and molasses. Transfer to a large bowl and let cool slightly.\n            \n\n              Add the egg to the butter mixture; beat with a mixer on medium speed until incorporated. Reduce the mixer speed to low; beat in the flour mixture in two additions until just combined. Divide the dough in half; wrap each half in plastic wrap and pat into 1/2-inch-thick disks. Refrigerate until firm, at least 2 hours.\n            \n\n              Position racks in the upper and lower thirds of the oven; preheat to 350 degrees F. Line 2 baking sheets with parchment paper. Working with 1 piece of dough at a time, roll out the dough to 1/4 inch thick on a lightly floured surface, dusting with flour as needed. Cut out gingerbread men with a 3 1/2- to 5-inch cookie cutter and arrange 1 inch apart on the prepared baking sheets. Brush off the excess flour and refrigerate the cutouts 15 minutes.\n            \n\n              Bake the cookies until golden around the edges, 10 to 12 minutes. Let cool 3 to 5 minutes on the baking sheets, then transfer to racks to cool completely. Decorate with royal icing and let harden at room temperature, about 1 hour.\n            \n\n              Photograph by Ralph Smith\n            \n", "ingredients": [{"food": "potato flour", "quantity": 3.5}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "ginger", "quantity": 1.0}, {"food": "cinnamon", "quantity": 2.0}, {"food": "cloves", "quantity": 0.25}, {"food": "allspice", "quantity": 0.25}, {"food": "butter oil", "quantity": 6.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "molasses", "quantity": 0.75}, {"food": "egg substitute", "quantity": 1.0}, {"food": "", "quantity": 1}], "title": "\nGingerbread Men\n"}, {"directions": "\n\n              Preheat the oven to 200 degrees F. Line a baking sheet with two kitchen towels stacked on top of each other and place in the oven. This will keep your cooked pancakes warm.\n            \n\n              For the pancakes: Whisk the flour, 1/4 cup plus 2 tablespoons of the sugar, the cornstarch, baking powder, ginger, cinnamon, cloves, baking soda and 1/4 teaspoon of the salt together in a large bowl. Whisk 1 1/4 cups of the milk, the molasses, melted butter, 1/2 teaspoon of the vanilla and the eggs together in a medium bowl. Add the milk mixture to the flour mixture and stir until batter is thick and ingredients are just incorporated (it's okay if there are some lumps). Let the batter rest for 5 minutes. \n            \n\n              Meanwhile, make the cream cheese sauce: Combine the remaining 1/4 cup plus 2 tablespoons sugar, 1/4 teaspoon salt, 3/4 cup milk and 1/2 teaspoon vanilla with the cream cheese and rum in a small saucepan over medium heat, whisking until the cream cheese melts completely and mixture just begins to simmer, about 2 minutes. Remove the sauce from the heat and keep warm.\n            \n\n              Heat a large nonstick skillet over medium heat. Use 1 heaping tablespoon of the batter per pancake, making enough to just fill the skillet without crowding. Cook until pancakes are golden on the bottom and bubbly on top, about 30 seconds. Flip the pancakes and cook until lightly golden on the bottom, about 30 seconds more. Transfer the pancakes to the baking sheet in the oven, tucking them between the kitchen towels. Repeat with the remaining batter. \n            \n\n              When ready to serve, divide the pancakes between four serving plates, dust with confectioners' sugar and drizzle with the cream cheese sauce. Serve immediately with extra sauce on the side.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.6666666666666665}, {"food": "sugar", "quantity": 0.75}, {"food": "cornstarch", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "ginger", "quantity": 2.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "cloves", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 0.5}, {"food": "milk", "quantity": 2.0}, {"food": "molasses", "quantity": 0.25}, {"food": "butter oil", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "", "quantity": 2.0}, {"food": "sugar", "quantity": 1}], "title": "\nGingerbread Pancakes with Cream Cheese and Rum Sauce\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: a 1 1/2-inch gingerbread person cookie cutter; 3 pastry bags fitted with small plain tips or 3 resealable plastic bags\n\n              For the gingerbread truffles: Line an 8-by-8-inch baking pan with plastic wrap to extend over the sides by several inches. Combine the gingersnap crumbs, butter, brown sugar, molasses and pumpkin pie spice in a food processor and pulse to combine. (You may add a little of the cream to get the mixture more malleable.) Spread the mixture into the baking pan, cover with the overhanging plastic wrap and press it smooth with your hands. Refrigerate 4 hours.\n            \n\n              For coating and decorating the truffles: Set a wire rack over a parchment-lined baking sheet. Using the plastic overhang as handles, remove the truffle mixture in one piece. Flip onto your work surface and remove the plastic so the smoothest side faces up. Use a 1 1/2-inch gingerbread person cutter to cut out 12 gingerbread men. (After cutting the gingerbread men, you may roll the extra truffle mixture into balls for round truffles, if desired.) Place the gingerbread men (and truffle balls, if making) on the rack and place in the freezer while you melt the chocolate.\n            \n\n              Melt the chocolate and coconut oil in a medium bowl at 50 percent power in the microwave for 30 second intervals, stirring after each, until completely smooth, 1 1/2 to 2 minutes total. Allow the chocolate to cool 20 minutes.\n            \n\n              Put a gingerbread man, smooth-side up, on a fork, and spoon the chocolate over, lightly tapping the fork to let the excess drip back into the bowl to achieve a smooth coating of chocolate. Return the gingerbread person to the rack and repeat with the remaining men (and truffle balls, if desired). Refrigerate while you prepare the royal icing for decoration.\n            \n\n              For the royal icing, combine the confectioners' sugar and meringue powder in an electric mixer fitted with the whisk attachment and whisk to combine. With the mixer on low speed, add the lemon juice and 2 tablespoons water and mix until smooth, then scrape down the sides of the bowl and add about 1 tablespoon more water, a little at a time, to make an icing that drizzles slowly from a spoon dipped into the bowl. Increase the speed to high and beat until the icing is very smooth, about 1 minute. Spoon a third of the icing into a pastry bag fitted with a small plain tip. (Alternatively, transfer to a resealable plastic bag and snip off a corner.) Divide the rest of the icing between 2 small bowls, using food coloring to color one red and one green. Transfer the icing to 2 more piping bags, fitted with small plain tips (#3 or #4) or resealable plastic bags. (You will have icing left over.)\n            \n\n              Decorate the gingerbread men (and truffle balls, if desired) with the royal icing. Refrigerate until ready to serve.\n            \n", "ingredients": [{"food": "bread crumbs", "quantity": 2.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "sugar", "quantity": 1.0}, {"food": "molasses", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1}, {"food": "pumpkin pie spice", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 8.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "sugar", "quantity": 2.0}, {"food": "onion powder", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "", "quantity": 1}], "title": "\nGingerbread People Truffles\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: a 4-inch gingerbread man cookie cutter; 6 to 8 mugs; a piping bag or resealable plastic bag\n\n              For the gingerbread people: Whisk together the flour, ginger, cinnamon, baking soda, allspice, nutmeg, baking powder and salt in a medium bowl until well blended.\n            \n\n              Beat together the butter and granulated sugar in a large bowl with an electric mixer starting on low and increasing speed until pale and fluffy, about 3 minutes, scraping the sides of the bowl down as needed. Beat in the molasses until combined, then the egg. (The mixture will look curdled.) Turn to low speed and beat in the flour mixture a little at a time until the mixture comes together, then increase speed and beat until all of the ingredients are well incorporated and you have a sticky dough. Divide the dough in half, flatten into 2 disks and wrap each in plastic wrap. Refrigerate at least two hours and up to overnight.\n            \n\n              Position 2 racks in the top and bottom thirds of the oven and preheat to 350 degrees F. Line 2 baking sheets with parchment paper. Keeping the other disk refrigerated, roll one disk to an 1/8-inch thickness on a well-floured surface, sprinkling flour on and under the dough as needed and sliding a spatula underneath every so often to prevent sticking. If the dough looks crackly or breaks apart, press it back together from the outside edge in. With a 4-inch gingerbread man cookie cutter, cut out gingerbread people as close together on the dough as possible. Pull away the extra dough around each shape and use a small spatula to transfer the people to the prepared cookie sheets about 1 inch apart. Gather together the scraps, leaving behind the excess flour, and knead them a few times to form a smooth dough again. Reroll them in the same way. (If there are any pieces of dough stuck on your surface, scrape them away with a spatula, flour the surface again and then continue to roll the dough.) Check to see if the cutter fits inside the mugs. If the legs are too wide, gently push the legs of the dough cut-outs closer together to make them fit. Freeze the cookies to firm them, about 15 minutes.\n            \n\n              Bake the cookies in the center of the oven racks, rotating the sheets from top to bottom and also turning them 180 degrees around halfway through baking, until they are slightly firm to the touch but not brown, about 12 minutes. Repeat the process with the remaining dough.\n            \n\n              Cool the cookies 5 minutes on the baking sheets, then transfer to a rack to cool completely before icing. The cookies will continue to firm as they cool.\n            \n\n              Combine the confectioners' sugar and meringue powder in a large bowl. Add 3 tablespoons water and beat with a hand mixer on low speed until the frosting thickens. The icing should be pure white and thick, but not fluffy and bubbly. (If the frosting is overbeaten, it will get aerated, which makes it harder to work with. If this happens, let the frosting sit for a bit to settle, then use a rubber spatula to vigorously beat and smooth out the icing.) Separate the icing into bowls and color as desired.\n            \n\n              Put the icing into piping bags or resealable plastic bags and snip the corners to the desired size. Use the icing to decorate the cookies, piping on bathing suits and sunglasses.\n            \n\n              Pipe a little white icing on the widest end of each gumdrop to make a drink with foam. Dot some icing on 1 hand of each gingerbread person and press the drink into the dot to make it stick. Let the cookies set at room temperature, at least 1 hour.\n            \n\n              For the hot chocolate: Combine the milk, cocoa powder, sugar, molasses, ginger, cinnamon, nutmeg and allspice in a medium saucepan. Cook over medium heat, stirring occasionally, until the sugar, cocoa powder and spices are dissolved and the milk is steaming, about 5 minutes. Do not let the mixture come to a boil. Whisk in the chopped chocolate a little at a time until smooth.\n            \n\n              To serve, divide the hot chocolate among 6 to 8 mugs. Insert a gingerbread person with its arms resting on the rim. Add whipped cream and marshmallows as bubbles in the hot tubs.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.0}, {"food": "ginger", "quantity": 1.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "allspice", "quantity": 0.25}, {"food": "nutmeg", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 0.5}, {"food": "sugar", "quantity": 0.5}, {"food": "molasses", "quantity": 0.25}, {"food": "egg substitute", "quantity": 1.0}, {"food": "sugar", "quantity": 8.0}, {"food": "onion powder", "quantity": 0.25}, {"food": "", "quantity": 1}, {"food": "", "quantity": 8.0}, {"food": "milk", "quantity": 6.0}, {"food": "onion powder", "quantity": 0.25}, {"food": "sugar", "quantity": 0.25}, {"food": "molasses", "quantity": 2.0}, {"food": "ginger", "quantity": 3.0}, {"food": "cinnamon", "quantity": 2.0}, {"food": "nutmeg", "quantity": 0.5}, {"food": "allspice", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 7.0}, {"food": "ice cream swich", "quantity": 1}, {"food": "", "quantity": 1}], "title": "\nGingerbread People in Gingerbread Hot Chocolate Tubs\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: a 4-inch gingerbread man cookie cutter\n\n              Whisk together the flour, ginger, cinnamon, baking soda, allspice, nutmeg, baking powder and salt in a medium bowl until well blended.\n            \n\n              Beat the granulated sugar and butter with an electric mixer in a large bowl starting on low speed and increasing to medium, scraping down the sides of the bowl as needed, until pale and fluffy, about 3 minutes. Beat in the molasses until combined, then beat in the egg (the mixture will look curdled). Reduce the speed to low and beat in the flour mixture a little at a time until the mixture comes together. Then increase the speed to medium and beat until well incorporated and a sticky dough forms. Divide the dough in half, flatten into 2 disks and wrap each in plastic wrap. Refrigerate at least 2 hours and up to overnight.\n            \n\n              Position oven racks in the top and bottom thirds of the oven and preheat to 350 degrees F. Line 2 baking sheets with parchment paper.\n            \n\n              Keeping one disk refrigerated, roll the other disk on a well-floured surface to a thickness of 1/8 inch, sprinkling flour on and under the dough as needed and sliding a spatula underneath every so often to prevent sticking. If the dough looks crackly or breaks apart, press it back together from the outside edge in. With a 4-inch gingerbread man cookie cutter, cut out cookies as close together as possible. Pull away the extra dough around each shape and use a small spatula to transfer them to the prepared baking sheets, spacing them about 1 inch apart. Gather together the scraps, leaving behind the excess flour, knead a few times to form a smooth dough again and reroll in the same way. (If there are any pieces of stuck dough on your surface, scrape them away with a spatula, flour the surface again and then continue to roll the dough.)\n            \n\n              Bake the cookies in the center of the oven racks, rotating them from top to bottom and front to back halfway through, until slightly firm to the touch but not brown, about 12 minutes. Cool the cookies 5 minutes on the baking sheets, then transfer to a rack to cool completely before icing. The cookies will continue to firm as they cool. Repeat the process with the remaining dough.\n            \n\n              Meanwhile, make the royal icing for decorating. Combine the confectioners' sugar and meringue powder in a large bowl. Add 6 tablespoons water and beat with an electric mixer on low until the icing thickens. The icing should be pure white and thick, but not fluffy and bubbly. (If overbeaten, it will get aerated, which makes it harder to work with. If this happens, let the icing sit for a bit to settle, then use a rubber spatula to vigorously beat and smooth it out.)\n            \n\n              Spoon about 1/3 cup of icing into each of 3 separate bowls (cover any remaining icing with plastic wrap and reserve in case you need more). Leave 1 bowl white. Dye the second bowl black and the third light brown. Thin out the light brown icing with 1 teaspoon water. Transfer the icing to separate resealable plastic bags. Snip a very tiny hole in the corner of the white and black icing bags, and snip a larger hole in the corner of the light brown icing bag.\n            \n\n              Place each cookie right side up in front of you. With the black icing, pipe an outline around the head of each cookie, around the arms and across the chest with a bowed line. Turn the gingerbread man upside down so it is standing on its head; now you can see the shape of the reindeer's head. Pipe black antlers coming out of the top of the head, over the gingerbread man's legs and feet.\n            \n\n              Using the loose light brown icing, flood each reindeer's head, using a toothpick to nudge the icing into any tight spots. Place a red cinnamon candy in the center of each face for the nose. Dry until set, 40 minutes to 1 hour.\n            \n\n              Once the brown base has dried, pipe on the rest of the face. Pipe 2 white dots above the nose for the whites of the eyes, and 2 white dots on the underside of the ears for downy fur. Use the black icing to pipe a smiling mouth and eyebrows. Once the white icing has slightly dried, pipe in black pupils. Give your reindeer some personality! Let the icing dry until hardened, 1 hour or ideally overnight.\n            \n\n              The cookies can be stored in an airtight container for up to 3 days, but are best eaten fresh.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.0}, {"food": "ginger", "quantity": 1.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "allspice", "quantity": 0.25}, {"food": "nutmeg", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 0.25}, {"food": "sugar", "quantity": 0.5}, {"food": "butter oil", "quantity": 0.5}, {"food": "molasses", "quantity": 0.25}, {"food": "egg substitute", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "onion powder", "quantity": 5.0}, {"food": "", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "cinnamon", "quantity": 18.0}], "title": "\nGingerbread Reindeer\n"}, {"directions": "\nSpecial equipment: a 10 1/2-by-15 1/2-inch rimmed baking sheet a large clean kitchen towel (preferably not terrycloth or microfiber)\n\n              For the cake: Position an oven rack in the middle of the oven and preheat to 350 degrees F. Line a 10 1/2-by-15 1/2-inch baking sheet with parchment paper so it fits the bottom snuggly. Butter and flour the parchment and the sides of the baking sheet.\n            \n\n              Whisk together the flour, baking powder, cinnamon, ginger, pepper, allspice and 1/2 teaspoon salt in a large bowl and set aside.\n            \n\n              Beat the egg yolks and 3/4 cup granulated sugar with an electric mixer on medium-high speed in a large bowl until the mixture is thick and falls into heavy ribbons when the beaters are lifted, about 5 minutes. Beat in the melted butter, molasses and vanilla. Sift the spiced flour mixture into the egg yolk mixture and use a rubber spatula to gently fold together until just incorporated.\n            \n\n              Rinse the egg beaters and beat the egg whites and remaining pinch salt with an electric mixer on medium-high speed in a large bowl until frothy. Add the remaining 1 tablespoon granulated sugar and continue to beat until soft peaks form.\n            \n\n              Fold one-third of the whipped egg whites into the cake batter to loosen it up a bit. Then gently fold in the remaining whipped egg whites until just combined. Pour the cake batter into the prepared baking sheet and spread it out in an even layer. Bake until the middle of the cake springs back when pressed, 12 to 15 minutes.\n            \n\n              To roll up or train the cake: While the cake is still hot, use a knife to cut around the sides of the baking sheet to release the cake. Dust the cake with confectioners' sugar. Spread a large clean kitchen towel (preferably not terrycloth or microfiber) over the top of the cake. Quickly invert the baking sheet onto the towel. Tap the bottom of the baking sheet and slowly lift up; the cake should release and be positioned squarely on the towel. Carefully peel away the parchment paper, making sure not to tear the cake. Trim away any rough edges if desired. Then, while the cake is still warm and starting at the long side of the cake, roll it up into a tight log, taking the towel with it. Let the cake cool completely, rolled up just like this, about 30 minutes.\n            \n\n              For the filling: Beat the cream cheese and butter with an electric mixer on medium-high speed in a medium bowl until smooth. Add the confectioners' sugar, lemon juice, vanilla and salt and beat until thick and smooth. Set aside 2 tablespoons of the filling.\n            \n\n              To fill and roll the cake: Unroll the cooled cake and spread the filling over the top in an even layer. Then roll the cake back up (without the towel this time) and put it seam-side down on a serving platter. Dip each gum drop in some of the reserved filling and evenly space them down the center of the roulade. Dust the cake with more confectioners' sugar. Slice and serve.\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 4.0}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "ginger", "quantity": 1.0}, {"food": "black bean mango", "quantity": 0.25}, {"food": "allspice", "quantity": 0.25}, {"food": "salt", "quantity": 0.5}, {"food": "eggs", "quantity": 6.0}, {"food": "sugar", "quantity": 0.75}, {"food": "molasses", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "sugar", "quantity": 1}, {"food": "macaroni cheese", "quantity": 6.0}, {"food": "butter oil", "quantity": 3.0}, {"food": "sugar", "quantity": 0.75}, {"food": "lemon juice", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 8.0}], "title": "\nGingerbread Roulade Cake\n"}, {"directions": "\n\n              Make the gingerbread dough: Sift together the flour, ginger, cinnamon, baking soda, nutmeg, cloves and salt into a large bowl. Set aside.\n            \n\n              Combine the butter, shortening, brown sugar and granulated sugar in the bowl of a stand mixer fitted with the paddle attachment. Beat on medium speed until light and fluffy, about 1 minute. Add the egg, molasses and vanilla and beat on medium until smooth, about 1 minute. Add the sifted flour mixture and mix on low speed until combined into a smooth dough, about 1 minute. Form the dough into a flat square, wrap in plastic wrap and refrigerate until just firm, about 2 hours and up to overnight.\n            \n\n              Meanwhile, make templates for a gingerbread house. Gather several sheets of stiff paper; a manila folder works well. For the wall panels, cut a rectangle that measures 4 by 7 inches. For the front and back panels of a house with a peaked roof, cut a template that is 6 inches wide at the base, 4 inches to the roofline and 4 1/2 inches slanted to a peak. The template for the roof panels should measure 4 1/2 by 8 inches.\n            \n\n              Roll and cut the gingerbread: Preheat the oven to 300 degrees F. Line 3 baking sheets with parchment paper. Unwrap the dough and cut into 3 equal pieces (a pizza wheel is handy for this). Working with one piece of dough at a time and keeping the other pieces refrigerated, roll the dough into a rectangle 1/8 to 1/4 inch thick. Using the templates, cut out the front and back of the house and remove the scraps around the cutouts. Repeat with the remaining pieces of dough, cutting out 2 roof pieces and 2 side pieces. (If the dough gets too soft while rolling, return it to the refrigerator for 15 minutes before proceeding.) Discard the dough scraps or reroll to make cookies. Chill the dough pieces on the baking sheets for 15 minutes. \n            \n\n              Bake the gingerbread: Bake the dough pieces until crisp almost all the way through (the very center will still be a little soft), 30 to 35 minutes. Cool the pans 10 minutes on a rack, then remove the house pieces to the rack to cool completely. Assemble and decorate the gingerbread panels as desired.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 3.0}, {"food": "ginger", "quantity": 1.0}, {"food": "cinnamon", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "nutmeg", "quantity": 0.5}, {"food": "cloves", "quantity": 0.25}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 4.5}, {"food": "shortening confectionery", "quantity": 4.0}, {"food": "sugar", "quantity": 0.5}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "egg substitute", "quantity": 1.0}, {"food": "molasses", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 1.0}], "title": "\nGingerbread for a Gingerbread House\n"}]