[{"directions": "\n\nWatch how to make this recipe.\n\n\n              Bring the almond milk, 1 3/4 cups water, the diced bananas, almond and vanilla extracts and pinch of salt to a boil in a large saucepan over high heat. \n            \n\n              Stir in the oats, cocoa powder and 1 tablespoon of the honey and reduce the heat to medium. Cook, stirring frequently, until the oats are fully cooked to desired consistency, 6 to 7 minutes. \n            \n\n              Transfer to 4 bowls, top with the sliced bananas, walnuts, the remaining 1 tablespoon honey, cinnamon and chocolate chips and serve.\n            \n", "ingredients": [{"food": "milk", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 0.25}, {"food": "vanilla extract", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "oats", "quantity": 2.0}, {"food": "onion powder", "quantity": 2.0}, {"food": "tamarind nectar", "quantity": 2.0}, {"food": "walnuts", "quantity": 0.3333333333333333}, {"food": "cinnamon", "quantity": 1}, {"food": "baking chocolate", "quantity": 2.0}], "title": "\n\"Hot Chocolate\" Banana-Nut Oatmeal\n"}, {"directions": "\n\n              For the noodles: Mix together the flour, sesame oil, egg, 1 teaspoon salt and 1/3 cup warm water in a large bowl. Knead until a dough forms, about 10 minutes. Cover with plastic wrap and refrigerate for at least 1 hour and up to overnight.\n            \n\n              For the sauce: Combine the soy sauce, fish sauce, gochugaru, sesame seeds, sesame oil, ginger, garlic and scallions in a small bowl. Whisk to combine, cover with plastic wrap and set aside for at least 1 hour.\n            \n\n              Roll out the dough using a rolling pin until it is 1/8 to 1/16 inch thick. Starting at one end, roll the dough into a cylinder, then use a sharp knife to cut it into 1/8-inch-thick noodles. Put the noodles on a parchment-lined baking sheet sprinkled with additional flour, making sure that you use your fingers to separate the noodles so they do not stick together; set aside.\n            \n\n              For the broth: Put the dried anchovies, dried shrimp, garlic, mushrooms, kombu, daikon, onion and 3 quarts water in a medium saucepan. Bring to a boil over medium-high heat, then reduce to a simmer and cook for 20 to 30 minutes. Strain into another medium saucepan and discard the solids. \n            \n\n              For the seafood and toppings: Bring the broth back to a boil and add the seafood. Cover with a lid and cook until the shellfish is open and the shrimp is just cooked through, about 5 minutes. Remove the cooked seafood to a medium bowl and reserve. \n            \n\n              Add the cut noodles and zucchini to the broth and cook until the noodles are just tender, a few minutes. Stir in the eggs and 2 teaspoons salt. Remove from the heat and divide among 4 bowls. Top evenly with the seafood, drizzle with half the sauce and garnish with sliced scallions and some black pepper. Serve immediately with the remaining sauce on the side.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.5}, {"food": "vegetable oil", "quantity": 1.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "soy sauce", "quantity": 0.25}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "sesame seeds", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.5}, {"food": "ginger", "quantity": 0.5}, {"food": "garlic powder", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "anchovies", "quantity": 0.5}, {"food": "shrimp", "quantity": 0.25}, {"food": "garlic powder", "quantity": 5.0}, {"food": "mushrooms", "quantity": 5.0}, {"food": "", "quantity": 2.0}, {"food": "radish seeds", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "cockles", "quantity": 2.0}, {"food": "", "quantity": 3.0}, {"food": "eggs", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1}], "title": "\nHaemul Kalguksu (Seafood Knife Noodles)\n"}, {"directions": "\n\n              For the dipping sauce: Combine the soy sauce, gochugaru, rice vinegar, sesame seeds, ginger, scallions and garlic in a small bowl and set aside.\n            \n\n              For the pancakes: Heat 1 inch of water in a medium saucepan over high heat until boiling. Put the mussels or clams in the pan, cover tightly with a lid and cook until the shells are open and the meat is just cooked, about 5 minutes. Drain and let cool slightly. Pick the meat from the shells and set aside. Discard the shells.  \n            \n\n              Add the all-purpose and rice flours, potato starch, sesame oil and egg to a large bowl. Add the ice water and whisk until well incorporated. The batter consistency should be loose, like heavy cream. Add the shrimp, squid, scallions, chile, shallot, garlic, chives, 3/4 teaspoon salt and the mussel or clam meat and mix well. \n            \n\n              Heat 2 tablespoons of the canola oil in a medium skillet over medium-high heat. Add 1/2 cup of the batter to the skillet and spread it evenly until it is in a single layer, using a spatula if necessary. Lower the heat to medium and cook until the sides are crisp and small bubbles form on top, 3 to 4 minutes. Flip the pancake and cook the other side until brown and crispy, 3 to 4 minutes. Flip the pancake twice more, once again on each side, and cook for 30 seconds per side to ensure the pancake becomes crispy. Repeat with the remaining pancake batter and canola oil. \n            \n\n              Transfer the pancakes to a serving platter and cut into wedges. Serve with the dipping sauce.\n            \n", "ingredients": [{"food": "soy sauce", "quantity": 0.25}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "sesame seeds", "quantity": 1.0}, {"food": "ginger", "quantity": 0.5}, {"food": "", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "barley flour or meal", "quantity": 1.0}, {"food": "potato flour", "quantity": 0.5}, {"food": "rice flour", "quantity": 0.5}, {"food": "potato flour", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "shrimp", "quantity": 4.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.25}, {"food": "", "quantity": 6.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "chives", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.5}], "title": "\nHaemul Pajeon (Korean Seafood Pancake)\n"}, {"directions": "\n\n              1. Trim the excess fat from the hens and reserve at least 2 tablespoons of trimmings and fat. In a 4-quart saucepan or Dutch oven, add the hens, 10 cups water, salt, and 3 scallions. Bring to a simmer and reduce the heat to low so the water just barely bubbles. Simmer for 30 minutes. Remove the hens and allow to cool; strain and reserve the broth.\n            \n\n              2. In a medium saucepan, melt the reserved fat and the sesame oil over medium heat. Remove any skin or browned bits. Add the garlic and 2 1/2 tablespoons ginger and cook until fragrant, about 1 minute. Stir in the rice and toast until opaque, about 2 minutes. Add 3 cups broth and 3 scallions, cover, and simmer, about 20 minutes.\n            \n\n              3. Stir together the soy sauce, brown sugar, and 2 tablespoons broth until the sugar dissolves. In a separate bowl, combine the remaining 1 tablespoon ginger and 1/2 cup broth. In a third bowl, combine the Sriracha and 2 tablespoons broth.\n            \n\n              4. Place half a hen and a small bowl of broth on a plate along with some rice, 1 green onion, and condiments on the side. Spoon the broth and condiments over the rice, or as desired.\n            \n", "ingredients": [{"food": "game meat bison", "quantity": 2.0}, {"food": "", "quantity": 6.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "ginger", "quantity": 2.5}, {"food": "crisped rice bar", "quantity": 1.5}, {"food": "soy sauce", "quantity": 4.0}, {"food": "sugar", "quantity": 4.0}, {"food": "Worcestershire sauce", "quantity": 3.0}, {"food": "salt", "quantity": 1}], "title": "\nHainanese Chicken Rice\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Finely grate the zest of one of the limes and add it to the bowl of a mini food processor. Squeeze in the juice of the lime and add the garlic, cilantro, coarsely chopped scallions, cumin and 1 teaspoon salt and pulse until roughly chopped. Add 2 tablespoons of the olive oil and 1 tablespoon water and continue to pulse until the mixture becomes a chunky sauce. \n            \n\n              Toss the halibut in a bowl with all but 1 tablespoon of the sauce and let marinate for 10 to 15 minutes while you prepare the cabbage and the sour cream. \n            \n\n              In a large bowl, toss the remaining 1 tablespoon cilantro sauce with the cabbage, finely chopped scallions, the juice of the second lime, 1 tablespoon of the olive oil and 1/2 teaspoon kosher salt. In a small bowl, stir together the sour cream, the juice of the remaining lime and a pinch of salt. \n            \n\n              Heat a large nonstick skillet over medium-high heat. Add half of the remaining 1 tablespoon olive oil. Add about half of the fish, so the pieces are in a single layer, and cook, turning, until the fish is just opaque and flakes easily with a fork, about 4 minutes. Transfer the fish to a plate and cook the remaining fish with the remaining oil. Divide the fish among the tortillas and top with cabbage. Serve with the sour cream and salsa verde on the side.\n            \n", "ingredients": [{"food": "limes", "quantity": 3.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "cumin seed", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "halibut", "quantity": 1.0}, {"food": "swamp cabbage", "quantity": 4.0}, {"food": "sour cream", "quantity": 0.6666666666666666}, {"food": "", "quantity": 8.0}, {"food": "", "quantity": 1}], "title": "\nHalibut Fish Tacos with Cilantro Savoy Slaw\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F.\n            \n\n              Combine the cilantro, mint, coconut milk, 2 tablespoons water, 1 tablespoon of the oil, the brown sugar, lime juice, garlic, ginger, pepper and 1/4 teaspoon salt in a food processor. Pulse until smooth, then transfer to a small bowl.\n            \n\n              Lay out a 24-inch piece of foil on a baking sheet. Toss the kale with the remaining 1 tablespoon oil and a pinch of salt. Arrange in a single layer in the middle of the foil. Nestle the fish filets on the kale and sprinkle with 1/4 teaspoon of salt. Evenly spread the green curry sauce over each filet. Top loosely with another 24-inch piece of foil (try to keep the foil from touching the fish) and seal the edges.\n            \n\n              Bake the foil pack until the fish is just cooked through and the greens are crisp-tender, 15 to 20 minutes. Carefully unseal the foil pack, and divide the fish and greens among four plates. Top with cilantro and serve with lime wedges.\n            \n", "ingredients": [{"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "coconut milk", "quantity": 0.3333333333333333}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "sugar", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "ginger", "quantity": 2.0}, {"food": "pepper", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "kale", "quantity": 1.0}, {"food": "halibut", "quantity": 6.5}], "title": "\nHalibut Green Curry\n"}, {"directions": "\n\n              For the endive: In a medium skillet over medium heat, heat the olive oil. Add the sugar and endive quarters and brown for about 2 minutes. Next, add the piquillo peppers, garlic and red onions and cook about 3 more minutes. Deglaze with the vegetable broth and add the beans. Cook until the broth is slightly reduced, about 4 minutes. Smash some of the beans to further thicken the sauce. Keep warm.\n            \n\n              For the gremolata: Combine together the mint, parsley, lemon zest, garlic, red pepper flakes and some kosher salt in a small bowl. Add enough extra-virgin olive oil to bind the mixture together, 1 to 2 tablespoons.\n            \n\n              For the fish: Sprinkle the halibut fillets on both sides with salt and pepper. In a large saute pan, add the canola oil and heat on high until there are small wisps of smoke coming from the sides of the pan. Add the fish to the pan and cook until golden, about 4 minutes. Flip and cook until firm but still translucent in the center, 4 more minutes.\n            \n\n              Spoon some endive onto each plate and then a piece of halibut. Top with some of the gremolata.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "sugar", "quantity": 1.0}, {"food": "endive", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.25}, {"food": "garlic powder", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "fava beans", "quantity": 15.0}, {"food": "", "quantity": 3.0}, {"food": "parsley", "quantity": 3.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "halibut", "quantity": 6.0}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}], "title": "\nHalibut with Endive and Gremolata\n"}, {"directions": "\n\n              Heat 2 tablespoons olive oil in a medium skillet over medium heat. Add the endive quarters, sprinkle with sugar and cook, tossing a couple of times, until lightly browned, about 2 minutes. Add the red onion, peppers and garlic and cook until the endive is wilted, about 2 more minutes. Raise the heat to high, add the beans, broth and rosemary and continue cooking, mashing some of the beans with a spoon to thicken the sauce slightly, 2 to 3 minutes. \n            \n\n              Meanwhile, heat the remaining 2 tablespoons oil in a large skillet over medium-high heat. Season the halibut fillets with salt and pepper; place skin-side up in the pan and cook until golden, about 4 minutes. Turn and cook until firm but still translucent in the center, 4 more minutes. \n            \n\n              Place the halibut fillets in 4 shallow bowls and spoon the beans and endive on top. Garnish with parsley. Photograph by Antonis Achiellos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 4.0}, {"food": "endive", "quantity": 2.0}, {"food": "sugar", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "peppers", "quantity": 0.5}, {"food": "garlic powder", "quantity": 1.0}, {"food": "fava beans", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "rosemary", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "parsley", "quantity": 1.0}], "title": "\nHalibut with Tuscan Beans and Endive\n"}, {"directions": "\n\n              Halve and toast the buns in a toaster, or under a broiler. Spread a little mayonnaise and barbecue sauce on the top and bottom of each bun. Layer with lettuce, bacon or ham and turkey. Top with the other half of the bun. Pack upright in a mini air-tight container. Send off to school.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 8.0}, {"food": "mayonnaise dressing", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 4.0}, {"food": "black bean mango", "quantity": 1}, {"food": "bacon", "quantity": 2.0}, {"food": "smoked turkey roll", "quantity": 4.0}, {"food": "grape juice", "quantity": 1.0}, {"food": "garlic bread", "quantity": 1}], "title": "\nHam Club Sandwich Sliders\n"}, {"directions": "\n\n              Spread both sides of buns with mayonnaise, if desired, and barbecue sauce. \n            \n\n              Layer bottom half of buns with lettuce, bacon and ham or turkey. Top with other half of bun. Serve with tomatoes, pickles and potato straws.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 8.0}, {"food": "mayonnaise dressing", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 4.0}, {"food": "black bean mango", "quantity": 1}, {"food": "bacon", "quantity": 2.0}, {"food": "turkey ham", "quantity": 4.0}, {"food": "grape juice", "quantity": 1.0}, {"food": "garlic bread", "quantity": 1}, {"food": "", "quantity": 1}], "title": "\nHam Club Sliders\n"}, {"directions": "\n\n              Heat the vegetable oil in a Dutch oven or heavy-bottomed pot over medium-high heat. Add the onion, bell pepper, celery, garlic, and salt to taste. Cook, stirring occasionally, until the onion is translucent, about 7 minutes. Add the rice, ham, beans and 2 cups water and stir to combine. \n            \n\n              Reduce the heat to medium low, cover and cook until the rice is tender and almost all of the liquid is absorbed, 15 to 20 minutes. (Adjust the heat as necessary to maintain a gentle simmer; this will prevent the rice from sticking.) Remove from the heat and let stand 5 minutes before serving. Season with salt. Serve with hot sauce, if desired. \n            \n\n              Per serving: Calories 724; Fat 18 g (Saturated 5 g); Cholesterol 101 mg; Sodium 363 mg; Carbohydrate 94 g; Fiber 10 g; Protein 46 g\n            \n\nSlow-Cooked Ham and Beans:\n\n\n              Combine the tomato paste, Worcestershire sauce, red pepper flakes and paprika in a 5-to-6-quart slow cooker. Add the ham, beans, bay leaf and thyme. Pour in 4 cups water; cover and cook on low, undisturbed, 8 hours.\n            \n\n              Pour the tomatoes into a bowl and crush them with your hands. Add the tomatoes and their juices, the scallions and garlic to the slow cooker. Cover and cook 30 more minutes.\n            \n\n              Remove the ham from the slow cooker and transfer to a cutting board to cool slightly before slicing. Set aside about one-third of the ham and 3 cups of the stewed bean mixture for another use. Serve the remaining ham with the bean mixture.\n            \n\n              Per serving: Calories 750; Fat 22 g (Saturated 8 g); Cholesterol 201 mg; Sodium 640 mg; Carbohydrate 59 g; Fiber 17 g; Protein 77 g\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "crisped rice bar", "quantity": 1.5}, {"food": "diced chicken", "quantity": 1.5}, {"food": "fava beans", "quantity": 3.0}, {"food": "Worcestershire sauce", "quantity": 1}, {"food": "pasta with tomato sauce", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 2.0}, {"food": "hot pockets ham cheese stuffed swich", "quantity": 1.0}, {"food": "ham", "quantity": 4.0}, {"food": "lima beans", "quantity": 1.0}, {"food": "corier leaf", "quantity": 1.0}, {"food": "thyme", "quantity": 4.0}, {"food": "whole milk", "quantity": 28.0}, {"food": "", "quantity": 1.0}, {"food": "garlic powder", "quantity": 4.0}], "title": "\nHam Jambalaya\n"}, {"directions": "\n\n              Whisk the mayonnaise and mustard together in a large bowl. Pulse the ham and pickles in a food processor until finely chopped but not pureed. Add the ham mixture, pickle juice, celery, onions and celery leaves to the mayonnaise mixture, and stir. Taste; if the salad seems dry (it should be spreadable), add more mayonnaise and/or pickling liquid. Serve as is or on sandwiches.\n            \n", "ingredients": [{"food": "mayonnaise dressing", "quantity": 0.5}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "ham", "quantity": 1.0}, {"food": "pickle loaf", "quantity": 1.25}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.5}], "title": "\nHam Salad\n"}, {"directions": "\n\n              Blend 1/2 cup mayonnaise, 1 chopped spring onion, 2 tablespoons lemon juice, 1/2 teaspoon kosher salt and a few grinds of pepper in a small food processor or blender until smooth. Spread some of the sauce on the bottoms of 8 toasted rolls. Top with thick-sliced baked or smoked ham, assorted pickled vegetables (such as carrots, cucumbers and peppers), watercress, more sauce and the roll tops.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [], "title": "\nHam Sandwiches with Pickled Veggies\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Toss the fries with 1 tablespoon vegetable oil and spread in a single layer on a rimmed baking sheet; sprinkle with the poultry seasoning. Bake until crisp and golden, about 25 minutes.\n            \n\n              Meanwhile, combine the mustard, honey, 1 tablespoon water, 1/4 teaspoon salt and a few grinds of pepper in a small bowl. Combine the mayonnaise, chopped pickles and brine in another small bowl.\n            \n\n              Heat the remaining 1 tablespoon vegetable oil in a large nonstick skillet over medium-high heat. Add the ham steaks and brush with half of the mustard glaze. Cook until golden brown, about 2 minutes. Flip, brush with the remaining mustard glaze and continue cooking until golden brown on the other side, about 2 minutes. Transfer to a cutting board and cut each piece in half; brush with the remaining glaze in the skillet.\n            \n\n              Spread the mayonnaise mixture on the buns. Sandwich with the ham, lettuce and some pickle slices. Serve with the seasoned fries and ketchup.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [{"food": "french toast", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "poultry seasoning", "quantity": 1.0}, {"food": "mustard spinach", "quantity": 0.25}, {"food": "honey smoked ham", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "mayonnaise dressing", "quantity": 0.5}, {"food": "pickle loaf", "quantity": 0.25}, {"food": "ham", "quantity": 2.0}, {"food": "potato flour", "quantity": 8.0}, {"food": "chrysanthemum leaves", "quantity": 1}], "title": "\nHam Sliders with Seasoned Fries\n"}, {"directions": "\n\n              Mix the mayonnaise, sour cream, chives and mustard in a bowl.\n            \n\n              Bring a saucepan of water to a boil. Add the rice, 1/2 teaspoon salt and a few grinds of pepper; reduce the heat to low and simmer until almost tender, about 15 minutes. Add the asparagus and simmer until the rice and asparagus are tender, about 3 more minutes. Drain in a fine-mesh sieve and rinse under cold water, stirring gently to remove excess water. Transfer to a large bowl and stir in the lemon juice and half of the prepared chive sauce; season with salt and pepper.\n            \n\n              Heat the butter in a large nonstick skillet over medium-high heat. Add the ham steaks, overlapping as necessary, and cook, flipping occasionally, until golden, about 5 minutes. Sprinkle the brown sugar over the ham and cook, flipping often, until the sugar melts. Season with pepper. Serve with the rice salad, the remaining chive sauce and lemon wedges.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [{"food": "mayonnaise dressing", "quantity": 0.3333333333333333}, {"food": "sour cream", "quantity": 0.3333333333333333}, {"food": "chives", "quantity": 0.25}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "crisped rice bar", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "asparagus", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "ham", "quantity": 4.0}, {"food": "sugar", "quantity": 2.0}], "title": "\nHam Steaks with Asparagus-Rice Salad\n"}, {"directions": "\n\n              Position racks in the middle and upper third of the oven; preheat to 400 degrees F. Scrub the potatoes and dry well. Bake directly on the middle oven rack until easily pierced with a knife, 45 to 50 minutes. Remove from the oven; let cool 5 minutes.\n            \n\n              Meanwhile, melt 2 tablespoons butter in a medium skillet over medium heat. Add the ham and leek; cook, stirring occasionally, until the leek is wilted, about 6 minutes. Add the cauliflower and chicken broth; season with salt and pepper. Bring to a simmer, cover and cook until the vegetables are tender, 4 to 5 minutes. Uncover and lightly mash the cauliflower. Increase the heat to medium high and cook until the liquid evaporates, 2 to 3 more minutes.\n            \n\n              One at a time, hold each potato with a kitchen towel and halve lengthwise. Scoop the flesh into a large bowl, leaving a 1/4-inch-thick shell. Mash the flesh with 2 tablespoons butter, the heavy cream and cheese until almost smooth and the cheese melts. Stir in the ham mixture, parsley and mustard; season with salt and pepper. Melt the remaining 2 tablespoons butter; brush the potato skins with some of the butter and season the insides with salt and pepper. Set on a baking sheet. Add the breadcrumbs to the remaining melted butter.\n            \n\n              Mound the filling into the potato skins and sprinkle the tops with the breadcrumb mixture. Return to the oven on the top rack and bake until the filling starts browning and the skins are crisp, 18 to 20 minutes.\n            \n\n              Photograph by Ryan Liebe\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "ice cream swich", "quantity": 6.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "parsley", "quantity": 0.25}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "", "quantity": 4.0}, {"food": "butter oil", "quantity": 6.0}, {"food": "ham", "quantity": 0.5}, {"food": "silk light vanilla", "quantity": 1.0}, {"food": "cauliflower", "quantity": 1.0}], "title": "\nHam and Cauliflower Twice-Baked Potatoes\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Butter a 9-by-13-inch casserole dish.\n            \n\n              Heat 2 tablespoons of the butter in a large skillet over medium-high heat. Add the onions and cook, stirring occasionally, until lightly browned, about 5 minutes. Lower the heat to medium and continue cooking and stirring until the onions are soft and caramelized, 20 minutes more. If they start to burn, lower the heat further. Season with salt and black pepper.\n            \n\n              Meanwhile, heat another large skillet over medium heat. Add 2 tablespoons of the butter and the bread and cook, stirring occasionally, until light golden brown all over, about 8 minutes. Season with salt and black pepper. Transfer the bread to a large bowl. Increase the heat to medium-high, add the remaining 2 tablespoons butter and the mushrooms and cook undisturbed to brown for 1 minute. Continue cooking, stirring occasionally, until soft, about 2 minutes more. Season with salt and black pepper.\n            \n\n              Whisk together the eggs, half-and-half, mustard, cayenne, 1/2 teaspoon salt and a few grinds of black pepper in a large bowl. Stir in the onions, bread, mushrooms, ham and 1 cup of the Gruyere. Transfer the mixture to the buttered baking dish. Top with a single layer of tomatoes and sprinkle with the remaining 1/2 cup Gruyere and the Parmesan. (The casserole can be refrigerated overnight and baked the next day.)\n            \n\n              Bake until the top is golden brown and the casserole is set (doesn't jiggle when shaken), about 40 minutes. Top with the parsley.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 6.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "garlic bread", "quantity": 4.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 8.0}, {"food": "eggs", "quantity": 8.0}, {"food": "", "quantity": 1.25}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "", "quantity": 1}, {"food": "diced chicken", "quantity": 4.0}, {"food": "barley flour or meal", "quantity": 1.5}, {"food": "plum", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "parsley", "quantity": 2.0}], "title": "\nHam and Cheese Breakfast Casserole\n"}, {"directions": "\n\n              Preheat the oven to 400. Cover the potatoes with water in a pot; season with salt, cover and boil until just tender, 2 minutes. Drain.\n            \n\n              Whisk the egg yolks, cheese, flour, and pepper to taste in a bowl.\n            \n\n              Heat a 10-inch ovenproof nonstick skillet over high heat. Add 2 tablespoons olive oil, the onion and chiles and cook until browned, 4 minutes. Add the ham and cook 3 minutes. Transfer the mixture to a bowl. Add the remaining 2 tablespoons oil and the potatoes to the skillet and cook until golden, 4 minutes. Add the paprika, parsley and garlic and cook 1 minute. Transfer to the same bowl.\n            \n\n              Beat the egg whites, 2 tablespoons water and 1/2 teaspoon salt with a mixer until soft peaks form. Stir one-third of the whites into the yolk mixture, then gently fold in the rest. Oil the skillet, if dry, and place over medium-low heat. Add the egg mixture, cover and cook until the top just sets, 4 to 6 minutes. Top with the filling and transfer to the oven, uncovered, until set, 5 to 7 minutes.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 2.5}, {"food": "salt", "quantity": 1}, {"food": "eggs", "quantity": 6.0}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "vegetable oil", "quantity": 4.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "ham", "quantity": 0.25}, {"food": "paprika", "quantity": 1.0}, {"food": "parsley", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}], "title": "\nHam and Cheese Pan Souffle\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 350 degrees F. Lightly spray a 9-by-5-by-3-inch metal loaf pan with nonstick cooking spray and set aside.\n            \n\n              In a medium bowl, whisk the flour, baking powder, baking soda, 3/4 teaspoon dry mustard, kosher salt and cayenne until combined. In a large bowl, whisk together 3/4 cup milk, the oil, 1 tablespoon honey and the eggs until smooth. Stir in the dry ingredients until just combined. Then fold in the ham, 3/4 cup shredded cheese, the diced cheese and scallions.\n            \n\n              Pour the batter into the prepared loaf pan and sprinkle the top with the remaining 1/4 cup shredded cheese. Bake until well risen, golden brown and a skewer or cake tester inserted in the center comes out clean, 40 to 45 minutes.\n            \n\n              Cool in the pan for 10 minutes. Meanwhile, in a small microwave-safe bowl, stir together the remaining 1 tablespoon each honey and milk and the remaining 1 1/2 teaspoons dry mustard until smooth. Heat in the microwave until hot and bubbling, 20 to 30 seconds. Turn the loaf onto a wire rack and generously brush with the warm glaze. Cool completely.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.25}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "mustard spinach", "quantity": 2.25}, {"food": "salt", "quantity": 0.5}, {"food": "pepper", "quantity": 1}, {"food": "milk", "quantity": 0.75}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "honey smoked ham", "quantity": 2.0}, {"food": "eggs", "quantity": 3.0}, {"food": "ham", "quantity": 6.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "diced chicken", "quantity": 0.75}, {"food": "", "quantity": 2.0}], "title": "\nHam and Cheese Quick Bread\n"}, {"directions": "\n\n              Spread mayonnaise on sliced white bread. Sandwich with sliced ham, Swiss cheese and pickles.  Trim the crusts and cut into quarters. Thread a quarter onto each skewer; toast over a flame until the cheese melts.\n            \n\n              Photograph by Anna Williams\n            \n", "ingredients": [], "title": "\nHam and Cheese Sandwiches\n"}, {"directions": "\n\n              Insert a paring knife into the thickest part of each chicken breast to make a 3-inch-long pocket down the side, cutting in about halfway. Rub the insides of the pockets with 1 tablespoon of the mustard for all 4 breasts. Stuff each breast with 2 half slices of ham and 1 slice of provolone, folding them to fit. Rub both sides of the chicken breasts with the olive oil and sprinkle with the salt and pepper.\n            \n\n              Heat a nonstick skillet over medium-high heat until very hot, 3 to 5 minutes. Add the chicken breasts and cook until golden brown and just cooked through, 6 to 8 minutes per side depending on the thickness of the chicken; reduce the heat to medium if the chicken becomes too dark towards the end of the cooking time. Cover the skillet with a lid or a piece of aluminum foil during the last 3 minutes of cooking time to finish cooking the chicken through to an internal temperature of 160 degrees F. Check the temperature at the thickest part of the breast without stuffing.\n            \n\n              Transfer the chicken to 4 plates or a cutting board and add the chicken broth and remaining 1 tablespoon mustard to the skillet. Cook, whisking, over medium-high heat until the sauce has reduced by about half, 3 to 4 minutes. Remove from the heat and swirl in the butter and chopped herbs.\n            \n\n              Depending on the size of the breasts, either put 1chicken breast on each of 4 plates or slice all the breasts and divide among 6 plates. Spoon the sauce over the chicken and serve with Crispy Sliced Roasted Potatoes on the side.\n            \n\n              Serving suggestion: Crispy Sliced Roasted Potatoes, recipe follows.\n            \n\nCrispy Sliced Roasted Potatoes:\n\n\n              Place a rimmed baking sheet in the center rack of the oven and preheat the oven to 425 degrees F.\n            \n\n              Thinly slice the potatoes about 1/8-inch thick and toss with the oil, salt and pepper. Carefully spread the slices on the hot baking sheet in a single layer and roast until golden and crispy, turning with a metal spatula occasionally and spreading them out to cook evenly, 30 to 35 minutes.\n            \n", "ingredients": [{"food": "fat free chicken breast ", "quantity": 8.0}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "ham", "quantity": 4.0}, {"food": "luncheon slices", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "black bean mango", "quantity": 0.25}, {"food": "diced chicken", "quantity": 0.6666666666666666}, {"food": "butter oil", "quantity": 1.0}, {"food": "dill seed", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 1.25}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "salt", "quantity": 0.75}, {"food": "black bean mango", "quantity": 0.25}], "title": "\nHam and Cheese Stuffed Chicken Breasts\n"}, {"directions": "\nSpecial equipment: Waffle iron\n\n              Preheat a waffle iron to medium-high. Preheat the oven to 200 degrees F. Whisk together the flour, Gruyere, ham, Parmesan, baking powder, sugar, 1/4 teaspoon salt and a few grinds of pepper in a large bowl. Whisk together the milk, butter, oil, 1 egg and the scallions in another bowl. Pour the milk mixture into the flour mixture and gently stir until just incorporated (it's okay if there are some lumps).\n            \n\n              Lightly brush the top and bottom of the waffle iron with butter. Fill the waffle iron about three-quarters of the way full (some waffle iron should still be showing). Close the lid gently and cook until the waffles are golden brown and crisp, 6 to 7 minutes. Keep the cooked waffles warm in the oven or covered with foil on a plate while you make the remaining waffles.\n            \n\n              Lightly brush the waffle iron bottom with more butter. Crack the remaining 4 eggs right onto the waffle iron and keep the iron open (do this in batches if your iron isn't large enough). Sprinkle the eggs with salt and pepper. Cook until the whites are set and the yolk is still runny, 4 to 5 minutes. Serve 1 egg on each waffle, using a spatula to transfer.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 0.75}, {"food": "macaroni cheese", "quantity": 0.25}, {"food": "ham", "quantity": 2.5}, {"food": "", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.5}, {"food": "sugar", "quantity": 1.5}, {"food": "black bean mango", "quantity": 1}, {"food": "milk", "quantity": 0.75}, {"food": "waffle", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "eggs", "quantity": 5.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}], "title": "\nHam and Cheese Waffles with an Egg\n"}, {"directions": "\n\n              Whisk the vinegar, mustard and a pinch each of salt and pepper in a large bowl. Gradually whisk in 1 tablespoon olive oil until smooth.\n            \n\n              Heat the remaining 1 tablespoon olive oil in a large nonstick skillet over medium-high heat. Add the ham and cook until browned, 2 to 3 minutes per side. Remove each piece to a plate. Reduce the heat to medium low. Working in batches, crack the eggs into the skillet and cook, without flipping, until the whites are set but the yolks are still runny, 4 to 5 minutes. Season with salt and pepper. Divide among the plates.\n            \n\n              Add the bell pepper, mesclun greens and chives to the bowl with the vinaigrette and toss to coat. Season with salt and pepper. Add the salad to the plates. Serve with the baguette.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [{"food": "vinegar", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "ham", "quantity": 2.0}, {"food": "eggs", "quantity": 8.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "turnip greens", "quantity": 1.0}, {"food": "chives", "quantity": 1.0}, {"food": "split pea soup", "quantity": 1.0}], "title": "\nHam and Eggs with Greens\n"}, {"directions": "\n\n              Mash the goat cheese, pepitas and 2 to 3 teaspoons hot sauce in a bowl with a fork until combined. Spread the mixture evenly on 4 slices of bread, then top with the ham and avocado.\n            \n\n              Toss the arugula with the olive oil, a few dashes of hot sauce, and salt and pepper to taste in a bowl. Add the arugula to the sandwiches and cover with the remaining bread. Serve with potato salad.\n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [{"food": "macaroni cheese", "quantity": 6.0}, {"food": "pumpkin flowers", "quantity": 3.0}, {"food": "Worcestershire sauce", "quantity": 1}, {"food": "garlic bread", "quantity": 8.0}, {"food": "ham", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "mixed nuts", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "poultry salad swich spread", "quantity": 1}], "title": "\nHam and Goat Cheese Sandwiches\n"}, {"directions": "\n\n              Set a baking sheet on the middle oven rack; preheat to 425 degrees F. Scatter the ham and cheese in the pie crust. Whisk the eggs, half-and-half, chives, 1/2 teaspoon salt and a few grinds of pepper in a large bowl; pour into the crust. Transfer to the hot baking sheet and bake until the eggs are set and the top is lightly browned, about 30 minutes.\n            \n\n              Meanwhile, whisk the vinegar and mustard in a large bowl. Gradually whisk in the olive oil until smooth. Add the greens and mushrooms; toss well to coat. Season with salt and pepper. Cut the quiche into wedges and serve with the salad.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "honey smoked ham", "quantity": 6.25}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "pie crust", "quantity": 1.0}, {"food": "eggs", "quantity": 3.0}, {"food": "", "quantity": 1.25}, {"food": "chives", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "vinegar", "quantity": 1.0}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "turnip greens", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}], "title": "\nHam and Gruyere Quiche\n"}, {"directions": "\n\n              Lay each collard leaf, underside up, on a flat surface. Locate the thickest part of the stem and use a small, sharp knife to just shave the top off for even thickness (this makes rolling the leaves up easier).\n            \n\n              Fill a large wide skillet or pan with about 1/4 inch of water. Arrange a few leaves at a time, overlapping, in a circle on the bottom of the pan and sprinkle lightly with salt. Repeat with the remaining leaves.\n            \n\n              Put the skillet over medium-high heat and as soon as steam appears, lower the heat to medium, cover and steam until the collards are green, tender and pliable, 8 to 10 minutes. Remove from the heat and use tongs to transfer the leaves to a baking sheet to cool completely.\n            \n\n              Lay out 2 large leaves and slightly overlap (or 3 leaves if they are smaller). If desired, add a few splashes of hot sauce to the mayonnaise. Spread the center of the leaves with 1/2 tablespoon of the mayonnaise, and then top with a slice of cheese followed by three slices of red pepper. Top with another collard leaf, and then with two slices of the ham or 1/4 cup of the chicken. Fold in the sides of the leaves and tightly roll up like a burrito. Cut in half and enjoy, or refrigerate whole for a few hours before serving.\n            \n\n              6th Ingredient: A few splashes of green hot sauce on the mayo.\n            \n", "ingredients": [{"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "Worcestershire sauce", "quantity": 1}, {"food": "mayonnaise dressing", "quantity": 2.5}, {"food": "", "quantity": 5.0}, {"food": "ruby red grapefruit juice blend", "quantity": 15.0}, {"food": "honey smoked ham", "quantity": 10.0}], "title": "\nHam and Pimento Cheese Collard Wraps\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F. Melt 1 tablespoon butter in a large ovenproof skillet over medium-high heat. Add the onion, potatoes and frozen peas and carrots and cook, stirring occasionally, until the vegetables begin to soften, about 5 minutes. Add the ham, flour and thyme and cook, stirring, until combined. Stir in the chicken broth and bring to a boil, then stir in the milk and simmer until slightly thickened, about 3 minutes. Transfer the skillet to the oven and bake until the potatoes are tender, about 20 minutes.\n            \n\n              Meanwhile, melt the remaining 3 tablespoons butter in a medium skillet over medium-high heat. Add the panko, parsley and 1/8 teaspoon each salt and pepper and cook, stirring occasionally, until the panko is slightly toasted, about 4 minutes. Scatter over the ham and vegetable mixture; let rest 5 minutes before serving.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 4.0}, {"food": "ham", "quantity": 1.0}, {"food": "potato flour", "quantity": 3.0}, {"food": "thyme", "quantity": 0.5}, {"food": "diced chicken", "quantity": 1.5}, {"food": "milk", "quantity": 0.6666666666666666}, {"food": "", "quantity": 0.75}, {"food": "parsley", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "onion powder", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 2.0}, {"food": "mixed nuts", "quantity": 1.0}], "title": "\nHam and Vegetable Gratin\n"}, {"directions": "\n\n              Combine the beans, 3 cups water, the onion, ketchup, maple syrup, brown sugar, mustard, molasses, Worcestershire sauce, vinegar and 1/4 teaspoon pepper in a 6-quart slow cooker. Set the ham on top, then cover and cook on high, 8 hours.\n            \n\n              Transfer the ham to a platter and skim off the excess fat from the beans. Slice the ham and serve with the beans.\n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [{"food": "fava beans", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "syrup", "quantity": 0.25}, {"food": "sugar", "quantity": 0.25}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "molasses", "quantity": 1.5}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "ham", "quantity": 1.0}], "title": "\nHam with Barbecue Beans\n"}, {"directions": "\n\n              Preheat the oven to 200 degrees F. \n            \n\n              Spray 4 of the tortillas with cooking spray (or brush with olive oil). Lay the oiled tortillas on a large cutting board oiled-side down. Brush with the mustard and sprinkle with about half of the cheese. Top each evenly with a thin layer of ham, onions and some pepper, and then finish with the remaining cheese. \n            \n\n              Brush the apple butter evenly on the remaining tortillas. Place one apple-butter tortilla on top of a ham-and-cheese tortilla (filling sides in), and firmly press the tortillas together to make a quesadilla. \n            \n\n              Heat a large nonstick skillet over medium heat. Lay a quesadilla oiled-side down in the pan and cook until golden brown and the cheese starts to melt, about 2 minutes. Spray the top of the quesadilla with cooking spray, turn and cook until the other side browns and the cheese is melted, 2 to 3 minutes more. Transfer to a baking sheet and keep warm in the oven. Repeat with the remaining quesadillas. \n            \n\n              Cut the quesadillas into 4 wedges and arrange on plates. Toss the apples with lemon and juice and cinnamon to taste. Serve with the apple slices.\n            \n", "ingredients": [{"food": "whole milk", "quantity": 6.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "spicy black bean enchilada", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "ham", "quantity": 4.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "butter oil", "quantity": 1.5}, {"food": "ruby red grapefruit juice blend", "quantity": 2.0}, {"food": "grape juice", "quantity": 1}], "title": "\nHam, Apple and Cheese Quesadilla\n"}, {"directions": "\n\n              Spread softened butter and dijon mustard inside a split loaf of French bread. Fill with deli ham, sliced brie and sliced green apple. Cut into pieces.\n            \n", "ingredients": [], "title": "\nHam, Brie and Apple Tea Sandwich\n"}, {"directions": "\n\n              Bring 4 1/4 cups water, 1 teaspoon salt and 1/2 teaspoon pepper to a boil in a large saucepan. Stir in the oats, reduce heat to medium and cook, stirring constantly, until the oats are soft and the oatmeal is slightly thickened, about 7 minutes. Stir in the ham, Gruyere and chives and remove the saucepan from the heat.\n            \n\n              Heat the oil in a large nonstick skillet over medium-high heat. Carefully crack the eggs into the pan and cook until the whites are set and slightly crispy and the yolk is still runny, 2 to 3 minutes. Sprinkle with 1/4 teaspoon salt.\n            \n\n              Transfer the oatmeal to individual bowls. Top each with an egg, sprinkle with additional fresh chives and serve.\n            \n", "ingredients": [{"food": "black bean mango", "quantity": 1}, {"food": "oats", "quantity": 2.0}, {"food": "ham", "quantity": 4.5}, {"food": "", "quantity": 3.75}, {"food": "chives", "quantity": 0.6666666666666666}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "eggs", "quantity": 4.0}], "title": "\nHam, Egg and Cheese Oatmeal\n"}, {"directions": "\n\n              Soak the red onion in a bowl of ice water, 10 minutes. Drain the onion and squeeze dry. \n            \n\n              Whisk the yogurt, dill, honey mustard, and salt and pepper to taste in a large bowl. Slowly drizzle in the olive oil and 1 tablespoon water, whisking until combined. Add the onion, ham, cheese, lettuce and apple and toss to coat. Pile the ham mixture in the middle of each wrap. Fold in the sides, then roll up the wraps. Cut in half and serve with the strawberries. \n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "onion powder", "quantity": 0.5}, {"food": "silk plain soy yogurt", "quantity": 0.3333333333333333}, {"food": "dill seed", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.5}, {"food": "ham", "quantity": 4.0}, {"food": "macaroni cheese", "quantity": 3.0}, {"food": "lettuce", "quantity": 1.0}, {"food": "apple", "quantity": 1.0}, {"food": "barley flour or meal", "quantity": 4.0}, {"food": "strawberries", "quantity": 3.0}], "title": "\nHam, Swiss and Apple Wraps\n"}, {"directions": "\n\n              Mix 6 tablespoons softened butter, 2 teaspoons chopped scallion and 1 teaspoon honey. Spread on split mini corn muffins and fill with sliced ham and pickled jalapenos.\n            \n", "ingredients": [], "title": "\nHam-Cornbread Tea Sandwich\n"}, {"directions": "\n\n              Melt 1 tablespoon butter with the olive oil in a large skillet over medium-low heat. Add the onions and cook, stirring occasionally, until soft and caramelized, about 20 minutes. (For a shortcut, use onion marmalade in place of the caramelized onions.)\n            \n\n              Lay out 4 slices of bread. Top with half the cheese, then half the ham. Layer the caramelized onions, apple slices and the remaining ham and cheese on top, then the remaining bread slices.\n            \n\n              Wipe out the skillet; melt 1 tablespoon butter over medium-low heat. Add 2 sandwiches and cook, pressing gently with a spatula, until the bottom is golden and the cheese begins to melt, about 4 minutes.\n            \n\n              Flip and cook until golden, about 4 more minutes. Repeat with the remaining butter and sandwiches.\n            \n\n              Photograph by Steve Giralt\n            \n", "ingredients": [{"food": "butter oil", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "onions", "quantity": 2.0}, {"food": "garlic bread", "quantity": 8.0}, {"food": "macaroni cheese", "quantity": 10.0}, {"food": "ham", "quantity": 8.0}, {"food": "apple", "quantity": 1.0}], "title": "\nHam-Taleggio Grilled Cheese\n"}, {"directions": "\n\n              For the dough: Warm the milk and 1/2 cup water in a medium saucepan over low heat until it is about 100 degrees F (but no more than 110 degrees). Remove the saucepan from the heat, and sprinkle the yeast over the liquid. Sprinkle a pinch of the granulated sugar over the top, and set aside without stirring until foamy, about 5 minutes. Then whisk in the butter and egg yolk.\n            \n\n              Whisk together the flour, remaining granulated sugar and salt in a large bowl. Make a well in the center, and stir in the yeast mixture with a wooden spoon until you've made a thick, slightly sticky dough. Turn the dough onto a floured work surface, and knead until soft and elastic, about 6 minutes. Shape the dough into a ball.\n            \n\n              Brush the inside of a large bowl with butter. Put the dough ball in the buttered bowl, turning to coat lightly. Cover the bowl with plastic wrap, trace a circle the size of the dough ball on the plastic and note the time. Let the dough rise in a warm place until doubled in size, about 1 hour 30 minutes.\n            \n\n              Turn the dough out of the bowl, and knead briefly to release excess air; re-form the dough into a ball, and return it to the bowl. Lightly butter a large piece of plastic wrap, and lay it on the dough. Cover the entire bowl tightly with the rest of the plastic, and refrigerate for 4 hours or overnight to let the dough proof.\n            \n\n              To make the filling: Melt the butter in a medium skillet over medium heat. Add the leeks, and cook, stirring frequently, until softened and just beginning to caramelize, about 5 minutes. Sprinkle the leeks with the flour, and cook, stirring constantly, until lightly browned and toasted, about 1 minute. Whisk in the wine and 1/4 cup water, and let the mixture thicken, whisking constantly, about 1 minute. Remove the skillet from the heat, and stir in the Gruyere, 1/2 teaspoon salt and a few grinds of pepper. Transfer the filling to a medium bowl, and let cool completely. (The filling will firm up a bit, but if it's too warm, it will be difficult to form the rolls.)\n            \n\n              To fill and form the rolls: Butter a 9-by-13-inch baking pan with the 2 tablespoons softened butter. Turn the dough onto a floured work surface, and press it flat. Roll it into a 10-by-18-inch rectangle, with 1 long edge facing you. Spread the cooled filling evenly over the dough, leaving about a 1-inch border on the side opposite you. Sprinkle the ham over the filling. Starting from the side facing you, roll the dough up into a tight roll. Lightly brush the 1-inch border with water, and continue rolling to seal the roll. Fold the ends in just a bit, and if any spots look thicker than others, even out the roll with your hands.\n            \n\n              Cut the roll every 1 1/2 inches with a serrated knife, to make 12 buns. Place the buns cut-side-down (except for the end pieces) in the prepared pan, spacing them 1 inch apart. Cover the buns loosely with plastic wrap. Set in a warm place to rise until the buns double in size, with no gaps in between, 1 hour 30 minutes to 2 hours.\n            \n\n              Position the rack in the center of the oven, and preheat to 350 degrees F. Bake the buns until they're golden brown and the tops spring back when pressed lightly, 25 to 30 minutes. Let cool in the pan for 10 minutes.\n            \n", "ingredients": [{"food": "whole milk", "quantity": 0.5}, {"food": "yeast extract spread", "quantity": 2.25}, {"food": "sugar", "quantity": 2.0}, {"food": "healthy request microwavable bowl", "quantity": 4.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "potato flour", "quantity": 2.75}, {"food": "salt", "quantity": 1.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "turnip greens", "quantity": 1.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "martha white foods", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "ham", "quantity": 0.5}], "title": "\nHam-and-Cheese Buns\n"}, {"directions": "\n\n              Make the kale chips: Preheat the oven to 275 degrees F. Cut off the tough stems of the kale, then cut the leaves into 1 1/2-inch pieces. Toss the kale on a baking sheet with the olive oil and 1/2 teaspoon salt; spread in a single layer. Transfer to the oven and bake, flipping halfway through, until crisp, about 20 minutes.\n            \n\n              Meanwhile, make the sandwiches: Combine the apple and honey mustard in a medium bowl. Spread evenly onto 4 frozen waffles and top with the ham and cheese. Cover with the remaining waffles to make 4 sandwiches.\n            \n\n              Heat 2 tablespoons butter in a large nonstick skillet over medium heat. Add the waffle sandwiches and cook until golden, about 3 minutes per side, adding the remaining 2 tablespoons butter when you flip. Remove to a cutting board and cut the sandwiches in half. Serve with the kale chips.\n            \n\n              Photograph by Andrew Purcell\n            \n", "ingredients": [{"food": "kale", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "apple", "quantity": 1.0}, {"food": "mustard spinach", "quantity": 0.3333333333333333}, {"food": "frozen yogurt", "quantity": 8.0}, {"food": "ham", "quantity": 0.5}, {"food": "cheddar cheese", "quantity": 0.25}, {"food": "butter oil", "quantity": 4.0}], "title": "\nHam-and-Cheese Wafflewiches with Kale Chips\n"}, {"directions": "\n\n              Heat the olive oil in a large skillet over medium heat. Add the onion and thyme; season with salt and pepper. Cook, stirring occasionally, until golden brown, 8 to 10 minutes; let cool.\n            \n\n              Roll and stretch the dough into a 12-inch square on a lightly floured surface. Spread the creme fraeche over the dough. Top with the onion mixture and the ham and chives. Cut the dough into 16 small squares and make 4 stacks of 4 squares each.\n            \n\n              Place each stack on its side in a buttered 9-by-5-inch loaf pan. Gently separate the dough layers so the dough fills the pan.\n            \n\n              Cover the loaf loosely with plastic wrap and set aside in a warm place until the dough rises by half its size, 1 to 2 hours.\n            \n\n              Preheat the oven to 350. Bake the loaf until it's browned and cooked through, 40 to 45 minutes (tent with foil if it's browning too quickly). Let cool 15 minutes in the pan, then loosen the edges with a knife. Remove to a plate and let cool 30 minutes.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "garlic bread", "quantity": 1.0}, {"food": "", "quantity": 0.25}, {"food": "ham", "quantity": 3.0}, {"food": "chives", "quantity": 2.0}], "title": "\nHam-and-Herb Pull-Apart Bread\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees. Pierce the potatoes with a fork; microwave for 15 minutes. Remove and brush with olive oil; transfer to the oven rack and bake until fully tender, about 15 minutes.\n            \n\n              Meanwhile, heat 2 tablespoons oil in a medium skillet over medium heat. Stir in the flour with a wooden spoon and cook until slightly toasted, about 2 minutes. Whisk in the milk and bring to a boil. Reduce the heat and simmer, whisking occasionally, until the sauce begins to thicken, about 6 minutes. Stir in the spinach and ham and cook until the greens wilt and the mixture is about as thick as sour cream, 3 to 4 more minutes. Season with the cayenne and nutmeg and add salt to taste.\n            \n\n              Slice the cooked potatoes lengthwise down the middle (but not all the way through); press in on the ends to open the slit. Drizzle 1/2 tablespoon oil into each potato; fluff the flesh with a fork and season with salt. Divide the spinach mixture among the potatoes and top with the shredded cheese while still hot.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 4.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "milk", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "ham", "quantity": 4.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "hearts of palm", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "macaroni cheese", "quantity": 4.0}], "title": "\nHam-and-Spinach Spuds\n"}, {"directions": "\n\n              Preheat the oven to 450 degrees F. Place a roasting rack on a foil-lined baking sheet in the oven.\n            \n\n              Using your hands, break the meat into small pieces and combine evenly but loosely on a parchment or waxed paper-lined baking sheet. Spread the meat out and season it generously with salt and pepper. If desired, add the spice mix at this time.\n            \n\n              Divide the meat into 4 portions (about 6 ounces each). Using your hands, form each portion into a ball-shape by gently tossing it from 1 hand to the other. (Don't over work or press too firmly on the meat.) Gently form each portion into a patty about 3 1/2 inches wide and 1-inch-thick.\n            \n\n              Preheat a large cast iron skillet over medium-low heat for 5 minutes. Raise the heat to high and add the oil. Add the patties and cook, turning once, until well-browned, about 2 minutes each side.\n            \n\n              Using a spatula, transfer the hamburgers to the roasting rack in the oven and continue cooking to desired doneness, 8 to 9 minutes for medium-rare, 10 to 11 minutes for medium, and 13 to 15 minutes for well-done. If you are using the cheese, top the hamburgers during their last couple of minutes of cooking to melt.\n            \n\n              Transfer the hamburgers to a plate, let rest for a couple minutes before serving. Meanwhile, toast the hamburger buns. Assemble the hamburgers with the condiments and toppings of your choice. Serve.\n            \n\n              When cooking on a countertop grill, turn on grill, then place burgers on the heated grill.\n            \n\n              Timing for a countertop grill:\n            \n\n              For Medium-Rare: Cook for 3 minutes covered and then unplug the machine and continue to cook covered for 2 to 3 more minutes.\n            \n\n              For Medium: Cook for 4 minutes covered and then unplug the machine and continue to cook covered for 4 more minutes.\n            \n\n              For Well: Cook for 5 minutes covered and then unplug the machine and continue to cook covered for 5 more minutes.\n            \n\nSpice Mix:\n\n\n              Combine all ingredients.\n            \n", "ingredients": [{"food": "ground turkey", "quantity": 24.0}, {"food": "salt", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "split pea soup", "quantity": 4.0}, {"food": "luncheon slices", "quantity": 4.0}, {"food": "turnip greens", "quantity": 1}, {"food": "barley flour or meal", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "onion powder", "quantity": 2.0}, {"food": "", "quantity": 1}], "title": "\nHamburgers\n"}, {"directions": "\n\n              Using your hands, break the meat into small pieces and combine evenly but loosely on a parchment-lined baking sheet. Spread the meat out and season it generously with salt and pepper.\n            \n\n              Preheat the oven to 475 degrees F. Place a roasting rack on a foil-lined baking sheet in the oven.\n            \n\n              Divide the meat into 4 portions (about 5 ounces each). Using your hands, form each portion into a ball-shape by gently tossing it from one hand to the other. (Don't over work or press too firmly on the meat.) Gently form each portion into a patty about 3 inches wide and 1-inch-thick.\n            \n\n              Preheat a large cast-iron skillet over medium-low heat for 5 minutes. Raise the heat to high and add the oil. Add the patties and cook, turning once, until well-browned, about 2 minutes the first side, and 1 minute the second side.\n            \n\n              Using a spatula, transfer the hamburgers to the roasting rack in the oven and continue cooking to desired doneness, 5 minutes for very rare (blue), 6 to 7 minutes for rare, 8 to 9 minutes for medium-rare, 10 to 11 minutes for medium, and 13 to 15 minutes for well-done. If you are using the cheese, top the hamburgers during their last couple of minutes of cooking to melt.\n            \n\n              Transfer the hamburgers to a plate let rest for a couple minutes before serving. Meanwhile, toast the hamburger buns. Assemble the hamburgers with the condiments and toppings of your choice. Serve.\n            \n", "ingredients": [{"food": "ground turkey", "quantity": 10.0}, {"food": "ground turkey", "quantity": 10.0}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "cheddar cheese", "quantity": 4.0}, {"food": "split pea soup", "quantity": 4.0}, {"food": "luncheon slices", "quantity": 4.0}, {"food": "turnip greens", "quantity": 1}, {"food": "barley flour or meal", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "bacon", "quantity": 8.0}], "title": "\nHamburgers\n"}, {"directions": "\n\n              1. Set up a grill for both direct and indirect heat. \n            \n\n              2. Mix together the herbes de Provence, large pinch salt, and olive oil; rub onto the steaks. Place the steaks on the hot grill over high heat until marked, about 2 minutes per side. Transfer to indirect heat, cover, and cook 12 minutes more for medium-rare.\n            \n\n              3. Let rest 10 minutes. Slice, cutting across the grain. Sprinkle with salt and serve.\n            \n", "ingredients": [{"food": "dulce de leche", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "prime steaks", "quantity": 2.0}], "title": "\nHanger Steak Provencal\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Bring a medium saucepan filled with water to a boil. Squeeze half of the orange and half of the lime into a large bowl and add the coriander, cumin, 1/2 teaspoon ancho powder and 1 teaspoon salt. Poke the steak all over with a fork and add it to the bowl, turning to coat; marinate at room temperature for 15 minutes.\n            \n\n              Meanwhile, combine the juices from the remaining orange and lime halves in a medium microwave-safe bowl with the cider vinegar, sugar, 1/4 teaspoon salt and 2 tablespoons water. Microwave until simmering, about 45 seconds. Add the red onion and let stand, tossing occasionally, until ready to serve.\n            \n\n              In a small saucepan, combine the paprika with 1/2 cup oil and the remaining 1/2 teaspoon ancho power. Bring to just below a simmer over medium-low heat and cook, stirring occasionally, until the oil is hot and bright red, about 3 minutes. Transfer to a small bowl.\n            \n\n              Prepare a large bowl of ice water. Add the cilantro and parsley to the boiling water and cook until just bright green and wilted, about 20 seconds. Quickly transfer to the ice bath to cool. Remove the herbs from the water and squeeze out as much of the water as possible. Place in a blender with the remaining 1/2 cup oil and blend on high until as smooth as possible. Strain through a fine-meshed sieve into a small bowl.\n            \n\n              Heat a little vegetable oil in a large cast-iron pan over medium-high heat until very hot. Remove the steak from the marinade and pat dry. Cook the steak, turning once, until well-seared on the outside and medium rare, 5 to 6 minutes per side. Transfer the steak to a cutting board and let rest 5 minutes; thinly slice across the grain. Sprinkle with additional salt.\n            \n\n              Adorn 4 plates with some crema and the chile and herb oils. Make 3 steak tacos per person, topping the tortillas with pickled onion, avocado, cilantro a drizzle of crema and some chile and herb oils.\n            \n", "ingredients": [{"food": "orange", "quantity": 1.0}, {"food": "lime", "quantity": 1.0}, {"food": "ground turkey", "quantity": 0.5}, {"food": "cumin seed", "quantity": 0.5}, {"food": "onion powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 1.5}, {"food": "vinegar", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "onion powder", "quantity": 0.5}, {"food": "paprika", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "sour cream", "quantity": 0.25}, {"food": "corn bran", "quantity": 12.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}], "title": "\nHanger Steak Tacos with Chile and Herb Oils\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Lay the bacon in a medium nonstick skillet, put the skillet over medium heat and cook until crisp, about 4 minutes per side; place the bacon on a paper towel. Remove all but 1 tablespoon of fat from the pan, add the pancakes and cook until they are warmed through and starting to crisp, about 1 minute per side. Sprinkle the pancakes with some salt and pepper, and transfer to a small baking sheet. Spread each pancake with a teaspoon of marmalade, and top with a slice of Swiss cheese. Keep warm in the oven.\n            \n\n              Crack the eggs into a small bowl, whisk with a fork until scrambled and season with 1/4 teaspoon each salt and pepper. Wipe out the skillet, add the butter and melt over medium heat. Add the eggs to the center of the pan, turn off the heat and swirl the eggs until they form a thin circle and are almost cooked through, 30 seconds. Flip the egg circle into a half-circle with a spatula, transfer to a cutting board and cut in half.\n            \n\n              Top 1 pancake (cheese-side up) with half the bacon, half the egg and another pancake. Repeat with the remaining bacon, egg and pancake (cheese-side down).\n            \n", "ingredients": [{"food": "bacon", "quantity": 3.0}, {"food": "pancakes", "quantity": 3.0}, {"food": "black bean mango", "quantity": 1}, {"food": "orange", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 3.0}, {"food": "eggs", "quantity": 2.0}, {"food": "butter oil", "quantity": 1.0}], "title": "\nHangover Bacon, Egg and Cheese Pancake Sandwich\n"}, {"directions": "\n\n              Mix the sugar and cinnamon in a small bowl; set aside. Mix the chocolate-hazelnut spread and cream cheese in another small bowl until smooth; set aside.\n            \n\n              Toast the waffles until browned and crisp in a toaster or toaster oven. Drizzle the melted butter over both sides of each waffle, and dust both sides with the cinnamon sugar. Spread both halves evenly with the chocolate-cream cheese mixture. Arrange the strawberries and bananas on 1 of the waffles, then top with the remaining waffle.\n            \n", "ingredients": [{"food": "sugar", "quantity": 2.0}, {"food": "cinnamon", "quantity": 0.25}, {"food": "margarine spread", "quantity": 2.0}, {"food": "whipped cream substitute", "quantity": 2.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 2.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "strawberries", "quantity": 2.0}, {"food": "banana", "quantity": 0.5}], "title": "\nHangover Berry, Banana, Chocolate-Hazelnut Waffle Sandwich\n"}, {"directions": "\n\n              Mix together the mayonnaise, Sriracha and maple syrup in a small bowl. Spread on the inside of both bun halves. Stack the lettuce, tomato and onion on the bottom bun.\n            \n\n              Pat and squeeze the sausage together into a ball. Put it on a piece of plastic wrap, and flatten it out into a thin patty 4 to 5 inches wide.\n            \n\n              Heat the oil in a small nonstick skillet over medium-high heat. Remove the patty from the plastic wrap, and cook it until browned on both sides and cooked through, about 3 minutes per side. Lay the Cheddar on the patty, cover the skillet and cook until the Cheddar melts, about 30 seconds. Remove, and set the patty on the bottom bun.\n            \n\n              Crack the egg into the skillet over medium-high heat, sprinkle with some salt and pepper and cook until the egg whites are set and crispy on the bottom and edges and the yolk is still runny, 2 to 3 minutes. Set the egg on top of the sausage patty, and top with the other bun half. Eat right away.\n            \n", "ingredients": [{"food": "mayonnaise dressing", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "syrup", "quantity": 0.5}, {"food": "", "quantity": 1.0}, {"food": "corier leaf", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "onion rings", "quantity": 3.0}, {"food": "breakfast tart", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nHangover Breakfast Sausage-and-Egg Burger\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Brush the tortilla with 1 tablespoon of the butter, and sprinkle with some salt and pepper. Mix the mayonnaise and mustard together in a small bowl; set aside.\n            \n\n              Put the hash brown on a baking sheet, spray lightly with cooking spray and bake until browned and crisp, about 15 minutes. During the last 2 minutes of baking, put the buttered tortilla on the baking sheet, and cook until warmed through and pliable. Cut the hash brown into quarters.\n            \n\n              Meanwhile, heat a medium nonstick skillet over medium-high heat. Add the corned beef, and cook, breaking it up with a spatula, until browned and crispy, 5 to 7 minutes. Transfer it to a bowl, and set aside.\n            \n\n              Crack the egg into a bowl, add 1/4 teaspoon salt and a grind of pepper and whisk with a fork. Melt the remaining tablespoon butter in the skillet, reduce the heat to low and add the egg. Swirl the pan so the egg forms a thin circle, and cook until just set, about 30 seconds. Roll the egg circle into a log with a spatula, and transfer it to a cutting board.\n            \n\n              Lay the tortilla flat, and spread with the mayonnaise-mustard mixture. Arrange half the corned beef along the lower third. Top with the egg log, the remaining corned beef, the pickles, the hash browns and a squeeze of ketchup. Fold in the sides, and roll the tortilla up from the bottom.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 10.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "mayonnaise dressing", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "frozen yogurt", "quantity": 1.0}, {"food": "", "quantity": 1}, {"food": "frankfurter beef", "quantity": 0.3333333333333333}, {"food": "egg substitute", "quantity": 1.0}, {"food": "pickle loaf", "quantity": 4.0}, {"food": "hearts of palm", "quantity": 1}], "title": "\nHangover Corned Beef Hash Wrap\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Whisk together the mayonnaise, lemon juice and cayenne in a small bowl, and season with 1/4 teaspoon each salt and pepper; set aside.\n            \n\n              Lay the Canadian bacon flat on a baking sheet. Generously spread both English muffin halves with the butter, sprinkle with some salt and pepper and transfer to the baking sheet. Bake until the muffins start to crisp and the bacon is fragrant, about 10 minutes. Top the bacon evenly with the spinach, and continue baking until the spinach is wilted and the muffins are nicely browned, about 5 minutes.\n            \n\n              Meanwhile, heat the vegetable oil in a small skillet over medium-high heat. Crack the egg in the skillet, sprinkle with salt and pepper and cook until the egg white is set and crispy on the bottom and edges and the yolk is still runny, 2 to 3 minutes.\n            \n\n              Arrange 1 spinach-topped slice of Canadian bacon on 1 English muffin half, top with the egg, drizzle with the mayonnaise mixture and top with the remaining spinach-topped bacon slice and muffin half.\n            \n", "ingredients": [{"food": "mayonnaise dressing", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "", "quantity": 0.125}, {"food": "black bean mango", "quantity": 1}, {"food": "bacon", "quantity": 2.0}, {"food": "split pea soup", "quantity": 1.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}], "title": "\nHangover Easy Eggs Benedict Sandwich\n"}, {"directions": "\nSpecial equipment: a 2 1/2-inch ring mold\n\n              Spread 1 side of each slice of bread with mayonnaise. Top 1 slice with American cheese and the other with pepper Jack, then sandwich them together. Cut the center out of the sandwich with a 2 1/2-inch ring mold.\n            \n\n              Crack the egg into a small bowl.\n            \n\n              Melt the butter in a medium nonstick skillet over medium-low heat, and swirl to coat the bottom. Arrange the inner and outer parts of the sandwich in the skillet, and cook until golden brown on the bottom, 4 to 5 minutes. Turn each over, pour the egg into the hole, sprinkle with salt and pepper and cook until the bottoms of the bread are golden brown, the egg whites are set and the yolk is still runny, 4 to 5 minutes. For the last minute of cooking, cover the pan with a lid to cook the egg white completely through. (The sandwich round may finish cooking faster.) Transfer the sandwich with the egg to a serving plate along with the sandwich round, to dip into the egg yolk.\n            \n", "ingredients": [{"food": "garlic bread", "quantity": 2.0}, {"food": "mayonnaise dressing", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nHangover Toad-in-the-Hole Grilled Cheese Sandwich\n"}, {"directions": "\n\nSoft:\n\n\n              Bring a pot of water to a boil over high heat. Reduce the heat to low, then add your eggs and cook 4 to 5 minutes. Drain, cool in ice water and peel.\n            \n\nMedium:\n\n\n              Bring a pot of water to a boil over high heat. Reduce the heat to low, then add your eggs and cook 7 to 8 minutes. Drain, cool in ice water and peel.\n            \n\nHard:\n\n\n              Place your eggs in a pot and cover with cold water by 1 inch. Bring to a boil over medium-high heat, then cover, remove from the heat and set aside 8 to 10 minutes. Drain, cool in ice water and peel.\n            \n\nHow to Make Deviled Eggs:\n\n\n              Transfer hard-boiled eggs to a bowl of ice water with a slotted spoon and let cool.\n            \n\n              Drain the ice water. One at a time, crack the bottom, wider end of each egg against the bowl, then hold the egg under cold running water and peel.\n            \n\n              Slice the eggs in half lengthwise. Scoop the yolks into a bowl and make your filling.\n            \n\n              Fill the egg-white halves with the yolk mixture using a spoon, piping bag or resealable plastic bag with a corner snipped.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "", "quantity": 1}], "title": "\nHard Boiled Eggs\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the haricots verts and cook until crisp-tender, about 4 minutes. Drain, then plunge into an ice bath to stop the cooking. Drain again, then transfer to paper towels and pat dry.\n            \n\n              Cook the pancetta in a large skillet over medium heat, stirring occasionally, until crisp, about 8 minutes. Remove to paper towels using a slotted spoon. Add the garlic to the drippings in the skillet and cook, stirring, until golden, about 1 minute. Add the panko and cook, stirring, until toasted, about 1 minute.\n            \n\n              Add the haricots verts to the skillet and cook, stirring, until evenly coated, about 2 minutes. Stir in the pancetta and season with salt and pepper. Serve with lemon wedges.\n            \n\n              Photo by Con Poulos\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "fava beans", "quantity": 1.25}, {"food": "diced chicken", "quantity": 4.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "", "quantity": 0.25}, {"food": "pepper", "quantity": 1}, {"food": "", "quantity": 1}], "title": "\nHaricots Verts with Pancetta\n"}, {"directions": "\n\n              If you want spicy harissa, include the chiles' seeds; if not, slit them open to remove and discard the seeds. Tear the chiles into large pieces and place them in a medium bowl. Carefully pour 4 cups boiling water over chiles and set aside until softened, about 20 minutes.\n            \n\n              Meanwhile, place the coriander and cumin seeds in a small skillet and cook over medium heat, swirling the pan often, until the spices are fragrant and lightly toasted, 2 to 3 minutes. Transfer the spices into a blender, add the oil, salt, garlic and lemon juice, and puree until smooth. Drain the chiles, reserving 1 cup of the soaking liquid (discard remaining liquid). Add the chiles and reserved liquid to the blender and puree on high until very smooth, about 2 minutes. Season the harissa with pepper and transfer to an airtight container. Refrigerate for up to 2 weeks.\n            \n", "ingredients": [{"food": "", "quantity": 10.0}, {"food": "", "quantity": 8.0}, {"food": "whole milk", "quantity": 0.5}, {"food": "whole milk", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "salt", "quantity": 1.0}, {"food": "garlic powder", "quantity": 6.0}, {"food": "", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nHarissa\n"}, {"directions": "\n\n              There are countless variations of this sweet Passover relish¿we like a mixture of chopped apples, pistachios and dates. Pulse in a food processor with a splash of kosher wine, then add honey, sugar, cinnamon and salt to taste. Stir in lemon zest and juice.\n            \n\n              Photograph by Roland Bello\n            \n", "ingredients": [], "title": "\nHaroset\n"}, {"directions": "\n\n              Put 1 3/4 cups lukewarm water (105 degrees F to 110 degrees F), the yeast, 1/2 cup olive oil and 1 tablespoon each turbinado sugar and salt in the bowl of a stand mixer fitted with the dough hook attachment. Mix on medium speed until the yeast and sugar dissolve, then let stand until foamy, about 10 minutes. Add both flours and mix on medium speed to make a smooth but sticky dough, about 4 minutes.\n            \n\n              Poke the butter pieces into the dough, spacing them evenly apart. (Do not mix.) Cover the dough with plastic wrap and set aside in a warm place until doubled in size, 45 minutes to 1 hour.\n            \n\n              Mix the dough with the dough hook on low speed just until there are streaks of butter throughout, about 1 minute. Put the grapes and raisins in a microwave-safe bowl, cover loosely and microwave until juicy, about 10 minutes. Let cool, then strain through a sieve, discarding the liquid.\n            \n\n              Brush a rimmed baking sheet with 2 tablespoons olive oil. Divide the dough in half and transfer one piece to the baking sheet, leaving the other in the bowl. Cover both pieces of dough loosely with parchment paper; set aside until plump and airy, about 30 minutes. Meanwhile, put a pizza stone or inverted rimmed baking sheet on the lowest oven rack and preheat the oven to 450 degrees F.\n            \n\n              Spread the dough on the baking sheet so it fills the pan, dimpling it with your fingertips. Scatter half of the grape-raisin mixture evenly on top. Put the remaining piece of dough on top and stretch and pat it to cover the bottom piece of dough. (Don't worry if the dough tears.) Scatter the walnuts and the remaining grape-raisin mixture on top; dimple the dough all over with your fingertips, poking the topping into the dough. Cover loosely with parchment and set aside until the dough rises above the sides of the baking sheet by about 1/2 inch, 35 to 40 minutes.\n            \n\n              Mix the remaining 1/4 cup sugar, the coriander, rosemary, the remaining 3/4 teaspoon salt and the pepper; sprinkle over the dough. Place the baking sheet on the hot stone and bake 10 minutes. Reduce the oven temperature to 400 degrees F and bake until the focaccia is golden and springs back when pressed, 20 to 30 more minutes. Brush with the remaining 2 tablespoons olive oil; let cool in the pan 15 minutes, then transfer to a rack to cool slightly or let cool completely and freeze.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "coconut water", "quantity": 1.75}, {"food": "", "quantity": 2.25}, {"food": "vegetable oil", "quantity": 0.75}, {"food": "sugar", "quantity": 0.25}, {"food": "salt", "quantity": 1.75}, {"food": "potato flour", "quantity": 2.25}, {"food": "potato flour", "quantity": 2.25}, {"food": "butter oil", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 2.0}, {"food": "raisins", "quantity": 0.6666666666666666}, {"food": "walnuts", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "rosemary", "quantity": 1.0}, {"food": "pepper", "quantity": 0.5}], "title": "\nHarvest Focaccia\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F. Coat a 9- by 13-inch baking dish with cooking spray. \n            \n\n              Whisk together the yogurt, milk, sour cream and flour in a large bowl. Stir in the hash browns, 1/2 cup of the Cheddar, 2 teaspoons salt and 1/2 teaspoon pepper. Set aside. \n            \n\n              Melt the butter in a large skillet over medium-high heat. Add the onions and cook, stirring often, until soft and lightly browned, about 10 minutes. Add the mushrooms and cook, stirring often, until the mushrooms are wilted and the onions begin to brown, about 10 minutes more. If the pan gets too hot, add a splash or two of water as needed. Stir in the garlic and cook for 1 minute. Stir the vegetables into the hash brown mixture to combine. \n            \n\n              Spread the mixture evenly in the prepared dish. Sprinkle with the remaining 1/2 cup cheese, the breadcrumbs and nutmeg if using. Bake until a deep golden brown, about 45 minutes. \n            \n\n              Sprinkle with parsley and serve.\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 1}, {"food": "silk banana-strawberry soy yogurt", "quantity": 12.0}, {"food": "milk", "quantity": 1.0}, {"food": "sour cream", "quantity": 0.5}, {"food": "potato flour", "quantity": 3.0}, {"food": "frozen yogurt", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "butter oil", "quantity": 2.0}, {"food": "onions", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "", "quantity": 2.0}, {"food": "nutmeg", "quantity": 0.25}, {"food": "barley flour or meal", "quantity": 1.0}], "title": "\nHash Brown Casserole\n"}, {"directions": "\n\n              Make clarified butter: Melt the butter in a small saucepan over low heat and cook until the white milk solids separate and rise to the top, about 3 minutes. Turn off the heat and carefully skim off the milk solids with a spoon; discard. Strain the remaining butter through a fine-mesh sieve and set aside (you should have about 1/4 cup clarified butter).\n            \n\n              Peel the potatoes and grate them on the large holes of a box grater into a colander. Squeeze out the excess moisture with your hands, then blot the potatoes dry with paper towels.\n            \n\n              Heat the clarified butter in a large nonstick skillet over medium-high heat. Add the potatoes to the skillet in a few piles and flatten with a spatula; sprinkle with 1 teaspoon salt, a few grinds of pepper and the paprika. Cook, undisturbed, until the potatoes start browning on the bottom, about 5 minutes. Flip, then drizzle with the cream; cook, undisturbed, until absorbed, about 2 minutes. Continue cooking, flipping the hash browns occasionally, until golden brown and crisp all over, about 15 more minutes. Season with salt and pepper.\n            \n\n              Photograph by Ralph Smith\n            \n", "ingredients": [{"food": "butter oil", "quantity": 6.0}, {"food": "sweet potatoes", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "paprika", "quantity": 0.5}, {"food": "ice cream swich", "quantity": 0.25}], "title": "\nHash Browns\n"}, {"directions": "\n\n              Grate the potatoes, with their skin into a large bowl. Peel and grate the parsnip; add to the potatoes. Toss the vegetables with the scallions, parsley and season with the salt and pepper, to taste.\n            \n\n              Heat a large (12-inch) nonstick skillet over medium heat and brush the skillet with about half the oil. Add the potato mixture and form into an even cake by pressing lightly with a spatula. Cook, shaking the pan periodically to prevent sticking, until the hash browns are crisp and brown, about 10 minutes.\n            \n\n              Remove the pan from the heat; place a flat plate over the top of the skillet. Carefully flip the pan so the potato cake goes onto the plate. Brush the skillet with the remaining olive oil and then side the hash browns back into the skillet. Cook until browned and crisp, about 10 minutes more. Slide out of the skillet onto a heated serving plate. Cut into wedges to serve.\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "martha white foods", "quantity": 2.0}, {"food": "parsley", "quantity": 2.0}, {"food": "salt", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}], "title": "\nHash Browns Makeover\n"}, {"directions": "\n\n              Fry 1 cup each chopped onion and grated potato in a cast-iron skillet with butter until crisp. Add 1/2 cup grated cheddar and crack in 2 eggs. Bake at 425 degrees F until set; top with salsa.\n            \n\n              Photograph by Yunhee Kim\n            \n", "ingredients": [], "title": "\nHash-Brown Eggs\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Butter a 2- to 3-quart baking dish. Halve the apples; cut out the core and place flat-side down. Using a sharp knife, make slits in each apple half about 1/4 inch apart; do not cut through to the bottom. Place the apples flat-side down in the prepared baking dish.\n            \n\n              Combine 2 tablespoons each butter and brown sugar in a bowl and mash together with a fork; spread the mixture over the tops of the apples. Cover with foil and bake until just tender, 20 to 25 minutes. Meanwhile, combine the remaining 2 tablespoons brown sugar with the flour, lemon zest, salt and the remaining 1 tablespoon butter in a bowl until clumpy.\n            \n\n              Uncover the apples and carefully insert the fig slices into the slits in the apples; sprinkle with the flour mixture. Bake, uncovered, until the topping is golden brown and the apples are tender, 20 to 25 more minutes.\n            \n\n              Combine the honey with the vanilla bean, cinnamon stick and 2 tablespoons water in a small skillet over medium-low heat. Bring to a simmer, stirring occasionally, and cook until the honey is infused, about 5 minutes. Remove from the heat; discard the cinnamon stick and vanilla bean and stir in the pomegranate seeds. Transfer the apples to plates and serve with ice cream and the pomegranate syrup.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "butter oil", "quantity": 3.0}, {"food": "apples", "quantity": 3.0}, {"food": "sugar", "quantity": 0.25}, {"food": "potato flour", "quantity": 2.0}, {"food": "lemon juice", "quantity": 0.25}, {"food": "hearts of palm", "quantity": 1}, {"food": "figs", "quantity": 4.0}, {"food": "honey smoked ham", "quantity": 0.25}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "cinnamon", "quantity": 1.0}, {"food": "pomegranate", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 1}], "title": "\nHasselback Apples with Figs\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Grease an 8-by-8-inch baking dish with some of the melted butter.\n            \n\n              Peel and halve the apples; cut out the cores and place flat-side down. Using a sharp knife, make slits in each apple half 1/4 inch apart; do not cut through to the bottom. (If you make the slits too close together, the apples will fall apart). Place the apples flat-side down in the prepared baking dish. \n            \n\n              Mix 2 tablespoons of the melted butter with 2 tablespoons of the brown sugar in a small bowl with a fork until a paste forms. Spread the mixture on the apples. Cover the baking dish with foil and bake until just tender when pierced with the tip of a knife, about 20 minutes. \n            \n\n              Meanwhile, make the streusel. If the granola has big chunks in it, put it in a plastic bag and smash with the back of a measuring cup into smaller crumbles. Mix the granola with the flour, salt, remaining 1 tablespoon brown sugar and remaining 1 tablespoon butter in a bowl with a fork until the pieces are moistened and the mixture is clumpy.\n            \n\n              Uncover the apples and spoon the streusel on the tops and in some of the slits, using a fork or the tip of a paring knife to gently separate the flaps. Return to the oven and bake, uncovered, until the apples are tender and the topping is golden, about 20 minutes more. \n            \n\n              Microwave the caramel sauce in a small bowl until warm, about 45 seconds. Stir in the lemon juice. Transfer the apples to plates, drizzle with the caramel sauce and top with whipped cream.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 3.0}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "sugar", "quantity": 3.0}, {"food": "granola bar", "quantity": 0.25}, {"food": "potato flour", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "Worcestershire sauce", "quantity": 0.25}, {"food": "lemon juice", "quantity": 1}, {"food": "ice cream swich", "quantity": 1}], "title": "\nHasselback Apples with Granola Streusel and Caramel\n"}, {"directions": "\n\n              Trim, peel and halve 2 1/2 pounds medium beets; slice as directed (see left). Place the beets in a 9-by-13-inch baking dish and drizzle with 3/4 cup olive oil; season with 1/4 teaspoon salt and a few grinds of pepper. Add cup water and cover with foil. Roast at 425 degrees F, 40 minutes. Uncover and continue roasting, spreading the slices apart and basting with the pan juices halfway through, until the beets are tender, 30 to 40 more minutes. Let cool slightly. Mix 1/2 cup plain Greek yogurt with 2 tablespoons each chopped dill and lemon juice, 1 teaspoon salt and a few grinds of pepper. Drizzle over the beets and top with crushed pink peppercorns and more dill.\n            \n\nHasselback 1-2-3\n\n\n              Cut a thin sliver from one side of the vegetable so it can sit flat. (If you¿re starting with halved veggies, like the beets at right, skip this step.)\n            \n\n              Position the vegetable cut-side down between the handles of two wooden spoons. \n            \n\n              Using a sharp knife, make crosswise cuts (1/8 to 1/4 inch apart), stopping when the knife hits the handles so you don't cut all the way through the vegetable.\n            \n\n              Photograph by Ryan Liebe\n            \n", "ingredients": [], "title": "\nHasselback Beets with Dill Yogurt Sauce\n"}, {"directions": "\n\n              Slice 2 1/2 pounds small potatoes as directed (see left); transfer to a large bowl and add 1 large red onion (cut into wedges). Melt 6 tablespoons butter in a small skillet over medium-high heat, swirling, until browned, 2 to 3 minutes; pour into a small bowl. Whisk in 1 1/2 teaspoons smoked paprika, 1 teaspoon kosher salt and a few grinds of pepper. Drizzle half of the brown butter over the vegetables; toss to coat. Spread on a rimmed baking sheet and roast at 425 degrees F until tender, 35 to 40 minutes. Drizzle with the remaining brown butter and roast until golden brown, 30 more minutes. Sprinkle with shredded manchego cheese, chopped chives and flaky sea salt.\n            \n\nHasselback 1-2-3\n\n\n              Cut a thin sliver from one side of the vegetable so it can sit flat. (If you¿re starting with halved veggies, like the beets at right, skip this step.)\n            \n\n              Position the vegetable cut-side down between the handles of two wooden spoons. \n            \n\n              Using a sharp knife, make crosswise cuts (1/8 to 1/4 inch apart), stopping when the knife hits the handles so you don't cut all the way through the vegetable.\n            \n\n              Photograph by Ryan Liebe\n            \n", "ingredients": [], "title": "\nHasselback Potatoes with Brown Butter\n"}, {"directions": "\n\n              Trim 2 bunches radishes, then slice as directed (see below). Place in a 9-by-13-inch baking dish and drizzle with 4 teaspoons toasted sesame oil. Season with 1/2 teaspoon salt and a few grinds of pepper and toss to coat. Roast at 425 degrees F until tender, 35 to 40 minutes. Whisk 2 tablespoons vegetable oil with 1 tablespoon mirin, 2 teaspoons each white miso paste and lemon juice, 1/4 teaspoon salt and a few grinds of pepper. Drizzle over the radishes and top with sesame seeds and sliced scallions.\n            \n\nHasselback 1-2-3:\n\n\n              Cut a thin sliver from one side of the vegetable so it can sit flat. (If you¿re starting with halved veggies, skip this step.)\n            \n\n              Position the vegetable cut-side down between the handles of two wooden spoons. \n            \n\n              Using a sharp knife, make crosswise cuts (1/8 to 1/4 inch apart), stopping when the knife hits the handles so you don¿t cut all the way through the vegetable.\n            \n\n              Photograph by Ryan Liebe\n            \n", "ingredients": [], "title": "\nHasselback Radishes with Miso Dressing\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Position an oven rack in the center of the oven and preheat the oven to 425 degrees F. Shave a thin sliver from one side of each potato to give it a flat surface to stand on while you slice it. Make thin slices into the potato about 1/16-inch thick, stopping before you cut all the way through. (Placing a chopstick on either side of the potato while you slice it can help stop the blade before it cuts all the way through.) Put each potato on a separate sheet of foil. Shape the foil around the potatoes to wrap them, but leave the tops open and exposed. Put the potatoes on a rimmed baking sheet.\n            \n\n              Melt the butter in a small skillet over medium-high heat, swirling occasionally, until browned and nutty, 2 to 3 minutes. Stir in the brown sugar, vanilla, cinnamon and salt. Drizzle the butter mixture over the potatoes and pinch the foil together on top to seal the potato inside. Bake for 45 minutes, then let cool for a few moments. Remove the potatoes from the foil, put them on a serving platter and drizzle with the sauce leftover in each foil packet. Sprinkle with the pecans before serving.\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 4.0}, {"food": "butter oil", "quantity": 6.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "cinnamon", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "", "quantity": 0.25}], "title": "\nHasselback Sweet Potatoes\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 425 degrees F. Line a baking sheet with aluminum foil. \n            \n\n              Make a series of 1/8-inch slices along each potato, slicing 2/3 of the way through. \n            \n\n              Stir together the butter, oil, thyme, garlic, 1/4 teaspoon salt and 1/4 teaspoon pepper in a small bowl. Rub the potatoes all over with the mixture, getting in between the slices. \n            \n\n              Place on the baking sheet and roast until the center of the potatoes are tender and the outside is crisp, 50 minutes to 1 hour. Halfway through the roasting time, remove the potatoes from the oven and run a fork gently across the tops of the potatoes, using light pressure, to fan the slices and separate them from one another. \n            \n\n              Meanwhile, stir the yogurt and scallions with a pinch salt and a pinch pepper. Serve the sauce with the potatoes. \n            \n\n              Per serving: Calories: 150; Total Fat 4 grams; Saturated Fat: 2 grams; Protein: 4 grams; Total carbohydrates: 24 grams; Sugar: 8 grams; Fiber: 4 grams; Cholesterol: 10 milligrams; Sodium: 260 milligrams\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 4.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "silk banana-strawberry soy yogurt", "quantity": 0.3333333333333333}, {"food": "martha white foods", "quantity": 1.0}], "title": "\nHasselback Sweet Potatoes\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Line a baking sheet with aluminum foil. Make a series of 1/8-inch slices along each potato, slicing 2/3 of the way through. Stir together the butter, oil, thyme, garlic, 1/4 teaspoon salt and 1/4 teaspoon pepper in a small bowl. Rub the potatoes all over with the mixture, getting in between the slices. Place on the baking sheet and roast until the center of the potatoes are tender and the outside is crisp, 50 minutes to 1 hour. Halfway through the roasting time, remove the potatoes from the oven and run a fork gently across the tops of the potatoes, using light pressure, to fan the slices and separate them from one another. Meanwhile, stir the yogurt and scallions with a pinch salt and a pinch pepper. Serve the sauce with the potatoes.\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 4.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "silk banana-strawberry soy yogurt", "quantity": 0.3333333333333333}, {"food": "martha white foods", "quantity": 1.0}], "title": "\nHasselback Sweet Potatoes\n"}, {"directions": "\nSpecial equipment: 12 cup jumbo muffin tin\n\n              Preheat the oven to 350 degrees F. Line the large muffin tins with large cupcake liners.\n            \n\n              Put the butter, coffee, water, and cocoa in a microwave-safe bowl, cover with plastic wrap, and microwave on HIGH until the butter melts, about 2 minutes. Whisk to combine.\n            \n\n              Meanwhile, whisk the flour, granulated sugar, baking powder, salt, and baking soda in a large bowl. Beat the sour cream with the egg and vanilla in a small bowl. Whisk the hot cocoa mixture into the dry ingredients. Stir in the sour cream mixture just to combine; don't overmix. Divide the batter evenly between the prepared muffin tins, filling each one about 3/4 of the way full (about 2/3 cup per cupcake). Bake cupcakes until a toothpick inserted in the center of the cake comes out clean, about 30 minutes.\n            \n\n              Cool the cupcakes completely in the tin on a rack. Remove from liners and return cakes to a rack.\n            \n\n              For the glaze: Put chocolate in a medium bowl. Bring coconut milk and corn syrup to a boil, stirring constantly, then pour it over the chocolate. Let the mixture stand for 10 minutes, then stir until smooth. Spread 1 tablespoon warm glaze evenly over each cake, then scatter the coconut over the top.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.5}, {"food": "silk coffee", "quantity": 1.0}, {"food": "milk", "quantity": 0.5}, {"food": "cocoa mix", "quantity": 0.75}, {"food": "potato flour", "quantity": 3.0}, {"food": "sugar", "quantity": 3.25}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "salt", "quantity": 0.75}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "sour cream", "quantity": 0.75}, {"food": "eggs", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 1.5}, {"food": "sugar", "quantity": 1}, {"food": "baking chocolate", "quantity": 6.0}, {"food": "coconut milk", "quantity": 0.5}, {"food": "corn bran", "quantity": 1.0}, {"food": "coconut water", "quantity": 1.5}], "title": "\nHave Your Own Cake and Eat It Too (Individual Chocolate Cakes)\n"}, {"directions": "\n\n              Combine the curry powder, cayenne, 2 teaspoons salt and 1 teaspoon black pepper in a bowl. Combine the chicken, half of the spice mixture, the yogurt, 1 cup milk and the garlic in a large resealable bag; shake to coat. Refrigerate at least 2 hours or overnight.\n            \n\n              Preheat the oven to 350 degrees F. Spread 1/2 cup coconut on a baking sheet and toast, stirring occasionally, until golden, about 12 minutes; transfer to a medium bowl and set aside. Combine the remaining 1/2 cup coconut, the flour and the remaining spice mixture in a large bowl; work in the remaining 1/3 cup milk with your fingers until small lumps form.\n            \n\n              Set a wire rack on a baking sheet. Heat about 4 inches of equal parts peanut oil and shortening in a large pot over medium-high heat until a deep-fry thermometer registers 350 degrees F.\n            \n\n              Remove the drumsticks from the marinade, letting the excess drip off. Using your hands, coat the chicken with the flour mixture, pressing it so it sticks to the meat. Place on a plate.\n            \n\n              Working in 2 batches, carefully add the chicken to the hot oil mixture. (The temperature will drop to 300 degrees F to 325 degrees F; adjust the heat to maintain this lower temperature.) Fry, undisturbed, 2 to 3 minutes to set the crust. Continue frying, turning as needed, until golden brown and cooked through, 10 to 12 minutes. Remove to the rack; sprinkle with salt, transfer to the oven and bake until a thermometer inserted into the thickest part registers 165 degrees F, 10 to 15 minutes.\n            \n\n              Meanwhile, add the red onion, mango, cilantro, lime juice and a pinch of salt to the toasted coconut. Sprinkle the mixture on the chicken.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [{"food": "curry powder", "quantity": 2.0}, {"food": "pepper", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "diced chicken", "quantity": 8.0}, {"food": "silk plain soy yogurt", "quantity": 1.0}, {"food": "whole milk", "quantity": 1.3333333333333333}, {"food": "garlic powder", "quantity": 4.0}, {"food": "coconut water", "quantity": 1.0}, {"food": "potato flour", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 5.0}, {"food": "shortening confectionery", "quantity": 5.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "black bean mango", "quantity": 0.5}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "", "quantity": 0.5}], "title": "\nHawaii Fried-O\n"}, {"directions": "\n\n              Make the crust: Preheat the oven to 350 degrees F. Combine the graham crackers, sugar and salt in a food processor and pulse until the graham crackers are finely ground. Add the melted butter and pulse until moist. Press the crumbs into the bottom and up the side of a 9-inch pie plate; bake until set, 18 to 22 minutes. Transfer to a rack and let cool completely.\n            \n\n              Make the filling: Combine the pineapple, cream of coconut, rum, lemon juice and salt in a blender and puree until smooth. Pour into the prepared crust and freeze until firm, about 6 hours. Top with shredded coconut. Serve with whipped cream and cherries.\n            \n\n              Photograph by Ralph Smith\n            \n", "ingredients": [{"food": "crackers", "quantity": 14.0}, {"food": "sugar", "quantity": 3.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "butter oil", "quantity": 6.0}, {"food": "pineapple chunks", "quantity": 2.0}, {"food": "coconut cream", "quantity": 15.0}, {"food": "", "quantity": 3.0}, {"food": "", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "coconut water", "quantity": 1}, {"food": "maraschino cherries", "quantity": 1}], "title": "\nHawaii Pie-O\n"}, {"directions": "\n\n              Put an inverted baking sheet or pizza stone in the oven and preheat to 475 degrees F. Line another inverted baking sheet with parchment paper. Brush the dough with the olive oil and center it on the parchment. Cover with another piece of parchment; set aside.\n            \n\n              Heat a grill pan over medium-high heat. Grill the pineapple rings until marked, about 4 minutes per side. Transfer to a plate. Grill the scallion whites, turning, until charred, about 4 minutes. Transfer to the plate with the pineapple.\n            \n\n              Combine the barbecue sauce and tomato in a small bowl. Stretch the pizza dough to 10 by 14 inches on the parchment; spread the barbecue sauce mixture on top. Sprinkle with the pepper jack and muenster cheese and top with the grilled pineapple, ham and scallion whites and greens.\n            \n\n              Slide the pizza (on the parchment) onto the hot baking sheet or pizza stone. Bake until the cheese is bubbling and the crust is golden, about 15 minutes. Transfer the pizza to a cutting board and slice.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "pizza rolls", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "pineapple chunks", "quantity": 0.5}, {"food": "", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 0.25}, {"food": "diced chicken", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 0.5}, {"food": "ham", "quantity": 0.25}], "title": "\nHawaiian Barbecue Pizza\n"}, {"directions": "\n\n              Make the dipping sauce: Whisk the sweet chili sauce, mayonnaise and lime juice in a bowl.\n            \n\n              Make the chicken fingers: Preheat the oven to 425 degrees F. Spread the coconut on a baking sheet and bake, stirring occasionally, until golden brown, about 10 minutes. Transfer to a shallow dish and let cool, then stir in the panko, paprika and coconut oil. (The mixture should resemble wet sand.) Whisk the eggs and 1/2 teaspoon salt in a separate shallow dish.\n            \n\n              Set a rack on a baking sheet; coat the rack with cooking spray. Dip the chicken in the egg mixture, shaking off any excess; coat with the coconut mixture, pressing firmly to adhere. Place the chicken on the prepared rack; coat generously with cooking spray. Bake until cooked through and golden brown, 15 to 20 minutes. Serve with the dipping sauce.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "Worcestershire sauce", "quantity": 0.3333333333333333}, {"food": "mayonnaise dressing", "quantity": 2.0}, {"food": "", "quantity": 0.5}, {"food": "diced chicken", "quantity": 1}, {"food": "coconut water", "quantity": 0.5}, {"food": "", "quantity": 1.25}, {"food": "paprika", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "eggs", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "diced chicken", "quantity": 2.0}], "title": "\nHawaiian Chicken Fingers\n"}, {"directions": "\n\n              Preheat the broiler. Soak 8 long wooden skewers in water, 15 minutes. Line a baking sheet with foil and brush lightly with vegetable oil.\n            \n\n              Meanwhile, whisk the ketchup, soy sauce, vinegar and honey in a medium bowl. Transfer half of the sauce to a separate bowl and set aside for dipping. Toss the chicken, water chestnuts, pineapple, bell pepper and 1 tablespoon vegetable oil in a large bowl; sprinkle with 1/2 teaspoon salt and a few grinds of pepper. Thread onto the skewers, alternating the ingredients. Transfer to the prepared baking sheet.\n            \n\n              Brush the kebabs with some of the remaining sauce and broil until they start browning, about 4 minutes; flip, brush with more sauce and continue broiling until the chicken is golden and cooked through, about 3 more minutes. Serve with the reserved sauce and rolls.\n            \n\n              Photograph by Paul Sirisalee\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "", "quantity": 0.75}, {"food": "soy sauce", "quantity": 3.0}, {"food": "vinegar", "quantity": 3.0}, {"food": "honey smoked ham", "quantity": 1.5}, {"food": "diced chicken", "quantity": 1.25}, {"food": "coconut water", "quantity": 1.0}, {"food": "pineapple chunks", "quantity": 4.75}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "sweet rolls", "quantity": 4.0}], "title": "\nHawaiian Chicken Kebabs\n"}, {"directions": "\n\n              Grind 1 cup hazelnuts in a food processor. Knead into half of a 16.5-ounce package refrigerated sugar cookie dough. Roll out to 1/4 inch thick on a floured surface and cut into small rectangles. Transfer to a parchment paper-lined baking sheet and sprinkle with brown sugar. Bake at 350 degrees F until golden, 15 minutes; let cool. Serve with chocolate-hazelnut spread for dipping.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nHazelnut Bars\n"}, {"directions": "\n\n              Preheat oven to 400 degrees F.\n            \n\n              Place the chicken on a work surface and pound it into 3/4-inch thickness with a meat pounder. Pulse the hazelnuts in a food processor until finely ground. Set aside 3 tablespoon of the hazelnuts, and combine the rest with the panko, 1 teaspoon salt, and 1/2 teaspoon pepper and spread evenly on a baking sheet. Season the chicken with a pinch each salt and pepper. Beat the eggs together with 1/2 teaspoon salt then dip each chicken, letting excess drip off. Dredge the chicken in the nut mixture. Heat 1 1/2 tablespoons of the oil in a large heavy skillet over medium high heat until hot, then add chicken, 2 at a time and brown, turning once, about 2 minutes per side. Brown remaining chicken with the same amount of oil for each batch, wiping out the skillet as necessary. Place chicken on a baking sheet and finish cooking in oven, about 6 minutes.\n            \n\n              While the chicken cooks, whisk together the honey, lemon juice, garlic, and 1/4 teaspoon salt in a medium bowl. Slowly stream the olive oil into the dressing while whisking. Once creamy and smooth, stir in the reserved 3 tablespoons of hazelnuts. Toss together the dressing with the romaine hearts, tomatoes, and scallions. Serve with the chicken.\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 6.0}, {"food": "hazelnuts or filberts", "quantity": 1.25}, {"food": "", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "eggs", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 6.0}, {"food": "honey smoked ham", "quantity": 1.0}, {"food": "lemon juice", "quantity": 2.5}, {"food": "garlic powder", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "hearts of palm", "quantity": 1.0}, {"food": "plum", "quantity": 2.0}, {"food": "martha white foods", "quantity": 4.0}], "title": "\nHazelnut Chicken\n"}, {"directions": "\n\n              Make Classic Shortbread dough with just 1 cup flour. Add 1 cup ground oats and 3/4 cup finely ground hazelnuts with the flour. Mix one-third of the dough with 1/4 cup chopped hazelnuts; freeze tablespoonfuls in clumps for 30 minutes. Press the remaining dough into a buttered 8-inch square pan. Spread with raspberry preserves and top with the frozen clumps. Bake about 50 minutes at 350 degrees.\n            \n", "ingredients": [], "title": "\nHazelnut Linzer Bars\n"}, {"directions": "\n\n              Make the cookies: Position racks in the upper and lower thirds of the oven; preheat to 350 degrees F. Spread the hazelnuts on a rimmed baking sheet and bake until golden brown, 9 to 11 minutes; let cool, then finely chop. Reduce the oven temperature to 225 degrees F and line 2 baking sheets with parchment paper.\n            \n\n              Whisk the egg whites, cream of tartar and salt in a large bowl with a mixer on medium speed until soft peaks form, about 3 minutes. Increase the mixer speed to medium high and beat in the granulated sugar, 1 tablespoon at a time. Continue beating until stiff peaks form, 6 to 8 minutes. Mix in the vanilla. Add the chopped hazelnuts and sift in the confectioners' sugar.\n            \n\n              Fold together with a rubber spatula.\n            \n\n              Transfer the meringue to a pastry bag fitted with a large round tip. Pipe 2-inch rounds about 1 inch apart on the prepared pans, keeping the pastry tip close to the pan.\n            \n\n              Bake, switching the pans halfway through, until the meringues are dry and release from\n            \n\n              the parchment, 1 1/2 to 2 hours. Turn off the oven; leave the meringues inside for 30 minutes. Transfer to racks to cool completely.\n            \n\n              Meanwhile, make the filling: Beat the butter, confectioners' sugar and salt in a bowl with a mixer on medium speed until combined, 1 minute. Increase the speed to medium high and beat in the vanilla; beat until fluffy, about 3 minutes. Dollop 1 teaspoon filling and 1/2 teaspoon jelly on the flat side of half the meringues. Top with the remaining meringues.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "hazelnuts or filberts", "quantity": 0.5}, {"food": "egg substitute", "quantity": 3.0}, {"food": "ice cream swich", "quantity": 0.25}, {"food": "salt", "quantity": 0.25}, {"food": "sugar", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "sugar", "quantity": 0.25}, {"food": "butter oil", "quantity": 4.0}, {"food": "sugar", "quantity": 0.75}, {"food": "hearts of palm", "quantity": 1}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}], "title": "\nHazelnut Meringue Sandwich Cookies\n"}, {"directions": "\n\n              Spread the hazelnuts on a baking sheet and bake until golden brown, about 10 minutes; let cool, then finely chop.\n            \n\n              Whisk the flour, allspice, salt and hazelnuts in a medium bowl. Beat the butter and 1/4 cup confectioners' sugar in a large bowl with a mixer on medium speed until light and creamy, about 3 minutes. Beat in the vanilla. Reduce the mixer speed to low and gradually beat in the flour mixture until the dough comes together. Cover with plastic wrap and refrigerate until firm, at least 1 hour or overnight.\n            \n\n              Preheat the oven to 350 degrees F. Coat a baking sheet with cooking spray. Roll tablespoonfuls of the dough into balls and arrange 1 inch apart on the prepared baking sheet. Bake until light golden on the bottom, about 12 minutes. Meanwhile, sift the remaining 3/4 cup confectioners' sugar into a medium bowl.\n            \n\n              Immediately transfer the warm cookies to the bowl of confectioners' sugar and gently toss to coat; transfer to a rack to cool completely. Roll the cookies in confectioners' sugar again when completely cool.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "hazelnuts or filberts", "quantity": 0.3333333333333333}, {"food": "potato flour", "quantity": 1.0}, {"food": "allspice", "quantity": 0.25}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "", "quantity": 1}], "title": "\nHazelnut Sandies\n"}, {"directions": "\n\n              1. Preheat the oven to 350 degrees F. Spread the hazelnuts on a baking sheet and toast in the oven until lightly browned, about 8 minutes. Cool and coarsely chop. \n            \n\n              2. In a medium saucepan, combine the hazelnuts, milk, cream, sugar, nutmeg, and salt and place over medium heat. Allow the mixture to reach a bare simmer, remove from the heat, cover, and let steep 1 hour. Strain the mixture through a fine-mesh sieve and discard the solids. \n            \n\n              3. Place the yolks in a large bowl and whisk until smooth. Pour in the strained milk mixture and whisk to combine. Return the mixture to the saucepan and cook over medium-low heat, stirring constantly with a wooden spoon, until it thickens enough to coat the back of the spoon and registers between 170 degrees F and 175 degrees F on an instant-read or candy thermometer, about 10 minutes. \n            \n\n              4. Immediately strain the custard into a bowl. Set the bowl in a larger bowl of ice water and stir until cool. Refrigerate the custard until very cold, about 2 hours. 5. Freeze the custard in an ice cream maker according to the manufacturer's instructions. When just about frozen, add the Nutella, a spoonful at a time, churning after each addition to create flecks in the gelato. Transfer the gelato to an airtight container and freeze until firm, about 2 hours. Best if eaten within 3 days.\n            \n", "ingredients": [{"food": "hazelnuts or filberts", "quantity": 1.5}, {"food": "whole milk", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "sugar", "quantity": 1.0}, {"food": "nutmeg", "quantity": 0.5}, {"food": "salt", "quantity": 0.125}, {"food": "egg substitute", "quantity": 8.0}, {"food": "", "quantity": 0.3333333333333333}], "title": "\nHazelnut and Nutmeg Gelato\n"}, {"directions": "\n\n              Make the crust: Preheat the oven to 350 degrees F. Spread the hazelnuts on a baking sheet and bake until golden brown, tossing, 10 to 12 minutes. Transfer to a food processor. Toast the sesame seeds in a small skillet over medium heat until golden, tossing, about 5 minutes. Add to the processor along with the coriander, cumin, sugar and 1/2 teaspoon salt; pulse until the mixture looks like breadcrumbs. Transfer to a shallow bowl.\n            \n\n              Make the salad: Set a steamer basket over a saucepan filled with 1 inch of water; bring the water to a boil. Add the carrots, cover and steam until fork-tender, 8 to 10 minutes. Meanwhile, whisk the parsley, garlic, vinegar, lemon juice, cayenne, 2 tablespoons of the hazelnut crust mixture, 1 teaspoon salt, and black pepper to taste in a large bowl. Slowly whisk in 2/3 cup olive oil. Add the steamed carrots and toss; cover and refrigerate at least 1 hour.\n            \n\n              Add the feta and dates to the carrot mixture, season with salt and black pepper and toss. Add the mixed greens and frisee but do not toss.\n            \n\n              Pat the lamb chops dry and season with salt and black pepper. Heat a large skillet over medium-high heat; add the remaining 2 teaspoons olive oil. Working in 2 batches, position the chops snugly in the skillet with the fatty edge down (the bones will curve); cook until browned on the bottom, 2 to 3 minutes. Turn the chops and cook on the flat sides until browned, 1 to 2 minutes per side. Dredge each cooked chop in the hazelnut crust.\n            \n\n              Toss the salad and divide among plates. Serve with the lamb chops.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "hazelnuts or filberts", "quantity": 0.75}, {"food": "sesame seeds", "quantity": 2.0}, {"food": "ground turkey", "quantity": 1.0}, {"food": "cumin seed", "quantity": 0.75}, {"food": "sugar", "quantity": 0.75}, {"food": "salt", "quantity": 1}, {"food": "pineapple chunks", "quantity": 1.0}, {"food": "parsley", "quantity": 0.25}, {"food": "garlic powder", "quantity": 1.0}, {"food": "vinegar", "quantity": 3.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.6666666666666666}, {"food": "macaroni cheese", "quantity": 0.5}, {"food": "dates", "quantity": 0.3333333333333333}, {"food": "mixed nuts", "quantity": 10.0}, {"food": "", "quantity": 1.0}, {"food": "lamb", "quantity": 12.0}], "title": "\nHazelnut-Crusted Lamb Chops\n"}, {"directions": "\n\n              Position racks in the upper and lower thirds of the oven and preheat to 325 degrees F. Spread the hazelnuts on a baking sheet and bake until toasted, 12 to 15 minutes; let cool completely. Combine 1 cup each hazelnuts and sugar and the potato starch in a blender or food processor and pulse until very finely ground. Transfer to a large bowl.\n            \n\n              Reduce the oven temperature to 275 degrees F. Line 2 large baking sheets with parchment paper. Using a bowl as a guide, draw three 7-inch circles on the parchment with a pencil (2 circles on 1 piece and 1 circle on the other); flip the parchment so the markings face down.\n            \n\n              Put the egg whites, 1/2 cup sugar and the salt in a large heatproof bowl. Set over a saucepan of simmering water (do not let the bowl touch the water) and whisk until the sugar is dissolved and the mixture is warm, 2 to 5 minutes. Remove the bowl from the saucepan and beat with a mixer on medium-high speed until stiff and shiny but not dry, about 2 minutes.\n            \n\n              Fold the milk and one-quarter of the egg white mixture into the nut mixture with a rubber spatula until smooth, then fold in the remaining egg whites until just combined. Divide the batter among the 3 circles on the parchment and spread evenly with an offset spatula to fill the circles. Bake 1 hour, 30 minutes, then switch the position of the pans and continue baking until firm, dry and golden, 1 to 2 more hours. (The layers are done when they easily peel off the parchment.) Let cool slightly on the baking sheets; peel off the parchment and transfer to a rack to cool completely.\n            \n\n              Meanwhile, make the ganache: Put 1 cup cream in a microwave-safe bowl; microwave until very hot, about 2 minutes. Whisk in the chocolate and espresso powder until smooth. Let cool to room temperature, then cover and refrigerate until cold, thick and spreadable, at least 30 minutes. Make the whipped cream: Combine the remaining 4 cups cream and 1/3 cup sugar in a large bowl and beat with a mixer on medium speed until it barely holds soft peaks, 1 to 2 minutes. Finish beating the cream by hand with a whisk until soft peaks form; do not overbeat.\n            \n\n              Put 2 meringue layers on a baking sheet; spread half of the ganache on each, to the edge. Refrigerate until set, 15 minutes. (If the ganache is too firm to spread, microwave in 20-second intervals to soften.) Place one of the ganache-topped meringues on a platter. Spread with 1 cup whipped cream. Stack the other ganache-topped meringue on top; spread with another layer of whipped cream. Top with the last meringue, then cover the top and side of the cake with the remaining whipped cream. Chop the remaining 1/3 cup hazelnuts and sprinkle on top of the cake along with the shaved chocolate. Refrigerate at least 6 hours or overnight before serving.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "hazelnuts or filberts", "quantity": 1.3333333333333333}, {"food": "sugar", "quantity": 1.5}, {"food": "potato flour", "quantity": 1.0}, {"food": "egg substitute", "quantity": 6.0}, {"food": "salt", "quantity": 0.25}, {"food": "whole milk", "quantity": 0.25}, {"food": "ice cream swich", "quantity": 5.0}, {"food": "baking chocolate", "quantity": 8.0}, {"food": "onion powder", "quantity": 1.0}], "title": "\nHazelnut-Mocha Dacquoise\n"}, {"directions": "\n\n              Line 2 baking sheets with parchment paper.\n            \n\n              Grind 1 cup of the confectioners' sugar, the hazelnuts, and cocoa in a food processor until powdery, about 3 minutes. Sift mixture through a medium mesh strainer onto a piece of parchment paper, then discard any large pieces of nuts that didn't come through the strainer.\n            \n\n              With an electric mixer, beat the egg whites and salt until they hold firm but not dry peaks, about 2 minutes. Gradually add the remaining 1 cup confectioners' sugar, a tablespoon at a time, scraping down the sides of the bowl as needed; this can take up to 3 minutes. Beat for an extra 30 seconds until the peaks are firm and shiny but still not dry. Fold the nut mixture gently into the egg whites with a large rubber spatula. Transfer mixture into a large piping bag fitted with a 1/2-inch plain piping tip. Pipe 32 2-inch by about 1/3-inch thick rounds, evenly spaced, on each of the prepared pans. Set aside to air dry for 30 minutes before baking.\n            \n\n              Meanwhile make the filling: Put chocolate in a medium heatproof bowl. In a small saucepan, bring cream, with espresso powder mixed in, to a boil. Pour cream over chocolate and shake bowl gently so cream settles around the chocolate. Set mixture aside until the chocolate is soft, about 5 minutes. Whisk gently until smooth, taking care not to incorporate too many air bubbles. Cool at room temperature until set up.\n            \n\n              Preheat oven to 325 degrees F.\n            \n\n              Bake macaroons until set and puffed, about 18 to 20 minutes. Take care not to overcook the macaroons or they'll crack. Cool cookies for 5 minutes then gently peel from paper. Let cool completely.\n            \n\n              Spread 1 teaspoon of mocha filling on a cookie and sandwich 2 cookies together.\n            \n", "ingredients": [{"food": "sugar", "quantity": 2.0}, {"food": "hazelnuts or filberts", "quantity": 4.75}, {"food": "onion powder", "quantity": 3.0}, {"food": "egg substitute", "quantity": 3.0}, {"food": "salt", "quantity": 0.125}, {"food": "baking chocolate", "quantity": 4.0}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "onion powder", "quantity": 1.0}], "title": "\nHazelnut-Mocha Macarons\n"}, {"directions": "\n\n              Separate the stems and the florets from the broccoli. Trim and discard the bottom of the broccoli stems and peel the tough outer layers. Finely chop the stems and coarsely chop the florets and set aside separately.\n            \n\n              Mist a large pot with nonstick cooking spray and heat over medium heat. Add the broccoli stems, onions and potatoes and cook, stirring, until softened, 7 to 10 minutes. Add the flour and cook, stirring, until lightly toasted, about 2 minutes. Stir in the broth and bring to a boil. Reduce the heat to maintain a simmer and continue to cook, stirring occasionally, until thickened and the vegetables are tender, 12 to 15 minutes.\n            \n\n              Meanwhile, combine the reserved florets and 1/2 cup water in a small saucepan. Bring to a boil, cover and continue to steam until the florets are bright green and crisp-tender, about 5 minutes. Add the entire contents of the pot with the florets to the soup along with the nutmeg. Stir to combine and remove from the heat. Stir in the Cheddar, Worcestershire and milk. Season with salt and pepper. Garnish with the scallions.\n            \n", "ingredients": [{"food": "broccoli raab", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "potato flour", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "nutmeg", "quantity": 0.25}, {"food": "", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "milk", "quantity": 12.0}, {"food": "black bean mango", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}], "title": "\nHealthified Broccoli Cheddar Soup\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Separate the stems and the florets from the broccoli. Trim and discard the bottom of the broccoli stems and peel the tough outer layers. Finely chop the stems and coarsely chop the florets and set aside separately. \n            \n\n              Mist a large pot with nonstick cooking spray and heat over medium heat. Add the broccoli stems, onions and potatoes and cook, stirring, until softened, 7 to 10 minutes. Add the flour and cook, stirring, until lightly toasted, about 2 minutes. Stir in the broth and bring to a boil. Reduce the heat to maintain a simmer and continue to cook, stirring occasionally, until thickened and the vegetables are tender, 12 to 15 minutes. \n            \n\n              Meanwhile, combine the reserved florets and 1/2 cup water in a small saucepan. Bring to a boil, cover and continue to steam until the florets are bright green and crisp-tender, about 5 minutes. Add the entire contents of the pot with the florets to the soup along with the nutmeg. Stir to combine and remove from the heat. Stir in the Cheddar, Worcestershire and milk. Season with salt and pepper. Garnish with the scallions. \n            \n", "ingredients": [{"food": "broccoli raab", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "potato flour", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "black bean mango", "quantity": 1}, {"food": "nutmeg", "quantity": 0.25}, {"food": "", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "milk", "quantity": 12.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}], "title": "\nHealthified Broccoli Cheddar Soup\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Puree the peppers, oregano, tomatoes, 1/4 teaspoon salt, 1/4 teaspoon pepper and the sugar in a food processor or blender until smooth and set aside. Mix 1 cup of the mozzarella cheese with the egg whites and ricotta cheese in a medium bowl.\n            \n\n              Heat the oil in a large nonstick skillet set over medium-high heat. Add the sliced mushrooms and cook, stirring, until they have released their liquid and are tender, about 10 minutes. Stir in the kale, in batches, and as it wilts add the pepper flakes, garlic and 1/4 teaspoon salt and continue to cook until the kale is wilted and bright green, an additional 5 minutes.\n            \n\n              Mist a 9-by-13-inch baking dish with nonstick cooking spray. Spread 3/4 cup of the sauce in the bottom of the dish. Top with 3 noodles, 1/2 of the ricotta mixture and 1/2 of the mushroom mixture. Repeat layers with sauce, noodles and remaining ricotta and mushrooms. Top with remaining noodles and sauce. Cover with aluminum foil and bake until the noodles are tender and the sauce is bubbling around the edges of the pan, about 50 minutes.\n            \n\n              Uncover, sprinkle with the remaining 1/2 cup grated mozzarella and continue to bake until melted, about 5 minutes. Let stand 15 minutes, sprinkle with parsley and serve.\n            \n", "ingredients": [{"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "plum", "quantity": 28.0}, {"food": "black bean mango", "quantity": 1}, {"food": "sugar", "quantity": 0.25}, {"food": "macaroni cheese", "quantity": 1.5}, {"food": "egg substitute", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 15.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "mushrooms", "quantity": 4.25}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "garlic powder", "quantity": 2.0}, {"food": "", "quantity": 1}, {"food": "lasagna", "quantity": 9.0}, {"food": "parsley", "quantity": 2.0}], "title": "\nHealthified Kale and Portobello Lasagna\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Puree the peppers, oregano, tomatoes, 1/4 teaspoon salt, 1/4 teaspoon pepper and the sugar in a food processor or blender until smooth and set aside. Mix 1 cup of the mozzarella cheese with the egg whites and ricotta cheese in a medium bowl.\n            \n\n              Heat the oil in a large nonstick skillet set over medium-high heat. Add the sliced mushrooms and cook, stirring, until they have released their liquid and are tender, about 10 minutes. Stir in the kale, in batches, and as it wilts add the pepper flakes, garlic and 1/4 teaspoon salt and continue to cook until the kale is wilted and bright green, an additional 5 minutes.\n            \n\n              Mist a 9-by-13-inch baking dish with nonstick cooking spray. Spread 3/4 cup of the sauce in the bottom of the dish. Top with 3 noodles, 1/2 of the ricotta mixture and 1/2 of the mushroom mixture. Repeat layers with sauce, noodles and remaining ricotta and mushrooms. Top with remaining noodles and sauce. Cover with aluminum foil and bake until the noodles are tender and the sauce is bubbling around the edges of the pan, about 50 minutes.\n            \n\n              Uncover, sprinkle with the remaining 1/2 cup grated mozzarella and continue to bake until melted, about 5 minutes. Let stand 15 minutes, sprinkle with parsley and serve.\n            \n", "ingredients": [{"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "plum", "quantity": 28.0}, {"food": "black bean mango", "quantity": 1}, {"food": "sugar", "quantity": 0.25}, {"food": "macaroni cheese", "quantity": 1.5}, {"food": "egg substitute", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 15.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "mushrooms", "quantity": 4.25}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "garlic powder", "quantity": 2.0}, {"food": "", "quantity": 1}, {"food": "lasagna", "quantity": 9.0}, {"food": "parsley", "quantity": 2.0}], "title": "\nHealthified Kale and Portobello Lasagna\n"}, {"directions": "\n\n              Heat the oil in a medium saucepan set over medium heat. Add the onions and 1/2 teaspoon kosher salt, and cook, stirring, until soft and translucent, about 5 minutes. Add the tomatoes, tomato paste, chili powder, cumin and garlic powder, and cook, stirring, until the tomatoes start to soften and the tomato paste darkens in color, about 1 minute. Add the broth, 1/2 teaspoon salt and a few grinds pepper, and bring to a boil. Stir in the oats and reduce the heat to medium-low. Simmer until the oats are creamy and tender, 5 to 6 minutes. Remove the saucepan from the heat, cover and rest until the oatmeal thickens slightly, about 2 minutes (not all of the liquid will absorb).\n            \n\n              Transfer the oatmeal to four serving bowls. Scatter the sliced chiles and cilantro over the oatmeal. Divide the avocado among the bowls, and top with the crushed tortilla chips. Serve warm with a quarter of lime on the side.\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 3.5}, {"food": "black bean mango", "quantity": 1}, {"food": "oats", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 0.25}, {"food": "diced chicken", "quantity": 1.25}, {"food": "tortilla", "quantity": 1.0}, {"food": "lime", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 2.0}, {"food": "pasta with tomato sauce", "quantity": 2.0}, {"food": "chili powder", "quantity": 0.5}, {"food": "cumin seed", "quantity": 1}, {"food": "garlic powder", "quantity": 1}], "title": "\nHealthy \"Tortilla Soup\" Oatmeal\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 400 degrees F. Slice the bottom and stem ends off the pepper and cut the ends into corn kernel-size pieces. Remove the seeds and cut the pepper into 4 rings.\n            \n\n              Scatter the tomatoes down the center of a baking sheet and arrange the pepper rings next to the tomatoes on whichever side you'd like. Drizzle 1 teaspoon of the oil over the tomatoes and sprinkle with salt, pepper and about half of the BBQ rub. Toss together the corn, pepper pieces, cheese, yogurt, cilantro, a large pinch of salt and a few grinds of pepper in a bowl. Fill the pepper rings with the corn mixture. Bake the vegetables until slightly browned, about 20 minutes. \n            \n\n              While the vegetables are in the oven, brush each salmon fillet with dijonnaise and sprinkle with the remaining BBQ rub, some salt and a few grinds of pepper. \n            \n\n              Once the vegetables are browned, remove the baking sheet from the oven and drizzle the empty side with the remaining 1 teaspoon oil. Add the fillets, return to the oven and cook until the sides of the salmon feel firm when gently squeezed and the flesh is just slightly flaky, 5 minutes more. Sprinkle with cilantro leaves and serve with lime wedges. \n            \n", "ingredients": [{"food": "pepper", "quantity": 1.0}, {"food": "grape juice", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "hearts of palm", "quantity": 2.0}, {"food": "frozen yogurt", "quantity": 1.5}, {"food": "macaroni cheese", "quantity": 2.0}, {"food": "silk plain soy yogurt", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "vegetarian fillets", "quantity": 6.0}, {"food": "", "quantity": 2.0}, {"food": "", "quantity": 1}], "title": "\nHealthy BBQ Salmon Sheet Pan Dinner\n"}, {"directions": "\n\n              Place a rack at the top of the oven and preheat the oven to 400 degrees F.\n            \n\n              Cut 1/4-inch off the top of each tomato and discard. Use a spoon to hollow out the tomatoes to about halfway down the center. Discard the pulp or reserve for another use. Use your hands to rub the outside of the tomatoes with a light coating of the oil, then drizzle any remaining oil inside the tomatoes. Season the inside of the tomatoes with 3/4 teaspoon salt and 1/4 teaspoon pepper. Place the tomatoes in a 9-by-13-inch baking dish and reserve.\n            \n\n              In a medium bowl, stir together the oats, flour, scallions, lemon zest, cheese, 1/2 teaspoon salt and 1/4 teaspoon pepper. Use your fingers to work the butter into the mixture until it resembles large crumb-like pieces. Evenly divide the oat crumble among the tomatoes.\n            \n\n              Bake until the tomatoes are tender and the crumble is golden brown and crispy, 45 to 50 minutes, rotating the dish halfway through.\n            \n\n              Carefully transfer the tomatoes to a platter and garnish with the sliced basil leaves to serve.\n            \n", "ingredients": [{"food": "tomatoes", "quantity": 8.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "oats", "quantity": 0.75}, {"food": "wheat flour", "quantity": 0.3333333333333333}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "", "quantity": 2.75}, {"food": "butter oil", "quantity": 4.5}, {"food": "chrysanthemum leaves", "quantity": 4.0}], "title": "\nHealthy Baked Tomatoes with Cheesy Oat Crumble\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Line a 12-cup muffin pan with cupcake liners.\n            \n\n              Melt the butter in a small skillet set over medium heat, and cook until it starts to bubble and foam, about 5 minutes. Continue cooking, stirring constantly, until the foam subsides and brown specks start to appear, 1 to 2 minutes. Transfer the butter to a medium mixing bowl to cool slightly.\n            \n\n              In a large bowl, combine the flour, 1/2 cup of the oats, the baking powder, salt and baking soda.\n            \n\n              Add the sour cream, sugar and vanilla to the browned butter and whisk. Add the eggs and whisk until combined. Fold the wet ingredients into the dry ingredients and mix until just combined. Then fold in the bananas (don't worry if there are a few lumps).\n            \n\n              Divide the batter evenly among the prepared pan. Sprinkle with the remaining 2 tablespoons oats. Bake until the muffins are light golden and a toothpick inserted in the center comes out clean, 20 to 24 minutes. Cool in the pan for a few minutes, and then transfer to a wire rack to cool completely.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.0}, {"food": "wheat flour", "quantity": 1.5}, {"food": "oats", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "sour cream", "quantity": 0.5}, {"food": "sugar", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "bananas", "quantity": 2.5}], "title": "\nHealthy Banana Oat Muffins\n"}, {"directions": "\nSpecial equipment: 4 rocks, float or parfait glasses\n\n              Put the chocolate in a small microwave-safe bowl and microwave in 30 second increments, stirring in between each, until smooth and pourable.\n            \n\n              Cut the bananas into 1/4-inch rounds and toss them with most of the walnuts in a medium bowl. (Reserve some nuts for the top.)\n            \n\n              To assemble the parfaits: Divide the pineapple evenly among 4 rocks, float or parfait glasses. Next, add the coated bananas. Top each with a scoop of ice cream and drizzle with the melted chocolate. Sprinkle with the reserved walnuts and top with a cherry.\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 2.0}, {"food": "bananas", "quantity": 3.0}, {"food": "walnuts", "quantity": 0.25}, {"food": "diced chicken", "quantity": 0.25}, {"food": "ice cream swich", "quantity": 0.25}, {"food": "maraschino cherries", "quantity": 4.0}], "title": "\nHealthy Banana Split Parfaits\n"}, {"directions": "\n\n              Position an oven rack in the middle of the oven and preheat to 350 degrees F. Line a 12-cup muffin pan with paper liners and spay the liners lightly with cooking spray.\n            \n\n              Reserve 1/2 cup of the blueberries for garnish. Place the remaining blueberries in a large bowl and lightly crush them with the back of a fork (crushing keeps them from sinking to the bottom of the muffin batter during baking). Add the flour, baking powder, cinnamon and salt to the blueberries and stir to combine. Whisk together the milk, oil, brown sugar, carrots, eggs, lemon zest and vanilla in another bowl, whisking until no clumps of brown sugar remain. Fold the milk mixture into the flour mixture until just combined (don't worry if there are a few lumps).\n            \n\n              Divide the batter evenly among the prepared muffin cups. Press the reserved blueberries into the tops of the muffins. Bake for 10 minutes. Remove the pan from the oven and sprinkle the tops of the muffins with the turbinado sugar. Rotate the pan and continue to bake until the muffins are golden and a toothpick inserted in the centers comes out clean, 20 to 24 minutes. Cool the muffins in the pan for a few minutes, then transfer the muffins to a rack to cool completely.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "blueberries", "quantity": 1.5}, {"food": "wheat flour", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "milk", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "sugar", "quantity": 0.5}, {"food": "carrots", "quantity": 2.0}, {"food": "eggs", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}], "title": "\nHealthy Blueberry-Carrot Muffins\n"}, {"directions": "\nSpecial equipment: Six 3- to 4-ounce ice pop molds\n\n              In the pitcher of a blender add the blueberries, hazelnut milk, oats, honey, preserves, lemon juice and a pinch of salt, and puree until smooth.\n            \n\n              Divide the mixture evenly among six 3- to 4-ounce ice pop molds. Freeze until solid, at least 8 hours, but preferably overnight.\n            \n\n              Rest at room temperature for a few minutes before unmolding.\n            \n", "ingredients": [{"food": "blueberries", "quantity": 2.0}, {"food": "milk", "quantity": 0.6666666666666666}, {"food": "oats", "quantity": 0.25}, {"food": "honey smoked ham", "quantity": 3.0}, {"food": "blueberry muffin mix", "quantity": 2.0}, {"food": "", "quantity": 0.5}, {"food": "salt", "quantity": 1}], "title": "\nHealthy Blueberry-Oat Breakfast Ice Pops\n"}, {"directions": "\n\n              Stir together the ricotta, lemon zest, vanilla and 1 tablespoon apricot jam in a small bowl.\n            \n\n              Toss together the blueberries with the remaining 1 teaspoon of apricot jam in another small bowl.\n            \n\n              Spoon the ricotta mixture into the phyllo cups. Top each with a few blueberries and nuts. The tartlets can be made ahead and refrigerated for up to 2 hours.\n            \n", "ingredients": [{"food": "", "quantity": 0.5}, {"food": "lemon juice", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "apricot nectar", "quantity": 1.0}, {"food": "blueberries", "quantity": 0.3333333333333333}, {"food": "tostada shells", "quantity": 12.0}, {"food": "pine nuts", "quantity": 2.0}], "title": "\nHealthy Blueberry-Ricotta Tartlets\n"}, {"directions": "\n\n              Cook the broccoli in a large pot of salted boiling water until just bright green, about 3 minutes. Drain and cool under cold running water. Drain again and pat dry with paper towels. \n            \n\n              Heat 2 teaspoons of the oil over medium-high heat in a small saucepan. Add the panko and cook, stirring, until the panko is just lightly toasted, 2 to 3 minutes. Set aside. \n            \n\n              Heat the remaining 1 tablespoon oil in a large skillet over medium-high heat. Add the garlic and cook, stirring, until it just turns golden around the edges, about 3 minutes. Stir in the wine, pepper flakes and broccoli. Sprinkle with salt and cook, stirring frequently, until the broccoli is heated through and the wine has evaporated, about 5 minutes. Transfer to a platter and sprinkle with the panko and lemon zest.\n            \n", "ingredients": [{"food": "martha white foods", "quantity": 0.3333333333333333}, {"food": "ruby red grapefruit juice blend", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "garlic powder", "quantity": 5.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 0.5}], "title": "\nHealthy Broccoli Roman Style\n"}, {"directions": "\n\n              Cook the broccoli in a large pot of salted boiling water until just bright green, about 3 minutes. Drain and cool under cold running water. Drain again and pat dry with paper towels. \n            \n\n              Heat 2 teaspoons of the oil over medium-high heat in a small saucepan. Add the panko and cook, stirring, until the panko is just lightly toasted, 2 to 3 minutes. Set aside. \n            \n\n              Heat the remaining 1 tablespoon oil in a large skillet over medium-high heat. Add the garlic and cook, stirring, until it just turns golden around the edges, about 3 minutes. Stir in the wine, pepper flakes and broccoli. Sprinkle with salt and cook, stirring frequently, until the broccoli is heated through and the wine has evaporated, about 5 minutes. Transfer to a platter and sprinkle with the panko and lemon zest.\n            \n", "ingredients": [{"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "garlic powder", "quantity": 5.0}, {"food": "martha white foods", "quantity": 0.3333333333333333}, {"food": "ruby red grapefruit juice blend", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 0.5}], "title": "\nHealthy Broccoli Roman Style\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: 12 cup muffin tin and paper liners\n\n              Preheat the oven to 350 degrees F. Line twelve 1/2-cup muffin cups with paper muffin liners. \n            \n\n              Whisk the flours with the brown sugar, wheat germ, cinnamon, baking powder, baking soda, and salt in a medium bowl. In another medium bowl lightly whisk the egg, then whisk in the vegetable oil, and vanilla extract. \n            \n\n              Quickly and lightly fold the wet ingredients into the dry ingredients with a rubber spatula. Stir in the carrots and pineapple just until evenly moist; the batter will be very thick. Divide the batter evenly among the muffin cups. Bake until golden and a toothpick inserted in the centers comes out clean, about 30 minutes. Turn muffins out of the tins and cool on a rack. Serve warm. \n            \n\n              Per Serving: Calories: 179; Total Fat: 7 grams; Saturated Fat: 1 gram; Protein: 3 grams; Total carbohydrates: 26 grams; Sugar: 14 grams; Fiber: 2 grams; Cholesterol: 31 milligrams; Sodium: 110 milligrams\n            \n", "ingredients": [{"food": "potato flour", "quantity": 0.75}, {"food": "wheat flour", "quantity": 0.5}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "wheat germ", "quantity": 2.0}, {"food": "cinnamon", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "eggs", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "carrots", "quantity": 4.0}, {"food": "pineapple chunks", "quantity": 0.5}], "title": "\nHealthy Carrot Muffins\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Trim the cauliflower florets, cutting away as much stem as possible. In 3 batches, break up the florets into a food processor and pulse until the mixture resembles couscous.\n            \n\n              Heat the oil in a large skillet over medium-high heat. At the first wisp of smoke from the oil, add the onions, and stir to coat. Continue cooking, stirring frequently, until the onions are golden brown at the edges and have softened, about 8 minutes. Add the cauliflower, and stir to combine. Add 1 teaspoon salt, and continue to cook, stirring frequently, until the cauliflower has softened, 3 to 5 minutes. Remove from the heat.\n            \n\n              Spoon the cauliflower into a large serving bowl, garnish with the parsley, sprinkle with the lemon juice and season to taste with salt. Serve warm.\n            \n", "ingredients": [{"food": "cauliflower", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "", "quantity": 0.5}], "title": "\nHealthy Cauliflower Rice\n"}, {"directions": "\n\n              In a small bowl, stir together the oats and 1/4 cup hot water, and rest for 5 minutes.\n            \n\n              In the pitcher of a blender, add the oat mixture, the cherries, yogurt, 2 tablespoons cold water, the honey, almond extract and a pinch of salt. Blend on high speed until very smooth. Pour into a glass and serve immediately.\n            \n", "ingredients": [{"food": "oats", "quantity": 3.0}, {"food": "sweet potatoes", "quantity": 1.5}, {"food": "silk banana-strawberry soy yogurt", "quantity": 0.3333333333333333}, {"food": "honey smoked ham", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 0.125}, {"food": "salt", "quantity": 1}], "title": "\nHealthy Cherry Almond Oatmeal Smoothie\n"}, {"directions": "\n\n              Preheat the oven to 450 degrees F.\n            \n\n              Combine the chicken, chili powder, cumin, 1/2 teaspoon salt and several grinds of pepper in a large bowl and toss to coat.\n            \n\n              Heat 1 tablespoon of the oil in a large cast-iron skillet over medium-high heat until it just begins to smoke. Add the chicken and cook, undisturbed, until it just starts to brown in spots, about 2 minutes. Add the onion and cook, stirring often, until the onions are tender, about 3 minutes more.\n            \n\n              Transfer the chicken and onion mixture to a large bowl and rinse and dry the skillet. Add the rice, 1/2 cup of the cheese, half the lime juice, 3/4 teaspoon salt and few grinds of pepper to the chicken and toss to combine. Divide the filling among the peppers.\n            \n\n              Add the remaining tablespoon of oil to the skillet, arrange the peppers on top and turn to high heat. When the oil starts to sizzle, about 2 minutes, transfer to the oven and bake until the filling is hot and the peppers are softened, about 20 minutes. Sprinkle the remaining 1/2 cup cheese over the peppers and bake until melted, about 3 minutes more.\n            \n\n              Drizzle the remaining lime juice over the peppers and top with the cilantro leaves. Serve with the sour cream, pico de gallo and guacamole, if desired.\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 12.0}, {"food": "chili powder", "quantity": 2.0}, {"food": "cumin seed", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "crisped rice bar", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "lime", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 4.0}, {"food": "chrysanthemum leaves", "quantity": 1}, {"food": "sour cream", "quantity": 2.0}, {"food": "", "quantity": 0.5}, {"food": "dulce de leche", "quantity": 0.5}], "title": "\nHealthy Chicken Fajita Stuffed Peppers\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Microwave the sweet potato on high until tender (when you squeeze it with a clean dish towel, it should feel really soft), about 5 minutes. Let sit for a few minutes.\n            \n\n              Cut the potato in half but not all the way through. Using the dish towel to hold the potato in place, scoop out the flesh into a small bowl. Add the chicken, Cheddar and a pinch salt and mash everything together with a fork. Fill the potato skin with the mixture. \n            \n\n              Cut the avocado into small pieces. Drizzle the stuffed potato with the salsa verde and top with the avocado and scallion.\n            \n", "ingredients": [{"food": "sweet potato puffs", "quantity": 1.0}, {"food": "fat free chicken breast ", "quantity": 0.25}, {"food": "", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "avocado", "quantity": 0.5}, {"food": "", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}], "title": "\nHealthy Chicken-and-Cheese-Stuffed Sweet Potatoes\n"}, {"directions": "\n\n              Bring the bulgur and 1 1/2 cups water to a boil in a small saucepan. Reduce the heat to medium-low, cover and simmer until tender, 10 to 12 minutes. Strain, and let cool completely.\n            \n\n              Meanwhile, heat the oil in a small skillet over medium-high heat. Add the tomato paste, chili powder, cumin and cayenne, and whisk until the oil is yellow and the spices are fragrant, about 45 seconds. Let the chili oil cool to room temperature.\n            \n\n              Whisk together the sour cream, lime zest and juice, a pinch of salt and 1 tablespoon water in a small bowl. Refrigerate until ready to serve.\n            \n\n              Position an oven rack at the top of the oven, and preheat the broiler. Line a baking sheet with foil. Mash the beans, cooked bulgur, cheese, breadcrumbs, scallions, chili oil and 1/2 teaspoon salt with a potato masher in a large bowl until the mixture is well combined and holds together when squeezed. Form into 4 uniform patties about 3/4 inch thick.\n            \n\n              Arrange the patties on the prepared baking sheet, and generously coat each with cooking spray. Broil until a golden-brown crust forms, 4 to 5 minutes. Remove the baking sheet from the broiler, flip each patty with a metal spatula and coat the tops with cooking spray. Broil until the tops are golden brown, 4 to 5 minutes more.\n            \n\n              Halve, pit and slice the avocado. Put each patty on a muffin bottom and sprinkle with additional cheese if using; top with some sour cream-lime sauce, avocados and sprouts, and sandwich with the muffin top.\n            \n", "ingredients": [{"food": "wheat flour", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "chili powder", "quantity": 1.0}, {"food": "cumin seed", "quantity": 0.5}, {"food": "pepper", "quantity": 1}, {"food": "sour cream", "quantity": 0.25}, {"food": "grape juice", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "fava beans", "quantity": 15.0}, {"food": "macaroni cheese", "quantity": 0.3333333333333333}, {"food": "", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "", "quantity": 1}, {"food": "avocado", "quantity": 1.0}, {"food": "split pea soup", "quantity": 4.0}, {"food": "brussels sprouts", "quantity": 1.0}], "title": "\nHealthy Chili Bean and Bulgur Burgers\n"}, {"directions": "\n\n              Prepare a grill for medium heat. Lay out a piece of heavy-duty foil 12 inches by 18 inches. Fold the four sides up to create walls and spread the shrimp in the center of the foil. Toss the shrimp with the garlic, chipotle sauce, cumin, oregano, coriander and salt. Pour in the beer. Dot the butter pieces on top. Cover with another large piece of foil and crimp and fold the edges together to seal tightly.\n            \n\n              Transfer the foil pack to the grill, close the lid and cook until the shrimp are pink and cooked through, 4 to 6 minutes. Remove from the heat and let sit for a few minutes. Carefully tear the packet open, being careful not to let the escaping steam burn you. Squeeze lime juice over the shrimp and sprinkle with cilantro. Serve the shrimp with the rice and pass extra chipotle hot sauce on the side.\n            \n", "ingredients": [{"food": "shrimp", "quantity": 1.25}, {"food": "garlic powder", "quantity": 5.0}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "cumin seed", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "ground turkey", "quantity": 0.25}, {"food": "salt", "quantity": 0.75}, {"food": "", "quantity": 0.5}, {"food": "butter oil", "quantity": 2.0}, {"food": "lime", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 0.25}, {"food": "crisped rice bar", "quantity": 2.0}], "title": "\nHealthy Chipotle Beer-and-Butter Shrimp Foil Pack\n"}, {"directions": "\n\n              Evenly position two racks in the middle of the oven and preheat to 375 degrees F. Line two baking sheets with parchment paper or silicone baking mats. (If you have only one baking sheet, let it cool completely between batches.)\n            \n\n              Whisk the sugars, eggs, oil and vanilla in a large bowl until smooth.\n            \n\n              Whisk the flours, salt and baking soda in another bowl. Stir the dry ingredients into the wet ingredients with a wooden spoon; take care not to over mix. Stir in the chocolate chips and dried fruit.\n            \n\n              Scoop heaping tablespoons of the dough onto the prepared pans. Wet hands slightly and roll the dough into balls. Space the cookies about 2 inches apart on the pans. Bake until golden but still soft in the center, 12 to 14 minutes, depending on how chewy or crunchy you like your cookies. Transfer the hot cookies with a spatula to a rack to cool. Serve.\n            \n\n              Store the cookies in a tightly sealed container for up to 3 days.\n            \n", "ingredients": [{"food": "sugar", "quantity": 0.75}, {"food": "sugar", "quantity": 0.75}, {"food": "eggs", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "wheat flour", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "baking chocolate", "quantity": 6.0}, {"food": "maraschino cherries", "quantity": 4.0}], "title": "\nHealthy Chocolate Chip Cookies\n"}, {"directions": "\n\n              Evenly position two racks in the middle of the oven and preheat to 375 degrees F. Line two baking sheets with parchment paper or silicone baking mats. (If you have only one baking sheet, let it cool completely between batches.)\n            \n\n              Whisk the sugars, eggs, oil and vanilla in a large bowl until smooth.\n            \n\n              Whisk the flours, salt and baking soda in another bowl. Stir the dry ingredients into the wet ingredients with a wooden spoon; take care not to over mix. Stir in the chocolate chips and dried fruit.\n            \n\n              Scoop heaping tablespoons of the dough onto the prepared pans. Wet hands slightly and roll the dough into balls. Space the cookies about 2 inches apart on the pans. Bake until golden but still soft in the center, 12 to 14 minutes, depending on how chewy or crunchy you like your cookies. Transfer the hot cookies with a spatula to a rack to cool. Serve.\n            \n\n              Store the cookies in a tightly sealed container for up to 3 days.\n            \n", "ingredients": [{"food": "sugar", "quantity": 0.75}, {"food": "sugar", "quantity": 0.75}, {"food": "eggs", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "wheat flour", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "baking chocolate", "quantity": 6.0}, {"food": "maraschino cherries", "quantity": 4.0}], "title": "\nHealthy Chocolate Chip Cookies\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: Four 3- to 4-ounce ice pop molds\n\n              Combine the milk, chocolate, cocoa powder, agave and a pinch of salt in a medium saucepan and set over medium-low heat. Cook, whisking constantly, until the chocolate melts and the cocoa dissolves, 6 to 8 minutes. Pour the chocolate mixture into a medium bowl. Stir in the chia seeds and vanilla. Let cool to room temperature, about 1 hour.\n            \n\n              Cover and refrigerate the mixture until chilled and the chia seeds are plumped, about 1 hour more, stirring halfway through.\n            \n\n              Divide the mixture evenly among four 3- to 4-ounce ice pop molds. Freeze until solid, at least 8 hours and up to overnight. Let sit at room temperature for a few minutes before unmolding.\n            \n\n              The pops will keep in the freezer for up to 2 weeks.\n            \n", "ingredients": [{"food": "milk", "quantity": 1.25}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "onion powder", "quantity": 3.0}, {"food": "silk light vanilla", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "chia seeds", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 0.5}], "title": "\nHealthy Chocolate-Chia Pudding Pops\n"}, {"directions": "\n\n              Mix the 2 cabbages together in a large colander. Salt cabbage generously and put in the sink to drain for about 1 hour. Rinse cabbage under cold water and pat very dry. Mix the carrot with the cabbage.\n            \n\n              Toast celery seeds in a dry skillet over medium heat; cool. Whisk the mayonnaise, mustard, brown sugar, pineapple juice, buttermilk, celery seeds, 1 teaspoon salt, pepper, to taste, and cayenne in a large bowl. Add the cabbage, tossing to coat. Serve immediately or refrigerate until needed.\n            \n", "ingredients": [{"food": "swamp cabbage", "quantity": 0.5}, {"food": "swamp cabbage", "quantity": 0.5}, {"food": "salt", "quantity": 1.0}, {"food": "carrot juice", "quantity": 1.0}, {"food": "celery seed", "quantity": 0.5}, {"food": "mayonnaise dressing", "quantity": 0.5}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "sugar", "quantity": 3.0}, {"food": "grape juice", "quantity": 3.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 0.25}], "title": "\nHealthy Chopped Slaw\n"}, {"directions": "\n\n              Warm the milk and 2 tablespoons of the butter in a small pot over medium-low heat until the milk is warm and the butter is melted. You do not want to bring the milk to boil or it will be too hot and kill the yeast. Remove from the heat and sprinkle the yeast over the mixture. Stir once or twice and set aside until it becomes foamy, about 5 minutes. Put the raisins in a small bowl and add 2 tablespoons water. Heat in the microwave on high until the raisins plump, about 45 seconds. Whisk both flours with the salt in a small bowl and set aside. In the bowl of a stand mixer fitted with the whisk attachment, beat the eggs and granulated sugar on medium-high speed until the sugar is dissolved and the eggs have lightened in color, 2 to 3 minutes. Reduce the speed of the mixer to low and slowly pour in the yeast mixture. Beat until smooth, and then add the flour mixture. Beat until just blended, and then switch to a dough hook and continue to mix the dough until it is soft, just a bit sticky and forms a loose ball shape, about 5 minutes. At this point touch the dough; it should only leave a small bit of sticky dough on your finger. If more than a bit sticks to your finger, add more all-purpose flour, a tablespoon at a time, until it reaches the right level of stickiness. Do not add more than 1/4 cup of flour or your dough will be dry and tough. Beat in the soaked raisins and any of the liquid in the dish until blended into the dough. Coat a large bowl with nonstick cooking spray, add the dough and turn to coat. Cover the bowl with plastic wrap and set in a warm place to rise until doubled in size, about 2 hours. Turn the dough out onto a clean work surface lightly dusted with all-purpose flour. Pat into a 15-by-10-inch rectangle. Melt 1 tablespoon of the butter and brush over the dough. Top with the apple butter, cinnamon and brown sugar. Fold in half from top to bottom to get a 16-by-6-inch piece of dough, and then cut into 24 strips. Twist and stretch, and then place on a lightly greased baking sheet, leaving 2 inches between each strip. Loosely cover with a piece of plastic wrap until the strips have doubled in size, about 1 hour longer. Preheat the oven to 350 degrees F. Melt the remaining 1 tablespoon butter and brush over the twists. Bake until lightly browned, about 15 minutes. Whisk the confectioners' sugar with 1 to 2 teaspoons very hot water until a smooth thick glaze, and brush over the warm twists. Serve warm.\n            \n\n              From Food Network Kitchen: This recipe has been updated and may differ from what was originally published or broadcasted.\n            \n\n              Makes 24 pieces (analysis per piece); Calories: 137; Total Fat: 3 grams; Saturated Fat: 1.5 grams; Protein: 3 grams; Total carbohydrates: 25 grams; Sugar: 9 grams; Fiber: 0 grams; Cholesterol: 21 milligrams; Sodium: 93 milligrams\n            \n", "ingredients": [{"food": "milk", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 4.0}, {"food": "yeast extract spread", "quantity": 25.0}, {"food": "raisins", "quantity": 0.5}, {"food": "wheat flour", "quantity": 2.25}, {"food": "potato flour", "quantity": 1.25}, {"food": "salt", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "sugar", "quantity": 0.5}, {"food": "", "quantity": 1}, {"food": "butter oil", "quantity": 2.0}, {"food": "cinnamon", "quantity": 2.0}, {"food": "sugar", "quantity": 2.0}, {"food": "sugar", "quantity": 0.25}], "title": "\nHealthy Cinnamon Breadsticks\n"}, {"directions": "\n\n              Heat the oil in a large, low-sided stockpot or Dutch oven set over medium-high heat. Add the onions and cook until they start to soften and are brown in parts, about 5 minutes. Add the garlic and ham, and cook until the garlic softens, about 2 minutes. Add the collard greens, broth, vinegar, 1 teaspoon salt and 1/4 teaspoon pepper. Stir to combine and cook, covered, until the collards are tender, 20 to 30 minutes. Stir in the black-eyed peas and butter, and cook until the beans are warmed through, about 5 minutes.\n            \n\n              Meanwhile, fill a large saucepan three-quarters with water. Salt lightly and bring to a boil. Add the oats and cook, stirring occasionally, until just tender, about 15 minutes. Drain the oats and divide them among six bowls. Top with the collard greens, ham and black-eyed peas. Serve immediately with hot sauce if using.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "ham", "quantity": 8.5}, {"food": "chrysanthemum leaves", "quantity": 2.5}, {"food": "diced chicken", "quantity": 2.0}, {"food": "vinegar", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "pigeon peas", "quantity": 15.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "oats", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 1}], "title": "\nHealthy Collard Greens and Black-Eyed Peas Over Oats\n"}, {"directions": "\n\n              Combine the Swiss chard, onions and 1/2 cup water in a large pot. Bring to a simmer over high heat, lower the heat to medium, cover and cook, stirring frequently, until the chard is very tender, about 15 minutes. \n            \n\n              Meanwhile, combine the cream cheese, nutmeg and 1/4 cup water in a medium saucepan. Place over medium heat and cook, whisking frequently, until the cheese melts and the mixture just bubbles around the edges. With a slotted spoon, transfer the chard to the pan with the cheese mixture (leave any excess liquid in the pot). Mix well and season with salt and pepper. Garnish with the pine nuts.\n            \n\n              Calories: 100 Fat: 6 grams Saturated Fat: 2 grams Protein: 5 grams Carbohydrates: 9 grams Sugar: 4 grams Fiber: 2 grams Cholesterol: 10 milligrams Sodium: 340 milligrams\n            \n", "ingredients": [{"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 6.0}, {"food": "nutmeg", "quantity": 0.25}, {"food": "black bean mango", "quantity": 1}, {"food": "pine nuts", "quantity": 2.0}], "title": "\nHealthy Creamed Swiss Chard With Pine Nuts\n"}, {"directions": "\n\n              Cut the squash in half lengthwise and scoop out the seeds. Place the cut-side down in a microwave-safe baking dish (the halves can overlap one another a bit) and add 1 cup water. Cover with plastic wrap and microwave until very tender and a knife easily pierces the skin of the squash, 15 to 18 minutes. Let stand 5 minutes. Carefully uncover and let stand until cool enough to handle but still warm. \n            \n\n              Meanwhile, heat the oil in a small nonstick skillet. Add the ginger and garam masala until fragrant. Stir in the lemon juice and honey. Season with the salt. The sauce should be sweet and sour. \n            \n\n              Scrape the flesh of the squash into a bowl, using a fork, to make long noodle-like strands. Toss with the sauce and cilantro. Season with additional salt. \n            \n\n              Calories: 140 Fat: 5 grams Saturated Fat: 1 gram Protein: 2 grams Carbohydrates: 26 grams Sugar: 6 grams Fiber: 0 grams Cholesterol: 0 milligrams Sodium: 170 milligrams\n            \n", "ingredients": [{"food": "spaghetti", "quantity": 1.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "ginger", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "honey smoked ham", "quantity": 4.0}, {"food": "seasoning mix", "quantity": 0.25}, {"food": "chrysanthemum leaves", "quantity": 0.5}], "title": "\nHealthy Curried Spaghetti Squash\n"}, {"directions": "\n\n              Cut the squash in half lengthwise and scoop out the seeds. Place the cut-side down in a microwave-safe baking dish (the halves can overlap one another a bit) and add 1 cup water. Cover with plastic wrap and microwave until very tender and a knife easily pierces the skin of the squash, 15 to 18 minutes. Let stand 5 minutes. Carefully uncover and let stand until cool enough to handle but still warm.\n            \n\n              Meanwhile, heat the oil in a small nonstick skillet. Add the ginger and garam masala until fragrant. Stir in the lemon juice and honey. Season with the salt. The sauce should be sweet and sour.\n            \n\n              Scrape the flesh of the squash into a bowl, using a fork, to make long noodle-like strands. Toss with the sauce and cilantro. Season with additional salt.\n            \n", "ingredients": [{"food": "spaghetti", "quantity": 1.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "ginger", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "honey smoked ham", "quantity": 4.0}, {"food": "seasoning mix", "quantity": 0.25}, {"food": "chrysanthemum leaves", "quantity": 0.5}], "title": "\nHealthy Curried Spaghetti Squash\n"}, {"directions": "\n\n              Quarter the dragon fruit lengthwise. Work your finger under the skin, pull it back and peel it away in 1 piece. Cut each quarter into 1/4-inch-thick triangles.\n            \n\n              Whisk together the yogurt, mayonnaise, lemon juice, honey, ginger and salt in a large bowl. Add the apples, grapes, 3/4 of the dragon fruit pieces and 3/4 of both the cilantro and the cashews. Toss to combine, and refrigerate until chilled, about 1 hour.\n            \n\n              Put a lettuce leaf in each of 4 small bowls, and top each with a scoop of salad. Garnish with the remaining dragon fruit, cilantro and cashews.\n            \n", "ingredients": [{"food": "fruit cocktail", "quantity": 1.0}, {"food": "silk banana-strawberry soy yogurt", "quantity": 0.3333333333333333}, {"food": "mayonnaise dressing", "quantity": 2.0}, {"food": "", "quantity": 0.5}, {"food": "honey smoked ham", "quantity": 1.0}, {"food": "ginger", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "apple", "quantity": 1.5}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "", "quantity": 0.3333333333333333}, {"food": "chrysanthemum leaves", "quantity": 4.0}], "title": "\nHealthy Dragon Fruit Waldorf Salad\n"}, {"directions": "\nSpecial equipment: A broiler-safe 9-by-13-inch baking dish\n\n              Position 2 oven racks in the middle and upper third of the oven, and preheat to 425 degrees F. Line 2 rimmed baking sheets with parchment.\n            \n\n              Cook the oil, garlic and 1/2 teaspoon salt in a large skillet over medium heat, stirring, until the garlic just starts to turn golden, 4 to 6 minutes. Add the tomatoes; rinse the can with about 1 1/2 cups water, and add the tomato water to the skillet. Add the kale and basil, bring to a simmer and cook until the sauce thickens, about 25 minutes.\n            \n\n              Meanwhile, combine the almond flour and breadcrumbs in a medium bowl until evenly mixed. Whisk the egg whites and 3 tablespoons water in another medium bowl until frothy.\n            \n\n              Lay out the eggplant slices on a clean surface, and season with 1/2 teaspoon salt and a few grinds of pepper. Dip the eggplant slices in the egg whites, then press into the almond-breadcrumb mixture to coat. Place the eggplant pieces on the baking sheets. Bake until the eggplant is tender and the crust is golden brown, about 30 minutes. Rotate the baking sheets if the top one is browning too quickly.\n            \n\n              Turn the oven to broil. Spread a little of the sauce on the bottom of a broiler-safe 9-by-13-inch baking dish. Arrange half the eggplant in the dish in as close to an even layer as you can without overlapping too much. Spread half the remaining sauce on top, then 1/4 of the mozzarella. Top with the remaining eggplant, sauce and mozzarella and the Parmesan. Place the baking dish under the broiler until the cheese is melted and browned, about 1 minute. Serve immediately, while the cheese is still warm. Sprinkle the top with the parsley.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "whole milk", "quantity": 28.0}, {"food": "kale", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "egg substitute", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.5}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 0.25}, {"food": "chrysanthemum leaves", "quantity": 2.0}], "title": "\nHealthy Eggplant and Kale Parmesan\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Bring a medium saucepan filled two-thirds full of water to a boil. Add the farro and cook until tender but still chewy, about 15 minutes. Drain well and cool. (This can be done one day ahead).\n            \n\n              Combine the scallion whites, garlic, ginger, crushed red pepper, 1/2 teaspoon salt and sugar in a small bowl and keep near the stove top.\n            \n\n              Heat 1 tablespoon of the oil in a large nonstick skillet or wok over medium-high heat. Add the carrot and cook, stirring constantly, until crisp-tender, about 2 minutes. Add the scallion white mixture and continue to stir fry until fragrant, about 30 seconds. Add the cooled farro, half the scallion greens, the peas, bean sprouts, soy sauce and sesame oil and stir fry until the farro is hot, about 2 minutes. Remove from the heat and transfer to a serving dish.\n            \n\n              Wipe out the skillet, add the remaining 1 teaspoon of oil and place over medium-high heat. Add the eggs and a large pinch of salt; let cook undisturbed until the eggs begin to bubble up, then stir constantly, breaking the eggs up into small pieces, until they are cooked through, about 30 seconds. Scrape eggs over the farro and stir to incorporate. Sprinkle with the remaining scallion green and serve hot.\n            \n", "ingredients": [{"food": "", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "ginger", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "sugar", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "pigeon peas", "quantity": 1.0}, {"food": "brussels sprouts", "quantity": 1.0}, {"food": "soy sauce", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}], "title": "\nHealthy Farro Fried \"Rice\"\n"}, {"directions": "\n\n              Melt 2 tablespoons of the butter in a medium saucepan over medium heat. Add half the garlic, and cook, stirring, until soft, about 2 minutes. Add the quinoa, 2 1/3 cups water, 1/4 teaspoon salt and a few grinds of pepper, and bring to a simmer, stirring. Cover, reduce the heat to medium-low and cook until the quinoa is tender (the little white tails become visible) and the liquid is the consistency of a thin porridge, 10 to 15 minutes. Remove the saucepan from the heat, and whisk in the Parmesan and half the parsley. Cover and keep warm.\n            \n\n              Meanwhile, season the shrimp with 1/4 teaspoon salt and a few grinds of pepper. Heat the oil in a large nonstick skillet over medium-high heat. Add the shrimp in a single layer (it's OK if they touch), and cook until the underside turns pink, about 2 minutes. Turn the shrimp, add the remaining garlic and cook until the shrimp begin to curl and turn totally pink, about 2 minutes more. Add the wine, 2 tablespoons water and the remaining parsley, reserving a pinch for garnish. Once the liquid has reduced by half, swirl in the remaining 2 tablespoons butter until smooth. Divide the quinoa and shrimp among 4 bowls, top with the pan sauce and sprinkle with the reserved parsley.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 4.5}, {"food": "garlic powder", "quantity": 4.0}, {"food": "quinoa", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 0.3333333333333333}, {"food": "chrysanthemum leaves", "quantity": 0.25}, {"food": "shrimp", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "martha white foods", "quantity": 0.5}], "title": "\nHealthy Garlic Shrimp and Quinoa Grits\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Adjust an oven rack to the middle position and preheat the oven to 325 degrees F.\n            \n\n              Toss together the oats, millet, almonds, coconut flakes, pumpkin seeds, sunflower seeds and sesame seeds in a large bowl.\n            \n\n              Whisk together the olive oil, brown sugar, maple syrup, vanilla and 3/4 teaspoon salt together in a small bowl.\n            \n\n              Pour the olive oil mixture into the oat mixture and toss until evenly coated. Spread out on a rimmed baking sheet and bake until golden and toasted, tossing the mixture around about halfway through, 30 to 40 minutes. Let cool completely on the baking sheet, then store at room temperature in an airtight container for up to 1 week.\n            \n", "ingredients": [{"food": "oats", "quantity": 3.5}, {"food": "millet", "quantity": 1.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "coconut water", "quantity": 0.3333333333333333}, {"food": "pumpkin flowers", "quantity": 0.3333333333333333}, {"food": "sesame seeds", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "sugar", "quantity": 0.25}, {"food": "syrup", "quantity": 0.25}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "salt", "quantity": 1}], "title": "\nHealthy Granola\n"}, {"directions": "\nSpecial equipment: Heavy-duty foil\n\n              Prepare a grill for medium-high heat.\n            \n\n              Stir together the milk, egg, breadcrumbs, Worcestershire sauce and 1 tablespoon of the barbecue sauce in a medium bowl.\n            \n\n              Finely chop the spinach, scallion and garlic together on a cutting board. Transfer to the bowl, along with the ground beef and turkey, 1 teaspoon salt and several grinds of black pepper. Gently combine the mixture well with your hands.\n            \n\n              Coat a 20-inch piece of heavy duty aluminum foil all over with cooking spray. Pile the meatloaf mixture onto the foil just off the center and form into a 9-by-5-inch loaf that's about 1-inch thick. Fold the long half of the foil over the meatloaf, lining up the edges, and crimp and fold tightly to make a sealed packet.\n            \n\n              Put the packet on the grill, close the grill lid and cook for 10 minutes. Turn the packet over using 2 large metal spatulas; cover and grill 10 minutes more. Remove and let rest for 5 minutes. Carefully open the packet (hot steam will escape). The meatloaf should have some grill marks and an internal temperature of 165 degrees F. Brush the top and sides of the loaf with the remaining 3 tablespoons barbecue sauce. Cut into slices and serve.\n            \n", "ingredients": [{"food": "milk", "quantity": 0.25}, {"food": "egg substitute", "quantity": 1.0}, {"food": "", "quantity": 3.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 4.0}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "frankfurter beef", "quantity": 12.0}, {"food": "ground turkey", "quantity": 8.0}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 1}], "title": "\nHealthy Grilled BBQ Meatloaf Foil Pack\n"}, {"directions": "\nSpecial equipment: Four 8-inch disposable foil pie pans and heavy duty foil\n\n              Prepare a grill for medium heat.\n            \n\n              Put the chicken, beans, rice, salsa, pickled jalapenos, tomato paste, chili powder, turmeric and 3/4 teaspoon salt in a large bowl and toss to combine. Divide the chicken-rice mixture evenly among the pie pans, spreading it out in an even layer. Pour 1/2 cup of chicken broth into each pie pan.\n            \n\n              Cover each pan tightly with foil. Put the pans on the grill, close the grill lid and cook for 20 minutes. Remove from the grill and let rest for a few minutes.\n            \n\n              Carefully remove the foil from each pan (hot steam will escape). The liquid should be absorbed, the rice tender and the chicken cooked through. Sprinkle each with some scallions.\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 4.5}, {"food": "fava beans", "quantity": 15.0}, {"food": "crisped rice bar", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "luncheon slices", "quantity": 2.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "chili powder", "quantity": 1.0}, {"food": "turmeric", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}], "title": "\nHealthy Grilled Chicken-and-Rice Foil Packs\n"}, {"directions": "\nSpecial equipment: Nonstick foil\n\n              Special equipment: nonstick foil\n            \n\n              Prepare a grill for medium-high heat.\n            \n\n              Tear eight 14-inch pieces of nonstick foil and lay them out nonstick-side up. Brush the centers of each piece with the melted butter.\n            \n\n              Whisk together the evaporated milk, eggs, maple syrup, vanilla and cinnamon in a small baking dish or large resealable bag.\n            \n\n              Dip each side of each piece of bread in the milk mixture until fully submerged. Arrange 2 pieces of bread next to each other, without overlapping, on 1 piece of buttered foil. Repeat with the remaining bread and 3 pieces of foil.\n            \n\n              Make the foil packs: Put the remaining 4 pieces of foil, buttered-side down, directly on top of the bread so the foil touches the bread and the edges line up. Fold and crimp the edges tightly to make 4 oblong packets.\n            \n\n              Put the packs on the grill, close the lid and cook for 5 minutes. Turn the packets over, close the lid and grill 5 minutes more. Remove and let rest for a few minutes. Carefully open the packets (hot steam will escape). Both sides of the French toast should be browned and the center should be custardy. Keep in the packets or transfer to plates. Top each serving with 1/4 cup of the berries and more maple syrup, if desired.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 3.0}, {"food": "milk", "quantity": 12.0}, {"food": "eggs", "quantity": 2.0}, {"food": "syrup", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "garlic bread", "quantity": 8.0}, {"food": "mixed nuts", "quantity": 1.0}], "title": "\nHealthy Grilled French Toast Foil Packets\n"}, {"directions": "\nSpecial equipment: 18-inch-wide heavy duty foil\n\n              Prepare a grill for medium-high heat.\n            \n\n              Toss together the bell pepper, onion, scallions, oil, chile powder, cumin and 1/4 teaspoon salt in a very large bowl.\n            \n\n              Tear two 18-inch pieces of 18-inch-wide heavy duty foil. Spread the vegetable mixture on one piece of foil, leaving a few inches of exposed foil as a border. Arrange the shrimp on top of the vegetables in a single layer. Squeeze the limes over the mixture. Top with the remaining piece of foil, lining up the edges. Fold the edges and crimp tightly to make a leak-proof packet.\n            \n\n              Tear two 18-inch pieces of 18-inch-wide heavy duty foil. Arrange the tortillas, overlapping slightly, on one piece of foil. Top with the remaining piece of foil, lining up the edges. Fold the edges and crimp tightly to make another packet.\n            \n\n              Put the shrimp packet on the grill, close the grill lid and cook 12 minutes (do not turn the packet over). The packet should puff up and look like a pillow. Slide from the grill onto a baking sheet using tongs. Set aside and let rest while you heat up the tortillas. Put the tortilla pack on the grill and cook until warm, about 2 minutes per side.\n            \n\n              Carefully open the shrimp packet (hot steam will escape). The shrimp should be pink and cooked through and the onions and peppers just tender. Scatter the cilantro over the shrimp. Serve with the warm tortillas and salsa and avocado, if desired.\n            \n", "ingredients": [{"food": "peppers", "quantity": 2.5}, {"food": "onion powder", "quantity": 1.5}, {"food": "", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "cumin seed", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "shrimp", "quantity": 1.25}, {"food": "limes", "quantity": 2.0}, {"food": "potato flour", "quantity": 6.0}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "avocado", "quantity": 1}], "title": "\nHealthy Grilled Shrimp Fajita Foil Pack\n"}, {"directions": "\nSpecial equipment: 18-inch-wide heavy duty foil\n\n              Prepare a grill for medium heat.\n            \n\n              Toss together the tomatoes, eggplant, zucchini, pesto, olives, garlic, olive oil, crushed red pepper and 1 teaspoon salt in a large bowl.\n            \n\n              Combine the wine with 2 cups water in a large measuring cup or bowl.\n            \n\n              Tear four 16-inch pieces of 18-inch-wide heavy duty foil and arrange on a work surface. Evenly divide the spaghetti among the 4 pieces of foil, placing it in the center of each piece and leaving plenty of room on the short ends. Evenly divide the vegetable mixture among the foil, spooning it on top of the spaghetti. Fold up the sides and ends of each piece of foil to make a canoe shape. Pour 3/4 cup of the wine mixture into each packet. Keeping the folded sides up, tightly crimp the edges together so the packets remain canoe-shaped. This will prevent leaking and allow for space at the top of each packet.\n            \n\n              Put the packets on the grill, close the grill lid and cook 24 minutes, changing the position of the packets on the grill about halfway through. Remove from the grill and let rest for 10 minutes.\n            \n\n              Carefully open each packet. The pasta should be al dente and the vegetable mixture saucy. Stir 2 tablespoons Parmesan into each serving. Transfer the pasta and sauce to 4 serving bowls and top with the basil.\n            \n", "ingredients": [{"food": "pineapple chunks", "quantity": 2.5}, {"food": "pineapple chunks", "quantity": 1.5}, {"food": "pineapple chunks", "quantity": 1.5}, {"food": "pasta with tomato sauce", "quantity": 0.25}, {"food": "olives", "quantity": 12.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "martha white foods", "quantity": 1.0}, {"food": "spaghetti", "quantity": 8.0}, {"food": "", "quantity": 8.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}], "title": "\nHealthy Grilled Summer Vegetable Spaghetti Foil Pack\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Pulse the melba toasts in a food processor to make semi-coarse crumbs; transfer to a medium bowl or dish. Mix in the breadcrumbs, oregano, 1/4 teaspoon each salt and pepper and the cayenne if using. \n            \n\n              Whisk together the egg whites, whole egg, garlic and 1/4 teaspoon each salt and pepper in another bowl. \n            \n\n              Put the flour and 1/4 teaspoon salt in a resealable plastic bag. Add the cheese pieces to the bag, close and shake to coat. Dip one piece of the cheese at a time in the egg mixture first, and then roll firmly in the breadcrumb mixture; then dip the same piece again in the egg mixture followed by the breadcrumb mixture. (Note: Use one hand with the dry mixture and the other with the wet mixture.) Place on a parchment paper-lined plate or baking sheet. Freeze for 15 minutes, or up to overnight. \n            \n\n              Preheat the oven to 475 degrees F. Transfer the frozen cheese sticks to another baking sheet. Fully coat the cheese sticks with the olive oil cooking spray. Bake until golden, about 12 minutes. Sprinkle with additional salt and pepper to taste. \n            \n\n              Serve immediately with the warm marinara sauce.\n            \n", "ingredients": [{"food": "", "quantity": 10.0}, {"food": "whole milk", "quantity": 0.3333333333333333}, {"food": "", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "ground turkey", "quantity": 1}, {"food": "egg substitute", "quantity": 2.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "wheat flour", "quantity": 0.3333333333333333}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "Worcestershire sauce", "quantity": 0.3333333333333333}], "title": "\nHealthy Mozzarella Sticks\n"}, {"directions": "\n\n              For the crust: Line an 8-inch square pan with foil so it overhangs on two sides and lightly coat with cooking spray. Process the cookies in a food processor until finely ground. Add the melted butter and process again until the crumbs are coated with the butter; add the melted chocolate and process until the mixture is the texture of very wet sand. Using an offset spatula, press the mixture into the bottom of the prepared pan, cover and refrigerate while preparing the filling. Clean out the food processor bowl.\n            \n\n              For the filling and topping: Add the cream cheese, peanut butter, yogurt and sugar to the bowl of the food processor and process until smooth and combined. Pour the mixture over the crust and smooth with a spatula. Top with the peanuts and sprinkle with 1/4 teaspoon salt. Cover and refrigerate until set slightly looser than cream cheese, about 4 hours up to overnight.\n            \n\n              Run a knife around the edges of the mixture to loosen, use the foil handles to lift it out, cut into 12 bars and serve chilled.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "chocolate chip cookies", "quantity": 24.0}, {"food": "butter oil", "quantity": 3.0}, {"food": "baking chocolate", "quantity": 4.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "peanut butter ", "quantity": 0.5}, {"food": "silk banana-strawberry soy yogurt", "quantity": 0.5}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "peanuts", "quantity": 0.25}, {"food": "salt", "quantity": 1}], "title": "\nHealthy No-Bake Chocolate-Peanut Butter Bars\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: An offset spatula\n\n              For the crust: Line an 8-inch square pan with foil so it overhangs on two sides and lightly spray the foil with nonstick cooking spray. Put the chocolate and butter in a medium microwave-safe bowl and microwave, stirring every 30 seconds, until the chocolate is melted and smooth, about 1 minute.\n            \n\n              Put the graham crackers in a food processor and process until finely ground. Add the melted chocolate mixture and process until the mixture is the texture of very wet sand. Press the crust into the bottom of the prepared pan, cover and refrigerate while preparing the cheesecake layer.\n            \n\n              For the cheesecake: Clean out the food processor bowl. Sprinkle the gelatin over 2 tablespoons water in a small microwave-safe bowl and set aside to soften, about 5 minutes. Microwave the dissolved gelatin, stirring every 10 seconds, until melted.\n            \n\n              Combine the cream cheese, buttermilk, peanut butter, brown sugar, vanilla, salt and melted gelatin in the food processor and process until smooth and the sugar has dissolved. Rub a little of the mixture between your fingers, if it is still gritty then continue to process.\n            \n\n              Pour the cream cheese mixture over the crust and spread evenly with an offset spatula. Sprinkle the top with the peanuts. Wrap the pan loosely with plastic wrap and refrigerate until the cheesecake layer is set, about 2 hours. The bars can be assembled and refrigerated overnight. Cut into 12 bars.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "baking chocolate", "quantity": 4.0}, {"food": "butter oil", "quantity": 3.0}, {"food": "baking chocolate", "quantity": 9.0}, {"food": "", "quantity": 1}, {"food": "", "quantity": 0.25}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 1.0}, {"food": "peanut butter ", "quantity": 0.3333333333333333}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "peanuts", "quantity": 2.0}], "title": "\nHealthy No-Bake Peanut Butter Cheesecake Bars\n"}, {"directions": "\nSpecial equipment: kitchen twine\n\n              Preheat the oven to 425 degrees F.\n            \n\n              Toss the squash with 2 tablespoons of the oil, 3/4 teaspoon salt and 1/4 teaspoon pepper. Spread on a baking sheet and roast until tender and golden brown in spots, about 40 minutes, rotating the baking sheet halfway through.\n            \n\n              Meanwhile, combine the broth and 2 cups water in a saucepan and heat until just barely simmering. Tie together the sage with kitchen twine and add to the stock. Reserve for a later use.\n            \n\n              Heat the remaining 2 tablespoons oil in a low-sided stockpot set over medium heat. Add the shallots and cook, stirring frequently with a wooden spoon, until translucent and soft, 6 to 8 minutes. Add the garlic and cook until softened, about 3 minutes. Add the oats, 1/2 teaspoon salt and 1/4 teaspoon pepper, and stir until coated. Add the wine and simmer, stirring constantly, until absorbed, about 1 minute. Add 3 cups of the warm broth to the oats, then simmer, stirring constantly, until most of the liquid is absorbed, 8 to 10 minutes. Add 2 more cups of the broth and simmer, stirring constantly, until the oats are tender but still have a slight bite, 10 to 12 minutes. (There will be a fair amount of liquid in the pot at this time, similar to the texture of a thin gravy. It will thicken once the cheese is added.) Remove from the heat and stir in half of the cheese and half of the parsley. Adjust the consistency of the risotto by adding more stock as needed. Divide the hot risotto among four warm serving bowls, and top each with some butternut squash. Sprinkle with the remaining cheese and parsley to serve.\n            \n", "ingredients": [{"food": "squash", "quantity": 5.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 4.0}, {"food": "sage", "quantity": 1.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "oats", "quantity": 1.0}, {"food": "martha white foods", "quantity": 0.5}, {"food": "", "quantity": 1.5}, {"food": "parsley", "quantity": 3.0}], "title": "\nHealthy Oat Risotto with Roasted Butternut Squash\n"}, {"directions": "\n\n              Bring 3 1/2 cups water and 1/2 teaspoon salt to a boil in a medium saucepan. Reduce the heat to medium-low and stir in the oats. Cook, stirring frequently, until the oats are creamy and tender, 5 to 6 minutes. Remove the saucepan from the heat, cover and rest until the oatmeal thickens slightly, about 2 minutes.\n            \n\n              Whisk together the yogurt, 1 tablespoon of the maple syrup and the matcha in a small bowl until smooth and creamy. Set aside.\n            \n\n              Transfer the oatmeal to four serving bowls, and top each with 1/4 cup of the matcha yogurt. Scatter the chopped pistachios over the oatmeal and drizzle with the remaining maple syrup. Top each serving with some apples and sprinkle with matcha to serve.\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "oats", "quantity": 2.0}, {"food": "silk banana-strawberry soy yogurt", "quantity": 1.0}, {"food": "syrup", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "", "quantity": 4.0}, {"food": "apple", "quantity": 1.0}], "title": "\nHealthy Oatmeal with Matcha Yogurt, Pistachios and Apples\n"}, {"directions": "\n\n              Position racks in the upper and lower thirds of the oven and preheat the oven to 350 degrees F.\n            \n\n              Spread the oats out on a baking sheet and bake until light golden brown, 10 to 12 minutes. Reserve 1/4 cup of the oats for sprinkling and transfer the remaining oats to a medium mixing bowl to cool. Line two baking sheets with parchment paper.\n            \n\n              In the bowl of a stand mixer fitted with the paddle attachment, beat the sugar and butter on medium-high speed until lighter in color and slightly fluffy, about 5 minutes, scraping down the sides of the bowl several times. Beat in the egg and vanilla until very fluffy, 2 to 3 minutes more.\n            \n\n              In the mixing bowl with the cooled oats, add the flour, cinnamon, baking powder and salt, and mix to combine. Reduce the mixer speed to low, then add the flour mixture to the butter and beat until just combined. Stir in the dates and chocolate by hand.\n            \n\n              Drop level tablespoons of the dough on the baking sheets, leaving at least 1-inch of space around each cookie, about 30 cookies total. Sprinkle the cookies with the reserved toasted oats. Bake until the cookies are lightly golden, 12 to 15 minutes. Cool the cookies for 5 minutes on the baking sheets, then transfer to cooling racks to cool completely.\n            \n", "ingredients": [{"food": "oats", "quantity": 1.5}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "butter oil", "quantity": 6.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "wheat flour", "quantity": 0.75}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "cinnamon", "quantity": 0.5}, {"food": "salt", "quantity": 0.25}, {"food": "dates", "quantity": 0.75}, {"food": "baking chocolate", "quantity": 0.5}], "title": "\nHealthy Oatmeal, Date and Chocolate Chunk Cookies\n"}, {"directions": "\n\n              Combine the tomatoes, scallion greens, lemon juice and a pinch of salt in a medium bowl and toss to coat.\n            \n\n              Add the oil to a large skillet and heat over medium-high heat. Add the tomato paste, Cajun seasoning, scallion whites, celery and garlic. Cook, stirring frequently, until the paste turns brick red and the scallions and celery just begin to soften, about 4 minutes. Add the quinoa and stir to coat in the tomato paste mixture. Pour in 2 cups water and sprinkle with 1/2 teaspoon salt and several grinds of pepper. Bring to a high simmer and cook until most of the liquid has evaporated and the quinoa is tender, 12 to 15 minutes.\n            \n\n              Adjust the heat to medium-low, add the shrimp, sprinkle with salt and pepper, cover and cook until the shrimp is firm and cooked through, about 5 minutes. Remove from the heat and scatter with the cherry tomato salad.\n            \n", "ingredients": [{"food": "mixed nuts", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "seasoning mix", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "martha white foods", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "shrimp", "quantity": 1.25}], "title": "\nHealthy One-Skillet Shrimp and Quinoa\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: A glass pint jar or other container with a lid\n\n              The night before you want to eat the oats, combine the milk, oats, brown sugar, vanilla, carrots and a pinch of salt in a glass pint jar or other container with a lid. Secure the lid and shake. Refrigerate for at least 6 hours or up to overnight.\n            \n\n              In the morning, top the oats with the coconut, raisins, walnuts and cinnamon. To serve, drizzle with honey if using.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "milk", "quantity": 0.75}, {"food": "oats", "quantity": 0.5}, {"food": "sugar", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.125}, {"food": "carrot juice", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "coconut water", "quantity": 1.0}, {"food": "raisins", "quantity": 1.0}, {"food": "walnuts", "quantity": 1.0}, {"food": "cinnamon", "quantity": 1}], "title": "\nHealthy Overnight Carrot Cake Oats\n"}, {"directions": "\n\n              For the French toast: Coat a 9- by 13-inch baking dish with cooking spray. Arrange the bread slices on the diagonal in 3 rows in the dish, slightly overlapping the slices. Whisk together the evaporated milk, milk, vanilla and almond extracts, cinnamon, salt and eggs until well combined. Pour the egg mixture over the bread slices, taking care to evenly coat the bread. Cover with aluminum foil and refrigerate for at least 8 hours, or overnight. Preheat the oven to 350 degrees F. Remove the foil from the baking dish and spoon any remaining egg mixture over the top of the bread pieces to assure they are evenly moistened.\n            \n\n              For the topping: Sprinkle the pecans evenly over the bread. Sprinkle with 2 tablespoons of the maple syrup and the cinnamon. Bake until golden, about 40 minutes. Drizzle with the remaining 1/4 cup maple syrup and serve.\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 1}, {"food": "luncheon slices", "quantity": 8.25}, {"food": "milk", "quantity": 12.0}, {"food": "milk", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.25}, {"food": "cinnamon", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "eggs", "quantity": 4.0}, {"food": "pecans", "quantity": 0.3333333333333333}, {"food": "syrup", "quantity": 0.25}, {"food": "cinnamon", "quantity": 0.125}], "title": "\nHealthy Overnight French Toast Bake\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F.\n            \n\n              Put the peaches, 2 tablespoons of the butter, 2 tablespoons of the maple syrup and the vanilla in a 2-quart oval baking dish. Toss with a spatula to combine, then arrange the peaches cut side up.\n            \n\n              Put the bread and salt in the bowl of a food processor. Pulse until you have small crumbs (take care not to over-process or the crumbs can get gummy). Transfer to a medium bowl and mix with the remaining 2 tablespoons butter and 2 tablespoons maple syrup. Sprinkle the bread mixture evenly over the peaches.\n            \n\n              Bake until the peaches are very tender and the bread crumbs are golden-brown, 30 to 35 minutes.\n            \n", "ingredients": [{"food": "peaches", "quantity": 4.0}, {"food": "butter oil", "quantity": 4.5}, {"food": "syrup", "quantity": 4.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "garlic bread", "quantity": 4.0}, {"food": "salt", "quantity": 1}], "title": "\nHealthy Peach Betty\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: a 32-ounce plastic container or glass jar\n\n              Bring a small pot of salted water to a boil. Add the soba noodles and cook according to the package instructions. Reserve 2 tablespoons of the cooking water, then drain the noodles and cool.\n            \n\n              Whisk together the peanut butter, hoisin, chili-garlic sauce, 1 tablespoon of the lime juice, 1/2 teaspoon of the sesame oil, the reserved 2 tablespoons noodle water and a large pinch salt in a medium bowl. Add the soba noodles to the sauce and toss to coat. Transfer the tossed noodles to a 32-ounce resealable plastic container or glass jar. \n            \n\n              Whisk together the remaining 1 teaspoon lime juice, 1/2 teaspoon sesame oil, a pinch salt and a few grinds of black pepper in the same bowl. Add the coleslaw mix, cilantro, scallion, bell pepper and cucumber and toss to coat. Transfer to the container on top of the noodles. Pack the seaweed snacks separately. \n            \n\n              When ready to eat, top with the seaweed snack strips and eat right out of the container (or transfer to a bowl).\n            \n", "ingredients": [{"food": "black bean mango", "quantity": 1}, {"food": "buckwheat", "quantity": 2.0}, {"food": "peanut butter ", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 0.5}, {"food": "lime juice", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "cheesecake mix", "quantity": 0.5}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "cucumber", "quantity": 0.5}, {"food": "seaweed", "quantity": 2.0}], "title": "\nHealthy Peanut Soba Noodles with Vegetable Salad\n"}, {"directions": "\n\n              Stuff a whole almond into the space where each prune pit was. Fold and press the prunes around the almonds (it's fine if the almonds peek through a bit). Put the prunes on a baking sheet lined with waxed paper and refrigerate 30 minutes.\n            \n\n              Put the raspberries into a resealable plastic bag and crush into a fine powder. Place the powder in a small shallow bowl.\n            \n\n              Put the chocolate in a small microwave-safe bowl. Microwave at 70 percent power for 1 minute. Remove from the microwave; the chocolate will still look solid but will be softened. Stir until smooth.\n            \n\n              Dip one end of a prune in chocolate, let any excess drip back in the bowl, and then dip the chocolate end into the crushed raspberries to coat. Put the prune back on the baking sheet, almond-side down, and repeat with the remaining prunes. Let the prunes stand until the chocolate hardens enough to come away cleanly from the paper, about 15 minutes.\n            \n", "ingredients": [{"food": "smoked turkey roll", "quantity": 12.0}, {"food": "prunes", "quantity": 12.0}, {"food": "raspberries", "quantity": 24.0}, {"food": "baking chocolate", "quantity": 2.0}], "title": "\nHealthy Prune Truffles\n"}, {"directions": "\nSpecial equipment: a 2-quart baking dish or an 8-inch square baking pan\n\n              For the oatmeal: Preheat the oven to 350 degrees F. Grease a 2-quart baking dish or an 8-inch square baking pan with the butter.\n            \n\n              Stir together the oats, sugar and salt in a large bowl. Whisk together the almond milk, vanilla and egg in a medium bowl. Pour the milk mixture into the oat mixture and stir to combine.\n            \n\n              For the topping: In a medium bowl, stir together the walnuts, oats, sugar, butter, flour, pumpkin pie spice and salt.\n            \n\n              Pour the oatmeal into the prepared baking dish. Scoop heaping tablespoons of the pumpkin puree directly into the oatmeal, and sprinkle the topping over the dish. The mixture will be very wet at this point, but the oats will soak up the liquid. Bake until lightly browned and just set, about 50 minutes.\n            \n\n              Cool on a rack for 10 to 15 minutes. Serve warm.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 2.0}, {"food": "oats", "quantity": 1.25}, {"food": "sugar", "quantity": 3.0}, {"food": "salt", "quantity": 0.125}, {"food": "milk", "quantity": 1.6666666666666665}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "walnuts", "quantity": 0.3333333333333333}, {"food": "oats", "quantity": 0.3333333333333333}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "butter oil", "quantity": 2.0}, {"food": "wheat flour", "quantity": 1.0}, {"food": "pumpkin pie spice", "quantity": 0.25}, {"food": "salt", "quantity": 0.125}, {"food": "pumpkin flowers", "quantity": 15.0}], "title": "\nHealthy Pumpkin-Oatmeal Bake\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: six 3- to 4-ounce frozen pop molds\n\n              Put six 3-to 4-ounce ice pop molds in the freezer for 30 minutes.\n            \n\n              Combine the strawberries and 1 tablespoon each coconut cream and honey in a blender. Puree until smooth. Pour into a liquid measuring cup and set aside. Rinse out the blender.  \n            \n\n              Combine coconut milk, 1 tablespoon each coconut cream and lime juice in the blender. Puree until smooth. \n            \n\n              Evenly divide strawberry puree between the frozen pop molds. Carefully layer the coconut milk over the strawberry puree. Freeze for 30 minutes. Rinse out the blender.\n            \n\n              When you are ready to complete the frozen pops, combine the blueberries and the remaining 1 tablespoon each coconut cream, honey and lime juice in the blender. Puree until smooth (see Cook's Note). \n            \n\n              Remove the frozen pop molds from the freezer and fill with the blueberry puree, and insert the frozen pop mold stick. \n            \n\n              Freeze until set, at least 4 hours up to overnight. Let sit at room temperature for 5 minutes before unmolding and serving.\n            \n", "ingredients": [{"food": "strawberries", "quantity": 2.0}, {"food": "coconut cream", "quantity": 3.0}, {"food": "honey smoked ham", "quantity": 2.0}, {"food": "coconut milk", "quantity": 0.5}, {"food": "lime juice", "quantity": 2.0}, {"food": "blueberries", "quantity": 2.0}], "title": "\nHealthy Red, White and Blue Frozen Pops\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Position a rack in the top third of the oven. Place the asparagus on a baking sheet lined with parchment paper. Drizzle with the olive oil and sprinkle lightly with salt and pepper. Roast until tender, about 15 minutes.\n            \n\n              Meanwhile, combine 5 tablespoons of the almonds, the lemon juice, sugar and 6 tablespoons water in a blender and blend until smooth, about 1 minute. Taste the sauce and season with salt. Pour the sauce onto a platter and place the asparagus on top. Garnish with the zest and remaining 1 tablespoon almonds. \n            \n\n              Per serving: SERVES: Calories: 110; Total Fat: 5 grams; Saturated Fat: 0.5 grams; Protein: 2 grams; Total carbohydrates: 17 grams; Sugar: 8 grams; Fiber: 6 grams; Cholesterol: 0 milligrams; Sodium: 125 milligrams\n            \n", "ingredients": [{"food": "asparagus", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 6.0}, {"food": "lemon juice", "quantity": 1.5}, {"food": "sugar", "quantity": 0.25}, {"food": "lemon juice", "quantity": 1.5}], "title": "\nHealthy Roast Asparagus with Creamy Almond Vinaigrette\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F and position a rack in the top third of the oven. \n            \n\n              Line a baking sheet with parchment paper. Place the potatoes and lemons on the sheet, drizzle with the oil and sprinkle with salt and pepper. Roast until tender and browned, about 1 hour, stirring the potatoes once or twice during cooking. Sprinkle with the garlic and roast 5 more minutes.\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 1.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "garlic powder", "quantity": 1.0}], "title": "\nHealthy Roast Fingerlings with Lemon\n"}, {"directions": "\n\n              Halve the peppers lengthwise, remove the stem and discard the seeds. Put in a large microwave-safe bowl and toss with a splash of water and a large pinch of salt. Cover with plastic wrap and cut a slit in the center to allow steam to escape using a paring knife. Microwave at 100 percent power until the peppers are soft and pliable, 5 to 7 minutes. Allow to cool completely.\n            \n\n              Heat 1 tablespoon of oil in a large nonstick skillet over medium-high heat and add the sausages, cut-side down. Cook until browned on both sides, about 3 minutes per side. Transfer to a plate.\n            \n\n              Lower the heat to medium, add the onion and remaining tablespoon of oil to the skillet and cook, stirring frequently, until soft and just starting to brown, about 5 minutes. Add the sausages back to the skillet and pour in the marinara and 1/4 cup water. Bring to a low simmer and cook until the sausages and sauce are warmed through and the sauce is slightly thickened, about 3 minutes. Remove from heat, stir in the parsley and set aside.\n            \n\n              Arrange the pepper halves on a work surface cut-side up. Put a chicken sausage half in a pepper half with some of the sauce and onions and fold up like a taco. Wrap halfway in wax paper. Repeat with the remaining ingredients to make 3 more tacos and serve immediately.\n            \n", "ingredients": [{"food": "ruby red grapefruit juice blend", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "pork sausage links", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "Worcestershire sauce", "quantity": 0.75}, {"food": "parsley", "quantity": 0.25}], "title": "\nHealthy Sausage in a Pepper\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Rinse the kale and shake off some of the water. Toss together the kale, garlic, peppers, 3 tablespoons of the oil, a large pinch of salt and a few grinds of pepper in a large bowl. Pile the mixture onto a rimmed baking sheet. Roast, covered with a sheet of parchment paper, until the kale is wilted and tender and the peppers are soft, about 35 minutes.\n            \n\n              Meanwhile, coat the shrimp with the curry paste, the juice of 1 lime half and the remaining 1 tablespoon oil.\n            \n\n              When the kale mixture is ready, remove the parchment from the top and toss it with a spatula. Top with an even layer of shrimp and roast until the shrimp are firm and cooked through, 10 to 12 minutes.\n            \n\n              Scatter the basil, cilantro, mint and cashews over top and squeeze with the remaining lime half. Season with salt and pepper. Serve with rice and lime wedges.\n            \n", "ingredients": [{"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "orange", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 4.0}, {"food": "black bean mango", "quantity": 1}, {"food": "shrimp", "quantity": 1.25}, {"food": "ruby red grapefruit juice blend", "quantity": 2.0}, {"food": "lime", "quantity": 1.0}, {"food": "basil", "quantity": 0.25}, {"food": "", "quantity": 0.25}, {"food": "", "quantity": 0.25}, {"food": "", "quantity": 2.0}, {"food": "crisped rice bar", "quantity": 1}], "title": "\nHealthy Sheet Pan Shrimp and Greens\n"}, {"directions": "\n\n              Soak the raisins in warm water until plump, about 15 minutes. Drain and set aside.\n            \n\n              Meanwhile, trim the cauliflower florets, cutting away as much stem as possible. In three batches, break up the florets into a food processor and pulse until the texture resembles that of couscous.\n            \n\n              Heat the oil in a large skillet over medium-high heat. At the first wisp of smoke from the oil, add the onions, and stir to coat. Continue cooking the onions, stirring frequently, until the edges are golden brown and the onions have softened, about 6 minutes. Add the almonds, raisins, capers, garlic, lemon zest and red pepper flakes, and cook, stirring, until the almonds are golden, about 3 minutes.\n            \n\n              Add the cauliflower to the skillet, and stir to combine. Add 1 teaspoon salt, and continue to cook, stirring frequently, until the cauliflower has softened, 3 to 5 minutes.\n            \n\n              Spoon the cauliflower into a large serving bowl, garnish with parsley and season to taste with salt. Serve warm.\n            \n", "ingredients": [{"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.25}, {"food": "cauliflower", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "onion powder", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.3333333333333333}, {"food": "capers", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "", "quantity": 0.5}, {"food": "ruby red grapefruit juice blend", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 0.25}], "title": "\nHealthy Sicilian Cauliflower Rice\n"}, {"directions": "\n\n              Place the bok choy in a steamer basket and place the basket over (not in) simmering water. Steam until the base of the bok choy is just tender when pierced with the tip of a knife, about 6 minutes. Meanwhile, whisk together the chives, soy sauce, lime juice, lime zest and sugar in a small bowl. Transfer the bok choy to a platter and drizzle with the soy mixture. Drizzle with the spicy sesame oil and serve.\n            \n\n              Per serving: Calories: 30; Total Fat: 1.5 grams; Saturated Fat: 0 grams; Protein: 2 grams; Total carbohydrates: 4 grams; Sugar: 2 grams; Fiber: 1 gram; Cholesterol: 0 milligrams; Sodium: 250 milligrams\n            \n", "ingredients": [{"food": "split pea soup", "quantity": 4.0}, {"food": "chives", "quantity": 2.0}, {"food": "soy sauce", "quantity": 4.0}, {"food": "lime juice", "quantity": 2.0}, {"food": "lime", "quantity": 1.0}, {"food": "sugar", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 1.0}], "title": "\nHealthy Spicy Steamed Baby Bok Choy\n"}, {"directions": "\n\n              For the dough: Combine both kinds of flour and 1/4 teaspoon salt in a large bowl and make a well in the center. Stir 1 1/4 cups warm water with the olive oil and yeast and pour into the well in the flour bowl. Stir until a soft and shaggy dough forms and then turn out onto a lightly-floured board and knead until smooth and the dough springs back when pressed with your thumb. Transfer to a bowl coated with nonstick cooking spray, mist the dough ball, cover and let stand until doubled in size, about 1 hour. Divide the dough into 2 pieces and roll each into a ball. Cover loosely and let rest an additional 30 minutes.\n            \n\n              For the sauce: Combine the oregano, tomatoes and garlic in a small skillet and bring to a simmer over medium heat. Continue to cook, stirring and lightly mashing the tomatoes with a spatula, until the tomatoes have released their liquid and the sauce has become thick and jammy, about 15 minutes. Remove from the heat, season with salt and pepper and stir in the basil.\n            \n\n              For assembling the pizza: Place 2 baking sheets in the oven and turn the oven to 500 degrees F. Stretch and/or roll each piece of dough until very thin and place each on a piece of lightly floured parchment paper that is the same size as the baking sheets heating in the oven (the dough will be a rustic oval shape). Rub each piece of dough with 1 teaspoon of the oil, sprinkle with 1/4 teaspoon salt and 1/8 teaspoon pepper and carefully transfer to the hot baking sheets. Bake until lightly browned, 8 to 10 minutes. Remove from the oven and evenly spread each pizza crust with the sauce, spreading about 1/2 inch from the edge, and then top with the mozzarella, Parmesan and spinach. Return to the oven and continue to bake until the crust is crisp and the cheese has melted and is browned in spots, 6 to 8 minutes, rotating the pans if necessary. Remove from the oven and place small spoonfuls of the ricotta on the pizzas and sprinkle with fresh basil. Sprinkle the pizzas with salt and crushed red pepper flakes, if using.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "yeast extract spread", "quantity": 1.0}, {"food": "", "quantity": 1}, {"food": "", "quantity": 0.5}, {"food": "plum", "quantity": 4.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "macaroni cheese", "quantity": 1.5}, {"food": "", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 6.0}, {"food": "macaroni cheese", "quantity": 0.5}, {"food": "basil", "quantity": 1}, {"food": "ruby red grapefruit juice blend", "quantity": 1}], "title": "\nHealthy Spinach and Ricotta Pizza\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Heat the olive oil in a large nonstick skillet over medium heat, add the onions and cook, stirring occasionally, until just browned and soft, about 5 minutes. Add the kale, garlic and 1/2 teaspoon each salt and pepper and cook until the kale is bright green, about 2 minutes. Add the broth and continue to cook until the kale is wilted and most of the broth is absorbed, about 5 minutes more. Add the squash, zucchini and 1/2 teaspoon salt and toss to combine with the kale. Continue cooking until the squash begins to soften, about 8 minutes. Remove from the heat and stir in the mayonnaise.\n            \n\n              Toss the cooked vegetables, brown rice, cheeses, 1/2 cup of the bread crumbs and the egg in a large bowl until mixed. Spray a 9-inch square or 2-quart casserole dish with cooking spray. Spread the mixture in the bottom of the casserole and top with the remaining 1/2 cup bread crumbs, 1/4 teaspoon salt and a few grinds of pepper. Bake until the squash and zucchini are tender and the top is browned and crisp, about 35 minutes. Serve hot.\n            \n\n              Make-Ahead Tip: Freeze the baked casserole for up to 2 weeks. Cover with foil and reheat at 350 degrees F until hot, 35 to 45 minutes.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.25}, {"food": "kale", "quantity": 6.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "diced chicken", "quantity": 0.5}, {"food": "diced chicken", "quantity": 2.5}, {"food": "diced chicken", "quantity": 2.5}, {"food": "mayonnaise dressing", "quantity": 2.0}, {"food": "crisped rice bar", "quantity": 3.0}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 0.3333333333333333}, {"food": "bread crumbs", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "", "quantity": 1}], "title": "\nHealthy Squash and Kale Casserole\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the cavatappi and cook according to the package directions. Drain and rinse under cold water. Set aside.\n            \n\n              Meanwhile, soak the onion in cold water for 5 minutes and then drain. \n            \n\n              Whisk together the mayonnaise, sour cream, cider vinegar, sugar, mustard, drained red onion, 1/2 teaspoon salt and a few grinds of pepper until smooth.\n            \n\n              Add the cooked cavatappi, tomatoes, dill, corn and zucchini to the dressing and stir to coat.\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "", "quantity": 8.0}, {"food": "onion powder", "quantity": 1}, {"food": "mayonnaise dressing", "quantity": 0.5}, {"food": "sour cream", "quantity": 3.0}, {"food": "vinegar", "quantity": 1.5}, {"food": "sugar", "quantity": 1.5}, {"food": "mustard spinach", "quantity": 0.75}, {"food": "meat drippings ", "quantity": 1}, {"food": "barley flour or meal", "quantity": 1.0}, {"food": "dill seed", "quantity": 2.0}, {"food": "sunflower seed kernels", "quantity": 1.0}, {"food": "", "quantity": 1.0}], "title": "\nHealthy Summer Pasta Salad\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Lightly coat a 2-quart baking dish with cooking spray. Put the sweet potatoes in a large pot and cover with salted water by 2-inches. Bring to a boil over medium-high heat. Add the carrots. Cook until both the potatoes and carrots are tender, about 15 minutes. Drain well.\n            \n\n              Transfer the potatoes and carrots to a large bowl and add the sugar, butter, ginger, zest, and cinnamon. Mash until well combined and slightly chunky. Season with salt and pepper. Stir in the egg whites and transfer to the baking dish. Sprinkle with the nuts and bake until well puffed and hot through, about 30 minutes.\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 2.0}, {"food": "", "quantity": 3.0}, {"food": "sugar", "quantity": 0.25}, {"food": "butter oil", "quantity": 2.0}, {"food": "ginger", "quantity": 2.0}, {"food": "orange", "quantity": 0.5}, {"food": "cinnamon", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "egg substitute", "quantity": 2.0}, {"food": "pecans", "quantity": 0.3333333333333333}], "title": "\nHealthy Sweet Potato Casserole\n"}, {"directions": "\n\n              Pull some of the soft middle from both halves of the roll out to make a well. Spread the cream cheese on the bottom of the roll. Top with the olives, artichoke hearts, tomato, roasted pepper, basil leaves, followed by the mixed sliced vegetables. Drizzle the artichoke marinade over the vegetables. Season with a pinch of salt and several cracks of black pepper. Sandwich with the top half of the roll and wrap tightly in plastic wrap and refrigerate for at least 3 hours up to overnight (this allows the flavors to meld).\n            \n", "ingredients": [{"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "whipped cream substitute", "quantity": 2.0}, {"food": "black bean mango", "quantity": 6.0}, {"food": "hearts of palm", "quantity": 5.0}, {"food": "plum", "quantity": 4.0}, {"food": "pepper", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 3.0}, {"food": "mixed nuts", "quantity": 1.0}, {"food": "salt", "quantity": 1}], "title": "\nHealthy Vegetarian Pan Bagnat\n"}, {"directions": "\nSpecial equipment: a pizza stone or baking sheet\n\n              For the dough: Stir together the warm water, honey and yeast in a measuring cup or small bowl. Let sit until a small layer of foam develops at the top, 3 to 5 minutes. (If this doesn't happen, your yeast is old; discard it and try again with new yeast.)\n            \n\n              Combine the flour and 1/2 teaspoon salt in a medium bowl and make a well in the center. Add the yeast mixture and oil to the well and incorporate with a wooden spoon until a sticky dough forms. Scrape down the sides of the bowl with a silicone spatula to reincorporate any dough stuck to the sides. Cover the bowl tightly with plastic wrap or a damp kitchen towel and keep in a warm place until the dough has doubled in size, about 1 1/2 hours.\n            \n\n              Knead the dough on a floured surface just until smooth, a few seconds. Divide the dough into 2 balls, cover with plastic wrap or a damp kitchen towel and let rest on the counter for 30 minutes.\n            \n\n              For the sauce: Put the tomatoes in a small bowl and rinse the can with about 2/3 cup of water into the bowl.\n            \n\n              Add the oil, garlic, 1/4 teaspoon salt and crushed red pepper to a large skillet. Cook over medium heat, stirring, until the garlic just starts to turn golden, 3 to 4 minutes. Add the tomato mixture and simmer, stirring occasionally, until the sauce thickens, 15 to 20 minutes.\n            \n\n              For the pesto: Preheat the oven to 400 degrees F. Spread the pistachios on a baking sheet and toast, tossing once, until slightly browned and aromatic, about 8 minutes. Let cool, then pulse in a food processor until the texture of coarse sand. Add the arugula, parsley and 1/4 teaspoon salt and pulse until the mixture is evenly chopped. Drizzle the oil through the feed tube with the machine running until well incorporated.\n            \n\n              When you are ready to bake the pizza, place a pizza stone in the bottom of the oven and heat it to 450 degrees F. If you do not have a pizza stone, preheat a baking sheet that has been flipped over bottom-side up. Cut two 12-inch squares of parchment and dust with flour.\n            \n\n              On a floured surface, stretch one ball of dough to a 12-inch round, leaving a thick 3/4-inch border on the edge. Slide the dough onto one of the parchment squares, then slide the square onto the back of a baking sheet. Brush the entire round with 1/2 tablespoon oil. Spread the dough up to the border with half the tomato sauce. Dollop the pizza with half the pesto using a teaspoon. Sprinkle with 1/3 cup of the mozzarella and a pinch crushed red pepper. (Don't worry if it looks like too little cheese. It will melt and spread.) Slide the pizza and parchment from the baking sheet onto the hot pizza stone.\n            \n\n              Bake the pizza until the edges turn golden brown, 6 to 8 minutes, rotating halfway through cooking. Let cool for 2 minutes before slicing. Repeat with the remaining dough and toppings.\n            \n", "ingredients": [{"food": "", "quantity": 0.75}, {"food": "honey smoked ham", "quantity": 1.0}, {"food": "yeast extract spread", "quantity": 1.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "plum", "quantity": 14.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "ruby red grapefruit juice blend", "quantity": 1}, {"food": "", "quantity": 3.0}, {"food": "arugula", "quantity": 1.5}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "lowfat blueberry nutri-grain waffles", "quantity": 0.6666666666666666}, {"food": "ruby red grapefruit juice blend", "quantity": 1}], "title": "\nHealthy Whole-Wheat Pizza with Arugula Parsley Pesto\n"}, {"directions": "\n\n              Make the cupcakes: Preheat the oven to 350 degrees F. Line a 6-cup jumbo muffin pan with paper liners. Whisk the flour, baking powder and salt in a bowl. \n            \n\n              Beat the butter and granulated sugar in a large bowl with a mixer on medium-high speed until light and fluffy, about 3 minutes. Beat in the eggs, one at a time, then beat in the vanilla. Reduce the mixer speed to low; beat in the flour mixture in 3 batches, alternating with the strawberry milk, beginning and ending with flour, until just combined. \n            \n\n              Divide the batter evenly among the prepared muffin cups. Bake until a toothpick comes out clean, 25 to 30 minutes. Let cool 5 minutes in the pan, then remove to a rack to cool completely. \n            \n\n              Using a paring knife, cut a cone-shaped piece of cake out of the top of each cupcake (about the same size as the strawberries), stopping about 1/2 inch from the bottom. Stuff with the strawberries, then cover with a small piece of the removed cake. \n            \n\n              Make the frosting: Sift the confectioners' sugar and cocoa powder into a medium bowl. Transfer half of the sugar-cocoa mixture to a large bowl; add the butter and 1/4 cup cream and beat with a mixer on medium-high speed until smooth. Add the remaining sugar-cocoa mixture and 1/4 cup cream and beat until fluffy. Transfer to a pastry bag fitted with a star tip and pipe onto the cupcakes. Top each with a strawberry half. \n            \n\n              Photograph by Sam Kaplan\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 1.5}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 1.0}, {"food": "potato flour", "quantity": 1.5}, {"food": "sugar", "quantity": 0.75}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "milk", "quantity": 0.5}, {"food": "strawberries", "quantity": 6.0}, {"food": "sugar", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "butter oil", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "strawberries", "quantity": 3.0}], "title": "\nHeart of the Batter\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F with a rack set on the middle shelf. Place the hearts of palm onto several layers of paper towels to absorb any excess liquid. Season lightly with salt.\n            \n\n              Heat 2 tablespoons of the oil in a large high-sided skillet over medium to medium-high heat until it just starts to shimmer. Sear the hearts of palm until golden brown on both sides, 2 to 4 minutes total. You may need to do this in two batches to avoid crowding the skillet. Transfer to a baking sheet or large plate. Discard the used oil and wipe out the skillet.\n            \n\n              Add the remaining oil to the same skillet over medium-high heat. Add the onions and 1/2 teaspoon salt and cook until softened and lightly browned, stirring occasionally, 6 to 8 minutes. Add the garlic and cook until just softened, stirring constantly, about 1 minute. Stir in the crushed tomatoes, diced tomatoes, red pepper flakes, 1/2 teaspoon salt and fish sauce if using. Bring to a boil, and then reduce to a simmer. Simmer, uncovered, for 15 minutes.\n            \n\n              Season with additional salt if needed. Carefully pour the sauce into a 13- by 9-inch baking dish. Add the browned hearts of palm to the sauce in a single layer and sprinkle all over with the grated cheese. Bake until the cheese is lightly golden brown, about 10 minutes. Allow to sit at room temperature for 5 minutes before serving. Top with the basil.\n            \n\n              To serve, divide the warm polenta among 6 bowls and top with the hearts of palm and tomato sauce.\n            \n", "ingredients": [{"food": "hearts of palm", "quantity": 14.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "yellow rice", "quantity": 1.25}, {"food": "garlic powder", "quantity": 6.0}, {"food": "tomatoes", "quantity": 28.0}, {"food": "diced chicken", "quantity": 14.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1}, {"food": "Worcestershire sauce", "quantity": 1.5}, {"food": "", "quantity": 1.25}, {"food": "chrysanthemum leaves", "quantity": 1}, {"food": "", "quantity": 1.5}], "title": "\nHearts of Palm Parm\n"}, {"directions": "\n\nSalad:\n\n\n              Preheat the oven to 375 degrees F.\n            \n\n              Lay the bacon strips on a roasting rack and bake in the oven until crisp, about 20 minutes. (To make bacon curls: Wrap each slice of raw bacon around a metal skewer in a barber-pole fashion and lay the skewers on the roasting rack.) Pat dry with a paper towel. When cool enough to handle, break into pieces or in half, if using curls.\n            \n\n              Put the egg in a small saucepan with enough cold water to cover. Bring to a boil, cover, and remove from the heat. Set aside for 10 minutes. Drain the egg and roll it between your palm and the counter to crack the shell, then peel under cool running water. Rub the egg through a fine-mesh strainer and set aside.\n            \n\n              Remove the large outer leaves from the romaine hearts and rinse. Chop these leaves into bite-size pieces and spin dry. (Use an extremely sharp knife to minimize bruising the edges.) Halve the hearts through the cores to make 4 wedges. Rinse under cold running water and shake to air dry.\n            \n\n              Divide the wedges among 4 plates. Mound some of the chopped romaine on top and season with salt and pepper, to taste. Spoon about 1/4 cup of Blue Cheese Dressing over each salad and top with some of the sieved egg and bacon. Pass the remaining dressing at the table.\n            \n\nBlue Cheese Dressing:\n\n\n              Pulse the mayonnaise, blue cheese, buttermilk, shallot, lemon zest, Worcestershire sauce, salt, and celery seeds in a food processor to make a chunky but pourable sauce. Stir in the parsley and season with plenty of pepper. Use immediately or refrigerate in a tightly sealed container for up to 3 days.\n            \n", "ingredients": [{"food": "bacon", "quantity": 8.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "mayonnaise dressing", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.5}, {"food": "", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "celery seed", "quantity": 0.25}, {"food": "parsley", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nHearts of Romaine with Blue Cheese and Bacon\n"}, {"directions": "\n\n              Heat the olive oil in a medium Dutch oven over medium-high heat. Add the celery, carrots, garliconions and cook, stirring, until the vegetables are softened, 5 minutes. Add the broth and bring to a simmer. Cook, stirring occasionally, until the vegetables are tender, about 15 minutes. \n            \n\n              Meanwhile, grind the oats in a food processor until fine. Combine with the flour, baking powder, zest, 1/4 teaspoon salt and 1/4 teaspoon pepper in a medium bowl. Work in the butter with your fingers until only very small pieces remain. Stir in 1/2 cup ice water, a bit at a time, until a soft dough is formed. Let rest 10 minutes. \n            \n\n              Drop cherry-size bits of the dumpling dough into the soup. Add the green beans and stir gently. Cook, stirring occasionally, until the dumplings are floating and cooked through and the beans are bright green and crisp-tender, about 12 minutes. Add the chicken and continue to cook until it is just cooked through, about 3 minutes. Remove from the heat, stir in the dill and season with salt and pepper.\n            \n\n              Per Serving: Calories: 376; Total Fat; 10 grams; Saturated Fat: 3 grams; Protein: 37 grams; Total carbohydrates: 34 grams; Sugar: 4 grams Fiber: 5 grams; Cholesterol: 73 milligrams; Sodium: 360 milligrams\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "celery seed", "quantity": 2.0}, {"food": "carrot juice", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "oats", "quantity": 0.75}, {"food": "potato flour", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "lemon juice", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "butter oil", "quantity": 1.0}, {"food": "fava beans", "quantity": 2.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "dill seed", "quantity": 0.25}], "title": "\nHearty Chicken and Dumplings Lightened-Up\n"}]