[{"directions": "\n\n              Put a 9-inch springform pan in the freezer for 15 minutes. Meanwhile, let 1 container vanilla ice cream soften at room temperature.\n            \n\n              Remove the pan from the freezer. Spread a 1/2-inch-thick layer of softened vanilla ice cream on the bottom and up the sides of the pan. (If the ice cream gets too soft, return to the freezer.) Freeze until firm, about 45 minutes.\n            \n\n              Meanwhile, pulse the chocolate wafers in a food processor to break into large crumbs. Add the chocolate shell topping and pulse until the crumbs are moist, about 5 pulses; set aside.\n            \n\n              Let the chocolate ice cream soften at room temperature, about 15 minutes. Spread over the vanilla layer, firmly packing the ice cream into the pan. Spread the chocolate crumb mixture over the chocolate ice cream. Freeze until set, about 1 hour.\n            \n\n              Remove the remaining container vanilla ice cream from the freezer 15 minutes before assembling the final layer. Spread the ice cream over the crumb layer, packing it tightly, then smooth the top with an offset spatula. Freeze until firm, about 2 hours.\n            \n\n              To unmold, wipe the outside of the pan with a hot cloth, then run a hot knife around the inside; unlatch and remove the side. If the ice cream cake is too soft, refreeze 20 minutes.\n            \n\n              Spread 3 cups whipped cream over the top and sides of the cake. Freeze until set, about 20 minutes. Put the remaining 2 cups whipped cream in a pastry bag fitted with a star tip; pipe along the top and bottom edges of the cake and decorate with sprinkles. Return to the freezer; remove 15 minutes before serving and slice with a hot knife.\n            \n\n              Photograph by Steve Giralt\n            \n", "ingredients": [{"food": "ice cream swich", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "whipped cream substitute", "quantity": 5.0}, {"food": "", "quantity": 1}], "title": "\nIce Cream Crunch Cake\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Brush melted bittersweet chocolate on the inside of a foil cupcake liner and freeze 10 minutes. Add 2 more layers of melted chocolate, freezing after each. (You¿ll need 1 ounce of chocolate for each cup.) Peel off the liners and fill the cups with ice cream. Pipe whipped cream on top, decorate with sprinkles and return to the freezer.\n            \n\n              Photograph by Cory Dawson\n            \n", "ingredients": [], "title": "\nIce Cream Cupcakes\n"}, {"directions": "\n\n              Preheat the oven to 325 degrees F; coat a 9-inch-round springform pan with cooking spray. Prepare the cake mix as directed, adding the cocoa powder and food coloring to the batter. Transfer to the prepared pan and bake until done, about 45 minutes.\n            \n\n              Let the cake cool, then remove from the pan; level the domed top with a serrated knife. Use a 5-inch circle of parchment paper as a guide to cut a circle from the center of the cake (you won't need the small circle). Freeze the large cake ring.\n            \n\n              Cut a 6-by-30-inch strip of parchment paper. Clean the springform pan, then butter it and line the side with the parchment as shown; the paper will extend above the rim of the pan so you can build a tall cake.\n            \n\n              Let 1 pint sorbet soften slightly at room temperature. Spread in the prepared pan, then lay a piece of plastic wrap on top and use the bottom of a measuring cup to pack the sorbet into the pan in an even layer. Freeze until firm, at least 30 minutes.\n            \n\n              Let 1 pint vanilla ice cream soften; spread in the pan, cover with plastic wrap and press evenly with the measuring cup. Freeze until firm, then repeat to make 1 more layer each of sorbet and ice cream (4 layers total). Freeze until firm.\n            \n\n              Place the blue cake ring on top of the ice cream, pressing gently; return to the freezer while you prepare the next layer.\n            \n\n              Cut off the top 1 1/2 inches of the remaining sorbet carton; remove the carton and wrap the sorbet loosely in plastic wrap. Press into a 5-inch round, then place the flattened sorbet into the hole in the cake, smoothing as needed. Freeze until firm.\n            \n\n              Cut off the top 1 1/2 inches of the remaining ice cream carton (you won't need the bottom). Flatten as you did the sorbet; place on top of the raspberry layer. Repeat with the bottom section of sorbet. Freeze until firm.\n            \n\n              Beat the heavy cream and confectioners' sugar with a mixer until stiff peaks form. Remove the springform ring and parchment collar from the cake. Cover the cake with the whipped cream. Freeze until ready to serve.\n            \n\n              Photograph by Ralph Smith\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "shortening cake mix", "quantity": 1.0}, {"food": "onion powder", "quantity": 2.0}, {"food": "", "quantity": 28.0}, {"food": "", "quantity": 4.0}, {"food": "butter oil", "quantity": 1}, {"food": "silk raspberry soy yogurt", "quantity": 3.0}, {"food": "ice cream swich", "quantity": 2.5}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "sugar", "quantity": 0.25}], "title": "\nIce Cream Flag Cake\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: an ice cream maker\n\n              Combine the sugar and 1/3 cup water in a small saucepan. Cook over low heat, stirring, until the sugar dissolves, about 5 minutes. Let cool completely.\n            \n\n              Whisk together the tequila, lime juice, cooled sugar syrup, orange liqueur and 1 cup cold water in a medium bowl. Freeze until slushy in an ice cream maker according to the manufacturer's instructions, about 45 minutes (see Cook's Note). Transfer the frozen margaritas to a chilled pitcher. Store in the freezer until ready to serve. \n            \n\n              Fill a small plate with an even layer of salt. Moisten the rims of 4 chilled rocks or wine glasses and press into the salt to rim the edges. Divide the margaritas among the glasses. Serve with lime wedges.\n            \n", "ingredients": [{"food": "sugar", "quantity": 0.3333333333333333}, {"food": "", "quantity": 12.0}, {"food": "lime juice", "quantity": 1.0}, {"food": "", "quantity": 4.0}, {"food": "salt", "quantity": 1}], "title": "\nIce Cream Maker Margaritas\n"}, {"directions": "\n\n              1. Preheat the oven to 350 degrees F. Line 2 baking sheets with parchment paper.\n            \n\n              2. In a small bowl, whisk together the flour, cocoa powder, salt, and baking powder. In another bowl, beat the butter, shortening, and sugar together with an electric mixer until fluffy. Beat in the eggs and vanilla, beating until smooth. With a spoon, stir in the flour mixture, stirring just until you have a smooth dough.\n            \n\n              3. Using a 2 tablespoon cookie dough scoop, drop 6 mounds of dough on each baking sheet, leaving a couple inches between each cookie. Bake until the cookies are firm around the edges and soft in the middle, about 15 minutes. (For even baking, rotate the pans from top to bottom and back to front halfway through baking.) Using a spatula, transfer the cookies to a wire rack and cool completely.\n            \n\n              4. Meanwhile, turn the ice cream pints on their sides and use a serrated knife to slice through the containers, cutting each into 3 even rounds. Place the ice cream disks on a baking sheet and freeze until ready to assemble the sandwiches.\n            \n\n              5. To assemble, peel the cardboard from the ice cream disks and sandwich each disk between 2 cookies. Serve the sandwiches immediately, or wrap individually in plastic wrap and freeze up to 1 week.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 0.5}, {"food": "onion powder", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "butter oil", "quantity": 6.0}, {"food": "shortening confectionery", "quantity": 2.0}, {"food": "sugar", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 2.0}], "title": "\nIce Cream Sandwiches\n"}, {"directions": "\n\n              Whisk together the flour, baking soda and salt in a medium bowl.\n            \n\n              Combine the butter, peanut butter and brown sugar in another medium bowl. Beat with an electric mixer until light and fluffy, about 2 minutes. Add the flour mixture and blend until just combined. Shape the dough into a log: Place it onto a piece of plastic wrap about 18 inches long. Use your hands to pat the dough into a log about 7 inches long and 2 inches around. Roll the plastic wrap around the dough. Twist both ends of the wrap, like a candy, and tighten both sides until the dough log is compact and tightly wrapped (this might cause the dough to shrink down to a 6-inch log instead of a 7-inch log, but that is okay). Tuck the twisted ends under the dough and refrigerate until firm, at least 2 hours.\n            \n\n              When ready to bake the cookies, preheat the oven to 350 degrees F and arrange 2 racks in the middle of the oven. Line 2 baking sheets with parchment paper. Remove the plastic wrap from the dough and use a sharp knife to slice the dough into 1/8-inch-thick rounds. Place the rounds about 1 inch apart on the baking sheets, about 12 cookies per baking sheet. Press a halved peanut in to the center of each cookie. If the dough is still very cold, it might crack slightly around the peanut. Simply use your finger to lightly push the dough back together.\n            \n\n              Bake the cookies until the edges are very lightly browned, 10 to 12 minutes. Halfway through cooking, rotate the baking sheets front to back and top to bottom.\n            \n\n              Cool the cookies slightly on the baking sheets for 5 minutes, and then transfer to a cooling rack and cool completely.\n            \n\n              Sandwich the cooled cookies between large scoops of your favorite ice cream.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 0.125}, {"food": "butter oil", "quantity": 5.0}, {"food": "peanut butter ", "quantity": 0.3333333333333333}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "peanuts", "quantity": 12.0}, {"food": "ice cream swich", "quantity": 1.0}], "title": "\nIce Cream Sandwiches with Slice and Bake Peanut Butter Sandies\n"}, {"directions": "\n\n              Make the steaks: Using a serrated knife, slice the carton of ice cream crosswise into 4 rounds, dipping the knife in hot water as needed. Snip off the carton with kitchen shears.\n            \n\n              Tightly wrap each ice cream round in plastic wrap, then form into a steak shape with your hands (the warmth of your hands will soften the ice cream). Freeze until firm, about 30 minutes.\n            \n\n              Unwrap one ice cream steak and transfer to a piece of parchment or wax paper. Dip a metal skewer in hot water, then press into the ice cream to create parallel diagonal grill-mark lines.\n            \n\n              Make lines in the opposite direction to form a crosshatch pattern, dipping the skewer in hot water as needed. If the ice cream gets too soft, return to the freezer until firm.\n            \n\n              Fill the lines with the chocolate wafer crumbs. Transfer the steak to a baking sheet and freeze until firm, about 30 minutes. Repeat with the remaining ice cream steaks.\n            \n\n              Make the fries: Using a crinkle vegetable cutter or a chef's knife, trim the sides of the pound cakes, then cut each cake crosswise into 1/4-inch-thick slices.\n            \n\n              Cut each cake slice into strips. Divide between 2 parchment-lined rimmed baking sheets.\n            \n\n              Drizzle the melted butter over the pound cake fries and toss. Bake in a 350 degrees F oven until lightly toasted, about 8 minutes, tossing halfway through; let cool slightly.\n            \n\n              Arrange the steaks, the pound cake fries and strawberry jam on plates. (Each plate serves 2.)\n            \n\n              Photograph by Kat Teutsch\n            \n", "ingredients": [{"food": "ice cream swich", "quantity": 1.0}, {"food": "chocolate chip cookies", "quantity": 0.5}, {"food": "corn cakes", "quantity": 2.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "silk strawberry soy yogurt", "quantity": 0.5}], "title": "\nIce Cream Steak Frites\n"}, {"directions": "\n\n              Toast frozen waffles, then let cool. Sandwich scoops of ice cream between the waffles. Dust with confectioners' sugar, if desired.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nIce Cream Wafflewiches\n"}, {"directions": "\nSpecial equipment: Parchment paper\n\n              Position a rack in the top third of the oven and preheat to 375 degrees F. Line a baking sheet with parchment paper, then arrange the bacon slices in a single layer on top. Bake until the bacon is golden brown and crispy, 15 to 20 minutes, flipping once halfway through. Transfer the bacon to a paper-towel-lined plate to absorb any excess fat, cool and then cut each slice in half making 12 smaller strips.\n            \n\n              Meanwhile, from the top and 3 sides of the lettuce, slice 4 round \"cheeks\" 4 to 5 inches across to make 2 \"buns\".\n            \n\n              Whisk the yogurt, mayonnaise, chives, lemon juice and zest, and 1/4 teaspoon each salt and pepper together in a small bowl.\n            \n\n              Assemble the sandwiches: On a work surface, lay the lettuce \"buns\" cut side up and spread 1 tablespoon lemon-pepper sauce on each side. Lay six strips of bacon on each bottom bun and top with two slices of tomato. Season with a pinch of salt and pepper and sandwich with remaining lettuce buns.\n            \n\n              Copyright 2014 Television Food Network, G.P. All rights reserved.\n            \n", "ingredients": [{"food": "bacon", "quantity": 6.0}, {"food": "", "quantity": 1.0}, {"food": "silk banana-strawberry soy yogurt", "quantity": 2.0}, {"food": "mayonnaise dressing", "quantity": 1.0}, {"food": "chives", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "lemon juice", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "pasta with tomato sauce", "quantity": 1.0}], "title": "\nIceberg BLTs\n"}, {"directions": "\n\n              Remove the zest from 2 oranges in strips with a vegetable peeler and finely grate 1 teaspoon zest from the third orange; juice all 3 oranges. Combine the sugar and strips of zest in a skillet and cook over medium heat, undisturbed, until the sugar melts. Swirl the pan and continue cooking, swirling, until dark amber, about 4 minutes. Immediately stir in the orange juice and cook at a rapid simmer until reduced by half, about 15 minutes. Add 1/2 cup cream; simmer until incorporated, about 5 minutes. Remove from the heat; stir in the vanilla. Remove the strips of zest with a slotted spoon and set aside for topping. Let the caramel sauce cool to room temperature, about 45 minutes.\n            \n\n              Transfer about two-thirds of the cooled caramel sauce to a medium bowl. In a separate bowl, beat the remaining 2 1/2 cups cream with a mixer until very soft peaks form (do not overbeat). Stir the grated orange zest and 1 cup of the whipped cream into the bowl with the caramel sauce, then fold in the remaining whipped cream.\n            \n\n              Line an 8-inch springform pan with plastic wrap. Lay 6 cookies in the pan. Spread 1/2 cup caramel whipped cream on top, then drizzle with 2 teaspoons of the reserved caramel sauce. Repeat to make about 7 more layers of cookies, caramel whipped cream and caramel sauce, ending with a layer of caramel whipped cream.\n            \n\n              Cover the cake with plastic wrap; chill at least 6 hours or overnight. Uncover, invert onto a plate and remove the pan and plastic wrap. Top with the candied orange zest.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "oranges", "quantity": 3.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "ice cream swich", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 1.5}, {"food": "chocolate chip cookies", "quantity": 2.0}], "title": "\nIcebox Cake With Orange-Caramel Cream\n"}, {"directions": "\n\n              For the Icebox Cake:\n            \n\n              Whisk together all-purpose flour, baking soda and salt in a medium bowl. Reserve.\n            \n\n              Combine the butter, peanut butter and light brown sugar in another medium bowl. Beat with an electric mixer until light and fluffy, about 2 minutes. Add the flour mixture and blend until just combined. Shape the dough into a log: Place it onto a piece of plastic wrap about 18 inches long. Use your hands to pat the dough into a log about 7 inches long and 2 inches around. Roll the plastic wrap around the dough. Twist both ends of the wrap, like a candy, and tighten both sides until the dough log is compact and tightly wrapped (this might cause the dough to shrink down to a 6-inch log instead of a 7-inch log, but that is okay). Tuck the twisted ends under the dough and refrigerate until firm, at least 2 hours.\n            \n\n              When ready to bake the cookies, preheat the oven to 350 degrees F and arrange 2 racks in the middle of the oven. Line 2 baking sheets with parchment paper. Remove the plastic wrap from the dough and use a serrated knife to slice the dough into 1/8-inch thick rounds. Place the rounds about 1 inch apart on the baking sheets, about 12 cookies per baking sheet. Press a halved peanut in to the center of each cookie. If the dough is still very cold, it might crack slightly around the peanut. Simply use your finger to lightly push the dough back together.\n            \n\n              Bake the cookies until the edges are very lightly browned, 10-12 minutes. Halfway through cooking, rotate the baking sheets front to back and top to bottom.\n            \n\n              Cool the cookies slightly on the baking sheets for 5 minutes then transfer to a cooling rack and cool completely.\n            \n\n              Place the heavy cream and confectioner's sugar in to a large mixing bowl and use a hand mixer to whip until stiff peaks.\n            \n\n              Line a 1.5 quart loaf pan with plastic wrap. The plastic wrap should come up the sides of the loaf pan and have at least a 2-inch over-hang. On the bottom of the loaf pan, lay 5 cookies face-side-down in a single layer. The cookies should touch but not over-lap. Spread 1 cup of whipped cream evenly over the cookies. Continue this layering process 3 more times. Place the last 4 cookies on the whipped cream and top the cookies with any of the remaining whipped cream. Fold the plastic wrap over the top of the loaf pan so that the entire top layer is covered. Refrigerate overnight.\n            \n\n              For the Peanut Butter Glaze:\n            \n\n              Right before serving, whisk together the milk, confectioner's sugar, and peanut butter until smooth in a mixing bowl.\n            \n\n              To serve, flip the icebox cake out on to a platter and remove the plastic wrap. Drizzle the glaze all over the top of the icebox cake. Reserve extra peanut butter glaze to drizzle over individual slices. Serve immediately.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 0.125}, {"food": "butter oil", "quantity": 5.0}, {"food": "peanut butter ", "quantity": 0.3333333333333333}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "peanuts", "quantity": 12.0}, {"food": "ice cream swich", "quantity": 3.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "milk", "quantity": 5.0}, {"food": "sugar", "quantity": 0.25}, {"food": "peanut butter ", "quantity": 0.25}], "title": "\nIcebox Cake with Slice and Bake Peanut Butter Sandies\n"}, {"directions": "\n\n              Add the water to a large pot and bring it to a boil. Remove the pot from the heat, add the tea bags and let steep for 10 minutes.\n            \n\n              Remove the tea bags and stir in the remaining ingredients. Pour into a pitcher and chill until cold. Serve over ice.\n            \n", "ingredients": [{"food": "coconut water", "quantity": 6.0}, {"food": "silk chai", "quantity": 4.0}, {"food": "milk", "quantity": 0.75}, {"food": "ground turkey", "quantity": 0.75}, {"food": "ginger", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 0.5}], "title": "\nIced Chai\n"}, {"directions": "\n\n              Evenly space the oven racks in the oven and preheat to 375 degrees F. on the convection setting, if available. Line 2 baking sheets with parchment paper or silicone mats.\n            \n\n              Beat the butter in a medium bowl with an electric mixer on medium-high heat until smooth. Add the sugar and citrus zest and continue to beat until light and fluffy, about 2 minutes. (The creaming is important to get a great texture so don't skimp here.) Add the yolks, 1 at a time, beating well after each addition. Beat in the extracts.\n            \n\n              Whisk the flour, baking soda and salt together in a bowl. Stir the dry ingredients into the wet mixture, mixing at low speed to make a soft dough.\n            \n\n              Scoop the dough into rounded heaping tablespoons with a cookie scoop or measuring spoon. Space the cookies about 2-inches apart on the prepared pans. Freeze for at least 30 minutes. (The cookies can be frozen for up to 1 month.)\n            \n\n              Bake the cookies, straight from the freezer, until edges are firm and bottoms are lightly browned, 15 to 17 minutes. Transfer to a rack to cool.\n            \n\n              For icing: Mix the confectioners' sugar, colored sugar and appropriate flavored zest in a medium bowl. Add the citrus juice and mix with an electric mixer to make a firm but pourable icing. (If needed, add up to 1 teaspoon more juice, but keep in mind that if the icing is too loose it won't set.) Dip the rounded side of the cooled cookies into the icing; then let the excess icing fall back into the bowl. Dry cookies icing side up on a rack. Serve.\n            \n\n              Store in an airtight container for up to 4 days.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 0.75}, {"food": "sugar", "quantity": 1.25}, {"food": "barley flour or meal", "quantity": 1.0}, {"food": "egg substitute", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 0.75}, {"food": "vanilla extract", "quantity": 0.25}, {"food": "potato flour", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 0.25}, {"food": "sugar", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "hearts of palm", "quantity": 1.0}, {"food": "grape juice", "quantity": 2.0}], "title": "\nIced Citrus Crackle Cookie\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Bring the peppercorns, cardamom pods, star anise, cinnamon sticks, and 4 cups cold water to a boil in a medium saucepan over medium-high heat. Reduce the heat and simmer for 10 minutes. Turn off the heat, add the tea bags and let steep 5 minutes. Discard the tea bags, strain the tea mixture into a large measuring cup and discard the spices. Let the tea mixture cool at room temperature for at least 10 minutes, then chill completely in the refrigerator, about 1 hour.\n            \n\n              To serve, fill 4 tall glasses with ice. Divide the chilled tea mixture among them. Whisk the sweetened condensed milk and milk together in a small bowl or large measuring cup until smooth, then pour 1/4 cup into each glass. Stir and serve immediately.\n            \n", "ingredients": [{"food": "black bean mango", "quantity": 2.0}, {"food": "drumstick pods", "quantity": 6.0}, {"food": "anise seed", "quantity": 3.0}, {"food": "cinnamon", "quantity": 2.0}, {"food": "black bean mango", "quantity": 8.0}, {"food": "milk", "quantity": 0.75}, {"food": "milk", "quantity": 0.25}], "title": "\nIced Masala Chai\n"}, {"directions": "\n\n              Beat the butter and granulated sugar in a large bowl with a mixer on medium-high speed until light and fluffy, 3 to 5 minutes. Add the egg and vanilla and beat until incorporated. Reduce the mixer speed to low; add the flour mixture in 2 batches and beat until just incorporated. Divide the dough in half, wrap in plastic wrap and refrigerate until firm, at least 1 hour and up to 1 day.\n            \n\n              Line 2 baking sheets with parchment paper. Working with 1 piece of dough at a time, lightly dust the dough with flour and roll out between 2 pieces of parchment paper until about 1/8 inch thick. Refrigerate until slightly firm, about 15 minutes. Cut out shapes using 2-to-4-inch cookie cutters and transfer to the prepared baking sheets. Gather the scraps and refrigerate until firm; reroll once to cut out more cookies. Refrigerate the cutouts until firm, about 30 minutes.\n            \n\n              Position racks in the upper and lower thirds of the oven; preheat to 350 degrees F. Bake the cookies, switching the position of the pans halfway through, until just golden, 13 to 15 minutes. Let cool 5 minutes on the baking sheets, then transfer to racks to cool completely.\n            \n\n              Meanwhile, make the icing: Sift the confectioners' sugar and meringue powder into a large bowl. Beat in 6 tablespoons water with a mixer on medium speed until soft, glossy peaks form. Spread on the cookies and decorate with nonpareils. Let set, about 1 hour.\n            \n\n              Photograph by Johnny Miller\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.5}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 2.0}, {"food": "sugar", "quantity": 0.75}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "onion powder", "quantity": 2.0}, {"food": "", "quantity": 1}, {"food": "baking chocolate", "quantity": 1}], "title": "\nIced Sugar Cookies\n"}, {"directions": "\nSpecial equipment: a deep fat fry thermometer\n\n              Trim the excess fat and silver skin from the steak and cut into strips about 1/2-inch wide and 2- to 3- inches long.\n            \n\n              Whisk together the buttermilk, Worcestershire, 2 teaspoons salt and 1 teaspoon each pepper, granulated garlic, dry mustard and paprika in a large bowl. Add the steak strips to the buttermilk mixture, toss to coat, cover and refrigerate for 2 hours. \n            \n\n              Fill a large Dutch oven with about 3 inches of oil, attach a deep fat fry thermometer and heat to 350 degrees F. \n            \n\n              Whisk together the flour, 2 teaspoons salt and the remaining 1 teaspoon each pepper, granulated garlic, dry mustard and paprika in a shallow dish. \n            \n\n              Remove the marinating meat with a slotted spoon to a plate. Reserve the buttermilk mixture in the bowl. In batches, dredge the steak strips in the seasoned flour, then back into the buttermilk mixture, and back again into the seasoned flour until well coated. \n            \n\n              Dipped a few dredged steak strips in the hot oil. Fry, stirring occasionally, until golden brown and crispy, about 4 minutes. Remove with a clean slotted spoon onto a paper-towel-lined plate. \n            \n\n              Serve the steak fingers with BBQ or cocktail sauce and French fries if you'd like.\n            \n", "ingredients": [{"food": "frankfurter beef", "quantity": 1.5}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "garlic powder", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "sweet potatoes", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "potato flour", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 1}, {"food": "", "quantity": 1}], "title": "\nIdaho-Style Finger Steaks\n"}, {"directions": "\n\n              Pierce the potatoes all over with a fork. Place on a microwave-safe plate and microwave until tender, about 15 minutes. Let cool 10 minutes, then gently flatten the potatoes with your hand until about 3/4 inch thick. Slice each in half horizontally to make 2 slices of \"bread.\" Season the insides with salt and pepper.\n            \n\n              Meanwhile, bring a medium saucepan of salted water to a boil. Add the broccoli and cook until bright green and tender, about 2 minutes. Drain and run under cold water to stop the cooking, then transfer to a paper towel¿lined plate to dry.\n            \n\n              Cook the bacon in a large nonstick skillet over medium-high heat, turning, until crisp, about 7 minutes. Drain on a paper towel¿lined plate; break each slice in half. Make the chive sour cream: Blend the sour cream, chives, vinegar and 1/4 teaspoon salt in a food processor until pale green and smooth, about 1 minute. Transfer to a small bowl.\n            \n\n              Build the sandwiches: Layer the muenster, bacon, broccoli and jarlsberg on 4 potato halves, then top with the remaining potato halves. Heat the vegetable oil in a large nonstick skillet over medium-high heat. Add the potato sandwiches and place a heavy skillet on top. Cook until browned and crisp and the cheese is melted, 3 to 4 minutes per side. Season with salt and pepper. Cut in half and serve with the chive sour cream and hot sauce.\n            \n\n              Photograph by Jeff Harris\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "broccoli raab", "quantity": 2.0}, {"food": "bacon", "quantity": 6.0}, {"food": "sour cream", "quantity": 1.0}, {"food": "chives", "quantity": 0.5}, {"food": "vinegar", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "Worcestershire sauce", "quantity": 1}], "title": "\nIdahoagie\n"}, {"directions": "\n\n              Make the Igloo:\n            \n\n              Butter and flour an 8-inch-round cake pan and a 1.5-quart ovenproof bowl. Make the cake batter; divide between the pan and the bowl. Bake at 350 degrees F until a toothpick comes out clean, about 35 minutes for the pan, 40 to 45 minutes for the bowl. Let cool, then unmold the cakes onto a rack.\n            \n\n              Microwave the white chocolate at 50% power in 15-second intervals, stirring, until melted, about 2 minutes. Pour onto a parchment paper-lined baking sheet and spread to 1/4 inch thick with an offset spatula. Sprinkle with the sanding sugar. Chill until set, about 10 minutes.\n            \n\n              Remove the chocolate from the refrigerator. Break most of it into rough 1/2-to-1-inch pieces to form the ice that covers the igloo.\n            \n\n              Use a paring knife to cut a few even 1/2-inch tiles from the remaining chocolate (these are for the tunnel entrance).\n            \n\n              Assemble the igloo: Mix 2 1/2 cups frosting with the blue food coloring. Spread some blue frosting on the flat cake, then cover with the bowl-shaped cake.\n            \n\n              Spread some frosting on the cake where you want the tunnel to go, then attach a doughnut half, cut-side down. Attach the other half with frosting to extend the tunnel.\n            \n\n              Cover the entire cake with a thin layer of blue frosting (this is called a \"crumb coat,\" which is like a primer; it doesn't have to be perfect). Chill, uncovered, until the frosting sets, about 15 minutes.\n            \n\n              Spread the remaining blue frosting evenly over the cake and doughnuts. Arrange the white-chocolate pieces on the igloo in a mosaic pattern. Place the even white- chocolate tiles around the tunnel entrance.\n            \n\n              For the trees, mix 3/4 cup vanilla frosting with the green food coloring. Spread on the cones, flicking the frosting with the tip of an offset spatula to form branches. Arrange the trees around the igloo and dust with confectioners' sugar.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1}, {"food": "potato flour", "quantity": 1}, {"food": "shortening cake mix", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "rice cake", "quantity": 1.0}, {"food": "", "quantity": 4.0}, {"food": "ice cream cones", "quantity": 3.0}, {"food": "sugar", "quantity": 1}], "title": "\nIgloo Cake\n"}, {"directions": "\n\n              Heat the vegetable oil in a large skillet over medium-low heat. Add the onions and season with 3/4 teaspoon salt; cover and cook, stirring occasionally, until golden and soft, about 30 minutes. (Reduce the heat to low if the onions are browning too quickly.) Uncover, increase the heat to medium high and continue to cook, stirring often, until caramelized, about 8 more minutes. Add 1/2 cup water, scraping up any browned bits from the bottom of the pan. Simmer, stirring, until the water evaporates, about 2 minutes; transfer the onions to a bowl and set aside.\n            \n\n              Mix the mayonnaise, ketchup, relish and vinegar in a small bowl; set aside. Form the beef into 8 patties, about 4 inches wide and 1/2 inch thick.\n            \n\n              Heat a griddle or large skillet over medium heat; lightly brush with vegetable oil. Toast the buns cut-side down on the griddle. Spread each bun bottom with about 1 tablespoon of the mayonnaise mixture, then top with a few pickles, 1 or 2 tomato slices, some lettuce and another dollop of the mayonnaise mixture; set aside. (Keep the griddle hot.)\n            \n\n              Season both sides of the patties with salt and pepper. Working in batches, transfer the patties to the griddle and cook 3 minutes. Spread about 1 1/2teaspoons mustard on top of each patty, then flip and cover with 1 cheese slice; cook 2 more minutes for medium. Top 4 of the patties with the caramelized onions, then cover with the remaining patties cheese-side up. Transfer the double patties to the bun bottoms; cover with the bun tops.\n            \n\n              Photograph by Ralph Smith\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "onions", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "mayonnaise dressing", "quantity": 0.25}, {"food": "", "quantity": 2.0}, {"food": "pickle relish", "quantity": 1.0}, {"food": "vinegar", "quantity": 0.5}, {"food": "frankfurter beef", "quantity": 2.0}, {"food": "split pea soup", "quantity": 4.0}, {"food": "pickle loaf", "quantity": 0.25}, {"food": "pasta with tomato sauce", "quantity": 4.0}, {"food": "lettuce", "quantity": 0.75}, {"food": "pepper", "quantity": 1}, {"food": "mustard spinach", "quantity": 0.25}, {"food": "macaroni cheese", "quantity": 8.0}], "title": "\nIn-N-Out-Style Double Cheeseburgers\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Combine the cucumber, 1/4 teaspoon garam masala, 1/2 teaspoon salt and a few grinds of pepper in a medium bowl; toss to coat. Stir in the yogurt and set aside. Combine the chutney, chopped jalapeno, cilantro and lime juice in a separate bowl; stir to combine.\n            \n\n              Season the chicken on both sides with the remaining 1 3/4 teaspoons garam masala and a generous pinch each of salt and pepper. Heat a large skillet over medium-high heat, then add the olive oil. Add the chicken and cook until browned, 4 to 5 minutes. Flip and cook until browned on the other side, 2 to 3 more minutes. Reduce the heat to medium and add 1/4 cup water. Cover and cook until the chicken is cooked through, 10 to 12 minutes. Transfer the chicken to a cutting board and let rest 5 minutes.\n            \n\n              Meanwhile, warm the naan in the oven on a baking sheet. Slice the chicken and divide among the naan. Top with the chutney mixture, red onion, sliced jalapeno and more cilantro. Serve with the cucumber mixture.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "silk plain soy yogurt", "quantity": 0.3333333333333333}, {"food": "black bean mango", "quantity": 0.5}, {"food": "ruby red grapefruit juice blend", "quantity": 1.5}, {"food": "dessert topping", "quantity": 0.5}, {"food": "", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.5}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "garlic bread", "quantity": 4.0}, {"food": "onion powder", "quantity": 0.25}], "title": "\nIndian Chicken Tacos\n"}, {"directions": "\n\n              Combine the ginger, chile, onion, cumin and 1/4 teaspoon salt in a mini food processor and pulse to make a thick paste. (Or finely chop and mash with the flat side of a knife.) Mix the yogurt, lime juice, cilantro and a pinch of salt in a bowl. Cover and chill until ready to use. Heat the vegetable oil in a large skillet over medium-high heat. Add the ginger-chile paste and cook, stirring, until most of the liquid has evaporated and the mixture is slightly toasted, about 5 minutes. Stir in the chicken, carrots, 1/4 teaspoon salt and 1/2 cup water and continue to cook, stirring, until the sauce is thick and the chicken is heated through, about 2 more minutes. Season with salt. Spoon one-quarter of the chicken filling down the middle of each piece of bread. Drizzle with some of the yogurt sauce and roll up. Serve with chips. \n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "potato chips", "quantity": 1}, {"food": "ginger", "quantity": 1.0}, {"food": "pepper", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "cumin seed", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "silk plain soy yogurt", "quantity": 0.5}, {"food": "lime juice", "quantity": 2.0}, {"food": "", "quantity": 0.3333333333333333}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "carrots", "quantity": 2.0}, {"food": "garlic bread", "quantity": 4.0}], "title": "\nIndian Chicken Wrap\n"}, {"directions": "\n\n              Preheat the oven to 450 degrees F and line a baking sheet with foil. Set aside 2 tablespoons cilantro leaves for the rice. Puree the remaining cilantro leaves and stems, the serrano, garlic, 1/4 cup water, the lemon juice, 2 tablespoons coconut, 1/2 teaspoon salt and a few grinds of pepper in a blender until smooth, adding up to 2 tablespoons more water if needed.\n            \n\n              Toss the chicken thighs with half of the cilantro sauce on the prepared baking sheet; arrange skin-side up. Season generously with salt and pepper. Roast until the skin is crisp and the chicken is cooked through, about 25 minutes.\n            \n\n              Meanwhile, heat the vegetable oil in a medium saucepan over medium heat. Add the curry powder, turmeric and a few grinds of pepper; cook, stirring, until toasted, 30 seconds. Add the rice and cook, stirring, until well coated, 1 to 2 minutes. Add 1 1/2 cups water and 1/2 teaspoon salt. Reduce the heat to low. Cover and cook until the liquid is absorbed and the rice is tender, about 15 minutes. Remove from the heat and let stand, covered, 5 minutes.\n            \n\n              Fluff the rice with a fork. Stir in the cashews, the remaining 2 tablespoons coconut and the reserved 2 tablespoons cilantro. Serve with the chicken; top with the remaining cilantro sauce.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [{"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "seeds", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "coconut water", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 8.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "curry powder", "quantity": 0.5}, {"food": "turmeric", "quantity": 0.5}, {"food": "crisped rice bar", "quantity": 1.0}, {"food": "", "quantity": 0.25}], "title": "\nIndian Chicken with Cashew Rice\n"}, {"directions": "\n\n              Combine the flours and salt in a bowl. Make a well in the center, add 1/2 cup warm water and 1 tablespoon olive oil and mix to make a sticky dough. Turn out onto a lightly floured surface and knead until soft and pliable, about 5 minutes. Brush a bowl with olive oil and place the dough in it. Cover and let rest about 30 minutes.\n            \n\n              Divide the dough into 6 even balls. On a floured surface, roll each ball into an 8-to-9-inch round, then layer between parchment paper.\n            \n\n              Heat a large skillet over medium-high heat. One at a time, lightly brush each dough round with oil and place in the pan. Cook until bubbly on top and charred on the bottom, 1 to 2 minutes, then flip and cook 1 more minute. Remove from the skillet, brush with more oil and season with salt. To reheat, wrap the flatbreads in a damp paper towel and microwave 45 seconds.\n            \n\n              Photograph by Marcus Nilsson\n            \n", "ingredients": [{"food": "potato flour", "quantity": 0.75}, {"food": "potato flour", "quantity": 0.75}, {"food": "salt", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}], "title": "\nIndian Flatbreads\n"}, {"directions": "\n\n              Preheat the oven to 450 degrees F. Mix 1/4 cup yogurt, the garlic, 2 teaspoons curry powder, 1 teaspoon salt, a few grinds of black pepper and the cayenne in a large bowl. Add the chicken and toss to coat; set aside.\n            \n\n              Pierce the sweet potatoes all over with a fork. Bake on a baking sheet until tender, about 25 minutes. Meanwhile, pulse the cereal in a food processor until finely ground; season with salt, black pepper and the remaining 1/2 teaspoon curry powder. Transfer to a shallow baking dish.\n            \n\n              Heat 1/2 inch peanut oil in a large cast-iron skillet over medium-high heat until shimmering. Press the chicken into the cereal, turning to coat. Add half of the chicken to the hot oil and fry until golden brown, 3 to 5 minutes per side. Transfer to a wire rack set on a baking sheet. Repeat with the remaining chicken. Transfer to the oven and bake until cooked through, about 10 minutes.\n            \n\n              Mix the ketchup with the steak sauce and cilantro. Split open the sweet potatoes; top with the remaining 1/2 cup yogurt and season with salt and black pepper. Serve the chicken with the potatoes and ketchup; top with more cilantro.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "silk banana-strawberry soy yogurt", "quantity": 0.75}, {"food": "garlic powder", "quantity": 1.0}, {"food": "curry powder", "quantity": 2.5}, {"food": "black bean mango", "quantity": 1}, {"food": "pepper", "quantity": 0.25}, {"food": "diced chicken", "quantity": 8.0}, {"food": "sweet potatoes", "quantity": 4.0}, {"food": "crisped rice bar", "quantity": 5.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "", "quantity": 0.5}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "dessert topping", "quantity": 2.0}], "title": "\nIndian Fried Chicken\n"}, {"directions": "\n\n              Toss the shrimp with 1/2 teaspoon garam masala in a medium bowl; season with salt and pepper. Heat 1 tablespoon olive oil in a large pot or Dutch oven over high heat. Add the shrimp in a single layer and cook until the edges are golden, about 30 seconds per side. Remove to a plate with a slotted spoon; set aside.\n            \n\n              Add the remaining 1 tablespoon olive oil to the pot, then add the onion and garlic. Cook, stirring occasionally, until the onion is lightly browned, 3 minutes. Stir in the tomato paste, the remaining 1 1/2 teaspoons garam masala and the cilantro. Cook, stirring to coat, 30 seconds. Stir in 3 1/4 cups water and the potatoes. Cover, bring to a boil and cook 5 minutes, then uncover and add the cauliflower. Cook over medium-high heat, stirring occasionally, until the cauliflower is tender, about 10 minutes.\n            \n\n              Stir in the shrimp and peas; simmer 3 minutes. Season with salt and pepper. Top each serving with more cilantro. Serve with the naan.\n            \n", "ingredients": [{"food": "shrimp", "quantity": 1.0}, {"food": "", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "pasta with tomato sauce", "quantity": 3.0}, {"food": "dessert topping", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 2.0}, {"food": "cauliflower", "quantity": 1.0}, {"food": "pigeon peas", "quantity": 2.0}, {"food": "barley flour or meal", "quantity": 2.0}], "title": "\nIndian Shrimp with Cauliflower\n"}, {"directions": "\n\n              Place the mango, jalapeno, mayonnaise, lime zest and juice, cilantro and a pinch of salt in a blender. Blend until smooth. Transfer to a small mixing bowl and season with additional salt if needed. Cover with plastic wrap and refrigerate until ready to use.\n            \n\n              Fill a large Dutch oven halfway with oil and heat to 350 degrees F.\n            \n\n              While the oil heats up, cut the kielbasa sausage into 3 equal pieces, each about 6 inches long. Cut each piece in half lengthwise. Use a pair of kitchen shears to cut off the pointed end of each skewer. Carefully insert 1 skewer a little more than halfway through each sausage piece. If a piece of your kielbasa is curved, carefully straighten it out before inserting the skewer. Place on a large plate and reserve.\n            \n\n              Prepare the pancake batter according to the package directions, adding the cornstarch, cornmeal and garam masala. Pour enough of the pancake batter into a pint glass to fill about three-quarters of the way. Reserve the remaining batter to fill the glass as needed. Dip 2 sausage skewers into the batter, covering completely. Carefully place them in the oil and fry until the batter is cooked through and golden brown, about 3 minutes, flipping occasionally. Do not fry more than 2 sausages at a time because they will start to stick together. Transfer the fried \"corn dogs\" on to a paper-towel-lined plate to absorb any excess oil. Season liberally with salt. Dip and fry the remaining sausage skewers.\n            \n\n              Serve immediately with the mango dipping sauce.\n            \n", "ingredients": [{"food": "black bean mango", "quantity": 0.5}, {"food": "", "quantity": 0.5}, {"food": "mayonnaise dressing", "quantity": 0.25}, {"food": "grape juice", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1}, {"food": "sausage", "quantity": 14.0}, {"food": "cheesecake mix", "quantity": 2.0}, {"food": "cornstarch", "quantity": 0.25}, {"food": "cornmeal", "quantity": 0.3333333333333333}, {"food": "", "quantity": 2.0}, {"food": "", "quantity": 8.0}], "title": "\nIndian-Inspired Corn Dogs with Mango Dipping Sauce\n"}, {"directions": "\n\n              Preheat the oven to 325 degrees F. Coat each cup of a 12-cup muffin pan with baking spray. \n            \n\n              Whisk together the cornmeal, flour, salt and baking powder in a small bowl. Whisk together the creamed corn and egg yolks in a large bowl. Stir in the cornmeal mixture, scallions and chipotle. Whip the egg whites in another large bowl until stiff peaks form. Stir about one-third of the egg whites into the corn mixture to lighten it and then fold in the remaining egg whites until no steaks of white remain. \n            \n\n              Spoon the batter into the muffin cups (they will be very full) and bake until puffed and golden, 20 to 25 minutes. Cool the spoon breads for 5 minutes in the pans. Run a thin spatula around the edges of each to loosen and then remove the breads from the pans. Serve warm or at room temperature.\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 1}, {"food": "yellow rice", "quantity": 0.75}, {"food": "potato flour", "quantity": 0.5}, {"food": "eggs", "quantity": 3.0}, {"food": "salt", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "corn bran", "quantity": 14.0}, {"food": "whole milk", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}], "title": "\nIndividual Corn Spoon Breads\n"}, {"directions": "\n\n              Place an inverted baking sheet in the middle of the oven and another in the lower third; preheat to 500 degrees F. Heat 2 tablespoons olive oil in a large nonstick skillet over high heat. Add the mushrooms and season with 1/2 teaspoon salt and a few grinds of pepper. Cook, stirring occasionally, until the mushrooms are browned and tender, 8 to 10 minutes. Remove from the heat.\n            \n\n              Meanwhile, cut the pizza dough into 4 pieces; lightly rub each with olive oil. Place 2 pieces on a sheet of parchment paper and stretch each into a 6- to 8-inch round. Repeat with the remaining 2 pieces of dough. Sprinkle with the mozzarella, then top with the mushrooms and garlic. Transfer the pizzas (on the parchment) to a pizza peel or another inverted baking sheet, then slide onto the hot baking sheets. Bake until the crusts are golden and the cheese is bubbling, 12 to 15 minutes. Sprinkle with the parsley and parmesan.\n            \n\n              Combine the arugula, endive and radicchio in a medium bowl. Drizzle with the vinegar and remaining 1 tablespoon olive oil; season with salt and pepper and toss. Top the pizzas with the salad.\n            \n\n              Photograph by Bobbi Lin\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "mixed nuts", "quantity": 1.25}, {"food": "salt", "quantity": 1}, {"food": "pizza rolls", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 2.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "parsley", "quantity": 0.25}, {"food": "parmesan cheese", "quantity": 1}, {"food": "arugula", "quantity": 2.0}, {"food": "endive", "quantity": 1.0}, {"food": "radicchio", "quantity": 0.5}, {"food": "vinegar", "quantity": 2.0}], "title": "\nIndividual Mushroom Pizzas with Arugula\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F. Lightly coat eight 6-ounce ramekins with nonstick cooking spray and place on a rimmed baking sheet.\n            \n\n              Toss the peaches with the cornstarch and 2 tablespoons sugar in a large bowl. Let stand until juicy, about 10 minutes. Divide the peaches and juices among the ramekins.\n            \n\n              While the peaches sit, combine the flour, remaining 1/2 cup sugar, flax seed and salt. Cut in the butter, using a fork or pastry cutter, until the mixture forms medium-size crumbs. Stir in the buttermilk until well moistened and large clumps hold together.\n            \n\n              Sprinkle the topping evenly over the peaches. Bake until the fruit is bubbling and the topping is golden brown and crisp, 40 to 45 minutes. Serve warm or at room temperature with vanilla yogurt or frozen yogurt if desired.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "pineapple chunks", "quantity": 2.5}, {"food": "cornstarch", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "potato flour", "quantity": 0.75}, {"food": "watermelon seed krnls", "quantity": 2.0}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 3.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 2.0}, {"food": "frozen yogurt", "quantity": 1}], "title": "\nIndividual Peach Cobblers\n"}, {"directions": "\n\n              Make stuffing mix according to the package instructions, but use low-sodium chicken broth instead of water and add cubed chorizo or andouille sausage and a handful of chopped hearty herbs such as rosemary and thyme. Divide the mixture among individual ramekins or muffin tins and bake. If you're using a stovetop stuffing mix, prepare the stuffing, then spoon it into ramekins and heat in a 300 degree F oven for a few minutes, until crusty on top.\n            \n\n              Photograph by Anita Calero\n            \n", "ingredients": [], "title": "\nIndividual Sausage Stuffing\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 450 degrees F. Line 2 baking sheets with parchment paper. \n            \n\n              Divide the pizza dough into 4 pieces. Working with one piece of dough at a time, roll and stretch on a lightly floured surface into an 8- to 9-inch oval. Transfer to a prepared baking sheet and pull the end of the dough to one side into a tapered end to create a ghost shape. Repeat with the remaining dough, putting 2 ghosts on each baking sheet. Don't worry if they all look slightly different-- it will give the ghosts personality. \n            \n\n              Mix the oil and garlic together in a small bowl and evenly brush over the 4 ghosts; sprinkle with a total of 1/2 teaspoon salt and 1/4 teaspoon pepper. Bake until the crusts are golden and set, 10 to 12 minutes, rotating the pans top to bottom halfway through the baking time. \n            \n\n              Mix the ricotta, Parmesan and Italian seasoning together in a small bowl and spread over the ghosts, stopping about 1/2-inch from the edge. Sprinkle with the mozzarella and return to the oven until the ghosts are hot and the cheese has melted, about 5 minutes more. Place 2 olive slices on each ghost for the eyes. \n            \n\n              Transfer the ghosts to individual plates and serve.\n            \n", "ingredients": [{"food": "pizza rolls", "quantity": 1.0}, {"food": "potato flour", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "", "quantity": 0.3333333333333333}, {"food": "seasoning mix", "quantity": 0.5}, {"food": "", "quantity": 1.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1}], "title": "\nIndividual Spooky White Pizzas\n"}, {"directions": "\nSpecial equipment: four 8-ounce ramekins\n\n              Preheat the oven to 425 degrees F. \n            \n\n              Heat the oil in a medium skillet over medium-high heat. Add the garlic, carrots and onions and cook until tender and beginning to brown, 5 minutes. Add the turkey and thyme and continue to cook, breaking up with a spoon, until the turkey is cooked through and lightly browned. Stir in the ketchup and cook until lightly caramelized. Stir the broth and flour together in a small bowl until smooth and then pour into the skillet. Cook, until thickened, 2 minutes. Stir in the peas and season with 1/4 teaspoon salt. Remove from the heat and divide among four 8-ounce ramekins. \n            \n\n              Meanwhile, place the potatoes in a medium pot and cover with cold salted water. Bring to a boil and continue to cook until tender when pierced with a knife. Drain the potatoes and return to the pot over low heat. Add the milk, cheese and scallions and mash until smooth. Season with salt and pepper. \n            \n\n              Transfer the filled ramekins to a rimmed baking sheet and evenly top with the mashed potatoes. Lightly mist with nonstick cooking spray and bake until the potatoes are lightly browned and the turkey filling is bubbly around the edges, 15 minutes.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "ground turkey", "quantity": 8.0}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "", "quantity": 2.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "pigeon peas", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "sweet potatoes", "quantity": 1.0}, {"food": "milk", "quantity": 0.5}, {"food": "", "quantity": 0.3333333333333333}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 1}], "title": "\nIndividual Turkey Shepherd's Pie\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Heat the oil in a medium ovenproof skillet over medium-high heat. Add the garlic, carrots and onions; cook until tender and beginning to brown, about 5 minutes. Add the turkey and thyme, and continue to cook, breaking the turkey up with a spoon, until the turkey is cooked through and lightly browned. Stir in the ketchup and cook until lightly caramelized. Stir the broth and flour together in a small bowl until smooth, and then pour into the skillet. Cook until thickened, about 2 minutes. Stir in the peas and season with 1/4 teaspoon salt.\n            \n\n              Meanwhile, place the potatoes in a medium pot and cover with cold salted water. Bring to a boil, lower the heat and simmer until tender when pierced with a knife. Drain the potatoes and return to the pot over low heat. Stir the potatoes for a couple of minutes to dry them out. Add the milk, cheese and scallions, and mash until smooth. Season with salt and pepper.\n            \n\n              Swirl the mashed potatoes over the filling. Lightly mist with nonstick cooking spray and bake until the potatoes are lightly browned and the turkey filling is bubbly around the edges, 10 to 15 minutes.\n            \n\n              Per serving: Calories: 290; Total Fat: 12 grams; Saturated Fat: 4 grams; Protein: 19 grams; Total carbohydrates: 30 grams; Sugar: 7 grams; Fiber: 4 grams; Cholesterol: 50 milligrams; Sodium: 370 milligrams\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "ground turkey", "quantity": 8.0}, {"food": "thyme", "quantity": 0.5}, {"food": "", "quantity": 2.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "pigeon peas", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "sweet potatoes", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "", "quantity": 0.3333333333333333}, {"food": "", "quantity": 1.0}, {"food": "meat drippings ", "quantity": 1}, {"food": "", "quantity": 1}], "title": "\nIndividual Turkey Shepherd's Pie\n"}, {"directions": "\n\n              Combine the cinnamon, shallots, lemongrass, cilantro stems, garlic and ginger in a large bowl. Finely grate the zest of the limes into the bowl (reserve the limes separately) and stir in the coconut milk. Reserve 1 1/2 cups of the coconut mixture separately, then add the chicken wings to the bowl with the remainder and toss to coat. Cover the bowl with plastic wrap and refrigerate for at least 2 hours, or preferably overnight.\n            \n\n              Meanwhile, make the pickle: Combine the shallots, cucumber, carrot and 1 tablespoon salt in a medium bowl. Carefully pour 3 cups boiling water over the vegetables, then stir to mix evenly and let stand for 20 minutes. Drain the vegetables in a colander, pressing gently to remove excess liquid, then transfer to a bowl. Add the vinegar, sugar, chile and 1 teaspoon salt, stirring to dissolve the sugar and salt. Refrigerate until ready to use, at least 10 minutes and up to 1 hour.\n            \n\n              Bring 4 cups water to a boil in a large pot. Add the wings with their marinade, return to a boil, then reduce the heat to maintain a steady simmer. Cook, stirring occasionally, until a paring knife inserted in the middle of a wing comes out with no resistance, about 15 minutes. Using tongs, transfer the wings to a wire rack set over a rimmed baking sheet, season liberally with salt and let air-dry while you make the dipping sauce.\n            \n\n              For the dipping sauce: Place the reserved 1 1/2 cups aromatics and coconut milk in a medium sauce pan over medium heat; stir in 1 cup water and bring to a simmer. Cook, stirring occasionally, until reduced and thickened, about 20 minutes. Transfer the sauce to a blender, along with three-quarters of the cilantro leaves and the juice of the reserved limes; puree until smooth. Pour the coconut dipping sauce into a bowl, season with salt and pepper and let cool completely.\n            \n\n              Heat 2 inches of oil in a large, heavy-bottomed pot over medium heat until a deep-fry thermometer registers 425 degrees F. Working in 2 batches, fry the wings, turning occasionally, until golden brown and crisp, about 2 minutes per batch. Transfer the wings with a slotted spoon to a clean rack set over a baking sheet and season with more salt. (Make sure the oil returns to the proper temperature between batches.)\n            \n\n              Transfer the wings to a serving platter and sprinkle with cilantro. Serve immediately with coconut dipping sauce and cucumber and carrot pickles.\n            \n", "ingredients": [{"food": "cinnamon", "quantity": 1.0}, {"food": "shallots", "quantity": 4.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 8.0}, {"food": "limes", "quantity": 2.0}, {"food": "coconut milk", "quantity": 13.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "black bean mango", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "vinegar", "quantity": 0.25}, {"food": "sugar", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}], "title": "\nIndonesian Coconut Curry Chicken Wings\n"}, {"directions": "\n\n              Bring the salmon to room temperature 20 minutes before grilling. \n            \n\n              Preheat the oven to 450 degrees F. Set a large cast-iron grill pan over low heat and pre-heat for 1 minute. \n            \n\n              Meanwhile, brush the salmon lightly with the oil and season with salt and pepper. \n            \n\n              Raise the heat under the grill pan to medium-high. Place the salmon, skin-side up on the grill, at an angle across the ridges of the pan. Cook until the fish has distinctive grill marks, about 3 minutes. To make cross-hatched grill marks, use a spatula to re-position the fillets about 45 degrees (keep the skin-side up). Cook 2 minutes more. Turn the salmon over, and transfer the grill pan to the oven. Continue cooking the fish in the oven for 2 to 3 minutes for pink inside, 5 minutes for medium, and 7 minutes for well done. \n            \n\n              Remove the fish from the pan, and let rest for 2 minutes, to finish cooking. (If the skin comes loose during cooking, you may remove and discard it before serving, if desired.) Serve.\n            \n", "ingredients": [{"food": "vegetarian fillets", "quantity": 5.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nIndoor-Grilled Salmon\n"}, {"directions": "\n\n              Combine the teff flour and active dry yeast in a large bowl. Add 2 cups lukewarm water and whisk or, more traditionally, use your hand to mix everything together, making sure the mixture is absolutely smooth with no lumps. Cover with plastic wrap and let sit at room temperature until the mixture is bubbly and tastes sour like tangy yogurt, 36 to 48 hours. (It will start bubbling and rising in a matter of hours, but it can take anywhere from 36 to 48 hours to achieve a noticeable level of sourness, which is key to the flavor of the injera; see Cook's Note.) After about 36 hours, begin tasting the mixture; this will help you determine when it's just right and will help prevent it from souring too much.\n            \n\n              At this point, the batter will look separated and watery on top. If you shake the bowl a little, you should see some bubbles rising to the top. Add the self-rising flour and up to 1 cup of water a little at a time. Whisk or use your hand to thoroughly combine into a smooth, thin, pourable mixture with about the consistency of a slightly thicker crepe batter. Cover again and let sit for 1 hour.\n            \n\n              Heat a 10-inch nonstick skillet over medium heat for a few minutes. Have a lid for the skillet and a wire baking rack nearby. Whisk 1 teaspoon salt into the batter (it will bubble up). Pour 1/4 cup of the batter into the skillet, tilting and swirling to coat with a thin layer of batter. The batter should spread quickly and easily. (If it's too thick, whisk in a little more water.) Within a matter of seconds, you should start seeing small holes forming and the surface darkening as it cooks from the outside towards the center. When the injera is about 3/4 of the way cooked, cover the skillet and let steam for 1 minute. The injera is cooked when the edges are dry and lifting up from the pan. Carefully run a spatula underneath and transfer to the baking rack to cool completely. Repeat with the remaining batter.\n            \n\n              You can stack the injera only when they are completely cooled; otherwise, they will stick to each other. Wrap the stack of cooled injera with a dry, clean cloth or paper towels to keep them from drying out until ready to serve. Serve at room temperature, or microwave for 30 seconds to heat through.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.0}, {"food": "yeast extract spread", "quantity": 0.125}, {"food": "potato flour", "quantity": 1.0}, {"food": "salt", "quantity": 1}], "title": "\nInjera (Ethiopian Flatbread)\n"}, {"directions": "\n\n              Peel and cube 2 russet potatoes and 2 carrots; boil in salted water until tender, 8 minutes, adding 3/4 cup frozen peas during the last minute. Drain and cool. Toss with 2 chopped hard-boiled eggs, 1/4 cup mayonnaise, 1 tablespoon each olive oil, and white wine vinegar, 1 teaspoon Dijon mustard and salt and pepper.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [], "title": "\nInsalata Russa\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Mix the jam, thyme, and salt and pepper to taste in a bowl. Lay out a long piece of plastic wrap on a cutting board. Place the chicken on the plastic and brush half of the jam mixture evenly on top of each breast. Mound a quarter of the cheese on each piece of chicken, then wrap 2 slices of ham around each breast to cover the cheese. Place another piece of plastic over the chicken and gently pound with a mallet or heavy skillet until about 1/4 inch thick. Heat 2 tablespoons olive oil in a medium nonstick skillet over medium-high heat. Add the chicken and cook until golden and crisp, 3 to 4 minutes. Turn and cook on the other side until cooked through but still moist, 3 to 4 more minutes. Meanwhile, whisk the shallot, mustard, vinegar and the remaining jam mixture in a medium bowl. Slowly whisk in the remaining 3 tablespoons olive oil to make a smooth dressing. Place each piece of chicken on a plate and drizzle with dressing. Toss the greens with the remaining dressing; serve with the chicken. \n            \n\n              Photograph by Antonis Achilleos \n            \n", "ingredients": [{"food": "jam", "quantity": 3.0}, {"food": "thyme", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 4.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "ham", "quantity": 8.0}, {"food": "vegetable oil", "quantity": 5.0}, {"food": "", "quantity": 1.0}, {"food": "mustard spinach", "quantity": 0.5}, {"food": "vinegar", "quantity": 2.0}, {"food": "turnip greens", "quantity": 2.0}], "title": "\nInside-Out Chicken Cordon Bleu\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Whisk 1/4 cup flour, 5 tablespoons sugar, 2 tablespoons cocoa powder, 1 egg, 3 tablespoons milk, 3 tablespoons vegetable oil and a dash of vanilla extract and salt in a large mug until smooth. Microwave until puffed, about 2 minutes.\n            \n\n              Copyright (c)2011 Food Network Magazine, LLC. Published by Hyperion. Available wherever books are sold. All Rights Reserved. Photograph courtesy of Antonis Achilleos.\n            \n", "ingredients": [], "title": "\nInstant Chocolate Cake\n"}, {"directions": "\n\n              Fold a big scoop of confectioners' sugar and a splash of vanilla into 4 cups of freshly whipped cream. Spoon some orange marmalade into 4 wine glasses, top with whipped cream, cover and chill. Sprinkle with chocolate shavings before serving.\n            \n\n              Photograph by Tina Rupp\n            \n", "ingredients": [], "title": "\nInstant Parfait\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: an Instant Pot® multi-cooker\n\n              Combine paprika, mustard powder, cumin, 1 tablespoon brown sugar, 2 teaspoons salt and 1/2 teaspoon pepper in a small bowl. Rub the spice mixture all over the pork.\n            \n\n              Turn the Instant Pot® (see Cook's Note) to the high saute setting. Add the oil and once hot, add the pork and cook in two batches, turning, until browned on all sides, about 5 minutes. Switch the Instant Pot® to the warm setting, remove the pork and transfer to a plate. \n            \n\n              Whisk 3/4 cup water into the drippings in the Instant Pot®. Add the vinegar, tomato paste, the remaining 2 tablespoons brown sugar and 2 cups water and whisk to combine. Add the pork back. Follow the manufacturer's guide for locking the lid and preparing to cook. Set to pressure cook on high for 1 hour. \n            \n\n              After the pressure cook cycle is complete, follow the manufacturer's guide for quick release and wait until the quick release cycle is complete. Careful of any remaining steam, unlock and remove the lid and transfer the pork to a large bowl. \n            \n\n              Switch the Instant Pot® to the normal saute setting and simmer the juices until reduced by half, about 15 minutes. While the juices are reducing use a ladle to remove any fat that rises to the top. Season to taste with salt. \n            \n\n              Meanwhile, use 2 forks to shred the pork in to small chunks. \n            \n\n              Add 3 cups of the reduced cooking liquid to the chunked pork and season with salt and vinegar to taste. Serve in hamburger buns with barbecue sauce and coleslaw.\n            \n", "ingredients": [{"food": "sugar", "quantity": 3.0}, {"food": "hot pockets ham cheese stuffed swich", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "cumin seed", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "low fat big franks", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "vinegar", "quantity": 0.5}, {"food": "pasta with tomato sauce", "quantity": 3.0}, {"food": "potato flour", "quantity": 12.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "", "quantity": 4.0}], "title": "\nInstant Pot Barbecue Pulled Pork Sandwiches\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: an Instant Pot® multi-cooker and an immersion blender\n\n              Set the Instant Pot® (see Cook's Note) to normal saute. Add the oil and once shimmering, but not smoking, add the onion and cook, stirring, until translucent and soft, about 5 minutes.\n            \n\n              Add the garlic, chili powder, cumin and oregano and cook, stirring, until fragrant, about 1 minute. Add the beans, bay leaves and 7 cups water. Follow the manufacturer's guide for locking the lid and preparing to cook. Set to pressure cook on high for 1 hour.\n            \n\n              After the pressure cook cycle is complete, follow the manufacturer's guide for quick release and wait until the quick release cycle is complete. Careful of any remaining steam, unlock and remove the lid and remove the bay leaves. Then remove 1 cup of the beans with a slotted spoon and set aside. Use an immersion blender to blend the black beans with 1 tablespoon salt until thick and creamy. Stir in the reserved whole beans and season to taste with salt and pepper. Serve with sliced avocado, cilantro leaves, chopped scallions, lime wedges and sour cream.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 5.0}, {"food": "fava beans", "quantity": 2.5}, {"food": "chili powder", "quantity": 4.0}, {"food": "cumin seed", "quantity": 1.5}, {"food": "", "quantity": 1.5}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "sour cream", "quantity": 1}], "title": "\nInstant Pot Black Bean Soup\n"}, {"directions": "\nSpecial equipment: an Instant Pot® multi-cooker\n\n              Season the chicken legs generously with salt and pepper. Turn the Instant Pot® (see Cook's Note) to the high saute setting. Add the oil and once it's shimmering, but not smoking, add half the chicken pieces and brown on both sides, about 7 minutes. Remove with tongs to a plate and brown the remaining chicken pieces. Return all the chicken to the multi-cooker and add the soy sauce, sugar, vinegar, garlic, bay leaves, onion and 1/2 teaspoon pepper.\n            \n\n              Follow the manufacturer's guide for locking the lid and preparing to cook. Set to pressure cook, on high, for 8 minutes. After the pressure cook cycle is complete follow the manufacturer's guide for quick release and wait until the quick release cycle is complete. Careful of any remaining steam, unlock and remove the lid and turn the Instant Pot® back to the high saute setting. Let the sauce come to a boil and reduce it until dark brown and very fragrant, about 20 minutes. Remove the bay leaves. \n            \n\n              Transfer the chicken and sauce to a serving platter, sprinkle with scallions and serve with rice.\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 4.0}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "soy sauce", "quantity": 0.3333333333333333}, {"food": "sugar", "quantity": 0.25}, {"food": "vinegar", "quantity": 0.25}, {"food": "garlic powder", "quantity": 5.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "crisped rice bar", "quantity": 1}], "title": "\nInstant Pot Chicken Adobo\n"}, {"directions": "\n\n              Make the chicken: Season the chicken with the chili powder and a generous pinch each of salt and black pepper. Set an Instant Pot to saute at high heat. When the display indicates ?hot,? add the olive oil. Working in batches, add the chicken and cook, turning, until browned, about 3 minutes; transfer to a plate. Add the red onion and garlic to the pot and cook, stirring and scraping up any browned bits from the bottom of the pot with a wooden spoon, until the onion is tender, about 5 minutes. Cancel the saute setting.\n            \n\n              Return the chicken to the pot. Whisk the pineapple preserves, 2 tablespoons mustard, the cayenne and 1 cup water in a small bowl; pour over the chicken and stir to combine. Put on the lid, making sure the steam valve is in the sealing position, and set the cooker to high pressure for 6 minutes. When finished, carefully turn the steam valve to the venting position to release the pressure. Transfer the chicken to a plate and shred the meat into large chunks with 2 forks.\n            \n\n              Set the cooker to saute at high heat. Bring the sauce to a simmer and cook until reduced by about half, about 8 minutes. Return the chicken to the pot and stir to coat. Continue to cook, stirring occasionally, until almost all the sauce is absorbed, about 10 minutes. Stir in the remaining 2 teaspoons mustard and the vinegar; season with salt and black pepper.\n            \n\n              Meanwhile, make the slaw: Toss the coleslaw mix and bell pepper with 1/2 teaspoon salt and a few grinds of black pepper. Let stand 5 minutes. Add the coconut, scallion, cilantro, mayonnaise and vinegar and toss to coat. Season with salt and black pepper.\n            \n\n              Divide the chicken among the buns and top with some of the slaw. Serve with vegetable chips.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 1.5}, {"food": "chili powder", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "pineapple chunks", "quantity": 0.3333333333333333}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "vinegar", "quantity": 1.0}, {"food": "cinnamon buns", "quantity": 6.0}, {"food": "cheesecake mix", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "coconut water", "quantity": 0.6666666666666666}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "", "quantity": 0.25}, {"food": "mayonnaise dressing", "quantity": 0.3333333333333333}, {"food": "vinegar", "quantity": 2.0}, {"food": "potato chips", "quantity": 1}], "title": "\nInstant Pot Hawaiian Pulled Chicken Sandwiches\n"}, {"directions": "\n\n              Put the potatoes in the bottom of an Instant Pot. Add 1 cup water, 2 tablespoons butter, 1/2 teaspoon salt and a few grinds of pepper. Place the pot?s steam rack over the potatoes.\n            \n\n              Rub the top and sides of the salmon fillets with the paprika and lemon zest and season generously with salt and pepper. Place skin-side down on the rack. Put on the lid, making sure the steam valve is in the sealing position, and set the cooker to high pressure for 3 minutes. When finished, carefully turn the steam valve to the venting position to release the pressure.\n            \n\n              Remove the salmon and rack and set the cooker to saute at normal heat. When the potatoes start sizzling, add the garlic and cook, stirring, until softened, 1 to 2 minutes; stir in the remaining 2 tablespoons butter and season generously with salt and pepper. Smash the potatoes with a fork or wooden spoon until chunky.\n            \n\n              Turn off the cooker. Add the mixed greens to the potatoes and stir until wilted, 1 to 2 minutes. Season with salt and pepper. Divide the salmon and potato mixture among plates. Serve with lemon wedges.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 1.25}, {"food": "butter oil", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "salmon", "quantity": 4.0}, {"food": "paprika", "quantity": 0.25}, {"food": "lemon juice", "quantity": 0.5}, {"food": "garlic powder", "quantity": 4.0}, {"food": "mixed nuts", "quantity": 4.0}], "title": "\nInstant Pot Salmon with Garlic Potatoes and Greens\n"}, {"directions": "\n\n              Mix the chili powder, cumin, coriander, paprika and cinnamon in a small bowl. Put the beef in a medium bowl; add 4 teaspoons of the spice mixture, season generously with salt and pepper and toss until coated. Set aside.\n            \n\n              Set an Instant Pot to saute at normal heat. When the display indicates ?hot,? add the olive oil, then add the onion, poblano, garlic and a generous pinch of salt. Cook, stirring often, until tender and lightly browned, about 5 minutes. Stir in the remaining spice mixture and cook, stirring, until lightly toasted, about 1 more minute.\n            \n\n              Cancel the saute setting and stir in 3/4 cup water and the tomatoes, scraping up any browned bits from the bottom of the pot with a wooden spoon. Add the beef and nestle it in the liquid. Put on the lid, making sure the steam valve is in the sealing position, and set the cooker to high pressure for 30 minutes. Let stand 10 to 15 minutes, then carefully turn the steam valve to the venting position to release the remaining pressure.\n            \n\n              Turn off the cooker. Remove the lid and stir in the crushed corn chips, gently breaking up any large chunks of beef. Let cool a few minutes, then spoon off any excess fat from the top. Stir in the vinegar and cilantro; season with salt and pepper. Serve the stew over rice; top with cheese, scallions, cilantro and more corn chips.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "chili powder", "quantity": 1.0}, {"food": "cumin seed", "quantity": 2.0}, {"food": "ground turkey", "quantity": 1.0}, {"food": "smoked turkey roll", "quantity": 0.5}, {"food": "cinnamon", "quantity": 0.25}, {"food": "beef stew", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "corn bran", "quantity": 0.5}, {"food": "vinegar", "quantity": 1.0}, {"food": "dessert topping", "quantity": 0.5}, {"food": "crisped rice bar", "quantity": 1}, {"food": "cheddar cheese", "quantity": 1}], "title": "\nInstant Pot Tex-Mex Beef Stew\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Mash 4 tablespoons softened butter with 2 tablespoons each chopped parsley, scallions and chives. Spread the mixture on 4 slices white bread; top each with sliced Irish cheddar cheese and bread-and-butter pickles. Cover with 4 more bread slices. Spread plain butter on the outside of the sandwiches and fry in a skillet until golden on both sides. Spread the remaining herb butter on the warm sandwiches. Slice into quarters, then press the cut sides in more chopped herbs.\n            \n\n              Photograph by Stephanie Foley\n            \n", "ingredients": [], "title": "\nIrish Grilled Cheese\n"}, {"directions": "\n\n              Preheat the oven to 325 degrees.\n            \n\n              Rub the lamb roast all over with olive oil. Make 10 small slits all over the roast. Insert the bacon and garlic cloves into the slits. Season with salt and pepper. Place the roast in a roasting pan and add the stock and cover. Place in the oven and slow roast for 3 hours, or until very, very tender. Remove the lamb from the oven and cut into 2-inch pieces. Set aside.\n            \n\n              In a large pot, add the butter and melt. Stir in the flour and let cook for 3 minutes. Add the onion and saute until soft, about 5 minutes. Add the carrots and the celery and saute for another 10 minutes. Slowly whisk in the stock that the lamb was cooked in. Add the reserved lamb. Bring to a simmer. Season with salt and pepper.\n            \n\n              For the dumplings: In a large bowl, combine the flour, baking soda and salt and mix well. In a small bowl, beat the eggs. Add the milk to the eggs. Add the egg mixture to the dry ingredients and mix well. Stir in the goat cheese and the herbs. Season with freshly ground black pepper. Have the stock boiling in a small saucepan. Using 2 tablespoons, drop the dumpling batter into the boiling stock. Cook for about 5 minutes, or until the dumplings float to the surface. Remove the dumplings from the stock and place on a plate.\n            \n\n              To finish: Place the dumplings into the stew. Check for seasoning. Garnish with fresh marjoram.\n            \n", "ingredients": [{"food": "hearts of palm", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "garlic powder", "quantity": 10.0}, {"food": "bacon", "quantity": 0.25}, {"food": "", "quantity": 1}, {"food": "black bean mango", "quantity": 1}, {"food": "veal", "quantity": 4.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "potato flour", "quantity": 0.5}, {"food": "onion powder", "quantity": 1.0}, {"food": "diced chicken", "quantity": 0.5}, {"food": "diced chicken", "quantity": 0.5}, {"food": "marjoram", "quantity": 1}, {"food": "potato flour", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.5}, {"food": "salt", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "milk", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 0.25}, {"food": "hearts of palm", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "veal", "quantity": 3.0}], "title": "\nIrish Lamb Stew with Herbed Goat Cheese Dumplings\n"}, {"directions": "\n\n              Combine 2 cups leftover mashed potatoes, a heaping 1/3 cup flour, 2 tablespoons milk and 1 tablespoon chopped mixed herbs in a bowl; knead until smooth. Season with salt and pepper. Divide into 4 balls on a floured surface and flatten each into a 3-inch patty. Melt 1 1/2 tablespoons butter in a large skillet over medium-high heat; add the patties and cook until golden brown, 4 to 5 minutes per side, adding more butter to the pan as needed. Season with salt.\n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [], "title": "\nIrish Potato Cakes\n"}, {"directions": "\n\n              Position a rack in the middle of the oven and preheat to 400 degrees F. Lightly butter a baking sheet.\n            \n\n              Put the currants in a medium bowl and cover with hot water. Soak for 15 minutes and drain.\n            \n\n              In a large bowl, whisk together the flour, cake flour, sugar, baking soda, and salt. Add the butter and, using your hands, work it into flour mixture, until it is about the size of small peas. Stir in the currants.\n            \n\n              Add the buttermilk and stir with a spatula, just until the flour is moistened and comes together in a shaggy dough. Turn the dough out onto a floured work surface and knead lightly until just smooth, about 1 minute. Form the dough into a ball and place on the center of the prepared baking sheet.\n            \n\n              Using a sharp knife cut a 1/4-inch-deep \"X\" into the top of the dough to let the fairies out. Bake until well browned and the bottom sounds hollow when tapped lightly with your knuckles, about 1 hour.\n            \n\n              Transfer the bread to a rack and let cool completely before serving.\n            \n", "ingredients": [{"food": "currants", "quantity": 0.5}, {"food": "potato flour", "quantity": 3.5}, {"food": "potato flour", "quantity": 1.75}, {"food": "sugar", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 2.0}, {"food": "butter oil", "quantity": 0.25}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 1.5}], "title": "\nIrish Soda Bread\n"}, {"directions": "\n\n              Saute 1 chopped red onion in olive oil until softened. Add 1 cup Israeli couscous; cook, stirring, 4 minutes. Add 1 1/2 cups water and 1/2 teaspoon kosher salt; bring to a simmer. Cover and cook over low heat, 8 minutes. Toss with 8 ounces halved pitted cherries, 1/2 cup crumbled feta, 1/4 cup each chopped parsley and scallions and 2 tablespoons white wine vinegar. Season with salt and pepper.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nIsraeli Couscous with Cherries\n"}, {"directions": "\n\n              Cook 2 cups Israeli couscous as the label directs; drain. Saute 1 diced onion in olive oil with a pinch of cinnamon until golden, 5 minutes. Add 1 cup golden raisins and 2 tablespoons water and cook 2 minutes; toss with the couscous and a handful each of sliced almonds and chopped parsley. Season with salt and pepper.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nIsraeli Couscous with Raisins\n"}, {"directions": "\n\n              Toss 1 cup each diced cucumber, tomato, green bell pepper and scallions with 3 tablespoons chopped dill, 2 tablespoons chopped parsley, the juice of 1 lemon and 1/2 cup olive oil in a large bowl.\n            \n\n              Season with salt.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nIsraeli Tomato Salad\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Toss the bread with 1/4 cup olive oil and half of the garlic in a large bowl. Divide between 2 baking sheets and spread in a single layer. Bake until crisp and golden, 20 to 25 minutes. Let cool.\n            \n\n              Heat the remaining 1/4 cup olive oil in a large deep skillet over medium-high heat. Add the red onions, salami and soppressata and cook, stirring occasionally, until the onions are softened, about 6 minutes. Add the giardiniera, oregano and the remaining garlic and continue to cook, stirring occasionally, until the garlic starts browning, 2 to 3 minutes. Add the chicken broth and bring to a simmer.\n            \n\n              Combine the toasted bread and broth mixture in a large bowl and gently mix until all the bread is moistened. Stir in the beaten eggs, provolone and parsley.\n            \n\n              Brush a 3-quart baking dish with olive oil. Add the stuffing and dot with the butter. Cover with foil and bake 30 minutes. Uncover and continue to bake until golden brown, 20 to 30 more minutes.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "garlic bread", "quantity": 16.5}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "garlic powder", "quantity": 4.0}, {"food": "onions", "quantity": 2.0}, {"food": "sliced salami", "quantity": 2.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.5}, {"food": "vegetables", "quantity": 0.75}, {"food": "", "quantity": 1.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "eggs", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 4.5}, {"food": "parsley", "quantity": 0.5}, {"food": "butter oil", "quantity": 2.0}], "title": "\nItalian Antipasti Stuffing\n"}, {"directions": "\n\n              Preheat a grill to medium high. Heat the olive oil in a skillet over medium-high heat. Working in batches, add the salami in a single layer and cook, turning once, until crisp, about 1 minute per side. Drain on paper towels.\n            \n\n              Add the mushrooms to the skillet and cook, undisturbed, until browned, about 2 minutes. Stir and continue to cook until tender, about 5 more minutes. Season with salt and pepper.\n            \n\n              Form the beef into four 6-ounce patties, about 3/4 inch thick; press the center of each patty with your thumb to make a 1/2-inch-deep indentation. Season the patties on both sides with salt and pepper. Lightly brush the grill grates with vegetable oil, then grill the patties, indentation-side up, until marked on the bottom, about 5 minutes. Flip and cook until marked and slightly firm, about 3 more minutes for medium doneness. Remove the patties to a plate and let rest 5 minutes. Grill the rolls, cut-side down, until lightly toasted, about 1 minute.\n            \n\n              Toss the arugula, vinegar, and olive oil to taste in a bowl; season with salt and pepper. Spread the ricotta on the bun bottoms and top with the burger patties, salami, mushrooms and arugula salad. Cover with the bun tops.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "salami", "quantity": 8.0}, {"food": "mushrooms", "quantity": 8.0}, {"food": "salt", "quantity": 1}, {"food": "frankfurter beef", "quantity": 1.5}, {"food": "vegetable oil", "quantity": 1}, {"food": "pizza rolls", "quantity": 4.0}, {"food": "arugula", "quantity": 2.0}, {"food": "vinegar", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 0.5}], "title": "\nItalian Burgers\n"}, {"directions": "\nSpecial equipment: A candy thermometer\n\n              Place the egg whites and 1/3 cup of the sugar in the bowl of an electric mixer fitted with a whisk attachment. Beat on medium-high speed until the egg whites reach the soft peak stage.\n            \n\n              Meanwhile, pour the remaining sugar and 1/3 cup water in a medium saucepan set over medium heat. Attach a candy thermometer to the side of the pan and bring to the soft-ball stage, without stirring, 240 degrees F.\n            \n\n              The egg whites and syrup should be ready at about the same time. If one is ready before the other then you can remove the pan from the heat or stop whipping for a few minutes.\n            \n\n              Continue to whip the egg whites on medium-high speed and slowly drizzle in the hot syrup, aiming the syrup between the side of the bowl and the beaters. Continue to whip until both the bottom of the bowl and the mixture are cool, 10 to 15 minutes. The mixture should be thick and will form firm peaks at this point. Beat in the salt. At this point you have an Italian meringue.\n            \n\n              While still beating on medium-high, add the butter, a few pieces at a time. As the butter is added, the buttercream may appear to thin out some, but it will thicken into firm peaks once all of the butter is added. Beat in the vanilla extract. If the buttercream is still too loose, beat on high speed until thickened.\n            \n\n              Use right away or refrigerate in an airtight container overnight. The buttercream may need to be beaten slightly to smooth out before using.\n            \n", "ingredients": [{"food": "egg substitute", "quantity": 4.0}, {"food": "sugar", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 16.0}, {"food": "vanilla extract", "quantity": 1.0}], "title": "\nItalian Buttercream\n"}, {"directions": "\n\n              Mix the ground meats, ricotta, parsley, panko crumbs, onion, pecorino, bacon, garlic, milk, thyme, egg, salt, Worcestershire, and black pepper, to taste, in a large bowl. Mix until just combined; don't overmix. The mixture will be pretty soft.\n            \n\n              Using your hands, gently form mixture into 1 tablespoon small meatballs (about the size of ping pong balls). Put them on a large plate or pan; cover and refrigerate at least an hour or up to 24 hours.\n            \n\n              Heat the oil in a medium nonstick skillet over medium-high heat. Add about 1/3 the meatballs and cook, turning occasionally, until well browned on all sides, about 6 minutes. Transfer the meatballs to a plate and repeat with the remaining meatballs.\n            \n\n              Drain off the oil and wipe out the skillet. Return the meatballs to the skillet and pour in the marinara sauce. Bring to a boil, lower the heat, cover, and simmer until the meatballs are cooked through, about 15 minutes.\n            \n\n              Serve the meatballs, skewered on a platter with a dollop of the sauce and a fresh leaf of basil. They can be serve warm or at room temperature.\n            \n\n              The meatballs can be stored, covered, in the refrigerator for 3 days, or frozen for up to 6 weeks.\n            \n", "ingredients": [{"food": "pork skins", "quantity": 0.75}, {"food": "ground turkey", "quantity": 0.75}, {"food": "whole milk", "quantity": 4.5}, {"food": "chrysanthemum leaves", "quantity": 0.3333333333333333}, {"food": "bread crumbs", "quantity": 0.3333333333333333}, {"food": "onion powder", "quantity": 1.0}, {"food": "", "quantity": 3.0}, {"food": "bacon", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "milk", "quantity": 2.0}, {"food": "thyme", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "salt", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 2.5}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 1}], "title": "\nItalian Cocktail Meatballs with Herbs and Ricotta\n"}, {"directions": "\n\n              Put the 1/4 cup olive oil and the garlic slices in a large skillet and place over medium heat. When the garlic starts to turn a light golden brown, add the broccoli rabe, 3/4 teaspoon salt and a few grinds of pepper. Stir to coat evenly in the oil. Cover the skillet with a lid and turn the heat down to low. Cook until the broccoli rabe stems are just tender, 6 to 8 minutes. Uncover and turn the heat up to medium-high. Stir in the cherry pepper pickling liquid and cook until the pan is dry, an additional 3 to 4 minutes. Transfer to a bowl and let cool completely.\n            \n\n              Slice the semolina loaf horizontally and lay the two halves cut-side up. Pull out some of the bread from both halves (reserve for another use), leaving a 1/2--inch border. Drizzle both halves with some olive oil. Spread half of the broccoli rabe on the bottom half. Layer on the cherry peppers, provolone, prosciutto, salami, mortadella, the remaining broccoli rabe and the top half of bread. Wrap tightly in parchment, wax paper or plastic wrap andtie with twine if necessary. Place a brick (see Cook's Note) or cast-iron skillet on top for at least 3 hours to flatten, refrigerated. About 45 minutes before serving, bring the sandwich to room temperature.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.25}, {"food": "garlic powder", "quantity": 4.0}, {"food": "broccoli raab", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "hot pockets ham cheese stuffed swich", "quantity": 0.5}, {"food": "barbecue loaf", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.3333333333333333}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.25}, {"food": "sliced salami", "quantity": 0.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.25}], "title": "\nItalian Combo and Broccoli Rabe Pressed Hero\n"}, {"directions": "\n\n              Preheat the oven to 475 degrees F. Bring a large pot of water to a boil. \n            \n\n              Add the gnocchi to the boiling water and cook according to the package directions; drain, reserving 1/2 cup of the cooking liquid. \n            \n\n              Meanwhile, heat the oil in a large nonstick skillet over medium-high heat. Add the onions and 1/8 teaspoon salt and cook, stirring occasionally, until soft, about 5 minutes. Add the eggplant and cook, stirring occasionally, until the eggplant is very soft and the onions are golden brown, 10 to 12 minutes. Remove from the heat. \n            \n\n              Add the gnocchi, reserved cooking liquid, marinara sauce and red pepper flakes to the skillet with the eggplant mixture and stir to combine. \n            \n\n              Transfer the eggplant-gnocchi mixture to a 9-inch oval or square baking dish. Sprinkle with the provolone. Bake on the top oven rack until hot and bubbling and the cheese turns golden, about 15 minutes. Remove from the oven and let sit for 5 minutes. \n            \n\n              Garnish with the fresh basil sprigs if using and serve.\n            \n", "ingredients": [{"food": "frozen yogurt", "quantity": 12.0}, {"food": "vegetable oil", "quantity": 1.5}, {"food": "onion powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 1.25}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "", "quantity": 1.5}, {"food": "barley flour or meal", "quantity": 1}], "title": "\nItalian Eggplant Gnocchi Bake\n"}, {"directions": "\n\n              Slice 1 large eggplant lengthwise into thirds; soak in water 15 minutes. Drain and toss with olive oil and salt. Grill over medium-high heat until tender, about 8 minutes per side. Chop and toss with 1 large chopped tomato, 1 minced garlic clove, 2 tablespoons chopped basil and 1 teaspoon each chopped oregano and red wine vinegar; season with salt and pepper. Top with shaved parmesan.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [], "title": "\nItalian Eggplant Salad\n"}, {"directions": "\n\n              Combine 3/4 cup drained giardiniera (Italian pickled vegetables), 4 ounces chopped fresh mozzarella, 4 cups Italian blend salad greens, 1/2 cup torn basil and 2 tablespoons chopped parsley in a large bowl. Whisk 1 tablespoon each white wine vinegar and jarred giardiniera brine, then slowly whisk in 3 tablespoons olive oil; drizzle over the salad and toss. Season with salt and pepper.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [], "title": "\nItalian Giardiniera Salad\n"}, {"directions": "\nSpecial equipment: a 16-inch piping bag fitted with a large star tip\n\n              Sift together the flour, baking soda and salt in a bowl; set aside.\n            \n\n              In a stand mixer fitted with a paddle attachment, cream the butter and sugar until well combined, about 5 minutes. Add the eggs one at a time, mixing after each addition. Add the lemon juice and flour mixture and mix until the dough just comes together. \n            \n\n              Fill a 16-inch piping bag fitted with a large star tip with three-quarters of the dough. Pipe 3-inch-long strips 1 inch apart on parchment-lined baking sheets (or pipe into stars if you prefer).\n            \n\n              Roll the remaining dough into 1 1/2-inch balls. Put some sprinkles in a bowl and roll the balls in the sprinkles to coat. Place the balls 1 inch apart on another parchment-lined baking sheet. Chill the dough for 30 minutes.\n            \n\n              Preheat the oven to 350 degrees F. \n            \n\n              Bake until the cookie edges are just golden brown, about 11 minutes. Allow to cool completely before decorating and enjoying. \n            \n\n              To decorate: Spread raspberry jam on the underside of one of the long cookies and sandwich with another long cookie. Continue with the remaining long cookies and jam.\n            \n\n              Microwave the chocolate chips and coconut oil in a microwave-safe bowl in 20-second increments, stirring between each, until melted.\n            \n\n              Dip the sandwiched cookies first in the chocolate, then in the sprinkles. Set the cookies aside on parchment until the chocolate is set, about 5 minutes. The cookies will keep for a few weeks packed in an airtight container. \n            \n", "ingredients": [{"food": "potato flour", "quantity": 4.0}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 1.5}, {"food": "eggs", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.5}, {"food": "dessert topping", "quantity": 1}, {"food": "silk raspberry soy yogurt", "quantity": 12.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}], "title": "\nItalian Grandma Cookies\n"}, {"directions": "\n\n              Blend the fruit, sugar, honey and lemon juice with 2 cups ice in a food processor or blender until chunky. Add another 1 cup ice and blend until completely smooth.\n            \n\n              Pour the mixture into a shallow baking dish and freeze 30 minutes. Scrape the ice with a fork until slushy, then freeze until firm, about 2 more hours. Scoop into paper cups.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "pineapple chunks", "quantity": 3.0}, {"food": "sugar", "quantity": 2.0}, {"food": "honey smoked ham", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}], "title": "\nItalian Ice\n"}, {"directions": "\n\n              Whisk the olive oil, vinegar, garlic, rosemary, parsley, oregano, honey, red pepper flakes and 1/2 teaspoon each salt and pepper in a medium bowl. Transfer 3 tablespoons of the vinaigrette to a small bowl; cover and refrigerate until ready to serve.\n            \n\n              Combine the remaining vinaigrette with the steak in a large resealable bag; turn the bag several times to coat the meat. Refrigerate at least 4 hours or overnight, turning the bag occasionally.\n            \n\n              Preheat a grill to high. Transfer the steak to a plate or baking sheet, letting the excess marinade drip off; season the steak with salt and pepper. Let stand at room temperature, 30 minutes. Grill the steak until a thermometer inserted into the thickest side reaches 130 degrees F, 16 to 20 minutes for medium rare, flipping every 4 to 5 minutes. Transfer the meat to a cutting board and let rest 10 minutes. Thinly slice the meat against the grain; serve with the reserved vinaigrette.\n            \n\n              Photograph by Ryan Liebe\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.5}, {"food": "vinegar", "quantity": 0.25}, {"food": "garlic powder", "quantity": 2.0}, {"food": "rosemary", "quantity": 1.0}, {"food": "parsley", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "honey smoked ham", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 1.0}], "title": "\nItalian Marinated Sirloin Steak\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: a 24-cup miniature muffin tin\n\n              Combine the milk and 1/4 cup of the breadcrumbs in a large bowl and allow it to sit for 5 minutes. Add the garlic, egg, 1/2 cup of the Parmesan and 1 teaspoon salt. Use your hands to stir everything together until well combined. Add the ground beef and mix until just combined.\n            \n\n              Drop rounded tablespoons of the meat mixture into a 24-cup miniature muffin tin. Use your fingers to push the meat into the bottom and up the sides of each cup to form a small bowl shape. Press 1 cube of mozzarella into each bowl. Cover with plastic wrap and freeze until solid, about 2 hours. (This can be done a day in advance.)\n            \n\n              Position an oven rack in the upper third of the oven and preheat it to 450 degrees F. Set a cooling rack over a rimmed baking sheet and spray it generously with cooking spray. Put the remaining 1/4 cup breadcrumbs in a small bowl.\n            \n\n              Use a small offset spatula or butter knife to help nudge the frozen meat bowls out of the muffin tin. Roll the outside of each bowl in the breadcrumbs to coat completely and place on the prepared rack. Spoon 1 teaspoon of marinara sauce into each bowl. Combine the oregano, crushed red pepper and remaining 1/4 cup Parmesan in a small bowl and sprinkle some on each meat bowl.  \n            \n\n              Bake, rotating the baking sheet once halfway through, until the meat is just cooked through and the breadcrumbs are crispy, 15 to 20 minutes.\n            \n", "ingredients": [{"food": "whole milk", "quantity": 0.3333333333333333}, {"food": "", "quantity": 0.5}, {"food": "garlic powder", "quantity": 2.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "", "quantity": 0.75}, {"food": "salt", "quantity": 1}, {"food": "frankfurter beef", "quantity": 1.0}, {"food": "", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 6.0}, {"food": "Worcestershire sauce", "quantity": 0.5}, {"food": "", "quantity": 0.5}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}], "title": "\nItalian Meat Bowls\n"}, {"directions": "\n\n              Split the bread in half lengthwise. Top the bottom half with the mortadella, capicola, salami, prosciutto and provolone. Toss the giardiniera in a bowl with the olives, peppers and olive oil. Tear out the soft center of the top bread half to make a shell. Pack the lettuce into the center of the bread and top with the giardiniera mixture. Carefully put the two sandwich halves together, pressing to keep the filling inside. Secure with small skewers and cut into pieces. \n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "barbecue loaf", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.25}, {"food": "sliced salami", "quantity": 0.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.25}, {"food": "macaroni cheese", "quantity": 0.25}, {"food": "vegetables", "quantity": 2.3333333333333335}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "peppers", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "lettuce", "quantity": 2.0}], "title": "\nItalian Party Sub\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Make the ganache: Place the chocolate in a medium bowl. Bring the cream and 1/2 teaspoon salt to a boil in a small saucepan, then pour over the chocolate. Shake the bowl so the chocolate is fully submerged in the cream, then let stand 1 minute. Using a small rubber spatula, slowly stir the chocolate and cream in the center of the bowl until it forms a shiny, smooth ganache. Cover the ganache with plastic wrap and let stand in a cool place in your kitchen until it is thick like pudding, but still pourable and spreadable, up to 2 hours. (See Cook's Note about timing.)\n            \n\n              Preheat the oven to 350 degrees F. Cut three 8-inch circles out of parchment paper. Using 2 tablespoons butter, grease and flour three 8-inch round cake pans and line each pan with a round of parchment paper.\n            \n\n              Whisk the flour, baking powder and the remaining 1/2 teaspoon salt in a medium bowl until evenly combined. Combine the sugar and remaining 14 tablespoons butter in the bowl of a mixer and beat on medium-high speed until pale and fluffy, about 3 minutes. Add the almond filling, lemon juice and almond and vanilla extracts and beat until smooth. Add the eggs one at a time, beating well after each addition. Add the flour mixture, then stir with a rubber spatula until the batter is combined.\n            \n\n              Divide the batter equally among 3 bowls. Add the green, yellow and red food colorings to the batter in their separate bowls, then stir the colorings. Scrape each batter into a prepared cake pan and smooth the top with a small offset spatula or rubber spatula. Bake until the cakes are lightly browned and a toothpick inserted in the middle of each cake comes out clean, 20 minutes. \n            \n\n              Transfer the cake pans to a wire rack and let cool 15 minutes. Invert the cakes onto the rack, remove the cake pans and discard the parchment paper rounds. Let the cakes cool completely, about 30 minutes. Flip the cakes right-side up and trim the top of each cake with a serrated knife so that it is flat, if necessary.\n            \n\n              Place the green cake on a cake stand and spread 1/4 cup jam evenly over the top. Place the yellow cake over the green and spread the remaining 1/4 cup jam evenly over the top. Place the pink layer on top, then loosely wrap the cake in plastic wrap and refrigerate for 30 minutes.\n            \n\n              Unwrap the cake and scrape the ganache on top (the ganache will be the consistency of thick pudding). Using an offset spatula, spread the ganache evenly over the side and top of the cake, leaving a slightly thicker layer on top. Once the ganache is smooth all around, drag the tines of a fork in a wavy pattern across the top of the entire cake. Refrigerate the cake to set the ganache, about 30 minutes. Allow the cake to come to room temperature before serving.\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 8.0}, {"food": "ice cream swich", "quantity": 0.6666666666666666}, {"food": "salt", "quantity": 1.0}, {"food": "butter oil", "quantity": 16.0}, {"food": "potato flour", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 1.5}, {"food": "sugar", "quantity": 0.75}, {"food": "rice cake", "quantity": 12.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "eggs", "quantity": 3.0}, {"food": "", "quantity": 0.5}, {"food": "yellow rice", "quantity": 0.5}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "apricot nectar", "quantity": 0.5}], "title": "\nItalian Rainbow Cookie Cake\n"}, {"directions": "\nSpecial equipment: 24 decorative toothpicks\n\n              Position a rack in the top of the oven, and preheat to 375 degrees F. Line a rimmed baking sheet with parchment.\n            \n\n              Beat the sausage, mozzarella, flour and oil in the bowl of an electric stand mixer fitted with a paddle attachment until the mixture just comes together. Shape the mixture into balls, using a level tablespoon for each, and set them on the prepared baking sheet at least 1 inch apart (you should have about 24).\n            \n\n              Bake the sausage balls until lightly golden brown and slightly puffed, 12 to 15 minutes, turning them halfway through.\n            \n\n              To serve, skewer a basil leaf (if the leaves are large, fold them in half), a pepper slice and a sausage ball onto a toothpick. Repeat with the remaining toothpicks and ingredients.\n            \n", "ingredients": [{"food": "pork sausage links", "quantity": 0.5}, {"food": "", "quantity": 1.0}, {"food": "potato flour", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 24.0}, {"food": "luncheon slices", "quantity": 12.0}], "title": "\nItalian Sausage Balls\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Remove the stems from 24 large cremini mushrooms (finely chop the stems for the filling).\n            \n\n              Wipe the caps clean with a damp paper towel, then toss with 2 tablespoons olive oil and season with salt . Arrange on a baking sheet.\n            \n\n              Cook 4 ounces sweet Italian sausage (casing removed) in a skillet with olive oil over medium heat, breaking up the meat, until no longer pink, 3 minutes. Add 1/2 finely chopped fennel bulb and the chopped mushroom stems and cook until tender, 3 minutes. Add 2 chopped garlic cloves, season with red pepper flakes and cook 1 minute. Let cool, then mix with 1 cup breadcrumbs, 1/2 cup shredded fontina and 2 tablespoons each grated parmesan, chopped parsley and chopped green olives. Divide among the mushroom caps.\n            \n\n              Bake until the mushrooms are tender and the filling is golden, 15 to 17 minutes. Let cool 5 minutes, then remove from the baking sheet.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [], "title": "\nItalian Sausage Stuffed Mushrooms\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F and butter a shallow 3-quart baking dish. Melt 6 tablespoons butter in a large nonstick skillet over medium-high heat. Add the sausage and cook, stirring and breaking up the meat with a wooden spoon, until lightly browned and no longer pink, about 6 minutes.\n            \n\n              Add the celery and onions and cook, stirring occasionally, until softened, about 5 minutes. Stir in the sage. Add the broth, 1 teaspoon salt and a few grinds of pepper; bring to a simmer, then remove from the heat.\n            \n\n              Whisk the eggs in a large bowl. Add the parsley, bread cubes and sausage-broth mixture and stir until combined. Transfer the stuffing to the prepared baking dish. Cut the remaining 2 tablespoons butter into small cubes and scatter evenly over the stuffing. Cover with foil and bake 30 minutes, then uncover and bake until golden, 20 to 30 more minutes.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 1.0}, {"food": "celery seed", "quantity": 4.0}, {"food": "onions", "quantity": 2.0}, {"food": "sage", "quantity": 2.0}, {"food": "diced chicken", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "eggs", "quantity": 2.0}, {"food": "parsley", "quantity": 0.5}, {"food": "garlic bread", "quantity": 16.5}], "title": "\nItalian Sausage Stuffing\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F. Line 1 baking sheet with foil and another with parchment.\n            \n\n              Toss the sausages with 1 tablespoon of the oil on the foil-lined baking sheet, and bake, flipping the sausages halfway through, until lightly browned and fully cooked, about 30 minutes. Let cool.\n            \n\n              Lower the oven temperature to 350 degrees F. Toss together the provolone and mozzarella in a medium bowl. Make a slit down the length of each sausage, cutting about halfway through, and fill each with 1 teaspoon pesto, 2 pepper strips and 1 scant tablespoon of the cheese mixture; reserve any remaining cheese mixture.\n            \n\n              Open the tube of dough, find the seam and carefully unroll the dough on a lightly floured surface. Cut 6 strips 1 1/4 inches by 12 inches. Wrap 1 strip around a stuffed sausage link, coiling the strip from 1 end of the link to the other, leaving a 1/4-inch space between dough turns and leaving the ends of the sausage slightly exposed. Repeat with the remaining dough strips and sausages, setting the finished rolls at least 1 inch apart on the parchment-lined baking sheet.\n            \n\n              Brush the rolls with the remaining tablespoon of oil. Sprinkle the tops with the reserved cheese mixture. Bake until golden brown, 20 to 25 minutes. Let cool for a few minutes before cutting each roll into 4 pieces with a serrated knife. Serve warm with warm marinara sauce on the side.\n            \n", "ingredients": [{"food": "pork sausage links", "quantity": 6.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "", "quantity": 5.0}, {"food": "", "quantity": 5.0}, {"food": "pesto pasta primavera", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "garlic bread", "quantity": 11.0}, {"food": "potato flour", "quantity": 1}, {"food": "Worcestershire sauce", "quantity": 1}], "title": "\nItalian Sausage-and-Pepper Pigs in Blankets\n"}, {"directions": "\n\n              Heat 2 tablespoons olive oil in a large skillet over medium-high heat. Add the onion and cook until slightly softened, about 3 minutes. Add the garlic and cook until soft, about 3 more minutes. Season with salt and pepper, transfer to a large bowl and set aside. Lightly pound the steak between 2 sheets of plastic wrap until about 1/8 inch thick. Heat the remaining 2 tablespoons olive oil in the same skillet over medium-high heat. Add the meat in batches and cook until browned, about 30 seconds per side; season with salt and pepper. Transfer the meat to the bowl with the onion and garlic. Add the parsley and giardiniera brine and toss to coat. Drizzle the cut sides of the rolls with olive oil. Pile the steak and onion mixture on the roll bottoms and top with the giardiniera and provolone. Cover with the roll tops. Serve with hot sauce, if desired.\n            \n\n               Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 4.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 1.25}, {"food": "parsley", "quantity": 0.5}, {"food": "vegetables", "quantity": 1.5}, {"food": "pizza rolls", "quantity": 4.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "Worcestershire sauce", "quantity": 1}], "title": "\nItalian Steak Sandwiches\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F and line a small baking dish with foil. Scoop out the seeds from the zucchini, leaving a 1/4-inch-thick shell.\n            \n\n              Combine the ricotta, 1/4 cup Italian cheese blend, the parsley, capicola and lemon zest and juice in a medium bowl. Season the zucchini with salt and pepper, then fill with the ricotta mixture.\n            \n\n              Drizzle each zucchini half with about 1 tablespoon marinara sauce, then sprinkle with the remaining 1/4 cup Italian cheese blend. Transfer to the baking dish and bake until the cheese is melted and bubbling, about 20 minutes.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [{"food": "", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 0.75}, {"food": "macaroni cheese", "quantity": 0.5}, {"food": "parsley", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "Worcestershire sauce", "quantity": 0.25}], "title": "\nItalian Stuffed Zucchini\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Toss the bread cubes and 1 tablespoon olive oil in a bowl. Spread on a rimmed baking sheet and bake, tossing occasionally, until crisp, 8 to 10 minutes. Let cool. \n            \n\n              Meanwhile, toss the giardiniera in a large bowl with the basil, olives, peppers, romaine, mortadella, prosciutto, capicola, salami, provolone and the remaining 1 tablespoon olive oil. Drizzle with the giardiniera brine and toss. Let sit about 20 minutes to let the flavors combine. \n            \n\n              Add the croutons to the salad and toss. Divide among bowls. \n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "garlic bread", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "vegetables", "quantity": 2.3333333333333335}, {"food": "chrysanthemum leaves", "quantity": 0.75}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}, {"food": "peppers", "quantity": 0.5}, {"food": "lettuce", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "sliced salami", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}], "title": "\nItalian Sub Salad\n"}, {"directions": "\n\n              Soak the onion slices in a large bowl of cold water, 15 minutes.\n            \n\n              Meanwhile, split the bread lengthwise, then pull out some of the bread from the inside. Drizzle 2 tablespoons each vinegar and olive oil on the bottom half. Season with salt and pepper.\n            \n\n              Layer the cheese and meat on the bottom half of the bread. Drain the onion and pat dry. Top the meat with the onion, lettuce, pepperoncini (if using) and tomatoes. Drizzle with 2 tablespoons each vinegar and olive oil and sprinkle with the oregano. Season generously with salt and pepper.\n            \n\n              Drizzle the cut side of the bread top with the remaining 1 tablespoon each vinegar and olive oil, then place on top of the sandwich. Cut into 4 pieces.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "onion powder", "quantity": 0.5}, {"food": "barbecue loaf", "quantity": 1.0}, {"food": "vinegar", "quantity": 5.0}, {"food": "vegetable oil", "quantity": 5.0}, {"food": "salt", "quantity": 1}, {"food": "macaroni cheese", "quantity": 0.25}, {"food": "salami", "quantity": 0.25}, {"food": "ham", "quantity": 0.25}, {"food": "mortadella", "quantity": 0.25}, {"food": "", "quantity": 0.25}, {"food": "lettuce", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.75}, {"food": "plum", "quantity": 3.0}, {"food": "", "quantity": 1.5}], "title": "\nItalian Subs\n"}, {"directions": "\n\n              Cover the sun-dried tomatoes with hot water in a bowl. Set aside until soft, about 20 minutes, then drain, chop, and put in a medium bowl. To mellow the minced onion, soak it in cold water for 10 minutes, then drain it well, pat dry and add to the tomatoes. \n            \n\n              Add the tuna, breaking it into large chunks, along with the celery, olives, and capers, and toss to combine. Add the olive oil, lemon zest and juice, and basil and toss again. Season, to taste, with salt and pepper. Serve cold, with bread or greens, if desired. \n            \n", "ingredients": [{"food": "tomatoes", "quantity": 4.0}, {"food": "onion powder", "quantity": 0.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "celery seed", "quantity": 1.0}, {"food": "olives", "quantity": 0.25}, {"food": "capers", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "lemon juice", "quantity": 0.5}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "turnip greens", "quantity": 1}], "title": "\nItalian Tuna Salad\n"}, {"directions": "\n\n              Mix the mayonnaise with the garlic in a small bowl and set aside. Using your hands, mix together the turkey and turkey sausage in a large bowl until just combined. Form this mixture into four 1-inch-thick patties. \n            \n\n              Preheat a large skillet over medium heat. Add the olive oil and pancetta slices and cook the pancetta on both sides until crisp, about 3 minutes. Drain on paper towels and reserve. \n            \n\n              Place the same skillet over medium-high heat and add the burgers. Cook, turning once, until cooked all the way through, about 5 minutes per side. Top with the fontina and cook until just melted. \n            \n\n              To serve, place the burgers on the focaccia bottoms. Top with tomato slices, pancetta and arugula. Spread the focaccia tops with garlic mayonnaise, set on top of the burgers and serve.\n            \n", "ingredients": [{"food": "mayonnaise dressing", "quantity": 3.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "ground turkey", "quantity": 8.0}, {"food": "pork turkey sausage", "quantity": 12.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "luncheon slices", "quantity": 8.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "split pea soup", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "arugula", "quantity": 1.0}], "title": "\nItalian Turkey Burgers\n"}, {"directions": "\n\n              Heat the olive oil in a large pot over medium-high heat. Add the onion and carrots and cook, stirring, until slightly softened, about 4 minutes. Add half of the garlic and 1 teaspoon each Worcestershire sauce and sage; cook 1 minute. Add the chicken broth, 3 cups water and the parmesan rind and bring to a boil. Cover, reduce the heat to medium and simmer until the vegetables are tender, about 7 minutes.\n            \n\n              Meanwhile, mix the pork, breadcrumbs, 1 tablespoon grated parmesan, the remaining garlic and the remaining 1 teaspoon each Worcestershire sauce and sage in a bowl. Form into 1-inch meatballs.\n            \n\n              Increase the heat to medium high and bring the soup to a boil. Stir in the orzo and cook 6 minutes. Add the meatballs and cook until they are firm and float to the top, about 4 more minutes. Stir in the spinach and cook until wilted, about 1 more minute. Ladle the soup into bowls and top with parmesan.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "carrots", "quantity": 3.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "sage", "quantity": 2.0}, {"food": "diced chicken", "quantity": 3.0}, {"food": "parmesan cheese", "quantity": 1.0}, {"food": "pork skins", "quantity": 0.5}, {"food": "", "quantity": 3.0}, {"food": "", "quantity": 0.75}, {"food": "mustard spinach", "quantity": 8.0}], "title": "\nItalian Wedding Soup\n"}, {"directions": "\n\n              For the meatballs: Grate bread on a box grater or pulse into crumbs in a food processor. Place in a large bowl with 1/3 cup cold water. Let sit until water is absorbed. Mix in ground turkey, 1/4 cup Pecorino, parsley, egg, garlic and 1 teaspoon salt and mix. Season with pepper. Gently form into 3/4 to 1-inch meatballs, using lightly floured hands. Place on a baking sheet, cover and refrigerate for 1 hour or up to 24 hours.\n            \n\n              Heat the olive oil in a large pot over medium heat. Add the meatballs and brown turning occasionally. Transfer to a platter.\n            \n\n              For the soup: Add 2 tablespoons of oil to a pot. Add the onion, celery and carrot and cook, stirring occasionally, until soft and golden, about 10 minutes. Add the garlic, thyme and red pepper and cook 3 minutes.\n            \n\n              Stir in the escarole and cook until just wilted, about 2 minutes. Add the chicken broth and tomatoes; bring to a gentle simmer. Return the meatballs to pot, cover and cook for 10 minutes, stirring occasionally. Season with salt and pepper. Ladle the soup into warm bowls. Drizzle some olive oil and pecorino cheese over each serving.\n            \n\n              Copyright 2009 Television Food Network, G.P. All rights reserved\n            \n", "ingredients": [{"food": "garlic bread", "quantity": 2.0}, {"food": "ground turkey", "quantity": 0.75}, {"food": "", "quantity": 0.25}, {"food": "parsley", "quantity": 0.25}, {"food": "egg substitute", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "salt", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "thyme", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "escarole", "quantity": 1.0}, {"food": "diced chicken", "quantity": 8.0}, {"food": "plum", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}], "title": "\nItalian Wedding Soup\n"}, {"directions": "\n\n              Heat the olive oil in a large pot over medium-high heat. Add the onion and carrots and cook, stirring, until slightly softened, about 4 minutes. Add half of the garlic and 1 teaspoon each Worcestershire sauce and sage; cook 1 minute. Add the chicken broth, 3 cups water and the parmesan rind and bring to a boil. Cover, reduce the heat to medium and simmer until the vegetables are tender, about 7 minutes.\n            \n\n              Meanwhile, mix the pork, breadcrumbs, 1 tablespoon grated parmesan, the remaining garlic and the remaining 1 teaspoon each Worcestershire sauce and sage in a bowl. Form into 1-inch meatballs.\n            \n\n              Increase the heat to medium high and bring the soup to a boil. Stir in the orzo and cook 6 minutes. Add the meatballs and cook until they are firm and float to the top, about 4 more minutes. Stir in the spinach and cook until wilted, about 1 more minute. Ladle the soup into bowls and top with parmesan.\n            \n", "ingredients": [{"food": "garlic bread", "quantity": 2.0}, {"food": "ground turkey", "quantity": 0.75}, {"food": "", "quantity": 0.25}, {"food": "parsley", "quantity": 0.25}, {"food": "egg substitute", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "thyme", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "escarole", "quantity": 1.0}, {"food": "diced chicken", "quantity": 8.0}, {"food": "plum", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}], "title": "\nItalian Wedding Soup\n"}, {"directions": "\n\n              Preheat the broiler. Line a rimmed baking sheet with foil. Combine the ground turkey, ricotta, pesto, parmesan, 1/2 teaspoon salt and a few grinds of pepper in a large bowl. Mix with your hands until just combined. Form into 24 small meatballs (about 1 tablespoon each); transfer to the prepared baking sheet. Broil until lightly browned, 5 to 7 minutes.\n            \n\n              Meanwhile, heat the olive oil in a medium Dutch oven or pot over medium-high heat. Add the onion, garlic, Italian seasoning and 1/2 teaspoon salt. Cook, stirring, until the onion is softened, about 3 minutes. Stir in the chicken broth, 2 cups water, the escarole and ditalini. Cover and bring to a boil, then partially uncover and reduce the heat to maintain a gentle simmer. Cook until the pasta is al dente, about 10 minutes.\n            \n\n              Add the meatballs and simmer, uncovered, until warmed through, about 3 minutes. Season with salt and pepper. Drizzle each serving with olive oil and sprinkle with parmesan and parsley.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "ground turkey", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 0.25}, {"food": "pesto pasta primavera", "quantity": 0.25}, {"food": "parmesan cheese", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "seasoning mix", "quantity": 1.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "italian veg medley pasta", "quantity": 4.75}, {"food": "parsley", "quantity": 1}], "title": "\nItalian Wedding Soup\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\nServing suggestions:\n\n\n              Grate the bread or pulse into crumbs in a food processor. In a small bowl toss the breadcrumbs with 1/3 cup cold water to re-hydrate.\n            \n\n              In a large bowl, combine the breadcrumbs, pork, veal, beef, Parmesan, Pecorino, parsley, salt, onion, garlic, and egg and mix until combined. Season the meat mixture with pepper.\n            \n\n              Using your hands, gently form the meat mixture into 18 slightly larger than golf ball-sized balls. (Packing the meat mixture too tightly together will result in tough meatballs). Refrigerate for at least an hour or up to 24.\n            \n\n              Heat half the oil in a large non-stick skillet over medium-high heat. Add half of the meatballs and cook, turning occasionally, until well browned on all sides, about 6 minutes. Transfer the meatballs to a plate. Drain the oil and wipe out the skillet, return to the heat, and repeat with the remaining oil and meatballs.\n            \n\n              Drain and wipe out the skillet again. Return all the meatballs to the skillet and pour in the marinara sauce. Bring to a boil, lower the heat, and simmer, covered, swirling the pan occasionally, until the meatballs are cooked through about 15 minutes. The cheese in the meat balls will start to melt when the meatballs are ready. Serve immediately with spaghetti or on sandwiches. These meatballs can be stored, covered in the refrigerator for 3 days or frozen for up to 6 weeks.\n            \n\nQUICK MARINARA SAUCE\n\n\n              Heat the oil in a medium saucepan over medium-high heat. Saute the onion and garlic, stirring, until lightly browned, about 3 minutes. Add the tomatoes and the herb sprigs and bring to a boil. Lower the heat and simmer, covered, for 10 minutes.\n            \n\n              Remove and discard the herb sprigs. Stir in the salt and season with pepper to taste. Use now, or store covered in the refrigerator for up to 3 days, or freeze for up to 2 months.\n            \n", "ingredients": [{"food": "garlic bread", "quantity": 2.0}, {"food": "pork skins", "quantity": 0.5}, {"food": "veal", "quantity": 0.5}, {"food": "frankfurter beef", "quantity": 0.5}, {"food": "", "quantity": 0.25}, {"food": "", "quantity": 0.25}, {"food": "parsley", "quantity": 0.25}, {"food": "salt", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.75}, {"food": "garlic powder", "quantity": 2.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "", "quantity": 3.0}, {"food": "spaghetti", "quantity": 1.0}, {"food": "pizza rolls", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.25}, {"food": "garlic powder", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.5}, {"food": "hearts of palm", "quantity": 1}, {"food": "hearts of palm", "quantity": 1}, {"food": "salt", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nItalian-American Meatballs\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\nServing suggestions:\n\n\n              Grate the bread or pulse into crumbs in a food processor. In a small bowl toss the breadcrumbs with 1/3 cup cold water to re-hydrate.\n            \n\n              In a large bowl, combine the breadcrumbs, pork, veal, beef, Parmesan, Pecorino, parsley, salt, onion, garlic, and egg and mix until combined. Season the meat mixture with pepper.\n            \n\n              Using your hands, gently form the meat mixture into 18 slightly larger than golf ball-sized balls. (Packing the meat mixture too tightly together will result in tough meatballs). Refrigerate for at least an hour or up to 24.\n            \n\n              Heat half the oil in a large non-stick skillet over medium-high heat. Add half of the meatballs and cook, turning occasionally, until well browned on all sides, about 6 minutes. Transfer the meatballs to a plate. Drain the oil and wipe out the skillet, return to the heat, and repeat with the remaining oil and meatballs.\n            \n\n              Drain and wipe out the skillet again. Return all the meatballs to the skillet and pour in the marinara sauce. Bring to a boil, lower the heat, and simmer, covered, swirling the pan occasionally, until the meatballs are cooked through about 15 minutes. The cheese in the meatballs will start to melt when the meatballs are ready. Serve immediately with spaghetti or on sandwiches. These meatballs can be stored, covered in the refrigerator for 3 days, or frozen for up to 6 weeks.\n            \n\nQUICK MARINARA SAUCE\n\n\n              Heat the oil in a medium saucepan over medium-high heat. Saute the onion and garlic, stirring, until lightly browned, about 3 minutes. Add the tomatoes and the herb sprigs and bring to a boil. Lower the heat and simmer, covered, for 10 minutes.\n            \n\n              Remove and discard the herb sprigs. Stir in the salt and season with pepper to taste. Use now, or store covered in the refrigerator for up to 3 days, or freeze for up to 2 months.\n            \n", "ingredients": [{"food": "garlic bread", "quantity": 2.0}, {"food": "pork skins", "quantity": 0.5}, {"food": "veal", "quantity": 0.5}, {"food": "frankfurter beef", "quantity": 0.5}, {"food": "", "quantity": 0.25}, {"food": "", "quantity": 0.25}, {"food": "parsley", "quantity": 0.25}, {"food": "salt", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.75}, {"food": "garlic powder", "quantity": 2.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "", "quantity": 3.0}, {"food": "spaghetti", "quantity": 1.0}, {"food": "pizza rolls", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.25}, {"food": "garlic powder", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.5}, {"food": "hearts of palm", "quantity": 1}, {"food": "hearts of palm", "quantity": 1}, {"food": "salt", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nItalian-American Meatballs\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Grate the bread on a box grater or pulse it into crumbs in a food processor. Toss the breadcrumbs with the milk in a small bowl and let sit 5 minutes to rehydrate.\n            \n\n              Combine the breadcrumbs, beef, Parmesan, parsley, onion, egg, garlic and salt in a large bowl and mix until combined.\n            \n\n              Using your hands, gently form the meat mixture into 18 balls slightly larger than golf balls. (Don't pack the meat together too tightly or the meatballs will be tough.) Refrigerate at least 1 hour and up to 1 day.\n            \n\n              Preheat the oven to 375 degrees F. Bake the meatballs on a baking sheet until cooked through and tender, 20 to 25 minutes.\n            \n\n              Serve immediately with the Quick Marinara Sauce and spaghetti or on sandwiches. The baked meatballs can be refrigerated up to 3 days or frozen in an airtight container up to 6 weeks.\n            \n\nQuick Marinara Sauce:\n\n\n              Heat the oil in a medium saucepan over medium-high heat. Add the onion and garlic and cook, stirring, until lightly browned, about 5 minutes. Add the tomatoes, thyme and basil and bring to a boil. Reduce the heat and simmer, uncovered, until thickened, about 15 minutes.\n            \n\n              Remove and discard the thyme stems. Stir in 2 teaspoons salt and 1/2 teaspoon pepper. The sauce can be refrigerated up to 3 days or frozen in an airtight container up to 2 months. \n            \n", "ingredients": [{"food": "garlic bread", "quantity": 2.0}, {"food": "milk", "quantity": 0.3333333333333333}, {"food": "frankfurter beef", "quantity": 1.5}, {"food": "", "quantity": 0.5}, {"food": "chrysanthemum leaves", "quantity": 0.25}, {"food": "onion powder", "quantity": 0.75}, {"food": "egg substitute", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "salt", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "", "quantity": 2.0}, {"food": "spaghetti", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "onion powder", "quantity": 0.25}, {"food": "garlic powder", "quantity": 4.0}, {"food": "whole milk", "quantity": 28.0}, {"food": "thyme", "quantity": 3.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nItalian-American Meatballs\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Grate the bread or pulse into crumbs in a food processor. In a small bowl toss the bread crumbs with milk to re-hydrate.\n            \n\n              In a large bowl, combine the bread crumbs, pork, veal, beef, Parmesan, parsley, salt, onion, garlic, and egg and mix until combined. Season the meat mixture with pepper.\n            \n\n              Using your hands, gently form the meat mixture into 18 slightly larger than golf ball-sized balls. (Packing the meat mixture too tightly together will result in tough meatballs). Refrigerate for at least 1 hour or up to 24 hours.\n            \n\n              Heat half the oil in a large nonstick skillet over medium-high heat. Add half of the meatballs and cook, turning occasionally, until well browned on all sides, about 6 minutes. Transfer the meatballs to a plate. Drain the oil and wipe out the skillet, return to the heat, and repeat with the remaining oil and meatballs.\n            \n\n              Drain and wipe out the skillet again. Return all the meatballs to the skillet and pour in the marinara sauce. Bring to a boil, lower the heat, and simmer, covered, swirling the pan occasionally, until the meatballs are cooked through about 15 minutes. The cheese in the meatballs will start to melt when the meatballs are ready. Serve immediately with the Quick Marinara Sauce and spaghetti or on sandwiches. If serving with spaghetti, toss with 1/3 of the sauce.These meatballs can be stored, covered in the refrigerator for 3 days, or frozen for up to 6 weeks.\n            \n\n              Copyright (c) 2004 Television Food Network, G.P., All Rights Reserved.\n            \n\n              Serving suggestions: 1 pound cooked spaghetti or linguini.\n            \n\n              Quick Marinara Sauce\n            \n\n              1/4 cup extra-virgin olive oil\n            \n\n              1/4 medium onion, diced (about 3 tablespoons)\n            \n\n              4 cloves garlic, sliced\n            \n\n              3 (28-ounce) cans whole, peeled, tomatoes, roughly chopped\n            \n\n              3 sprigs fresh thyme\n            \n\n              1 small bunch fresh basil, leaves chopped\n            \n\n              2 teaspoons kosher salt\n            \n\n              Freshly ground black pepper\n            \n\n              Heat the oil in a medium saucepan over medium-high heat. Saute the onion and garlic, stirring, until lightly browned, about 5 minutes. Add the tomatoes, the herb sprigs and basil and bring to a boil. Reduce heat and simmer, uncovered for about 15 minutes or until thickened\n            \n\n              Remove and discard the herb sprigs. Stir in the salt and season with pepper, to taste. Serve or store covered in the refrigerator for up to 3 days, or freeze for up to 2 months.\n            \n\n              Copyright (c) 2004 Television Food Network, G.P., All Rights Reserved.\n            \n", "ingredients": [{"food": "garlic bread", "quantity": 2.0}, {"food": "milk", "quantity": 0.3333333333333333}, {"food": "pork skins", "quantity": 0.5}, {"food": "veal", "quantity": 0.5}, {"food": "frankfurter beef", "quantity": 0.5}, {"food": "", "quantity": 0.5}, {"food": "parsley", "quantity": 0.25}, {"food": "salt", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.75}, {"food": "garlic powder", "quantity": 2.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "", "quantity": 1}], "title": "\nItalian-American Meatballs\n"}]