[{"directions": "\n\n              Divide the meat into 12 loose balls, then form into 1/4-inch-thick patties. Fold 1 slice cheese into a small square; center it on a patty, leaving a 1/2-inch border of meat around the cheese. Top with another patty. Crimp the edges of the 2 patties together, sealing the cheese inside. Repeat with the remaining cheese and meat to make 6 cheese-stuffed patties.\n            \n\n              Warm the vegetable oil in a cast-iron skillet over medium-high heat. Add the onion and cook, stirring, until browned, about 10 minutes. Transfer the onion to a bowl and wipe out the skillet.\n            \n\n              Add the patties to the skillet, season with salt and pepper, and cook 7 to 8 minutes. Flip, then poke the middle of each patty with a toothpick to release steam; cook 7 more minutes for medium well.\n            \n\n              Put about 3 pickle slices on each bottom bun; top with the sauteed onion and a patty, then close with the top bun. Wait a few minutes before biting into the burger-the cheese is hot!\n            \n\n              Photograph by Tina Rupp\n            \n", "ingredients": [{"food": "frankfurter beef", "quantity": 2.5}, {"food": "macaroni cheese", "quantity": 6.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "luncheon slices", "quantity": 1}, {"food": "split pea soup", "quantity": 6.0}], "title": "\n\"Jucy\" Lucys\n"}, {"directions": "\n\n              Pour 2 cups cherry juice into an ice cube tray; freeze 4 hours. Chill 4 rocks glasses. Blend the cherry ice cubes, 1 cup frozen cherries, 1/4 cup maraschino cherry juice and 6 ounces whiskey until slushy. Pour into the glasses; top with cola and stir. Garnish with maraschino cherries.\n            \n", "ingredients": [], "title": "\nJack and Cherry Coke Slushies\n"}, {"directions": "\n\n              Mix 2 tablespoons mayonnaise, 3/4 cup shredded extra-sharp cheddar and 1 tablespoon pickled jalapeno brine; season with salt and pepper. Broil 4 slices sourdough bread on a baking sheet until golden, then flip and spread with the cheese mixture. Top with chopped pickled jalapenos and a dash of paprika. Broil until the cheese is melted and bubbly, then cut each slice in half.\n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [], "title": "\nJalapeno Cheese Bread\n"}, {"directions": "\n\n              Combine 1 1/4 cups flour, 1 1/2 cups cornmeal, 3 tablespoons sugar, 1 tablespoon baking powder, 1 teaspoon salt and 1/2 teaspoon baking soda. Whisk 2 1/4 cups buttermilk, 2 eggs, 1/2 stick melted butter and 1 tablespoon chopped pickled jalapenos; stir into the flour mixture. Pour into a buttered, cornmeal-dusted 9-inch cast-iron skillet; top with sliced fresh jalapenos. Bake at 450 degrees F, 20 to 25 minutes.\n            \n\n              Photograph by Kana Okada\n            \n", "ingredients": [], "title": "\nJalapeno Cornbread\n"}, {"directions": "\n\n              Put all but 1 cup cranberries in a saucepan. Add the lime juice, sugar, cumin, a pinch of salt, the jalapenos and brine and 1/4 cup water. Bring to a simmer over medium heat; cook, stirring occasionally, until the berries burst and the sauce thickens, 15 to 20 minutes.\n            \n\n              Stir in the remaining 1 cup cranberries and cook until softened, 3 to 4 minutes. Remove from the heat and stir in the lime zest. Let cool, then transfer to a serving dish and refrigerate at least 3 hours.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "frozen yogurt", "quantity": 1.0}, {"food": "grape juice", "quantity": 1.0}, {"food": "sugar", "quantity": 1.25}, {"food": "cumin seed", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 0.25}], "title": "\nJalapeno Cranberry Sauce\n"}, {"directions": "\n\n              Puree 4 seeded jalapenos, 1 cup cilantro, 1/2 cup mayonnaise, 1 garlic clove, the juice of 1 lime and 1 tablespoon olive oil. Season with salt.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [], "title": "\nJalapeno Cream\n"}, {"directions": "\n\n              Prepare an outdoor grill for medium heat. Stir together the mayonnaise, sour cream and chipotle in a adobo in a small bowl. Refrigerate it while you make the danger dogs.\n            \n\n              Put 1 cheese stick into each jalapeno half, then fill with some sausage, pressing in and making sure the cheese is fully covered. Tightly wrap each jalapeno half in a strip of bacon, pressing it firmly so the bacon sticks to the chorizo.\n            \n\n              Grill the jalapenos cut-side down, moving as needed to avoid flareups, until the bacon on the bottom is brown and crispy and the sausage is cooked, about 10 minutes. Flip and continue to cook until the bacon on the other side is brown and crispy, another 10 minutes (to keep the melted cheese from leaking out, do not flip again). Put 2 grilled jalapenos in each bun, top with the spicy mayonaise and sprinkle with scallions.\n            \n", "ingredients": [{"food": "mayonnaise dressing", "quantity": 0.3333333333333333}, {"food": "sour cream", "quantity": 0.3333333333333333}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "seeds", "quantity": 6.0}, {"food": "sausage", "quantity": 8.0}, {"food": "bacon", "quantity": 12.0}, {"food": "hot pockets ham cheese stuffed swich", "quantity": 6.0}, {"food": "dessert topping", "quantity": 1}], "title": "\nJalapeno Danger Dog\n"}, {"directions": "\n\n              Put 1/4 cup cold water in a small microwave-safe bowl and sprinkle over the gelatin. Let stand for 5 minutes to bloom.\n            \n\n              Microwave the mixture until the gelatin liquefies, about 20 seconds. Stir to make sure the gelatin is completely dissolved. Combine the tequila and lime juice in a liquid measuring cup and stir in the gelatin mixture.\n            \n\n              Cut 1/4 inch off the stem end of each jalapeno and use a 1/4-teaspoon measure to scoop out the ribs and seeds from each. Stand the jalapenos cut-side up in a plastic container large enough to fit them in a single layer, wedging them as much as possible so they stay in place without causing them to break or change shape. Pour some of the gelatin mixture into each, filling them just to the top (about 2 tablespoons in each). Refrigerate until the gelatin is set, at least 6 hours and preferably overnight.\n            \n\n              Combine the lime zest, sugar and salt in a small bowl and rub with your fingers until the lime zest is evenly mixed in.\n            \n\n              Using a paring knife, trim off and discard the tapered end of each jalapeno, then cut the jalapenos in thirds crosswise. If not serving right away, put the jalapeno pieces on a baking sheet and return to the fridge to chill until ready to serve, up to 2 hours.\n            \n\n              When ready to serve, spread a bed of finely crushed ice on a rimmed serving dish so that it creates a flat surface and arrange the jalapeno pieces on top. Serve with the lime zest mixture on the side.\n            \n", "ingredients": [{"food": "onion powder", "quantity": 0.25}, {"food": "", "quantity": 1.0}, {"food": "lime juice", "quantity": 1.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 12.0}, {"food": "sugar", "quantity": 2.0}, {"food": "salt", "quantity": 1}], "title": "\nJalapeno Jelly Tequila Shots\n"}, {"directions": "\n\n              Mix 1/2 to 1 sliced seeded jalapeno and 1 1/4 cups tequila in a glass; let stand 1 hour. Rub the rim of 4 short glasses with lime and dip in a mixture of 2 tablespoons each sugar and coarse salt. Fill three-quarters of the way with ice. Combine the jalapeno tequila, 1/2 cup fresh lime juice, 3 tablespoons orange-flavored liqueur and 2 teaspoons superfine sugar in a cocktail shaker. Shake well, then pour into the glasses. Garnish with cilantro.\n            \n\n              Photograph by Tina Rupp\n            \n", "ingredients": [], "title": "\nJalapeno Margaritas\n"}, {"directions": "\n\n              Make a big batch of margaritas with a twist. Pulse 1 thin slice jalapeno, a handful of celery leaves, 6 ounces fresh lime juice and a spoonful of confectioners' sugar in a blender. Mix with 16 ounces tequila and 8 ounces orange liqueur in a pitcher; chill. Serve on the rocks in salt-rimmed glasses. \n            \n\n              Photograph by Tina Rupp\n            \n", "ingredients": [], "title": "\nJalapeno Margaritas\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Position an oven rack 4 to 5 inches from the heating element, and preheat the broiler. Line a baking sheet with foil.\n            \n\n              Cut the stem end off the jalapenos, cut each in half lengthwise and remove and discard the seeds (wear food-grade gloves if your skin is sensitive). Arrange the jalapenos skin-side up on the prepared baking sheet, and brush with the oil. Broil until the peppers are blackened and puffy, 3 to 4 minutes. When cool enough to handle, rub off the skins (running under cold water helps). Cut 2 of the halves into large dice so you have 32 pieces (1 for the top of each biscuit); set aside. Finely chop the rest of the peppers, and transfer to a medium bowl.\n            \n\n              Switch the oven from broil to bake, and preheat to 400 degrees F. Remove the foil from the baking sheet, and line it with parchment. Beat the egg well in a small bowl.\n            \n\n              Add the cream cheese, mozzarella and half the egg to the bowl with the chopped peppers, add 1/4 teaspoon salt and mix to combine.\n            \n\n              Separate the biscuit rounds, and cut each into quarters. Make a deep indentation in the center of each quarter, and fill with a heaping teaspoon of the pepper-cheese mixture (it will mound above the biscuit a fair amount). Brush any exposed biscuit with the remaining beaten egg. Bake until the biscuits are puffed and golden around the top, 10 to 12 minutes. Garnish each with a piece of reserved jalapeno.\n            \n", "ingredients": [{"food": "peppers", "quantity": 5.0}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "biscuit", "quantity": 16.0}], "title": "\nJalapeno Popper Mini Biscuits\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: four 6-inch wooden skewers\n\n              Cook the jalapeno poppers according to package directions. Set aside to cool.\n            \n\n              Position a rack in the upper third of the oven and preheat to 400 degrees F. Set a baking rack into a rimmed baking sheet.\n            \n\n              Sprinkle the cutlets with salt and pepper. Put smooth side-down on a work surface with the short ends parallel to the edge of the countertop. Spread a fourth of the cream cheese over a cutlet, leaving about a 1/4-inch border. Lay a jalapeno popper across the short end closest to you and roll up to enclose the popper. Secure with a 6-inch wooden skewer. Sprinkle the cutlet with salt and pepper. Repeat with the remaining cutlets, cream cheese and poppers. \n            \n\n              Put the flour in a shallow dish. Beat the egg until very loose in a second shallow dish. Put the breadcrumbs in a third shallow dish.\n            \n\n              Coat the chicken roll-ups in the flour and the dip in the egg, letting any excess drip off. Then fully coat in the breadcrumbs. Transfer to a plate.\n            \n\n              Heat the oil in a large nonstick skillet over medium-high heat. Place the roll-ups in the skillet, seam-side down, and cook until golden brown on all sides, turning as needed, about 5 minutes. Transfer the chicken to the rack on the prepared baking sheet. Bake until cooked through, about 15 minutes.\n            \n\n              Remove the skewers from the chicken, cut each roll-up in half and serve.\n            \n", "ingredients": [{"food": "frozen yogurt", "quantity": 4.0}, {"food": "diced chicken", "quantity": 4.125}, {"food": "salt", "quantity": 1}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "potato flour", "quantity": 0.3333333333333333}, {"food": "egg substitute", "quantity": 1.0}, {"food": "silk plain soy yogurt", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 2.0}], "title": "\nJalapeno Popper-Stuffed Chicken\n"}, {"directions": "\n\n              Pour oil to a depth of 2 inches into a medium saucepan. Heat over medium-high heat until a deep-frying thermometer inserted in the oil reaches 350 degrees F. In a small bowl, mix the lime zest and 3/4 teaspoon salt together. Working in batches, fry the tortilla wedges until golden and crisp, about 1 minute, and transfer them to a paper towel-lined baking sheet with a slotted spoon. Sprinkle the chips with the lime salt while they are still hot. Set aside.\n            \n\n              Heat 1 tablespoon canola oil in a 10-inch cast-iron or ovenproof skillet over medium-high heat. Add the onions, jalapeno and a pinch of salt and cook until the onions just start to brown, about 5 minutes. Add the tomato and cook until softened, about 1 minute. Add the beer and cook until all the liquid has evaporated, about 7 minutes. Remove the skillet from the heat. Toss the muenster and Cheddar together and add them to the skillet. Stir once or twice to combine.\n            \n\n              When ready to serve, preheat the broiler. Place the skillet under the broiler until the cheese is bubbling and lightly browned on top, 2 to 3 minutes. Serve hot with the chips.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1}, {"food": "", "quantity": 1.0}, {"food": "salt", "quantity": 0.75}, {"food": "corn bran", "quantity": 6.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "pepper", "quantity": 1.0}, {"food": "plum", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "barley flour or meal", "quantity": 12.0}, {"food": "martha white foods", "quantity": 4.0}], "title": "\nJalapeno Queso Fundido\n"}, {"directions": "\n\n              Mix 1 cup each mayonnaise and chopped pickled jalapenos, 1 chopped scallion, 1 tablespoon each lime juice and chopped cilantro and 1/2 teaspoon Worcestershire sauce.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [], "title": "\nJalapeno Tartar Sauce\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 375 degrees F. Brush an 8-by-4-by-2 1/2-inch loaf pan with some of the melted butter.\n            \n\n              Whisk together the flour, sugar and 1/2 cup Cheddar in a large bowl.\n            \n\n              Pour the beer into a medium bowl. Add half of the remaining butter and whisk together (it will get foamy!). \n            \n\n              Pour the beer-butter mixture into the flour mixture and fold until just combined (it's ok if there are lumps). The batter will be relatively thick and shaggy. Transfer to the prepared loaf pan and pat out into an even layer. Pour the remaining butter over the batter and top with the remaining 1/4 cup Cheddar and the jalapeno slices. Bake until golden brown and an instant-read thermometer inserted into the center registers 190 degrees F, 1 hour to 1 hour 5 minutes.\n            \n\n              Let cool in the pan on a rack for about 15 minutes. Invert the bread out of the pan and eat warm or at room temperature.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.0}, {"food": "potato flour", "quantity": 2.75}, {"food": "sugar", "quantity": 2.0}, {"food": "", "quantity": 0.75}, {"food": "barley flour or meal", "quantity": 12.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}], "title": "\nJalapeno-Cheddar Beer Bread\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Butter an 8-inch-square baking pan. Line with parchment paper, leaving a 2-inch overhang on all sides. Lightly butter the paper.\n            \n\n              Prepare the streusel: Pulse the butter, sugar, peanuts, orange zest and vanilla in a food processor just until the nuts are coarsely chopped.\n            \n\n              Make the cake: Sift the flour, baking powder, baking soda and salt through a fine sieve into a large bowl. Beat the butter and sugar in a separate bowl with a mixer on medium-high speed until pale, about 5 minutes. Add the eggs, scrape down the sides of the bowl and beat on medium speed until fluffy, about 4 minutes. Reduce the speed to low. Add the flour mixture in 3 batches, alternating with the sour cream, beginning and ending with the flour mixture. Scrape down the bowl and finish mixing by hand (do not overmix).\n            \n\n              Pour half of the batter into the prepared pan and smooth the top. Sprinkle with half of the streusel and dollop with half of the jam. Spread the remaining batter on top. Sprinkle with the remaining streusel and top with the remaining jam. Bake until a toothpick inserted into the center of the cake comes out clean, 50 minutes to 1 hour. Transfer the pan to a rack and let the cake cool completely, then lift out the cake by the parchment paper and cut into squares.\n            \n\n              Photograph by Kana Okada\n            \n", "ingredients": [{"food": "butter oil", "quantity": 3.0}, {"food": "sugar", "quantity": 0.5}, {"food": "peanuts", "quantity": 1.0}, {"food": "orange", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.25}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 0.75}, {"food": "eggs", "quantity": 2.0}, {"food": "sour cream", "quantity": 1.0}, {"food": "silk raspberry soy yogurt", "quantity": 1.0}], "title": "\nJam Cake With Peanut Streusel\n"}, {"directions": "\n\n              Cut four 4-inch rounds from 1 piece refrigerated pie dough. Spread 1 tablespoon jam in the center of each, leaving a 3/4-inch border around the edge. Brush the dough with beaten egg and crimp the edges. Sprinkle with sliced almonds. Bake at 450 degrees F, 10 minutes.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nJam Galettes\n"}, {"directions": "\n\n              Roll out refrigerated pizza dough to 1/4-inch. Cut into 3-inch rounds. Dollop with cream cheese and jam. Brush the edges with beaten egg, fold in half and press to seal. Brush with egg and sprinkle with sugar. Poke a hole in each; bake 20 minutes at 400 degrees F.\n            \n", "ingredients": [], "title": "\nJam Pockets\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F. Line an 8-inch-square baking dish with aluminum foil, leaving an overhang. Whisk the flour, sugar and salt in a bowl. Work in the butter with your fingers to make a crumbly dough. \n            \n\n              Refrigerate 2 tablespoons of the dough for topping. Press the remaining dough into the baking dish; freeze until firm, about 10 minutes. \n            \n\n              Bake the crust, 15 minutes. Spread the preserves on top, leaving a 1/2-inch border; crumble the reserved dough on top. Return to the oven and bake until the edges are golden brown, 25 more minutes. Let cool 20 minutes, then lift out of the pan and cut into squares. \n            \n\n              Photograph by Christina Holmes\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.5}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "hearts of palm", "quantity": 1}, {"food": "butter oil", "quantity": 10.0}, {"food": "", "quantity": 6.0}], "title": "\nJam Shortbread\n"}, {"directions": "\n\n              Line 2 baking sheets with parchment paper. Whisk the flour, baking powder and salt in a medium bowl. Beat the butter and sugar in a large bowl with a mixer on medium-high speed until light and fluffy, 3 to 5 minutes. Beat in the egg, then the vanilla and lemon zest. Reduce the mixer speed to low; add the flour mixture and beat until just combined (the dough will be soft). \n            \n\n              Divide the dough into 4 pieces and put 2 pieces on each prepared baking sheet. Shape each piece into a 12-by-1-inch log, about 3 inches apart. Using the handle of a wooden spoon or your finger, press a 1/2-inch-deep indentation down the middle of each log. Refrigerate until firm, about 30 minutes. \n            \n\n              Position racks in the upper and lower thirds of the oven and preheat to 375 degrees F. Fill the indentations with jam. Bake, switching the position of the pans halfway through, until golden brown, 20 to 25 minutes. Let cool completely on the baking sheets, then transfer the logs to a cutting board and slice crosswise into 1-inch-wide cookies. \n            \n\n              Photograph by Johnny Miller\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 1.5}, {"food": "sugar", "quantity": 0.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "lemon juice", "quantity": 0.5}, {"food": "jam", "quantity": 4.0}], "title": "\nJam Slices\n"}, {"directions": "\nSpecial equipment: a pastry bag\n\n              A camera-ready macaron has a smooth top and the coveted \"foot\": a lacy ring around the bottom. But macarons are tres temperamental. These detailed directions - and practice - will guide you to macaron success. If your first batch is less than perfect, savor your macarons in all their crispy chewy glory, and try again.\n            \n\n              Position an oven rack in the center of the oven and preheat the oven to 325 degrees F. Line two baking sheets with parchment paper. Using a small glass or cookie cutter (1 1/4- to 1 1/2-inch wide), trace 15 circles on each piece of parchment, leaving about 2 inches between each round. Flip the parchment over; the lines will be visible through the paper but you will not have to pipe directly onto the ink. Fit a pastry bag with a round tip about 1/4 inch wide.\n            \n\n              Sift the confectioners' sugar and ground almonds into a bowl and discard any larger nut chunks. (If you have more than a tablespoon of bigger chunks, grind those until powdery and then resift.) Combine the egg whites and salt in a large bowl and whip on medium-low speed with an electric mixer until frothy, 1 to 2 minutes. Add the granulated sugar, increase the speed to medium-high and whip until very soft peaks form, 2 to 3 minutes. Add the almond extract and a few drops of food coloring (if using); a little goes a long way so add with caution. Whip until stiff peaks form, 3 to 5 minutes. Fold about one-third of the sugar-nut mixture into the egg whites until blended, and then carefully fold in the remaining two-thirds. The batter should be a bit fluid but not runny. It should slowly drip off the spatula and sit on top of the batter in the bowl for a bit before eventually oozing back into it. If it seems a bit stiff at this point, fold once or twice more until it relaxes, although be careful not to over-fold. This correct texture is the key to the macaron and it is better to have a stiffer batter than a looser one.\n            \n\n              Transfer the batter to the prepared pastry bag. Holding the bag perpendicular over the baking sheet, squeeze until the batter fills a circle drawn on the paper. Release the pressure on the bag and pull towards you to prevent a pointy tip on the center of the cookie. Repeat with the remaining circles. Gently flatten any points on the cookies with a damp fingertip.\n            \n\n              Firmly rap the baking sheets against the counter to release any air bubbles and let stand at room temperature until the tops of the cookies no longer feel wet, 10 to 15 minutes.\n            \n\n              Bake, one sheet at a time, until the macarons are slightly crisp, about 15 minutes. Rotate the sheet halfway through for even baking. Cool the cookies on the sheets 5 minutes, and then peel them off the paper and cool completely on a rack. To assemble the cookies, spread a thin layer of the preserves on the bottoms of half of the cookies, about 1/4 teaspoon per cookie. Top with a second cookie, gently pressing to squeeze the preserves to the rims.\n            \n\n              From Food Network Kitchen\n            \n", "ingredients": [{"food": "sugar", "quantity": 1.0}, {"food": "whole milk", "quantity": 0.5}, {"food": "egg substitute", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "sugar", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 0.25}, {"food": "", "quantity": 2.0}, {"food": "apricot nectar", "quantity": 0.25}], "title": "\nJam-Filled Almond Macarons\n"}, {"directions": "\n\n              Unroll 1 refrigerated piecrust onto a parchment paper-lined baking sheet. Spread with 3/4 cup strawberry jam, leaving a 1/2-inch border. Mix 3/4 cup each oats and flour, 6 tablespoons melted butter, 1/3 cup brown sugar, 1/4 cup granulated sugar and a pinch of salt; squeeze into clumps and drop over the jam. Bake at 450 degrees F, 15 minutes. Let cool and cut into squares.\n            \n\n              SERVES 14; Calories: 210; Total Fat 8 grams; Saturated Fat: 4 grams; Protein: 2 grams; Total carbohydrates: 32 grams; Sugar: 17 grams Fiber 1 grams; Cholesterol: 13 milligrams; Sodium: 74 milligrams\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nJam-and-Oat Squares\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Line 2 baking sheets with parchment.\n            \n\n              Combine the thyme, scallions, garlic, scotch bonnet chile and bell pepper in a food processor and pulse until finely chopped (take care not to make a smooth puree).\n            \n\n              Heat a large nonstick skillet over medium heat. Add the beef, and cook, stirring, until slightly brown, about 2 minutes. Add the pepper mixture, curry powder and allspice, and cook, stirring, until the beef is deeply browned and the filling is fragrant, about 5 minutes. Remove from the heat and stir in the oil. Season the filling with 1 teaspoon salt and a few grinds of pepper and let the filling cool completely. Taste the filling and adjust the seasoning with more salt as needed.\n            \n\n              Roll each sheet of puff pastry to about 1/8 inch thick. Using a 4-inch football or oval-shaped cutter, stamp out 8 ovals of dough from each sheet; reserve the dough scraps. Spoon 1 tablespoon of the beef mixture onto the center of half the dough ovals and brush the edges with egg mixture. Top each oval with a second dough oval and crimp the edges with a fork to seal. Transfer the patties to the prepared baking sheets.\n            \n\n              From the dough scraps, cut sixteen 2-by-1/8-inch strips and forty-eight 1-by-1/8-inch strips, using a paring knife or pizza cutter. Arrange the long strips lengthwise across the center of each oval then arrange 3 short strips crosswise over the long strips to form the laces of a football. So as not to disturb the placement of the laces, carefully brush the tops of the ovals with egg mixture. Bake until puffed and golden brown, 25 to 30 minutes.\n            \n\n              Serve with barbecue sauce, chutney or ranch dressing for dipping.\n            \n", "ingredients": [{"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "", "quantity": 6.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "seeds", "quantity": 1.0}, {"food": "pepper", "quantity": 0.5}, {"food": "frankfurter beef", "quantity": 8.0}, {"food": "curry powder", "quantity": 1.5}, {"food": "allspice", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "meat drippings ", "quantity": 17.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1}], "title": "\nJamaican Meat Pie Footballs\n"}, {"directions": "\n\n              Combine the sausage, peppers, celery, scallions, tomatoes, rice, chicken broth, Cajun seasoning, bay leaves, thyme and cayenne in a 6-quart slow cooker.\n            \n\n              Cover and cook on low, 4 hours, adding the shrimp during the last 20 minutes of cooking. Discard the bay leaves. Serve topped with parsley.\n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [{"food": "sausage", "quantity": 1.5}, {"food": "peppers", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "crisped rice bar", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.5}, {"food": "seasoning mix", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "thyme", "quantity": 0.5}, {"food": "pepper", "quantity": 0.125}, {"food": "shrimp", "quantity": 1.0}, {"food": "parsley", "quantity": 1}], "title": "\nJambalaya\n"}, {"directions": "\n\n              Heat a large pot or Dutch oven over medium-high heat; add the olive oil. Add the sausages and cook, stirring occasionally, until lightly browned, about 3 minutes. Transfer to a plate using a slotted spoon.\n            \n\n              Add the scallion whites, celery and bell pepper to the pot. Cook, stirring occasionally, until softened, about 2 minutes. Add the garlic and Cajun seasoning; cook 1 minute.\n            \n\n              Add 1 1/2 cups water, the chicken broth, rice, tomatoes and bay leaf. Bring to a simmer and cook until the rice is tender, about 15 minutes. Return the sausages to the pot and season with salt. Discard the bay leaf. Top the soup with the scallion greens and serve with cornbread.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "diced chicken", "quantity": 3.0}, {"food": "martha white foods", "quantity": 4.0}, {"food": "celery seed", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "seasoning mix", "quantity": 1.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "crisped rice bar", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "corier leaf", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 1}], "title": "\nJambalaya Soup\n"}, {"directions": "\n\n              Melt 1 tablespoon butter in a large pot over medium-high heat. Add the turnip, potatoes, all but 2 tablespoons of the chopped red onion and a pinch of salt. Cook, stirring occasionally, until the vegetables are slightly softened, about 3 minutes; remove to a plate.\n            \n\n              Melt 2 tablespoons butter in the pot. Sprinkle in the flour and curry powder; cook, stirring, 1 minute. Gradually whisk in the broth until smooth. Return the potato mixture to the pot; add the peas and carrots and the sugar. Bring to a boil, then reduce the heat to medium. Cover and simmer 10 minutes; uncover and simmer 5 more minutes. Season with salt and pepper.\n            \n\n              Season the steak with salt and pepper. Melt the remaining 1 tablespoon butter in a nonstick skillet over medium-high heat. Add the steak; cook 4 minutes per side. Let rest 5 minutes, then slice against the grain. Serve with the curry and rice. Top with the reserved red onion.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [{"food": "butter oil", "quantity": 4.0}, {"food": "turnip greens", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "potato flour", "quantity": 3.0}, {"food": "curry powder", "quantity": 2.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "pigeon peas", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "", "quantity": 1.0}, {"food": "crisped rice bar", "quantity": 1}], "title": "\nJapanese Beef Curry\n"}, {"directions": "\n\n              Preheat the oven to 300 degrees F. Spray a 9-inch round cake pan with cooking spray and line the bottom with parchment. Place a 3 1/2-inch-wide strip of parchment around the inside of the pan so that it comes up about 1 inch higher than the edge; set aside.\n            \n\n              Heat the cream cheese, milk and butter in a small saucepan over medium heat, whisking occasionally, until smooth. Remove from the heat and let cool slightly, about 5 minutes.\n            \n\n              Whisk together the vanilla, egg yolks and lemon juice in a large bowl until smooth. Pour the cooled milk mixture into the yolk mixture and whisk until smooth and combined. Whisk in the flour and cornstarch until combined; set aside.\n            \n\n              Beat the egg whites, cream of tartar and 1/2 teaspoon salt in a large bowl with an electric mixer on medium speed until soft peaks form, about 2 minutes. Slowly add the granulated sugar and continue beating on medium speed until stiff peaks form, about 2 minutes longer.\n            \n\n              Gently fold the egg white mixture into the yolk mixture in 3 batches, making sure not to overmix (you want the whites to stay as fluffy as possible). As soon as the white streaks disappear from the batter, pour it into the prepared pan.\n            \n\n              Place the cake pan inside of a larger pan and pour enough hot water into the larger pan so that it comes 1 inch up the sides of the cake pan. Bake for 30 minutes, then reduce the oven to 250 degrees F and continue baking until the cake is doubled in size, golden brown on top and around the edges and jiggly in the center but set, about 1 hour and 15 minutes.\n            \n\n              Let the cake cool for 10 minutes. Carefully invert the cake onto your dominant hand (right onto your palm--this is the most gentle way to handle it), then invert it back onto a cake stand or plate so that the top is facing up. Sprinkle the entire top with confectioners' sugar and serve while still warm.\n            \n", "ingredients": [{"food": "pan dulce", "quantity": 1}, {"food": "macaroni cheese", "quantity": 10.0}, {"food": "whole milk", "quantity": 0.5}, {"food": "butter oil", "quantity": 4.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "eggs", "quantity": 7.0}, {"food": "", "quantity": 0.5}, {"food": "potato flour", "quantity": 0.6666666666666666}, {"food": "cornstarch", "quantity": 0.25}, {"food": "ice cream swich", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "sugar", "quantity": 1.0}, {"food": "sugar", "quantity": 1}], "title": "\nJapanese Cheesecake\n"}, {"directions": "\n\n              In a large soup pot bring the water to a boil along with the dried mushrooms, ginger, and garlic. Adjust the heat to a gentle simmer and cook for 30 minutes. Turn off the heat and let steep, 30 more minutes.\n            \n\n              While the broth steeps: Melt the butter over high heat in a large nonstick skillet, add the sliced fresh mushrooms and cook until crisp and brown, about 10 minutes. Season the mushrooms with salt and pepper, to taste, and distribute them evenly between 4 soup bowls.\n            \n\n              Put the eggs in a small saucepan and cover with cold water. Bring to a boil, turn off heat, cover, and let cook until almost soft boiled, 3 to 4 minutes. Immediately rinse the eggs with cold water and set aside.\n            \n\n              Strain the broth. Reheat and season with the sherry, soy sauce, and salt to taste. Distribute noodles, enoki mushrooms, if using, and scallions evenly in each soup bowl. Crack a soft-boiled egg into each bowl (to maintain the eggs' shape, take care to peel them carefully, or use as small spoon to free them from the shell). Ladle 2 cups of hot broth into each bowl. Sprinkle gomashio or shansho pepper over the soup, if desired, and serve immediately.\n            \n", "ingredients": [{"food": "coconut water", "quantity": 10.0}, {"food": "mixed nuts", "quantity": 2.0}, {"food": "hearts of palm", "quantity": 10.0}, {"food": "garlic powder", "quantity": 5.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "mixed nuts", "quantity": 1.0}, {"food": "silk very vanilla", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "black bean mango", "quantity": 1}, {"food": "eggs", "quantity": 4.0}, {"food": "", "quantity": 0.25}, {"food": "soy sauce", "quantity": 1.0}, {"food": "barley flour or meal", "quantity": 8.0}, {"food": "mushrooms", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "seasoning mix", "quantity": 1}], "title": "\nJapanese Mushroom Egg Noodle Soup\n"}, {"directions": "\n\n              Whisk the vinegar and sugar together in a small bowl and set aside.\n            \n\n              Combine the rice, water, and 1 teaspoon salt in a small saucepan with a tight-fitting lid. Wrap the pan's lid tightly with a small kitchen towel and cover the saucepan. (Make sure the towel's edges are folded up well away from the heat.) Bring to a boil, lower the heat to low, and simmer, covered, for 20 minutes.\n            \n\n              Remove the rice from the heat (don't uncover) and set aside for 10 minutes. Fluff the rice with a fork and transfer it to a large bowl. Add the vinegar mixture and toss with the rice, using a wooden spoon. Spread it out on a parchment paper-lined baking sheet. Fan the rice continuously with a fan or magazine until cooled. Cover the rice with a damp towel.\n            \n\n              Pour about 1 inch of water into a large saucepan and set up a collapsible steamer inside. Bring the water to boil, put the carrots and mushrooms in the steamer, cover, and steam until tender, about 6 minutes. Transfer the carrots and mushrooms to a large bowl, add the remaining 2 teaspoons salt, sesame oil, and sesame seeds, and stir to combine. Let cool.\n            \n\n              When the vegetable mixture has cooled, add the cucumber, pickled daikon, lime juice, and lime zest and toss to combine. Add the rice and, using a rubber spatula, lightly mix with the vegetable mixture.\n            \n\n              Set a small bowl of water beside you. Lightly wet your hands and form the vegetable rice into 12 small football-like shapes. Stuff the rice into the tofu pockets and press the sides together. Stuff a few tuffs of radish sprouts in the sides, if using. Stand the tofu packages up on a serving platter and sprinkle with the sansho. Serve with pickled ginger, wasabi, and soy sauce.\n            \n\n              Serving suggestions: Pickled ginger, wasabi, and soy sauce.\n            \n", "ingredients": [{"food": "vinegar", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "crisped rice bar", "quantity": 1.0}, {"food": "coconut water", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "diced chicken", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "sesame seeds", "quantity": 2.0}, {"food": "diced chicken", "quantity": 0.5}, {"food": "diced chicken", "quantity": 1.0}, {"food": "lime juice", "quantity": 1.0}, {"food": "lime", "quantity": 0.25}, {"food": "hot pockets ham cheese stuffed swich", "quantity": 12.0}, {"food": "brussels sprouts", "quantity": 1}, {"food": "pepper", "quantity": 1}], "title": "\nJapanese Vegetable and Rice Stuffed Tofu: Inari Sushi\n"}, {"directions": "\n\n              Season the pork with salt. Mix the rice wine and 1 teaspoon ginger and spread on the pork. Stack the pork and set aside.\n            \n\n              Peel, quarter and seed the cucumbers; cut into 4-inch spears. Toss with the sugar and vinegar. Toast the pepper flakes with 1 tablespoon salt in a skillet over medium heat, about 4 minutes; set aside.\n            \n\n              Beat the eggs with 1/2 cup water in a shallow bowl. Put the panko and cornstarch in 2 separate shallow bowls. Dredge each piece of pork in cornstarch, dip in egg, then coat with the panko. Heat 1/4 inch of peanut oil in a large skillet over high heat. Fry the pork in batches until golden, 3 to 4 minutes per side. Drain on a paper-towel-lined plate.\n            \n\n              Sprinkle the cucumbers with some of the spiced salt. Mix the tonkatsu sauce and the remaining 1/2 teaspoon ginger in a bowl. Serve the pork with the cucumbers and sauce.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "multigrain cutlets", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "crisped rice bar", "quantity": 2.0}, {"food": "ginger", "quantity": 1.5}, {"food": "", "quantity": 2.0}, {"food": "sugar", "quantity": 0.5}, {"food": "vinegar", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.5}, {"food": "eggs", "quantity": 3.0}, {"food": "", "quantity": 2.0}, {"food": "cornstarch", "quantity": 0.75}, {"food": "vegetable oil", "quantity": 1}, {"food": "Worcestershire sauce", "quantity": 0.25}], "title": "\nJapanese-Style Crispy Pork\n"}, {"directions": "\nSpecial equipment: a Japanese rectangular omelet pan\n\n              Beat the eggs with the milk and 1/4 teaspoon salt in a small bowl. Stir the ham and cheese together in another small bowl.\n            \n\n              Heat a Japanese rectangular omelet pan over medium heat until hot. Brush with little bit of oil. Add just enough of the egg mixture to coat the bottom of the pan when tilted. Let the egg cook until just set on the bottom, then use chopsticks or a rubber spatula to roll the sheet of egg into a log shape and push it to the far end of the pan. Brush the pan with more oil and again add just enough egg to coat the bottom when tilted, this time lifting up the rolled egg so that the raw egg flows underneath it. (If the egg is browning or setting too quickly, control the heat by lifting the pan off the burner for a moment.) When the underside is just set, roll the log towards the handle of the pan, then push the log back to the far end. Repeat; when you have made 3 layers, make another layer in the same manner and add half the ham and cheese. Make another layer, using the rest of the ham and cheese. Finish making the omelet in the same manner with the remaining egg.\n            \n\n              Turn the omelet out onto a plate, sprinkle with chives and serve.\n            \n", "ingredients": [{"food": "eggs", "quantity": 3.0}, {"food": "milk", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "ham", "quantity": 1.0}, {"food": "barley flour or meal", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "chives", "quantity": 2.0}], "title": "\nJapanese-Style Ham and Cheese Omelet\n"}, {"directions": "\n\n              Make the salsa: Mix the mango, jalapeno, onion, lime juice, cilantro and 1 teaspoon salt in a bowl; fold in the olive oil. Prepare the fish: Mix the instant potatoes, lime zest, cayenne, 2 teaspoons salt and 1/2 teaspoon black pepper in a shallow dish. Beat the eggs in another dish. Season the flour with salt and black pepper in a third dish. Dredge each fish fillet in the seasoned flour, dip in the eggs, then coat completely with the potato mixture.\n            \n\n              Place a large nonstick skillet over medium-high heat. Add about 1/2 inch of vegetable oil. When the oil is hot, place the fish curved-side down in the pan; cook until golden brown and crisp, 3 to 4 minutes. Turn and cook until golden on the other side, about 3 more minutes. Top with the salsa and more cilantro.\n            \n\n              Photograph by Tina Rupp\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 1.0}, {"food": "pepper", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "sweet potatoes", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "pepper", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "eggs", "quantity": 2.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "bass", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 1}], "title": "\nJay's Potato-Crusted Fish with Mango Salsa\n"}, {"directions": "\n\n              Combine the cranberries, sugar, 1 1/2 cups water, the cherry juice, dried cherries, rosemary and a pinch of salt in a medium saucepan. Bring to a simmer over medium heat and cook, stirring occasionally, until the cranberries burst and the sauce thickens, 15 to 20 minutes. Let cool slightly. Discard the rosemary sprig.\n            \n\n              Puree the sauce in a blender until smooth. Strain through a fine-mesh sieve into a serving dish, pressing the sauce through with a rubber spatula. Refrigerate until set, at least 3 hours or overnight.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "frozen yogurt", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "grape juice", "quantity": 0.5}, {"food": "maraschino cherries", "quantity": 0.5}, {"food": "rosemary", "quantity": 1.0}, {"food": "salt", "quantity": 1}], "title": "\nJellied Cranberry-Cherry Sauce\n"}, {"directions": "\n\n              Dip cupcake into the icing; let excess to drip back into bowl. Place cupcake on a rack over paper towels to catch any drips. Cut a length of the licorice, about 1 1/2 inches long, press the ends together to form a ring. Press ring into the icing to make a nest. Fill nest with coconut grass and place eggs in the nest.\n            \n\nVanilla Cupcake:\n\n\n              Preheat oven to 350 degrees F. Line two 12-cup cupcake tins with paper liners. (To avoid cupcakes sticking if they overflow slightly, lightly spray the tops of the pans.) Put tins on a baking sheet. Set aside.\n            \n\n              Process sugar and butter in a food processor until very creamy, scraping sides as needed, 1 to 2 minutes. Add the eggs and yolks, one at a time, pulsing after each addition. Add the milk, water, and vanilla and process to blend.\n            \n\n              Whisk both flours, baking powder, and salt in a medium bowl. Add the dry ingredients, in 3 batches to the wet, pulsing, and then scraping batter off the sides of the processor as needed after each addition. Process until the batter is very smooth, about 2 minutes.\n            \n\n              Evenly pour the batter into the prepared cups, filling them 3/4 of the way full. Bake until the cakes are just firm and spring back when gently pressed, and the tops are golden, 18 to 25 minutes. Cool slightly in tin, and turn out of tin when cool enough to handle. Cool cupcakes completely on a rack before frosting.\n            \n\nBasic Glaze Icing:\n\n\n              Put the sugar in an electric mixer fitted with the paddle attachment. With the mixer on the lowest speed, slowly add the water, the corn syrup and vanilla extract. When the sugar is sufficiently moistened (it won't fly out of the mixer), raise the speed to high, and beat for 2 minutes until completely smooth and glossy.\n            \n\n              Divide and color, as desired. Store at room temperature, covered with plastic wrap directly on the surface of the icing, to prevent forming a skin.\n            \n\n              For cupcakes: Dip the surface of the cupcake into the icing, allowing excess to drip into bowl. Clean any excess from the sides. Alternately, use a knife or a spreader to apply. Whisk as needed to keep icing glossy and smooth while using.\n            \n\n              For Light Blue Icing: Combine 2 to 3 drops of blue food coloring to 1 cup of Basic Glaze Icing.\n            \n\n              For Deep Yellow Icing: Combine 4 to 5 drops of yellow food coloring to 1 cup of Basic Glaze Icing.\n            \n\n              For Purple Icing: Combine 4 drops of red and 5 drops of blue food coloring to 1 cup of Basic Glaze Icing.\n            \n\nCoconut Easter Grass for Cupcakes:\n\n\n              Preheat oven to 250 degrees F. Line a baking sheet with parchment paper. Place a mesh rack on top, if available.\n            \n\n              Put coconut in a shallow bowl. While tossing with a large spoon, add food coloring drop by drop until the desired color is reached. A little more green than yellow makes a pretty grass color. Add a few tablespoons water to moisten the mixture and help disperse the color evenly. If the color is too dark, add additional water, as needed, to dilute to the desired color. Drain the coconut in a sieve or strainer.\n            \n\n              Spread the coconut in an even layer on the rack, or directly on the lined baking sheet. Place in the oven until dry, about 10 to 15 minutes. Use immediately, or store in covered container for up to 3 days.\n            \n", "ingredients": [{"food": "", "quantity": 1.0}, {"food": "", "quantity": 1}, {"food": "yellow rice", "quantity": 1.0}, {"food": "", "quantity": 1}, {"food": "", "quantity": 10.0}, {"food": "sugar", "quantity": 2.6666666666666665}, {"food": "butter oil", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "egg substitute", "quantity": 2.0}, {"food": "milk", "quantity": 0.6666666666666666}, {"food": "coconut water", "quantity": 0.6666666666666666}, {"food": "vanilla extract", "quantity": 2.5}, {"food": "potato flour", "quantity": 2.6666666666666665}, {"food": "potato flour", "quantity": 1.3333333333333333}, {"food": "baking chocolate", "quantity": 4.0}, {"food": "salt", "quantity": 0.5}, {"food": "sugar", "quantity": 1.0}, {"food": "coconut water", "quantity": 1.0}, {"food": "silk light vanilla", "quantity": 5.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "", "quantity": 1}, {"food": "coconut water", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "yellow rice", "quantity": 0.5}], "title": "\nJelly Bean Egg Nest\n"}, {"directions": "\n\n              Make the dough: Mix 1 1/2 cups flour, the milk and yeast in a stand mixer fitted with the paddle attachment on low speed until combined, about 45 seconds.\n            \n\n              Cover the yeast mixture with the remaining 1 1/2 cups flour, the sugar and salt; set aside until the yeast mixture starts to rise through the flour and the mixture looks craggy, about 45 minutes. Add the eggs and mix on low speed until just incorporated. Increase the speed to medium high and beat until the dough is smooth, uniform and starts to pull away from the sides of the bowl, about 5 minutes.\n            \n\n              With the mixer running, add the 3 sticks butter, 1 cube at a time, making sure each piece is incorporated before adding the next. Scrape down the sides of the bowl and mix 1 more minute. Transfer the dough to a separate large bowl, cover with plastic wrap and refrigerate 8 hours or overnight.\n            \n\n              Brush a 10- to 15-cup Bundt pan with the melted butter to coat. Place the dough in the pan, gently patting it down until it is even. Cover with plastic wrap and let rise in a warm spot until the dough fills two-thirds of the pan, 2 to 2 1/2 hours.\n            \n\n              Position a rack in the lower third of the oven and preheat to 375 degrees F. Bake the cake until dark golden brown, about 35 minutes. Transfer to a rack and let cool 15 minutes in the pan, then invert onto the rack to cool completely, about 2 hours.\n            \n\n              Make the syrup and filling: Combine 1/4 cup each sugar, raspberry jam and boiling water in a bowl, stirring to dissolve the sugar; set aside. Invert the cake again and make eight 2-inch-deep, 1-inch-wide incisions evenly spaced around the bottom of the cake with a paring knife. Fill a pastry bag fitted with a 3/4-inch tip with the remaining 1 1/4 cups jam and pipe it evenly into the incisions. Let the cake sit 5 minutes, then invert back onto a plate and brush with the raspberry syrup. Let sit 5 minutes, then sprinkle with the remaining 1/4 cup sugar.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 3.0}, {"food": "milk", "quantity": 0.6666666666666666}, {"food": "yeast extract spread", "quantity": 2.0}, {"food": "sugar", "quantity": 0.5}, {"food": "salt", "quantity": 1.5}, {"food": "eggs", "quantity": 4.0}, {"food": "butter oil", "quantity": 3.0}, {"food": "sugar", "quantity": 0.5}, {"food": "silk raspberry soy yogurt", "quantity": 1.5}], "title": "\nJelly Doughnut Bundt Cake\n"}, {"directions": "\n\n              Center the gumdrop on the cupcake. Stick the jellies into the frosting around the gumdrop.\n            \n", "ingredients": [{"food": "", "quantity": 1.0}, {"food": "frosting", "quantity": 1.0}, {"food": "spaghetti", "quantity": 3.0}], "title": "\nJelly Spaghetti Anemone\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Whisk the eggnog and egg in a small bowl. Whisk the flour, sugar, baking powder, nutmeg and salt in a large bowl. Work in the butter with your fingers until it is in pea-size pieces. Stir in the eggnog mixture until a soft dough forms.\n            \n\n              Line a baking sheet with parchment paper. Divide the dough in half. Using floured hands, pat 1 piece of dough into a 7-inch round on the prepared pan. Top with the jelly and gently spread almost to the edge. Pat the remaining piece of dough into a 7-inch round on a lightly floured piece of parchment paper and invert onto the jelly layer; discard the parchment. Lightly press the edges of the dough together.\n            \n\n              Score the top of the dough into 8 wedges. Brush with eggnog and sprinkle with sugar and the almonds. Bake until golden brown, about 25 minutes. Let cool slightly. Cut the scones along the scored lines. Serve warm or at room temperature.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "eggnog", "quantity": 0.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "sugar", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "nutmeg", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 6.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.3333333333333333}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}], "title": "\nJelly-Filled Eggnog Scones\n"}, {"directions": "\n\n              For the cookies: Position an oven rack in the upper and lower thirds of the oven and preheat to 350 degrees F. Line 2 baking sheets with parchment paper.\n            \n\n              Whisk together the flour, baking powder, nutmeg and salt in a medium bowl.\n            \n\n              Beat the butter and granulated sugar together in a large bowl with an electric mixer on medium-high speed until light and fluffy, about 3 minutes. Beat in the eggs, one at a time, then beat in the sour cream, vanilla and lemon zest. Add the flour mixture to the butter mixture and use a rubber spatula to gently fold and stir until just combined.\n            \n\n              Scoop the dough by level tablespoonfuls onto one of the prepared baking sheets and refrigerate until slightly chilled and firm, about 15 minutes.\n            \n\n              With lightly floured hands, roll each piece out into a 51/2-inch-long rope. Join the ends together to form 2-inch rings. Place on the prepared baking sheets, leaving about a 1 inch between the cookies.\n            \n\n              Once you've filled the 2 baking sheets (you should be able to fit about 14 on each sheet), bake the cookies until puffed and very light brown on the bottom, 10 to 12 minutes, switching the baking sheets in the oven halfway through baking. Transfer the cookies to a rack to cool. Let the baking sheets cool and bake the remaining cookies.\n            \n\n              For the glaze: Whisk together the confectioners' sugar, lemon juice, grape jelly and 1/3 cup water in a medium bowl. Dip the rounded top of the cooled cookies into the glaze, letting any excess drip off, and place back on the rack. Immediately decorate with chocolate sprinkles before the glaze sets. Let the cookies sit for about 30 minutes for the glaze to harden. Store at room temperature in an airtight container for up to 3 days.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.5}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "nutmeg", "quantity": 0.5}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 10.0}, {"food": "eggs", "quantity": 2.0}, {"food": "sour cream", "quantity": 0.25}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "sugar", "quantity": 0.75}, {"food": "", "quantity": 1.0}, {"food": "sugar", "quantity": 2.25}, {"food": "lemon juice", "quantity": 0.3333333333333333}, {"food": "grape juice", "quantity": 2.0}, {"food": "", "quantity": 1}], "title": "\nJelly-Glazed Doughnut Cookies\n"}, {"directions": "\n\n              Pulse the vinegar, rum, brown sugar, scallions, garlic, chile, Pickapeppa sauce, ginger, allspice and pumpkin pie spice in a food processor to make a slightly chunky sauce. Heat the oil in a medium skillet and cook the sauce over medium heat, stirring, until the oil is absorbed and the sauce thickens slightly, about 3 minutes. Cool.\n            \n\n              Rub the jerk paste all over the chicken halves, cover, and refrigerate for 2 to 24 hours.\n            \n\n              Prepare an outdoor grill with a medium-high fire for both direct and indirect grilling. Position a drip pan under the grate on indirect side. Place the chicken, skin side down, over direct heat and cook until skin crisps and has definite grill marks, about 4 minutes per side. Move to indirect heat over the drip pan and cook skin side up, covered, until an instant-read thermometer inserted into the thickest part of the thigh registers 165 degrees F, about 35 to 40 minutes. Let the chicken rest about 5 minutes, then cut into pieces and serve.\n            \n", "ingredients": [{"food": "vinegar", "quantity": 0.3333333333333333}, {"food": "", "quantity": 0.25}, {"food": "sugar", "quantity": 3.0}, {"food": "martha white foods", "quantity": 1.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "ginger", "quantity": 1.0}, {"food": "allspice", "quantity": 1.0}, {"food": "pumpkin pie spice", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "diced chicken", "quantity": 4.0}], "title": "\nJerk Chicken\n"}, {"directions": "\nSpecial equipment: 6 long skewers\n\n              Pulse the vinegar, rum, brown sugar, scallions, garlic, chile, Pickapeppa sauce, ginger, allspice, and pumpkin pie spice in a food processor to make a slightly chunky sauce. Heat the oil in a medium skillet and cook the sauce over medium heat, stirring, until the oil is absorbed and the sauce thickens slightly, about 3 minutes. Cool.\n            \n\n              Rub the jerk paste all over the chicken, cover, and refrigerate for 2 to 24 hours.\n            \n\n              Heat a grill pan over medium heat or prepare a grill. Thread the chicken, scallions, and pineapple alternately on skewers (if you use wooden ones, soak them in water for 15 minutes before threading them). Season with salt. (Leave a little space around the meat so the heat gets to all sides.) Grill, turning, until the chicken is cooked through, 10 to 12 minutes.\n            \n", "ingredients": [{"food": "sugar", "quantity": 0.25}, {"food": "", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "martha white foods", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "garlic powder", "quantity": 5.0}, {"food": "ginger", "quantity": 1.0}, {"food": "allspice", "quantity": 2.0}, {"food": "pumpkin pie spice", "quantity": 1.0}, {"food": "fat free chicken breast ", "quantity": 4.0}, {"food": "martha white foods", "quantity": 1.0}, {"food": "pineapple chunks", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "garlic bread", "quantity": 6.0}], "title": "\nJerk Chicken and Pineapple Kebabs\n"}, {"directions": "\n\n              Special Equipment: 6 long skewers\n            \n\n              Pulse the vinegar, rum, brown sugar, scallions, garlic, chile, Pickapeppa sauce, ginger, allspice, and pumpkin pie spice in a food processor to make a slightly chunky sauce. Heat the oil in a medium skillet and cook the sauce over medium heat, stirring, until the oil is absorbed and the sauce thickens slightly, about 3 minutes. Cool.\n            \n\n              Rub the jerk paste all over the chicken, cover, and refrigerate for 2 to 24 hours.\n            \n\n              Heat a grill pan over medium heat or prepare a grill. Thread the chicken, scallions, and pineapple alternately on skewers (if you use wooden ones, soak them in water for 15 minutes before threading them). Season with salt. (Leave a little space around the meat so the heat gets to all sides.) Grill, turning, until the chicken is cooked through, 10 to 12 minutes.\n            \n", "ingredients": [{"food": "vinegar", "quantity": 0.3333333333333333}, {"food": "", "quantity": 0.25}, {"food": "sugar", "quantity": 3.0}, {"food": "martha white foods", "quantity": 1.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "ginger", "quantity": 1.0}, {"food": "allspice", "quantity": 1.0}, {"food": "pumpkin pie spice", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "fat free chicken breast ", "quantity": 4.0}, {"food": "martha white foods", "quantity": 1.0}, {"food": "pineapple chunks", "quantity": 0.5}, {"food": "salt", "quantity": 1}], "title": "\nJerk Chicken and Pineapple Kebabs\n"}, {"directions": "\n\n              Combine the scallions, bell pepper, olive oil, lime juice, garlic, thyme, allspice, ginger, brown sugar, chile pepper and 1 tablespoon salt in a food processor; pulse to make a thick sauce. Refrigerate 1/4 cup for serving.\n            \n\n              Season the hens all over with salt and pepper; poke a few holes into the bone side. Rub 1 cup of the jerk sauce all over the hens in a large bowl or pan. Cover and refrigerate for 2 to 4 hours.\n            \n\n              Preheat a grill to medium; prepare for direct and indirect grilling: On a charcoal grill, bank the coals on one side. For a gas grill, turn off one of the burners after preheating. Remove the hens from the marinade, letting any excess drip off; place skin-side up on the cooler side of the grill (position the legs closer to the fire). Cover and cook until the hens are golden brown, about 15 minutes.\n            \n\n              Baste the hens with any extra jerk sauce, then turn them over to the direct-heat side of the grill; cook, uncovered, until the skin is dark brown and the meat is cooked through but still moist, 5 to 10 more minutes. (A thermometer inserted into the thickest part should read 160 degrees.) Set the hens aside for 5 minutes, then serve with the reserved jerk sauce.\n            \n\n              Photography by Con Poulos\n            \n", "ingredients": [{"food": "", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "lime juice", "quantity": 0.25}, {"food": "garlic powder", "quantity": 6.0}, {"food": "thyme", "quantity": 2.0}, {"food": "allspice", "quantity": 1.0}, {"food": "ginger", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "seeds", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "pepper", "quantity": 1}], "title": "\nJerk Cornish Hens\n"}, {"directions": "\n\n              Mix 3/4 cup ketchup, 2 tablespoons jerk seasoning, 1 tablespoon pineapple or peach preserves and 1 tablespoon lime juice.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [], "title": "\nJerk Ketchup\n"}, {"directions": "\n\n              Rub 1 pound pork tenderloin with 1/4 cup jerk seasoning; grill, then chop. Top tortilla chips with the pork, 1 cup diced pineapple and 3 cups shredded pepper jack. Bake, then top with sliced fresh jalapenos, cilantro and lime juice.\n            \n\n              Photograph by Jonny Valiant\n            \n", "ingredients": [], "title": "\nJerk Pork Nachos\n"}, {"directions": "\n\n              Pulse the vinegar, rum, brown sugar, scallions, garlic, chile, Pickapeppa sauce, ginger, allspice, and pumpkin pie spice in a food processor to make a slightly chunky sauce. Heat the oil in a medium skillet, add the sauce, and cook, stirring, until the oil is absorbed and the sauce thickens slightly, about 3 minutes. Cool.\n            \n\n              Copyright © 2005 Television Food Network, G.P., All Rights Reserved\n            \n", "ingredients": [{"food": "vinegar", "quantity": 0.3333333333333333}, {"food": "", "quantity": 0.25}, {"food": "sugar", "quantity": 3.0}, {"food": "martha white foods", "quantity": 1.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "ginger", "quantity": 1.0}, {"food": "allspice", "quantity": 1.0}, {"food": "pumpkin pie spice", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 3.0}], "title": "\nJerk Sauce\n"}, {"directions": "\n\n              Prepare a grill for medium-high heat.\n            \n\n              Use your hands to gently combine the turkey, yogurt, scallion, garlic, jerk seasoning and 1/2 teaspoon of salt in a medium bowl. Form into four 3-inch patties about 1/2-inch thick. Chill for at least 30 minutes (this helps to keep the burgers from sticking to the grill).\n            \n\n              Combine the coleslaw mix, mayonnaise and vinegar in a small bowl. Cover and refrigerate until ready to use.\n            \n\n              Brush the sweet potatoes with the oil and sprinkle with a large pinch of salt. Lightly oil the grill grates. Arrange the sweet potato rounds on the grill, cover with the lid and cook until there are nice grill marks and the potatoes are tender but not mushy, 8 to 12 minutes per side. Remove and set aside to cool completely.\n            \n\n              Spray both sides of the turkey burgers with nonstick cooking spray and grill, covered, until the burgers have nice grill marks and an internal temperature of 165 degrees F, 8 to 12 minutes per side.\n            \n\n              Assemble the burgers: Spread 4 sweet potato rounds each with mango chutney. Top with the patties and 1/4 of the coleslaw and sandwich with the remaining sweet potato rounds.\n            \n", "ingredients": [{"food": "ground turkey", "quantity": 12.0}, {"food": "silk banana-strawberry soy yogurt", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "seasoning mix", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "cheesecake mix", "quantity": 2.0}, {"food": "mayonnaise dressing", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "", "quantity": 1}, {"food": "black bean mango", "quantity": 2.0}], "title": "\nJerk Turkey Burgers on Sweet Potato Rounds\n"}, {"directions": "\n\n              Preheat a grill or grill pan to medium high. Mix the turkey, jerk seasoning, apple, 1/4 cup scallions and the panko in a bowl; season with salt and pepper. Form into four 1-inch-thick patties and make a small indentation in the middle of each with your thumb to prevent it from puffing up on the grill. Refrigerate.\n            \n\n              Whisk the mayonnaise and chutney in a large bowl. Add the cabbage, carrot and the remaining 1/4 cup scallions, season with salt and pepper and toss to coat.\n            \n\n              Brush the grill with canola oil. Grill the turkey patties until browned and cooked through, 4 to 5 minutes per side.\n            \n\n              Brush the cut sides of the buns with mayonnaise and sprinkle with jerk seasoning; toast on the grill, about 30 seconds. Serve the burgers and slaw on the buns.\n            \n\n              Per serving: Calories 504; Fat 20 g (Saturated 3 g); Cholesterol 51 mg; Sodium 894 mg; Carbohydrate 51 g; Fiber 4 g; Protein 36 g \n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "ground turkey", "quantity": 1.0}, {"food": "seasoning mix", "quantity": 1.0}, {"food": "apple", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "mayonnaise dressing", "quantity": 0.25}, {"food": "black bean mango", "quantity": 0.25}, {"food": "swamp cabbage", "quantity": 3.0}, {"food": "carrot juice", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "pizza rolls", "quantity": 4.0}], "title": "\nJerk Turkey Burgers with Mango Slaw\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F and position an oven rack in the middle.\n            \n\n              Cut the carrots into 1-inch lengths. Cut any thick pieces in half lengthwise so that the carrot chunks are all about the same size. Gently toss the carrots, onion, garlic cloves, oil and jerk seasoning together on a large baking sheet. Place in the oven and bake until the largest vegetables are very tender and browned in parts, about 50 minutes, flipping once halfway through cooking. Remove from the oven and cool slightly. Discard any parts of the onion wedges that has become leathery and chewy after from roasting.\n            \n\n              Once cooled, remove the garlic cloves from their skins; place garlic in a food processor along with the carrots and onions, lime juice, coconut milk, salt and 2 tablespoons of water. Blend until smooth, scraping down the sides of the bowl as needed. Add additional water, 1 tablespoon at a time, until desired consistency is reached.\n            \n\n              Transfer the dip to a small serving bowl and garnish with lime zest. Serve with flatbread and vegetables.\n            \n", "ingredients": [{"food": "carrots", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "seasoning mix", "quantity": 1.0}, {"food": "grape juice", "quantity": 1.5}, {"food": "coconut milk", "quantity": 0.25}, {"food": "salt", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1}], "title": "\nJerk-Spiced Carrot Dip\n"}, {"directions": "\n\n              Peel 1 jicama (1 1/4 pounds) and cut into thin matchsticks. Cut 4 radishes into matchsticks. Whisk 3 tablespoons olive oil, 2 tablespoons lemon juice, 2 teaspoons agave syrup, 1/2 teaspoon kosher salt and a pinch of cayenne pepper in a large bowl. Add the jicama, radishes, 1 sliced scallion and 2 tablespoons each chopped cilantro and mint; toss. Season with salt.\n            \n\n              Photograph by Linda Xiao\n            \n", "ingredients": [], "title": "\nJicama Salad\n"}, {"directions": "\n\n              Peel a jicama; cut into sticks. Toss with lime juice and sprinkle with chopped cilantro, salt, sugar and chili powder.\n            \n", "ingredients": [], "title": "\nJicama Sticks\n"}, {"directions": "\n\n              Cut the jicama into chunks, and then pulse in the food processor until finely ground. Transfer to a large bowl.\n            \n\n              In the same processor carafe, pulse the parsley and mint until finely chopped. Add to the jicama along with the tomatoes, cucumbers, onions, 2 tablespoons of the oil, the lemon juice, 2 teaspoons salt and 3/4 teaspoon pepper.\n            \n\n              Stir together the remaining 2 tablespoons oil with the paprika, 1 teaspoon salt and 1/2 teaspoon pepper and rub all over chicken.\n            \n\n              Preheat a grill to medium-high heat.\n            \n\n              Grill the chicken, turning, until grill marks appear, about 4 minutes. Let the chicken rest 5 minutes.\n            \n\n              Serve, topped with the jicama tabbouleh.\n            \n", "ingredients": [{"food": "", "quantity": 1.75}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "tomatoes", "quantity": 2.0}, {"food": "cucumber", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 4.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "diced chicken", "quantity": 6.0}, {"food": "smoked turkey roll", "quantity": 1.5}], "title": "\nJicama Tabbouleh and Chicken Salad\n"}, {"directions": "\n\n              Combine 3 tablespoons each lime juice and finely chopped dates or currants and 2 tablespoons vegetable oil in a large bowl; let stand 10 minutes. Cut 1 medium carrot and 1 pound peeled jicama into matchsticks. Add the vegetables to the date mixture, season with salt and toss to coat. Stir in some torn mint.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nJicama-Carrot Slaw\n"}, {"directions": "\n\n              Toss julienned mango and jicama, red onion, radish and cilantro; add cumin, salt and cayenne. Drizzle with olive oil and lime juice.\n            \n\n              See all 50 Simple Salads\n            \n", "ingredients": [], "title": "\nJicama-Mango Slaw\n"}, {"directions": "\n\n              Peel and segment the oranges with a paring knife (see page 52). Squeeze the empty membranes over a large bowl to release the juices.\n            \n\n              Whisk the chili powder, salt and pepper to taste, the olive oil and lime juice into the orange juice. Toss in the orange segments and jicama. Before serving, add the scallions, cilantro and pomegranate seeds.\n            \n\n              Photograph by Sang An\n            \n", "ingredients": [{"food": "oranges", "quantity": 4.0}, {"food": "chili powder", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "", "quantity": 3.0}, {"food": "", "quantity": 2.0}, {"food": "", "quantity": 0.5}], "title": "\nJicama-Orange Salad\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Heat a grill to medium-high direct heat and lightly oil the grates using a paper towel soaked in canola oil or nonstick grilling cooking spray. \n            \n\n              Spread a 16-inch-long piece of nonstick aluminum foil on a cutting board (or mist a piece of regular aluminum foil with nonstick cooking spray). Top with the onions, 1/4 teaspoon each salt and pepper and 1 tablespoon water. Bring two sides of the foil together, fold over twice to create a seal and then seal the remaining two ends. Put on the grill and cook for 12 minutes, flipping once. The onions should be tender with only a bit of charring. Carefully open the top of the foil to let all the steam out and continue to cook the onions, tossing, until browned and lightly charred, 3 minutes longer. Remove from the heat. \n            \n\n              While the onions cook, mix the ketchup and mustard together in a small bowl. Season with pepper and set aside. \n            \n\n              Lightly toast the English muffins on the grill and place one top and bottom on each of 4 plates. Spread some of the ketchup sauce on the bottom half of each muffin and top with a slice of tomato. \n            \n\n              Divide the beef into 4 patties about 4 inches in diameter and just under 1/2-inch thick. Sprinkle with a total of 1/2 teaspoon salt and 1/4 teaspoon pepper. Place the burgers on the grill. Cook until the edges of the burgers are browning, 3 to 5 minutes, and then flip. Brush the burgers with the remaining ketchup sauce and evenly top with the shredded cheese. Cover the burgers with the grill lid or a large heatproof bowl and continue to cook until the cheese has melted and the burgers are still a bit pink on the inside, about 3 minutes more. \n            \n\n              Put one burger on top of the assembled muffin bottom and top with some of the grilled onions and the top of the muffin. Serve with pickles if desired.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1}, {"food": "onion powder", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "split pea soup", "quantity": 4.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "frankfurter beef", "quantity": 1.0}, {"food": "", "quantity": 2.0}, {"food": "", "quantity": 1}], "title": "\nJuicy Grilled Cheeseburgers\n"}, {"directions": "\n\n              Lightly mix 6 ounces ground beef chuck with a big pinch of kosher salt. Form into two equal balls, and then shape into two flat patties. Lay two slices American cheese between them and form the meat around the cheese; make an indentation in the center of the patty. Heat a cast-iron skillet over medium-high heat; sprinkle the skillet with salt. Cook the burger 4 to 5 minutes per side. Serve on a soft bun.\n            \n", "ingredients": [], "title": "\nJuicy Lucy\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Make the meatballs: Preheat the oven to 400 degrees F and brush a baking sheet with olive oil. Pulse the bread in a food processor to make coarse crumbs. Transfer to a small bowl, add the milk and set aside to soak. Lightly beat the eggs in a large bowl, then add the beef, parsley, parmesan, garlic, 1 teaspoon salt and the red pepper flakes; mix with your hands to combine. Add the bread-milk mixture and mix until just combined (do not overmix).\n            \n\n              Dampen your hands and shape the meat mixture into 4 large balls. Make an indentation in the center of each with your thumb and stuff with a mini mozzarella ball, then mold the meat around the cheese. Arrange the meatballs on the prepared baking sheet and bake until browned and firm, 25 to 30 minutes.\n            \n\n              Meanwhile, make the sauce: Heat the olive oil in a large deep skillet over medium-high heat. Add the garlic and red pepper flakes and cook, stirring, until the garlic softens, about 1 minute. Add the tomatoes, 1 cup water, the basil sprigs and 1/2 teaspoon salt. Bring to a boil, then reduce the heat to low and simmer until thickened, about 30 minutes.\n            \n\n              Remove the meatballs from the oven and add to the sauce, spooning some of the sauce on top. Continue cooking, occasionally spooning the sauce over the meatballs, until tender and cooked through, about 6 minutes. Serve with ricotta and chopped basil.\n            \n\n              You can form all of these meatballs a day ahead; cover and refrigerate until ready to cook.\n            \n\n              Photograph by Christina Holmes\n            \n", "ingredients": [{"food": "meatballs", "quantity": 1}, {"food": "vegetable oil", "quantity": 1}, {"food": "garlic bread", "quantity": 3.5}, {"food": "whole milk", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "frankfurter beef", "quantity": 2.0}, {"food": "parsley", "quantity": 1.0}, {"food": "parmesan cheese", "quantity": 0.5}, {"food": "garlic powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "melon balls", "quantity": 4.0}, {"food": "Worcestershire sauce", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.75}, {"food": "tomatoes", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 3.0}, {"food": "macaroni cheese", "quantity": 1}], "title": "\nJumbo Cheesy Italian Meatballs\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F. Line a baking sheet with parchment paper. Combine the buttermilk and vanilla in a small bowl and set aside.\n            \n\n              Put the flour, granulated sugar, baking powder, baking soda, orange zest, nutmeg, cinnamon and 1/2 teaspoon salt in a food processor and pulse until combined. Add the butter and continue to pulse until the mixture looks like fine meal.\n            \n\n              Add the pecans and pulse once. Add the buttermilk mixture and pulse 3 or 4 times, or until the mixture is just moistened. (Do not overmix or the scones will be tough.)\n            \n\n              Turn the dough out onto a lightly floured surface and gently knead until it just forms a ball. Transfer to the prepared baking sheet and pat into an 8-inch round, about 3/4 inch thick. (To make individual scones, cut into 8 wedges and space apart on the baking sheet.) Brush with buttermilk and bake until golden, about 25 minutes. Let cool 2 minutes on the baking sheet, then transfer to a rack to cool completely.\n            \n\n              Mix the confectioners' sugar, maple syrup and a pinch of salt in a small bowl until smooth. Drizzle over the scone. Cut into wedges.\n            \n\n              Photograph by Steve Giralt\n            \n", "ingredients": [{"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.75}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "potato flour", "quantity": 2.25}, {"food": "sugar", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "orange", "quantity": 0.5}, {"food": "nutmeg", "quantity": 0.25}, {"food": "cinnamon", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 12.0}, {"food": "", "quantity": 0.5}, {"food": "sugar", "quantity": 0.25}, {"food": "syrup", "quantity": 3.0}], "title": "\nJumbo Maple-Pecan Scone\n"}, {"directions": "\n\n              1. Heat grill to medium-high. Cut a deep slit shrimp, through shell, down ridged back and remove vein. Rinse and pat shrimp dry. Whisk thyme leaves, lime juice, 1 tablespoon of olive oil, 1/2 teaspoon of salt, and black pepper to taste in a shallow glass dish. Add shrimp and refrigerate for 30 minutes. \n            \n\n              2. Pulse garlic, jalapeno, scallions, remaining 1 tablespoon olive oil, and remaining 1/2 teaspoon salt in a food processor to a coarse paste. Add cilantro and pulse to incorporate. Spoon mixture into slit in shrimp and press to close opening. Lay shrimp on grill and cook for 3 minutes. Turn over, cover, and grill until shrimp turn pink and are slightly firm to touch, about 2 more minutes. Sprinkle with salt and serve.\n            \n", "ingredients": [{"food": "pasta with sliced franks in tomato sauce", "quantity": 8.0}, {"food": "chrysanthemum leaves", "quantity": 3.0}, {"food": "", "quantity": 2.25}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "garlic powder", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 0.5}, {"food": "martha white foods", "quantity": 2.0}, {"food": "", "quantity": 1.0}], "title": "\nJumbo Shrimp Stuffed with Cilantro & Chiles\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Prepare an outdoor grill with a medium-high fire. Without removing the shells, slit about 3/4 of the way through the shrimp down the ridged back and remove the vein that runs down the center. Rinse and pat the shrimp dry. Whisk thyme leaves, lime juice, 1 tablespoon of the olive oil, 1/2 teaspoon of the salt and black pepper, to taste, in a shallow nonreactive bowl or dish. Lay the shrimp cut side down in the lime mixture and refrigerate for 30 minutes.\n            \n\n              In a food processor, pulse the garlic, jalapeno, scallions, remaining 1 tablespoon olive oil and remaining 1/2 teaspoon salt to make a coarse paste. Add the cilantro and pulse just enough to incorporate into the mixture. Spoon the mixture into the opening in the shrimp and close the shrimp. Grill the shrimp shell side down (to keep filling from falling out) for 3 minutes. Turn to the other shell side, cover, and grill another 2 minutes or until the shrimp turn pink and are slightly firm to the touch. Sprinkle with salt and serve.\n            \n\n              Jumbo shrimp in the shell can be a knife and fork sort of deal unless you're outside and it's summer and you are feeling very relaxed. Serve these with lots of napkins if your crowd is the peel-and-eat type.\n            \n", "ingredients": [{"food": "pasta with sliced franks in tomato sauce", "quantity": 8.0}, {"food": "chrysanthemum leaves", "quantity": 3.0}, {"food": "", "quantity": 2.25}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "seasoning mix", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "garlic powder", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 0.5}, {"food": "martha white foods", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}], "title": "\nJumbo Shrimp Stuffed with Cilantro and Chiles\n"}, {"directions": "\n\n              Unwrap the turkey and remove the neck and giblets (reserve for gravy). Rinse the turkey under cold water and pat dry. Fill a large pot with 2 quarts water; add 2 cups kosher salt, the brown sugar, juniper berries, peppercorns, bay leaves and lemon zest. Bring to a boil, then simmer 10 minutes. Add 6 quarts cold water and let cool. Submerge the turkey in the brine, adding water to cover, if necessary. Refrigerate at least 8 hours or overnight.\n            \n\n              Remove the turkey from the brine; rinse and pat dry. Mix the butter, scallions, ginger, garlic, sesame oil and soy sauce until combined. Reserve 4 tablespoons of the butter, then rub the rest under the turkey skin on the breasts and legs. Rub 2 tablespoons of the reserved butter on the skin; chill and save the rest for your gravy. Let the turkey stand 30 minutes at room temperature before roasting.\n            \n\n              Put the oven rack in the lowest position; preheat the oven to 350 degrees F. Put the turkey breast-side up on a rack in a large roasting pan, tucking the wing tips under. Tie the drumsticks together with twine. Roast until the skin is golden brown and a thermometer inserted into the thigh registers 165 degrees F, about 15 minutes per pound. Transfer to a cutting board and let rest 30 minutes before carving. Whisk the reserved 2 tablespoons flavored butter into your gravy just before serving, if desired.\n            \n\n              Photograph by Yunhee Kim\n            \n", "ingredients": [{"food": "frozen yogurt", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "sugar", "quantity": 1.5}, {"food": "goji berries", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "", "quantity": 4.0}, {"food": "ginger", "quantity": 1.5}, {"food": "garlic powder", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "soy sauce", "quantity": 1.0}], "title": "\nJuniper Brined Turkey With Asian Ginger Butter\n"}, {"directions": "\n\n              Unwrap the turkey and remove the neck and giblets (reserve for gravy). Rinse the turkey under cold water and pat dry. Fill a large pot with 2 quarts water; add 2 cups kosher salt, the brown sugar, juniper berries, peppercorns, bay leaves and lemon zest. Bring to a boil, then simmer 10 minutes. Add 6 quarts cold water and let cool. Submerge the turkey in the brine, adding water to cover, if necessary. Refrigerate at least 8 hours or overnight.\n            \n\n              Remove the turkey from the brine; rinse and pat dry. Crush and chop the coriander seeds, cumin seeds and garlic. Mix with the paprika and butter until combined. Reserve 4 tablespoons of the butter, then rub the rest under the turkey skin on the breasts and legs. Rub 2 tablespoons of the reserved butter on the skin; chill and save the rest for your gravy. Let the turkey stand 30 minutes at room temperature before roasting.\n            \n\n              Put the oven rack in the lowest position; preheat the oven to 350 degrees F. Put the turkey breast-side up on a rack in a large roasting pan, tucking the wing tips under. Tie the drumsticks together with twine. Roast until the skin is golden brown and a thermometer inserted into the thigh registers 165 degrees F, about 15 minutes per pound. Transfer to a cutting board and let rest 30 minutes before carving. Whisk the reserved 2 tablespoons flavored butter into your gravy just before serving, if desired.\n            \n\n              Photograph by Yunhee Kim\n            \n", "ingredients": [{"food": "frozen yogurt", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "sugar", "quantity": 1.5}, {"food": "goji berries", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "seeds", "quantity": 2.0}, {"food": "seeds", "quantity": 2.0}, {"food": "garlic powder", "quantity": 6.0}, {"food": "paprika", "quantity": 1.0}, {"food": "butter oil", "quantity": 2.0}], "title": "\nJuniper Brined Turkey With Paprika Butter\n"}, {"directions": "\nSpecial equipment: an 8-ounce lidded heat-safe container\n\n              Put the grits, coconut milk, cherries, pistachios, brown sugar, cardamom and ginger in the container. Secure the lid, and refrigerate up to overnight.\n            \n\n              When ready to eat, add 1/2 cup boiling water, stir gently and cover until the grits are tender and creamy and the cherries have plumped up, about 2 minutes. Stir again, and eat warm.\n            \n", "ingredients": [{"food": "", "quantity": 0.3333333333333333}, {"food": "coconut milk", "quantity": 2.0}, {"food": "maraschino cherries", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "sugar", "quantity": 1.5}, {"food": "ground turkey", "quantity": 1}, {"food": "ginger", "quantity": 1}], "title": "\nJust-Add-Water Instant Grits with Coconut and Cherries\n"}, {"directions": "\nSpecial equipment: an 8-ounce lidded heat-safe container\n\n              Put the oatmeal, apple rings, apple butter, raisins, butter, brown sugar, cinnamon and a pinch of salt in an 8-ounce lidded heat-safe container. Secure the lid, and refrigerate up to overnight.\n            \n\n              When ready to eat, add 1/2 cup boiling water, stir gently and cover until the oats are tender and the apple rings have softened, about 3 minutes. Stir again, and eat warm.\n            \n", "ingredients": [{"food": "", "quantity": 0.3333333333333333}, {"food": "apple", "quantity": 2.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "raisins", "quantity": 1.0}, {"food": "butter oil", "quantity": 0.5}, {"food": "sugar", "quantity": 1.0}, {"food": "cinnamon", "quantity": 0.125}, {"food": "salt", "quantity": 1}], "title": "\nJust-Add-Water Instant Oatmeal with Apples and Cinnamon\n"}, {"directions": "\nSpecial equipment: a lidded 16-ounce heat-safe container\n\n              Put the beef, soy sauce, sesame oil and sugar in the bottom of a lidded 16-ounce heat-safe container, and mix. Add in layers, in this order from the bottom up, kimchi and juice, beef base, noodles, bean sprouts, scallions and sesame seeds. Secure the lid, and refrigerate until using, up to overnight.\n            \n\n              When ready to eat, add boiling water to cover (about 1 cup). Stir gently to loosen the layers, cover and let sit until heated through, 3 to 4 minutes. Before eating, stir again to combine the ingredients.\n            \n", "ingredients": [{"food": "roast beef", "quantity": 2.0}, {"food": "soy sauce", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "sugar", "quantity": 0.25}, {"food": "grape juice", "quantity": 0.3333333333333333}, {"food": "frankfurter beef", "quantity": 0.5}, {"food": "noodles", "quantity": 3.5}, {"food": "brussels sprouts", "quantity": 0.25}, {"food": "turnip greens", "quantity": 1.0}, {"food": "sesame seeds", "quantity": 0.25}], "title": "\nJust-Add-Water Kimchi Beef Noodle Soup\n"}, {"directions": "\nSpecial equipment: a 16-ounce lidded heat-safe container\n\n              Put the salsa verde, chicken base and cumin in the bottom of a 16-ounce lidded heat-safe container. Top with the chicken, hominy, beans, coleslaw mix, radishes if using and cilantro. Sprinkle the tortilla chips on top. Secure the lid, and refrigerate up to overnight.\n            \n\n              When ready to eat, add 1 cup boiling water, and stir just to allow the water to reach the bottom of the container. Cover, and let sit 3 minutes. Stir again, and eat hot.\n            \n", "ingredients": [{"food": "", "quantity": 0.25}, {"food": "diced chicken", "quantity": 0.5}, {"food": "cumin seed", "quantity": 2.0}, {"food": "diced chicken", "quantity": 0.3333333333333333}, {"food": "hominy", "quantity": 0.25}, {"food": "fava beans", "quantity": 0.25}, {"food": "cheesecake mix", "quantity": 0.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "tortilla", "quantity": 2.0}], "title": "\nJust-Add-Water Mexican Chicken and Hominy Soup\n"}, {"directions": "\nSpecial equipment: a lidded 16-ounce heat-safe container\n\n              Add the miso, chicken base, chili-garlic sauce and ginger to the bottom of a lidded 16-ounce heat-safe container. Top with the rice vermicelli, chicken, mushrooms, peas and scallions. Secure the lid, and refrigerate until using, up to overnight.\n            \n\n              When ready to eat, add 1 1/4 cups boiling water to the container, cover and let sit until the noodles soften, about 7 minutes. Uncover, and stir again to dissolve the miso.\n            \n", "ingredients": [{"food": "miso", "quantity": 1.0}, {"food": "diced chicken", "quantity": 0.5}, {"food": "Worcestershire sauce", "quantity": 0.5}, {"food": "ginger", "quantity": 0.125}, {"food": "rice & vermicelli mix", "quantity": 1}, {"food": "diced chicken", "quantity": 0.3333333333333333}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "pigeon peas", "quantity": 6.0}, {"food": "turnip greens", "quantity": 1.0}], "title": "\nJust-Add-Water Miso Chicken Noodle Soup\n"}, {"directions": "\nSpecial equipment: a lidded 16-ounce heat-safe container\n\n              Put the rice, corn, peas, shrimp, chorizo, red pepper, tomato paste, chicken base, paprika and heaping 1/4 teaspoon salt in the container. Secure the lid, and refrigerate until using, up to overnight.\n            \n\n              When ready to eat, add boiling water to cover (about 1 cup). Stir gently, cover and let sit until the vegetables and shrimp are warmed through, 3 to 4 minutes.\n            \n", "ingredients": [{"food": "crisped rice bar", "quantity": 0.5}, {"food": "corn bran", "quantity": 2.0}, {"food": "pigeon peas", "quantity": 2.0}, {"food": "shrimp", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 2.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "diced chicken", "quantity": 0.5}, {"food": "smoked turkey roll", "quantity": 0.25}, {"food": "salt", "quantity": 1}], "title": "\nJust-Add-Water Shrimp Paella Soup\n"}, {"directions": "\nSpecial equipment: a 16-ounce lidded heat-safe container\n\n              Pour the couscous into the bottom of a 16-ounce lidded heat-safe container, and top with the chickpeas, tomatoes, olives, carrots, cilantro, butter, curry powder, a heaping 1/4 teaspoon salt and harissa if using. Put the lemon wedge on top. Secure the lid, and refrigerate up to overnight.\n            \n\n              When ready to eat, remove the lemon wedge and set aside. Add 1/2 cup boiling water to the container, and stir just to allow the water to reach the bottom. Cover, and let sit until the couscous absorbs all the liquid, about 6 minutes. Uncover, squeeze the lemon wedge over the couscous and stir again. Eat hot.\n            \n", "ingredients": [{"food": "couscous", "quantity": 0.3333333333333333}, {"food": "chickpeas", "quantity": 0.25}, {"food": "grape juice", "quantity": 6.0}, {"food": "olives", "quantity": 3.0}, {"food": "carrot juice", "quantity": 2.3333333333333335}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "curry powder", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 0.5}, {"food": "lemon juice", "quantity": 1.0}], "title": "\nJust-Add-Water Vegetarian Curried Couscous\n"}]