[{"directions": "\n\n              Toppings: Pulled pork, barbecue sauce and sliced scallions on cheesy skins\n            \n\n              How to Make Classic Potato Skins:\n            \n\n              Pierce 4 large russet potatoes with a fork. Bake directly on the oven rack at 350 degrees until tender, about 1 hour. Let cool, then quarter lengthwise and scoop out the flesh, leaving a 1/4-inch shell. Brush both sides with melted butter and season with salt and pepper. Bake, skin-side up, at 450 degrees until crisp, about 15 minutes. Add your favorite team toppings. (For cheesy skins, flip the baked shells over before topping, sprinkle with 1 cup grated cheddar cheese and bake an extra 5 minutes.)\n            \n\n              Photograph by Karl Juengel/Studio D\n            \n", "ingredients": [], "title": "\nKC BBQ Potato Skins\n"}, {"directions": "\n\n              Peel and roughly chop 1 large kabocha squash (about 3 pounds), discarding the seeds. Cook in boiling salted water until soft, about 20 minutes; reserve 1/2 cup of the cooking liquid, then drain. Puree the squash and the reserved liquid with 1/4 cup heavy cream; season with salt and pepper. Top with toasted pepitas.\n            \n\n              Use a food processor or immersion blender to puree these veggies-they're too fibrous for a potato masher.\n            \n\n              Photograph by Sam Kaplan\n            \n", "ingredients": [], "title": "\nKabocha Squash Mash\n"}, {"directions": "\n\n              In a food processor, combine all the ingredients except the cherry tomatoes. Pulse until all ingredients are well combined. Season with freshly ground black pepper. Slice cherry tomatoes in half. Very gently, with a melon baller, scoop out the seeds from each half. Place a teaspoonful of the tapenade in each tomato half. Garnish with chervil.\n            \n", "ingredients": [{"food": "olives", "quantity": 2.0}, {"food": "capers", "quantity": 2.0}, {"food": "anchovy", "quantity": 3.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "garlic powder", "quantity": 2.0}, {"food": "thyme", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "silk black cherry soy yogurt", "quantity": 1.0}, {"food": "chervil", "quantity": 1}], "title": "\nKalamata Olive Tapenade\n"}, {"directions": "\n\n              Puree 1/3 cup olive oil, 1 garlic clove, 2 anchovy fillets, 1 teaspoon Worcestershire sauce, and salt and pepper to taste in a blender. Toss 1 1/2 cups crusty bread cubes with 1 tablespoon of the dressing; broil on a baking sheet until toasted, about 2 minutes. Toss 1 1/4 pounds chopped kale with the remaining dressing; broil on another baking sheet, stirring, until crisp, 5 to 8 minutes. Put the kale and croutons in a bowl and top with lemon juice, grated parmesan and a chopped hard-boiled egg.\n            \n", "ingredients": [], "title": "\nKale Caesar Salad\n"}, {"directions": "\n\n              Tear the leaves off 1 bunch kale. Toss on a rimmed baking sheet with 2 tablespoons olive oil, 2 sliced garlic cloves, and salt and pepper. Roast in a 425 degrees F oven until crisp, about 15 minutes, stirring halfway through. Squeeze some lemon juice on top.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [], "title": "\nKale Chips\n"}, {"directions": "\n\n              Juice, in this order, the tomatoes and parsley (together), celery, kale and lemon, following your juicer's specific settings for each. Stir in the vodka, celery salt and a few grinds of pepper. Serve immediately over ice in a tall glass. Garnish with a celery stalk.\n            \n", "ingredients": [{"food": "plum", "quantity": 3.0}, {"food": "parsley", "quantity": 1.0}, {"food": "celery seed", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 3.0}, {"food": "lemon peel", "quantity": 0.5}, {"food": "", "quantity": 2.0}, {"food": "celery seed", "quantity": 0.25}, {"food": "black bean mango", "quantity": 1}], "title": "\nKale Mary\n"}, {"directions": "\n\n              Put the pine nuts in to a small skillet and place over medium heat. Cook, stirring often, until the nuts are toasted and fragrant, about 5 minutes. Remove from the heat and cool completely. Reserve 1 teaspoon of the nuts for garnish and place the rest in a food processor. Add the kale, basil and garlic to the food processor and pulse until finely chopped. Add the olive oil, lemon juice, nutritional yeast and salt and blend until well combined. Add the cannellini beans and blend until smooth, scraping down the sides of the bowl as needed.\n            \n\n              Transfer the dip to a small serving bowl and garnish with the basil sprig and toasted pine nuts. Serve with baguette and vegetables.\n            \n", "ingredients": [{"food": "pine nuts", "quantity": 0.25}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "garlic powder", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "yeast extract spread", "quantity": 0.25}, {"food": "salt", "quantity": 1.0}, {"food": "fava beans", "quantity": 15.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1}], "title": "\nKale Pesto and White Bean Dip\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Whisk together the lemon juice, olive oil and 1/4 teaspoon salt in a large bowl. Add the kale, toss to coat and let stand 10 minutes. \n            \n\n              While the kale stands, cut the dates into thin slivers and the apple into thin matchsticks. Add the dates, apples, almonds and cheese to the kale. Season with salt and pepper and toss well.\n            \n", "ingredients": [{"food": "lemon juice", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "dates", "quantity": 0.25}, {"food": "apple", "quantity": 1.0}, {"food": "almonds", "quantity": 0.25}, {"food": "", "quantity": 1.25}, {"food": "black bean mango", "quantity": 1}], "title": "\nKale and Apple Salad\n"}, {"directions": "\n\n              Preheat the oven to 450 degrees F. Combine the kale, artichoke hearts, 1/2 cup of the Swiss cheese, the milk, all but 1 tablespoon of the Parmesan, the cream cheese, Worcestershire, cayenne, 1/2 teaspoon salt and the garlic in a medium bowl. Transfer to a 1-quart baking dish and sprinkle with the remaining 1/4 cup Swiss cheese and 1 tablespoon Parmesan. Bake until bubbly and lightly golden, 20 to 25 minutes. Let set for 5 minutes and serve with tortilla chips.\n            \n", "ingredients": [{"food": "frozen yogurt", "quantity": 1.5}, {"food": "artichoke hearts", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 0.75}, {"food": "milk", "quantity": 0.75}, {"food": "", "quantity": 0.3333333333333333}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "Worcestershire sauce", "quantity": 0.5}, {"food": "pepper", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "garlic powder", "quantity": 1.0}, {"food": "corn bran", "quantity": 1}], "title": "\nKale and Artichoke Dip\n"}, {"directions": "\n\n              1. Toast the pumpkin seeds in a medium skillet over medium-high heat, watching carefully, stirring until light brown, about 5 minutes.\n            \n\n              2. Combine the kale, feta, and onions in a large bowl. Toss with the olive oil, lemon zest, lemon juice, and season with salt and pepper. Scatter the pumpkin seeds over the top and serve.\n            \n", "ingredients": [{"food": "pumpkin flowers", "quantity": 0.5}, {"food": "black bean mango", "quantity": 2.0}, {"food": "", "quantity": 8.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "grape juice", "quantity": 1.0}, {"food": "pepper", "quantity": 1}], "title": "\nKale and Feta Salad\n"}, {"directions": "\n\n              Chop 1/2 large bunch kale; toss with 1 tablespoon each olive oil and white wine vinegar, and 1/4 teaspoon kosher salt in a large bowl, then rub with your fingers until softened. Cook 1/2 cup chopped pecans in a skillet with 1 tablespoon olive oil and 1/4 teaspoon each sugar and salt until toasted. Stir in 1 chopped pear; add to the kale. Drizzle with more oil and vinegar, season with salt and pepper and toss.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [], "title": "\nKale and Pear Salad\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Spread the pecans out on a baking sheet and bake, tossing once, until very golden brown, 8 to 10 minutes. Let cool and very finely chop.\n            \n\n              Meanwhile, whisk together 1/3 cup vinegar, 1/2 teaspoon honey and a large pinch of salt in a small bowl. Add the shallots and let sit at room temperature, tossing occasionally, until the shallots turn bright pink and are slightly pickled, about 10 minutes. Remove the shallots and set aside (discard the liquid).\n            \n\n              Whisk together the remaining 1/3 cup vinegar, Dijon mustard, remaining 1 teaspoon honey, 1/2 teaspoon salt and a few grinds of black pepper in a medium bowl. Slowly drizzle in the oil, whisking constantly, until the mixture is blended. Stir in the toasted pecans.\n            \n\n              Combine the kale, pickled shallots, persimmons and Gorgonzola in a large bowl. Add the vinaigrette and toss to combine. Season with salt and pepper to taste.\n            \n", "ingredients": [{"food": "", "quantity": 0.5}, {"food": "vinegar", "quantity": 0.6666666666666666}, {"food": "honey smoked ham", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "mustard spinach", "quantity": 1.5}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "kale", "quantity": 10.0}, {"food": "persimmons", "quantity": 3.0}, {"food": "", "quantity": 0.5}], "title": "\nKale and Persimmon Salad with Pecan Vinaigrette\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Bring a large pot of salted water to a boil. Fill a large bowl with ice and water. Add the kale to the boiling water and cook, stirring, until just wilted but still bright green, about 2 minutes. With a slotted spoon, transfer the kale to the ice water (keep the water boiling). When cool, drain well and squeeze out as much water as possible. Coarsely chop the kale.\n            \n\n              Add the pasta to the boiling water and cook according to the package directions. Reserve 1/2 cup of the pasta water, and then drain the pasta.\n            \n\n              While the pasta cooks, pulse the pistachios and garlic in a food processor until finely chopped. Add the kale and parsley and pulse until very finely chopped. With the machine running, add the oil in a steady stream. Add the Parmesan, lemon juice and 1/2 teaspoon each salt and pepper and pulse to incorporate.\n            \n\n              Toss the pasta with the pesto, adding a few spoonfuls of the reserved cooking water if it seems dry. Season to taste with salt and pepper. Serve with lemon wedges on the side.\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "whole milk", "quantity": 10.0}, {"food": "", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nKale and Pistachio Pesto Spaghetti\n"}, {"directions": "\n\n              Toast the millet in a dry medium saucepan over medium heat, stirring occasionally, 3 to 5 minutes. Add 1 cup water and bring to a boil. Cover, reduce the heat to medium low and cook until the water is absorbed, about 15 minutes. Set aside.\n            \n\n              Meanwhile, pat the tofu dry between paper towels. Heat 3 tablespoons olive oil in a large nonstick skillet over medium heat. Add the tofu and cook, turning once, until well browned and slightly crisp, about 15 minutes.\n            \n\n              While the tofu is cooking, remove the kale stems and chop the leaves into bite-size pieces; place in a large bowl. Add 1 tablespoon of the lemon juice and rub it into the kale with your fingers until the kale softens, 3 to 5 minutes.\n            \n\n              Whisk the remaining lemon juice with the tahini and honey in a small bowl; add the remaining 2 tablespoons olive oil and whisk until smooth. Whisk in 2 tablespoons water and season with salt and pepper. Add 2 tablespoons dressing to the kale; add the cabbage, onion and a pinch of salt and toss well.\n            \n\n              Fluff the millet with a fork and add to the kale mixture along with the sunflower seeds and sesame seeds; toss to combine. Divide the salad among bowls and top with the tofu. Drizzle with any oil from the skillet and the remaining dressing.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "millet", "quantity": 0.5}, {"food": "soft tofu", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 5.0}, {"food": "kale", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 3.0}, {"food": "honey smoked ham", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "swamp cabbage", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "sunflower seed kernels", "quantity": 2.0}, {"food": "sesame seeds", "quantity": 1.0}], "title": "\nKale and Tofu Salad\n"}, {"directions": "\n\n              For the Hollandaise sauce: \n            \n\n              Combine the mayonnaise, 1 tablespoon warm water, mustard, lemon juice and cayenne pepper in a blender and process until combined. Scrape out and set aside. \n            \n\n              For the eggs Benedict: \n            \n\n              Fill a wide pot with about 3 inches of water. And the vinegar and bring to a low simmer. \n            \n\n              Heat the oil in a large nonstick skillet. Add the Canadian bacon and shallots and cook, stirring frequently, until golden, about 4 minutes. Add the kale, remove from the heat and stir until the kale wilts, about 2 minutes. Season with pepper. Set aside and keep warm. \n            \n\n              Toast each English muffin in a toaster oven or under a broiler until lightly golden, about 5 minutes. Top each with a tomato slice and toast until the tomato is just slightly warm, about 1 minute. Top each muffin with the Canadian bacon-kale mixture. Crack each egg into a mug and slip into the simmering water. Cook until the whites are at desired doneness, 3 to 5 minutes. Remove with a slotted spoon and place on each Benedict. Drizzle with Hollandaise and serve. \n            \n", "ingredients": [{"food": "silk light vanilla", "quantity": 2.0}, {"food": "rye grain", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "vinegar", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "bacon", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "mustard spinach", "quantity": 8.0}, {"food": "black bean mango", "quantity": 1}, {"food": "split pea soup", "quantity": 2.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "eggs", "quantity": 4.0}], "title": "\nKale and Tomato Eggs Benedict\n"}, {"directions": "\n\n              For the sauce: Combine the mayonnaise, mustard, 1 tablespoon warm water, lemon juice and cayenne pepper in a blender and process until combined. Scrape out and set aside.\n            \n\n              For the eggs: Fill a wide pot with about 3 inches of water. And the vinegar and bring to a low simmer.\n            \n\n              Meanwhile, heat the oil in a large nonstick skillet. Add the Canadian bacon and shallots and cook, stirring frequently, until golden, about 4 minutes. Add the kale, remove from the heat and stir until the kale wilts, about 2 minutes. Season with pepper. Set aside and keep warm.\n            \n\n              Toast the English muffins in a toaster oven or under a broiler until lightly golden, about 5 minutes. Top each with a tomato slice and toast until the tomato is just slightly warm, about 1 minute. Top each tomato slice with the Canadian bacon-kale mixture.\n            \n\n              Crack each egg into a separate mug or bowl, and slip them one at a time into the simmering water. Cook until the whites are at desired doneness, 3 to 5 minutes. Remove with a slotted spoon and place on each English muffin. Drizzle with the hollandaise. Serve each with 1/2 cup of berries and a glass of milk.\n            \n", "ingredients": [{"food": "silk light vanilla", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "vinegar", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "bacon", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "mustard spinach", "quantity": 8.0}, {"food": "black bean mango", "quantity": 1}, {"food": "split pea soup", "quantity": 2.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "eggs", "quantity": 4.0}, {"food": "silk raspberry soy yogurt", "quantity": 2.0}, {"food": "milk", "quantity": 6.0}], "title": "\nKale and Tomato Eggs Benedict with Berries\n"}, {"directions": "\n\n              Put the bacon in a small stock pot. Turn the heat to medium and cook, stirring it occasionally, until crisp and browned but not dry, about 7 minutes. While the bacon cooks, halve and thinly slice the red onion.\n            \n\n              Add the onion to the bacon and the drippings. Cook, stirring and scraping the browned bits from the bottom of the pot, until softened, about 4 minutes. Add the beans, their liquid and a half can of water to the pot, along with a generous grind of black pepper, and bring to a boil. Cover, reduce the heat to low, and simmer 15 minutes to bring all the flavors together.\n            \n\n              While the beans simmer, remove the thick stems from the kale and cut or tear into bite-size pieces. Stir and fold it into the beans. Then cover and cook until the kale is as crisp or tender as you like, 5 to 10 more minutes. Taste, then add more black pepper, if desired. Remove from the heat, and stir in 1 tablespoon of the cider vinegar and serve immediately. Pass around the cider vinegar to drizzle on the finished dish.\n            \n", "ingredients": [{"food": "bacon", "quantity": 4.5}, {"food": "onion powder", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 15.0}, {"food": "black bean mango", "quantity": 1}, {"food": "kale", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}], "title": "\nKale, Black-Eyed Pea and Bacon Stew\n"}, {"directions": "\nSpecial equipment: four 3- to 4-ounce ice pop molds\n\n              Combine the banana, kale, yogurt, maple syrup, orange and lemon juices and ginger in a blender and puree until smooth.\n            \n\n              Divide the mixture evenly among four 3- to 4-ounce ice pop molds. Freeze until solid, at least 8 hours and preferably overnight. Let sit at room temperature for a few minutes before unmolding.\n            \n\n              The pops will keep in the freezer for up to 2 weeks.\n            \n", "ingredients": [{"food": "pineapple chunks", "quantity": 1.0}, {"food": "kale", "quantity": 2.0}, {"food": "silk plain soy yogurt", "quantity": 0.5}, {"food": "syrup", "quantity": 0.25}, {"food": "oranges", "quantity": 2.0}, {"food": "", "quantity": 0.5}, {"food": "ginger", "quantity": 0.5}], "title": "\nKale-Banana Breakfast Pops\n"}, {"directions": "\n\n              Cook the bacon in a large Dutch oven or pot over medium-high heat, stirring occasionally, until crisp, about 5 minutes. Remove with a slotted spoon and drain on paper towels.\n            \n\n              Add the potatoes and leek to the drippings in the pot and cook, stirring, until the leek is slightly softened, about 3 minutes. Add the garlic, herbs, 1/4 teaspoon salt and a few grinds of pepper. Cook, stirring occasionally, until the vegetables are slightly browned, about 2 minutes. Add the chicken broth and 4 cups water and bring to a simmer; cover and cook 15 minutes. Add about three-quarters of the kale; continue cooking, covered, until wilted, about 5 minutes. Stir in the Worcestershire sauce.\n            \n\n              Meanwhile, preheat the broiler. Toss the remaining kale with the olive oil on a baking sheet; season with salt and pepper. Broil until crisp, about 3 minutes.\n            \n\n              Thin the sour cream with a splash of water. Working in 3 to 4 batches, puree the soup in a blender until smooth; reheat if needed. Serve topped with the sour cream, kale chips, bacon and almonds.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [{"food": "bacon", "quantity": 3.0}, {"food": "sweet potatoes", "quantity": 1.75}, {"food": "silk light vanilla", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "rosemary", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 4.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "sour cream", "quantity": 1.0}, {"food": "smoked turkey roll", "quantity": 2.0}], "title": "\nKale-Potato Soup with Bacon\n"}, {"directions": "\n\n              Bring the soy sauce, maple syrup, red pepper flakes, 1/4 cup lemon juice and 1 cup water to a boil in a wide saucepan. Add the chicken in a single layer; reduce the heat to medium low. Cover and simmer, turning occasionally, until just cooked through, 10 to 15 minutes. Remove the chicken to a plate (reserve the liquid). Let cool, then shred.\n            \n\n              Peel the sweet potatoes and cut into 1/2-inch cubes. Add to the liquid in the saucepan; cook over medium heat, stirring occasionally, until just tender, about 15 minutes. Transfer to a plate with a slotted spoon (reserve the liquid). Let the potatoes and liquid cool.\n            \n\n              Cut the apples into matchsticks. Peel the cucumber, cut in half lengthwise and thinly slice. Combine the apples, cucumber, kale, sesame seeds, chicken, sweet potatoes and sesame oil in a large bowl. Toss with the reserved cooking liquid and the remaining 2 tablespoons lemon juice. Season with salt and pepper; sprinkle with the peanuts.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "soy sauce", "quantity": 3.0}, {"food": "syrup", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "lemon juice", "quantity": 0.25}, {"food": "diced chicken", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 1.5}, {"food": "apples", "quantity": 2.0}, {"food": "cucumber", "quantity": 1.0}, {"food": "kale", "quantity": 1.0}, {"food": "sesame seeds", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "peanuts", "quantity": 1.0}], "title": "\nKale-Sesame Chicken Salad\n"}, {"directions": "\n\n              Toss one 5-ounce package baby kale, 2 cups quartered strawberries, 1 sliced endive and 1/4 cup salted roasted sunflower seeds in a large bowl. Blend 1/4 cup buttermilk, 3 tablespoons each sour cream, mayonnaise and chopped chives, 1 tablespoon white wine vinegar and a pinch each of salt and pepper in a blender. Toss with the salad.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [], "title": "\nKale-Strawberry Salad\n"}, {"directions": "\n\n              Soak the red onion in a small bowl of ice water, 10 minutes. Meanwhile, combine the kale, 1 tablespoon vinegar and a pinch of salt in a large bowl. Toss and rub with your fingers until the kale is dark green and softened, 3 to 5 minutes.\n            \n\n              Whisk the mayonnaise, buttermilk, garlic, dill and the remaining 1 tablespoon vinegar in a small bowl until smooth; season with salt and pepper. Drain the red onion, pat dry and add to the bowl with the kale; add the turkey, apple and half of the sunflower seeds. Drizzle with about three-quarters of the dressing and toss to coat; season with salt and pepper. Top with the remaining dressing, sunflower seeds and the avocado.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "onion powder", "quantity": 0.5}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "vinegar", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "mayonnaise dressing", "quantity": 0.5}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.3333333333333333}, {"food": "garlic powder", "quantity": 1.0}, {"food": "dill seed", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "smoked turkey roll", "quantity": 1.0}, {"food": "apple", "quantity": 1.0}, {"food": "sunflower seed kernels", "quantity": 0.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}], "title": "\nKale-Turkey Chopped Salad\n"}, {"directions": "\n\n              Puree all but 3 tablespoons cilantro with 1/2 cup water, the jalapeno, almonds and 1/4 teaspoon salt in a blender until smooth.\n            \n\n              Heat the vegetable oil in a large pot or Dutch oven over medium-high heat. Add the turkey and 1/2 teaspoon salt; cook, stirring and breaking up the meat with a wooden spoon, until browned, about 4 minutes.\n            \n\n              Add the onion, garlic and cumin and cook, stirring occasionally, until softened, about 6 minutes. Stir in 1 1/2 cups water, the pureed cilantro mixture, the potatoes and kale. Cover and bring to a boil, then uncover and reduce the heat to medium. Simmer, stirring occasionally, until the potatoes are tender, about 15 minutes. Season with salt and serve over the rice. Top with the reserved cilantro.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [{"food": "", "quantity": 1.0}, {"food": "seeds", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "ground turkey", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "cumin seed", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 1.0}, {"food": "kale", "quantity": 1.0}, {"food": "crisped rice bar", "quantity": 2.5}], "title": "\nKale-Turkey Rice Bowl\n"}, {"directions": "\n\n              1. Preheat a grill with high, medium high, and medium zones. Lightly oil grates.\n            \n\n              2. Season chicken with salt and black pepper, to taste and place it skin-side down on grate on high heat. Cook until skin is crisp, turning once, about 5 minutes. Dip each piece of chicken in sauce, shake off excess, and return to grill-dark meat pieces over medium high and white meat over medium heat. Cook, covered, basting once more, until glazed and an instant-read thermometer inserted in thickest part of each piece of chicken registers 170degreesF, about 25 to 30 minutes.\n            \n\nKansas City-Style BBQ Sauce:\n\n\n              1. Heat the oil in a medium saucepan over medium heat. Stir in the garlic, tomato paste, chili powder, paprika, red pepper flakes, allspice, and cloves and cook, stirring, until paste is dark brick red, about 3 minutes. Add the ketchup, water, vinegar, molasses, brown sugar, salt, soy sauce, Worcestershire, mustard, black pepper, and bay leaf.\n            \n\n              2. Adjust the heat to maintain a gentle simmer and cook until the flavors come together, about 30 minutes. Remove and discard bay leaf before using.\n            \n", "ingredients": [{"food": "mixed nuts", "quantity": 3.5}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 6.0}, {"food": "pasta with tomato sauce", "quantity": 2.0}, {"food": "chili powder", "quantity": 1.0}, {"food": "paprika", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "allspice", "quantity": 0.25}, {"food": "cloves", "quantity": 1}, {"food": "", "quantity": 2.0}, {"food": "coconut water", "quantity": 2.0}, {"food": "vinegar", "quantity": 0.5}, {"food": "molasses", "quantity": 0.25}, {"food": "sugar", "quantity": 0.25}, {"food": "salt", "quantity": 1.0}, {"food": "soy sauce", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1.0}, {"food": "corier leaf", "quantity": 1.0}], "title": "\nKansas City BBQ'd Chicken\n"}, {"directions": "\n\n              Heat the oil in a medium saucepan over medium heat. Stir in the garlic, tomato paste, chili powder, paprika, red pepper, allspice, and cloves and cook, stirring, until paste is dark brick red, about 3 minutes. Add the ketchup, water, vinegar, molasses, brown sugar, salt, soy sauce, Worcestershire, mustard, black pepper, and bay leaf. Adjust the heat to maintain a gentle simmer and cook until the flavors come together, about 30 minutes. Remove and discard bay leaf before using.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 6.0}, {"food": "pasta with tomato sauce", "quantity": 2.0}, {"food": "chili powder", "quantity": 1.0}, {"food": "paprika", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "allspice", "quantity": 0.25}, {"food": "cloves", "quantity": 1}, {"food": "", "quantity": 2.0}, {"food": "coconut water", "quantity": 2.0}, {"food": "vinegar", "quantity": 0.5}, {"food": "molasses", "quantity": 0.25}, {"food": "sugar", "quantity": 0.25}, {"food": "salt", "quantity": 1.0}, {"food": "soy sauce", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1.0}, {"food": "corier leaf", "quantity": 1.0}], "title": "\nKansas City-Style BBQ Sauce\n"}, {"directions": "\n\n              Heat the vegetable oil in a medium pot over medium heat. Add the onion and garlic and cook until the onion is golden, 6 to 7 minutes. Add the tomato sauce, 1 cup water, the vinegar, ketchup, brown sugar, molasses, Worcestershire sauce, tomato paste, mustard, garlic powder and 1 teaspoon salt. Bring to a boil, then reduce the heat to medium low and simmer until the onion is tender, about 15 minutes. Stir in the liquid smoke. Strain the sauce, pressing on the solids to extract any liquid.\n            \n\n               Photograph by Andrew Purcell\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "vinegar", "quantity": 0.5}, {"food": "", "quantity": 0.5}, {"food": "sugar", "quantity": 3.0}, {"food": "molasses", "quantity": 3.0}, {"food": "Worcestershire sauce", "quantity": 3.0}, {"food": "pasta with tomato sauce", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 2.0}], "title": "\nKansas City-Style Barbecue Sauce\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F.\n            \n\n              Mix the kasha and egg white together in a small bowl until the kasha is well coated. Heat a large nonstick skillet over medium-high heat. Add the kasha mixture and cook, stirring constantly, until the grains soften and separate and the egg adheres to the grains and dries out, about 3 minutes. Let cool completely.\n            \n\n              Spread the hazelnuts out on to a baking sheet and bake until golden and toasted, 8 to 10 minutes. Transfer to a cutting board and cool. Rub the skins off the nuts with a kitchen towel, then coarsely chop the nuts.\n            \n\n              Bring 2 cups of water to a boil in a medium saucepan. Add the kasha, bring back to a boil, reduce the heat to medium low, cover and simmer until most of the water is absorbed and the kasha is tender, about 15 minutes. Spread the grains out on a baking sheet to cool.\n            \n\n              Whisk together the vinegar, oil, honey and 3/4 teaspoon salt in a large bowl. Add the cooled kasha, hazelnuts, carrot, parsley and feta and gently stir to combine. Serve at room temperature.\n            \n", "ingredients": [{"food": "", "quantity": 0.75}, {"food": "egg substitute", "quantity": 1.0}, {"food": "hazelnuts or filberts", "quantity": 0.25}, {"food": "vinegar", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "honey smoked ham", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "carrot juice", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 3.0}], "title": "\nKasha Salad with Hazelnuts and Feta\n"}, {"directions": "\n\n              Preheat a grill to medium and brush the grates with vegetable oil. Thread the pork tenderloin, sausage, bacon, pickles, banana peppers and onions onto eight 10-inch skewers; season with salt and pepper.\n            \n\n              Combine the mustard and olive oil in a small bowl; brush all over the kebabs. Grill the kebabs, turning occasionally, until marked and cooked through, about 12 minutes.\n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1}, {"food": "pork skins", "quantity": 1.5}, {"food": "sausage", "quantity": 1.5}, {"food": "bacon", "quantity": 4.0}, {"food": "dill seed", "quantity": 3.25}, {"food": "banana", "quantity": 2.0}, {"food": "onions", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "mustard spinach", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 0.25}], "title": "\nKebabs with Pork Three Ways\n"}, {"directions": "\n\n              Combine 4 cups water, the Worcestershire sauce, vinegar, brown sugar, lemon juice, allspice, garlic powder, onion powder, 1 1/2 teaspoons salt and 1/2 teaspoon pepper in a medium saucepan. Bring to a boil, then reduce the heat to medium low and simmer 5 minutes.\n            \n\n              Photograph by Andrew Purcell\n            \n", "ingredients": [{"food": "Worcestershire sauce", "quantity": 0.5}, {"food": "vinegar", "quantity": 0.5}, {"food": "sugar", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "allspice", "quantity": 0.25}, {"food": "garlic powder", "quantity": 0.25}, {"food": "onion powder", "quantity": 0.25}, {"food": "salt", "quantity": 1}], "title": "\nKentucky-Style Mutton Dip\n"}, {"directions": "\n\n              Place 16 slices bacon on a rack in a baking pan, top with 1/2 cup brown sugar and bake at 400 degrees until crisp, 12 minutes; chop. Make stove-popped corn using bacon drippings in place of oil. Toss the popcorn with the bacon, smoked paprika and salt.\n            \n\n              Photograph by Jonathan Kantor\n            \n", "ingredients": [], "title": "\nKevin Bacon Popcorn\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Spread the flour on a baking sheet and bake, stirring halfway through, until lightly toasted, 10 minutes. Let cool on the baking sheet; whisk to break up any clumps.\n            \n\n              Beat the butter, brown sugar and salt in a large bowl with a mixer on medium-high speed until fluffy, 3 to 5 minutes. Reduce the mixer speed to low; beat in the toasted flour, then the lime juice and vanilla. Stir in the mini white chocolate chips and sprinkles until just combined. Refrigerate until the dough is firm but not hard, about 30 minutes.\n            \n\n              Line a baking sheet with parchment paper. Roll tablespoonfuls of dough into balls and arrange on the prepared pan. Refrigerate until firm, at least 30 minutes or overnight.\n            \n\n              Combine the white chocolate chips and shortening in a large microwave-safe bowl. Microwave in 30-second intervals, stirring, until melted, 1 to 2 minutes. Gently drop a dough ball into the melted white chocolate and spoon more chocolate on top to completely coat. Lift out with a fork, letting any excess chocolate drip back into the bowl; return to the baking sheet. Sprinkle\n            \n\n              with nonpareils. Repeat with the remaining dough balls. (If the melted chocolate hardens, microwave 30 seconds. If the dough becomes too soft, refrigerate 15 to 20 minutes.)\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.5}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 0.75}, {"food": "hearts of palm", "quantity": 1}, {"food": "lime juice", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "dessert topping", "quantity": 1}], "title": "\nKey Lime Cookie-Dough Truffles\n"}, {"directions": "\n\n              Whisk the flour, baking powder and salt in a medium bowl. Beat the butter and granulated sugar in a large bowl with a mixer on medium speed until light and fluffy, about 3 minutes. Add the eggs, one at a time, beating well after each addition. Beat in the lime zest and juice, then beat in the food coloring. Reduce the mixer speed to low; gradually add the flour mixture, beating until just combined. Cover and refrigerate until firm, about 45 minutes.\n            \n\n              Position racks in the upper and lower thirds of the oven; preheat to 350 degrees F. Line 2 baking sheets with parchment paper. Combine the confectioners' sugar and sanding sugar in a small bowl. Roll tablespoonfuls of dough into balls and toss in the sugar mixture to coat completely. Arrange the cookies 2 inches apart on the prepared baking sheets.\n            \n\n              Bake, switching the pans halfway through, until the cookies are puffed and cracked on top and golden around the edges, 18 to 20 minutes. Let cool 5 minutes on the baking sheets, then transfer to racks to cool completely.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.5}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 1.25}, {"food": "eggs", "quantity": 2.0}, {"food": "lime juice", "quantity": 1.0}, {"food": "", "quantity": 4.0}, {"food": "sugar", "quantity": 0.5}, {"food": "sugar", "quantity": 2.0}], "title": "\nKey Lime Crackles\n"}, {"directions": "\n\n              Make the lime curd: Combine the granulated sugar, egg and egg yolk, lime juice and cornstarch in a small saucepan. Cook over medium-low heat, whisking, until thick enough to coat a spoon, 8 to 10 minutes. Remove from the heat and whisk in the butter, a little at a time, until smooth. Strain through a fine-mesh sieve into a bowl, then stir in the lime zest and salt. Set in a larger bowl of ice and stir until the curd is completely cool. Press plastic wrap directly onto the surface; refrigerate until ready to use.\n            \n\n              Make the cupcakes: Preheat the oven to 350 degrees F and line a muffin pan with 12 cupcake liners. Pulse the wafer cookies in a food processor until finely ground. Melt 2 tablespoons butter; add to the processor and pulse until the mixture comes together. Press about 1 tablespoon crumbs into each muffin cup.\n            \n\n              Sift the flour, baking powder, baking soda and salt into a medium bowl; set aside. Combine the remaining 10 tablespoons butter and the granulated sugar in a large bowl and beat with a mixer on medium-high speed until fluffy, 5 minutes. Reduce the speed to low; beat in the eggs, one at a time. Add the vanilla, lime zest and juice and beat until well combined. Add the flour mixture in 3 additions, alternating with the buttermilk, beginning and ending with the flour mixture. Increase the speed to medium high and mix until combined.\n            \n\n              Divide the batter among the prepared muffin cups, filling each about three-quarters of the way. Bake until a toothpick inserted into the centers comes out clean, 20 to 22 minutes. Remove to a rack; let cool completely.\n            \n\n              Make the frosting: Beat the butter in a large bowl with a mixer on medium-high speed until fluffy, 5 minutes. Reduce the speed to low and beat in the confectioners' sugar. Increase the speed to medium high; add the sour cream, lime juice and salt and beat until fluffy, 2 more minutes.\n            \n\n              Place the lime curd in a pastry bag fitted with a 1/4-inch tip. Insert the tip into the center of each cupcake and squeeze to fill. Frost the cupcakes, then pipe more lime curd on top. Top with lime slices and zest.\n            \n\n              Cook's Note: Key limes are smaller and more tart than regular limes. If you can't find them, look for bottled Key lime juice and use regular lime zest.\n            \n", "ingredients": [{"food": "sugar", "quantity": 0.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "lime juice", "quantity": 0.25}, {"food": "cornstarch", "quantity": 2.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "limes", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "chocolate chip cookies", "quantity": 12.0}, {"food": "butter oil", "quantity": 12.0}, {"food": "potato flour", "quantity": 1.25}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 0.25}, {"food": "sugar", "quantity": 0.75}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "lime", "quantity": 1.0}, {"food": "lime juice", "quantity": 2.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.3333333333333333}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 3.25}, {"food": "sour cream", "quantity": 0.25}, {"food": "lime juice", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "lime", "quantity": 1}], "title": "\nKey Lime Cupcakes\n"}, {"directions": "\n\n              Melt the sugar with 1 tablespoon water in a medium saucepan and cook over medium heat, swirling the pan occasionally, until a golden caramel is formed, about 10 minutes. Add the lime juice, bring to a boil and allow the sugar to melt into the sauce until reduced by half, about 5 minutes. Add the broth and boil until reduced to 2/3 cup, about 3 minutes. Season with 1/2 teaspoon salt.\n            \n\n              Preheat the oven to 425 degrees F. Steam the carrots in a covered rack set over boiling water until tender, about 15 minutes. Stir together 3 tablespoons of the key lime gastrique and 1/4 teaspoon each salt and pepper. Toss the carrots with 1 tablespoon of the butter, the seasoned gastrique and the parsley.\n            \n\n              Stir together the coriander with 1 teaspoon salt and 1/2 teaspoon pepper. Rub the spice mixture evenly over the lamb.\n            \n\n              Melt the remaining 1 tablespoon butter in a large, heavy, ovenproof skillet over medium heat until hot. Sear the lamb on two sides until browned, about 2 minutes each side. Transfer the skillet to the oven and roast until the lamb is medium, 20 to 25 minutes.\n            \n\n              Let the lamb stand 10 minutes before serving with the carrots and remaining gastrique.\n            \n", "ingredients": [{"food": "sugar", "quantity": 0.5}, {"food": "silk key lime soy yogurt", "quantity": 0.3333333333333333}, {"food": "diced chicken", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "carrots", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "butter oil", "quantity": 2.0}, {"food": "parsley", "quantity": 0.25}, {"food": "ground turkey", "quantity": 1.0}, {"food": "lamb", "quantity": 2.0}], "title": "\nKey Lime Lamb Chops with Glazed Carrots\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F and line one 12-cup standard muffin tin with paper cupcake liners.\n            \n\n              Cream the butter in a large bowl with an electric mixer until smooth. Gradually add the granulated sugar and beat until light and fluffy, about 3 minutes. Add the eggs, one at a time, scraping down the sides of the bowl between additions. Beat in the vanilla.\n            \n\n              Combine the flour, baking powder, lime zest and salt in a medium bowl. Add one-third of the flour mixture to the butter mixture; beat in half the milk. Repeat additions, ending with the flour. Beat until combined, taking care not to overmix.\n            \n\n              Divide the batter between the prepared muffin tins, filling the cups two-thirds full. Bake until a toothpick inserted into the center of the cupcakes comes out clean and the tops spring back when pressed gently, 18 to 22 minutes. Cool the cupcakes in the tins on a rack for 10 minutes, and then remove from the tins and cool completely.\n            \n\n              To assemble: Pour the Key Lime Curd into a squeeze bottle with 1/4-inch opening. Fill the cupcakes with curd by inserting the tip into the top of each cupcake and squeezing a couple tablespoons of filling into each cupcake; the cupcake will feel heavier and curd may be visible as it comes up to the top of the cupcake.\n            \n\n              Stir the Key Lime Frosting and dip the top of each cupcake into the frosting, allowing any excess to drip off.\n            \n\n              Roll the edge of each cupcake in the graham cracker crumbs and place on a serving platter. Garnish with a slice of Key lime if desired.\n            \n\nKey Lime Curd:\n\n\n              Whisk together the yolks, granulated sugar, lime juice and salt in a small heavy-bottomed saucepan. Cook over medium heat, whisking constantly, about 6 minutes, or until the mixture is thick enough to coat the back of a spoon and registers 160 degrees F on an instant-read thermometer.\n            \n\n              Remove from the heat and strain through a fine sieve into a medium bowl. Stir in the butter, one piece at a time, stirring until combined before adding the next piece. Stir in the lime zest and cover with plastic wrap pressed directly on the surface of the curd.\n            \n\n              Chill completely, about 1 hour.\n            \n\n              3 ounces cream cheese, at room temperature \n            \n\nKey Lime Frosting:\n\n\n              Beat the cream cheese and butter in a bowl with electric mixer at medium speed until fluffy, about 2 minutes. Gradually beat in the sweetened condensed milk, scraping down the sides of the bowl to combine well. Beat in the lime juice and vanilla. On low speed, gradually add the confectioners' sugar and beat until well combined. Chill 30 minutes.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 2.0}, {"food": "sugar", "quantity": 1.5}, {"food": "eggs", "quantity": 4.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "potato flour", "quantity": 3.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "lime", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "milk", "quantity": 1.0}, {"food": "", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "cracker barrel", "quantity": 0.5}, {"food": "luncheon slices", "quantity": 1}, {"food": "egg substitute", "quantity": 5.0}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 1.0}, {"food": "lime", "quantity": 0.5}, {"food": "sugar", "quantity": 0.75}, {"food": "lime juice", "quantity": 0.5}, {"food": "butter oil", "quantity": 4.0}, {"food": "milk", "quantity": 0.5}, {"food": "lime juice", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "sugar", "quantity": 0.5}], "title": "\nKey Lime Pie Cupcakes\n"}, {"directions": "\n\n              Combine the cream cheese, sweetened condensed milk, lime zest and juice and salt in a large bowl. Beat with an electric mixer on medium-high speed until smooth. Add the heavy cream and whip until thick and fluffy. Transfer to a dip bowl and garnish with crushed graham crackers and lime slices. Serve with dippers.\n            \n", "ingredients": [{"food": "macaroni cheese", "quantity": 4.0}, {"food": "milk", "quantity": 0.6666666666666666}, {"food": "grape juice", "quantity": 2.0}, {"food": "salt", "quantity": 0.25}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "crackers", "quantity": 1}, {"food": "chocolate chip cookies", "quantity": 1}], "title": "\nKey Lime Pie Dip\n"}, {"directions": "\nSpecial equipment: A piping bag with a star tip\n\n              For the crust: Adjust an oven rack to the middle position and preheat the oven to 350 degrees F. Butter a 9-inch pie plate. Put the crackers in a food processor and pulse until they form fine crumbs. Add the butter, sugar and egg white and pulse until the mixture comes together like wet sand (it should hold together when pinched). Transfer to the prepared pie plate and press evenly into the bottom and up the sides. Bake until lightly golden, about 10 minutes. Let cool completely.\n            \n\n              For the filling: Whisk together the condensed milk, lime juice, salt and egg yolks in a medium bowl. Pour into the cooked pie shell and bake until the filling is set and only slightly jiggles in the center, 18 to 20 minutes. Let cool completely at room temperature and then refrigerate, loosely covered with plastic wrap, until chilled, about 2 hours or up to overnight.\n            \n\n              Prepare the garnish: Use a citrus zester to make strips of zest. Then cut away all of the peel and white pith (save the other half for another use). Cut the lime \"meat\" into small chunks.\n            \n\n              Fill a piping bag fitted with a star tip with whipped cream. Pipe mounds of whipped cream around the edges of the pie and decorate with chunks of lime and zest. Serve immediately or return to the refrigerator to chill until serving.\n            \n", "ingredients": [{"food": "pie fillings", "quantity": 2.0}, {"food": "butter oil", "quantity": 60.0}, {"food": "sugar", "quantity": 2.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "milk", "quantity": 14.0}, {"food": "lime juice", "quantity": 0.6666666666666666}, {"food": "salt", "quantity": 1}, {"food": "egg substitute", "quantity": 4.0}, {"food": "ice cream swich", "quantity": 1}], "title": "\nKey Lime Pie with Butter Cracker Crust\n"}, {"directions": "\n\n              Bring a medium saucepan filled two-thirds with water to a boil. Add the khorasan wheat and cook until the grains have plumped and are tender but still chewy, 55 minutes to 1 hour. Drain.\n            \n\n              Meanwhile, put the oil, garlic, 1/2 teaspoon salt and crushed red pepper in a medium skillet and set over medium heat. Once the oil starts to shimmer, stir until the garlic is lightly golden, about 30 seconds. Add the tomato paste and stir until the oil turns yellow, about 30 seconds. Add the crushed tomatoes and their juices, 1/2 cup of water and basil. Bring to a boil, lower the heat to medium low and simmer gently until the sauce thickens, 10 to 12 minutes.\n            \n\n              Stir in the khorasan wheat and transfer to a serving dish. Sprinkle with the Parmesan and basil and serve hot.\n            \n", "ingredients": [{"food": "wheat flour", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "ruby red grapefruit juice blend", "quantity": 1}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "plum", "quantity": 15.0}, {"food": "chrysanthemum leaves", "quantity": 1}, {"food": "", "quantity": 2.0}], "title": "\nKhorasan Wheat Marinara\n"}, {"directions": "\nSpecial equipment: a 10-by-5-by-3-inch loaf pan\n\n              Work the apples, sugar and lemon zest together in a large bowl with your hands until the sugar feels like wet sand. Let the mixture sit, tossing occasionally, for 30 minutes (the sugar will have started to melt but will still be gritty).\n            \n\n              Meanwhile, preheat the oven to 350 degrees F. Generously coat a 10-by-5-by-3-inch loaf pan with cooking spray. Sift the flour, baking soda, cinnamon, nutmeg and salt together onto a large piece of parchment. Whisk together the oil, eggs and vanilla in a medium bowl.\n            \n\n              Once the apples are ready, add the flour mixture to them, and fold until combined. Pour in the oil mixture, and fold until just combined (it's OK if there are a few lumps). Pour the batter into the prepared loaf pan. Tap the pan on the counter a few times to settle and even out the batter.\n            \n\n              Bake the bread until the top is golden brown and bounces back when pressed (if you insert a toothpick into the center, it's OK if there are a few crumbs), 55 to 60 minutes. Let cool in the pan on a cooling rack until cool enough to handle. Invert the bread out of the pan, and serve warm or at room temperature.\n            \n", "ingredients": [{"food": "pineapple chunks", "quantity": 5.25}, {"food": "sugar", "quantity": 1.5}, {"food": "lemon juice", "quantity": 0.5}, {"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "nutmeg", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.6666666666666666}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 0.5}], "title": "\nKids Can Bake: Apple Bread\n"}, {"directions": "\nSpecial equipment: an 11-by-17-inch baking sheet\n\n              Put 1 1/2 cups warm water (about 110 degrees F) and the sugar in a large bowl. Sprinkle the yeast over the top, and set aside until bubbly, 5 to 10 minutes.\n            \n\n              Meanwhile, whisk together both flours and the kosher salt in a medium bowl.\n            \n\n              Once the yeast is ready, add the oil to the bowl, then the flour mixture, and stir with a wooden spoon until a shaggy dough forms. Transfer to a work surface dusted with all-purpose flour, and knead the dough until it is smooth, elastic and slightly tacky, about 5 minutes.\n            \n\n              Lightly oil the bowl that held the flour mixture, put the ball of dough in it, cover and let rise in a warm place until doubled in size, about 1 hour.\n            \n\n              Generously oil an 11-by-17-inch baking sheet. Punch the dough down, and transfer it to the baking sheet. Gently stretch and pat the dough to the edges of the baking sheet with your hands (it will recede slightly from the edges). (If the dough is resistant, let it rest for about 10 minutes, then try again.) Dimple the dough all over with your fingers. Loosely cover, and let rise in a warm place until almost doubled in size, about 30 minutes.\n            \n\n              Meanwhile, preheat the oven to 425 degrees F. When the dough is ready, uncover, generously drizzle with olive oil and sprinkle with sea salt. Bake until golden brown, 20 to 25 minutes. Let cool in the pan on a cooling rack. Serve warm or at room temperature\n            \n", "ingredients": [{"food": "sugar", "quantity": 1.0}, {"food": "", "quantity": 0.25}, {"food": "potato flour", "quantity": 3.0}, {"food": "wheat flour", "quantity": 1.0}, {"food": "salt", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "sea lion", "quantity": 1}], "title": "\nKids Can Bake: Focaccia Bread\n"}, {"directions": "\n\n              Position a rack in the center of the oven, and preheat to 375 degrees F. Line 1 large rimmed baking sheet with parchment. Whisk together the flour, baking soda and salt in a small bowl.\n            \n\n              Microwave the butter in a large microwave-safe bowl on high until completely melted, about 1 minute. Whisk in both sugars, then the egg and vanilla, until incorporated and smooth; let cool for 5 minutes. Stir in the flour mixture with a wooden spoon until just incorporated. Stir in the chocolate chips.\n            \n\n              Scoop the dough onto the center of the prepared baking sheet. Spread the dough with an offset spatula into an 8-inch circle that's 1/2 inch thick. Sprinkle the top of the cookie with the sprinkles (they'll look crowded but will spread out as the cookie bakes). Bake, rotating the baking sheet from back to front halfway through, until golden but still soft in the center, 22 to 25 minutes (the longer the cook time, the crunchier the cookie). Let cool for a few minutes on the baking sheet, then use a large spatula to transfer the cookie (not the parchment) to a rack to cool. Slice the cookie into wedges, and serve.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 6.0}, {"food": "sugar", "quantity": 6.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "", "quantity": 1.0}], "title": "\nKids Can Bake: Giant Chocolate Chip-Sprinkle Cookie\n"}, {"directions": "\nSpecial equipment: a 12-cup mini loaf pan or 12-cup muffin tray\n\n              For the cakes: Preheat the oven to 350 degrees F. Spray a 12-cup mini loaf pan with cooking spray.\n            \n\n              Spread the pecans out on 1 side of a rimmed baking sheet, the coconut on the other, and bake until both are toasted, 5 to 7 minutes. Let cool, then finely chop the pecans.\n            \n\n              Combine the flour, baking powder, baking soda, cinnamon, ginger and salt in a large bowl. Whisk together the butter, sour cream, brown sugar, vanilla and eggs in another large bowl. Stir the carrots, pecans and coconut into the egg mixture. Fold the flour mixture into the carrot-egg mixture until just combined. Divide evenly among the prepared pans (about 3 heaping tablespoons of batter per loaf). (Don't be alarmed if the batter seems skimpy; the cakes will rise once baked.)\n            \n\n              Bake until the center of a cake bounces back when pressed and a toothpick inserted in the middle comes out clean, 20 to 22 minutes. Let the cakes cool in the pan for a few minutes, then transfer to a rack to cool completely.\n            \n\n              For the glaze: Mix together the confectioners' sugar, cream cheese, lemon juice and salt in a medium bowl. Top each loaf with about 1 tablespoon of the glaze, and spread evenly with the back of the spoon.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "", "quantity": 0.5}, {"food": "coconut water", "quantity": 0.5}, {"food": "wheat flour", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "ginger", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 1.0}, {"food": "sour cream", "quantity": 1.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "eggs", "quantity": 3.0}, {"food": "carrots", "quantity": 2.5}, {"food": "sugar", "quantity": 1.25}, {"food": "whipped cream substitute", "quantity": 0.5}, {"food": "lemon juice", "quantity": 1.0}, {"food": "salt", "quantity": 1}], "title": "\nKids Can Bake: Mini Morning Glory Loaves\n"}, {"directions": "\nSpecial equipment: a 24-cup mini muffin tin\n\n              For the brownies: Preheat the oven to 350 degrees F. Line a 24-cup mini muffin tin with paper liners, and coat with cooking spray. Microwave the butter and chocolate in a microwave-safe bowl on high in 30-second increments, checking in between, until all the butter is melted and the chocolate is almost all melted, about 2 minutes. Whisk until smooth. Whisk in the granulated sugar, vanilla and salt to combine. Stir in the eggs, 1 at a time, with a wooden spoon. Add the flour, and beat until the batter is shiny, about 1 minute.\n            \n\n              Divide the batter evenly among the prepared muffin cups. Bake until the top is no longer glossy, about 17 minutes (a toothpick inserted in the center of a muffin will not come out clean).\n            \n\n              For the topping: Meanwhile, whisk together the cream cheese, confectioners' sugar, cream, vanilla and salt in a bowl; refrigerate until the brownies are ready to top.\n            \n\n              To assemble: Let the brownies cool for 5 minutes in the pan. Make an indentation in the center of each with the back of a teaspoon. Let them cool for 20 minutes more, then transfer them to a cooling rack. Fill each indentation with 1 teaspoon of the topping. Warm the preserves in the microwave on high until warm and pourable, about 30 seconds. Let sit for 2 minutes, then stir until smooth. Top each filled brownie with 1 teaspoon of the preserves.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "butter oil", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 4.0}, {"food": "sugar", "quantity": 1.25}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "salt", "quantity": 0.25}, {"food": "eggs", "quantity": 2.0}, {"food": "potato flour", "quantity": 0.5}, {"food": "whipped cream substitute", "quantity": 0.5}, {"food": "sugar", "quantity": 0.25}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 0.125}, {"food": "salt", "quantity": 1}, {"food": "silk raspberry soy yogurt", "quantity": 0.25}], "title": "\nKids Can Bake: Raspberry and Cream Cheese Brownie Bites\n"}, {"directions": "\nSpecial equipment: an 11-by-17-inch baking sheet\n\n              Put 1 1/2 cups warm water (about 110 degrees F) and 1 teaspoon of the sugar in a large bowl. Sprinkle the yeast over the top, and set aside until bubbly, 5 to 10 minutes.\n            \n\n              Meanwhile, whisk together both flours and the salt in a medium bowl.\n            \n\n              Once the yeast is ready, add the oil to the bowl, then the flour mixture. Stir together the mixture with a wooden spoon until a shaggy dough forms. Transfer it to a work surface dusted with all-purpose flour, and knead the dough until it is smooth, elastic and slightly tacky, about 5 minutes.\n            \n\n              Lightly oil the bowl that held the flour mixture, put the ball of dough in it, cover and let rise in a warm place until doubled in size, about 1 hour.\n            \n\n              Generously oil an 11-by-17-inch baking sheet. Punch the dough down, and transfer it to the baking sheet. Gently stretch and pat the dough to the edges of the baking sheet with your hands (it will recede slightly from the edges). (If the dough is resistant, let it rest for about 10 minutes, then try again.) Dimple the dough all over with your hands. Scatter the grapes over the top. Loosely cover, and let rise in a warm place until almost doubled in size, about 30 minutes.\n            \n\n              Meanwhile, preheat the oven to 425 degrees F. When the dough is ready, uncover, generously drizzle with olive oil and sprinkle with the remaining 1 teaspoon sugar. Bake until the bread is golden brown and the grapes are soft and juicy, 20 to 25 minutes. Let cool in the pan on a cooling rack. Serve warm or at room temperature.\n            \n", "ingredients": [{"food": "sugar", "quantity": 2.0}, {"food": "", "quantity": 0.25}, {"food": "potato flour", "quantity": 3.0}, {"food": "wheat flour", "quantity": 1.0}, {"food": "salt", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}], "title": "\nKids Can Bake: Sweet Grape Focaccia Bread\n"}, {"directions": "\nSpecial equipment: two 24-cup mini muffin tins\n\n              Preheat the oven to 350 degrees F. Coat the cups of two 24-cup mini muffin tins with cooking spray.\n            \n\n              Whisk together the flour, baking powder, pumpkin pie spice, salt, baking soda and chocolate chips in a medium bowl. Whisk together the butter, sugar, sweet potato, sour cream and egg in a large bowl until well mixed. Fold the flour mixture into the sweet potato mixture, and stir until just combined (it's OK if there are some lumps).\n            \n\n              Fill each muffin cup with a generous tablespoon of batter. Bake until the muffins have pulled away from the sides of the tins and a toothpick inserted in the center of a muffin comes out clean, 12 to 16 minutes. Tip the muffins out onto a cooling rack. Serve warm or at room temperature.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "pumpkin pie spice", "quantity": 0.75}, {"food": "salt", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "sweet potato puffs", "quantity": 1.0}, {"food": "sour cream", "quantity": 0.3333333333333333}, {"food": "egg substitute", "quantity": 1.0}], "title": "\nKids Can Bake: Sweet Potato-Chocolate Chip Mini Muffins\n"}, {"directions": "\nSpecial equipment: an 11-by-17-inch baking sheet\n\n              Put 1 1/2 cups warm water (about 110 degrees F) and 1 teaspoon of the sugar in a large bowl. Sprinkle the yeast over the top, and set aside until bubbly, 5 to 10 minutes.\n            \n\n              Meanwhile, whisk together both flours and the kosher salt in a medium bowl.\n            \n\n              Once the yeast is ready, add the oil to the bowl, then the flour mixture, and stir with a wooden spoon until a shaggy dough forms. Transfer the dough to a work surface dusted with all-purpose flour, and knead until it is smooth, elastic and slightly tacky, about 5 minutes.\n            \n\n              Lightly oil the bowl that held the flour mixture, put the ball of dough in it, cover and let rise in a warm place until doubled in size, about 1 hour.\n            \n\n              Generously oil an 11-by-17-inch baking sheet. Punch the dough down, and transfer it to the baking sheet. Gently stretch the dough and pat it to the edges of the baking sheet with your hands (it will recede slightly from the edges). (If the dough is resistant, let it rest for about 10 minutes, then try again.) Dimple the dough all over with your fingers. Scatter the tomatoes over the top. Loosely cover, and let rise in a warm place until almost doubled in size, about 30 minutes.\n            \n\n              Meanwhile, preheat the oven to 425 degrees F. When the dough is ready, uncover it, generously drizzle with oil and sprinkle with sea salt. Bake until the bread is golden brown and the tomatoes are soft and juicy, 20 to 25 minutes. Sprinkle the Parmesan over the top as soon as the bread comes out of the oven. Let cool on the baking sheet on a cooling rack. Top with the basil, and serve warm or at room temperature.\n            \n", "ingredients": [{"food": "sugar", "quantity": 2.0}, {"food": "", "quantity": 0.25}, {"food": "potato flour", "quantity": 3.0}, {"food": "wheat flour", "quantity": 1.0}, {"food": "salt", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "sea lion", "quantity": 1}, {"food": "", "quantity": 0.3333333333333333}, {"food": "chrysanthemum leaves", "quantity": 1}], "title": "\nKids Can Bake: Tomato-Basil Focaccia Bread\n"}, {"directions": "\nSpecial equipment: A 2-inch biscuit cutter and a sealable plastic container (at least 1 quart) for making whipped cream\n\n              Make the strawberries first: Mix the sliced strawberries with the sugar and a squeeze of lemon in a large bowl. Set them aside, stirring a few times, until they are nice and juicy, about 30 minutes.\n            \n\n              Make the biscuits: Preheat the oven to 425 degrees F. Whisk together the flour, sugar, baking powder and salt in a large bowl. Add the cream. Add the lemon zest and juice. Stir the mixture with a wooden spoon until it just forms a dough. Gather the dough into a ball and transfer it to a flour-sprinkled surface. Pat it into a 1/2-inch-thick circle. Cut as many mini biscuits as you can with a 2-inch biscuit cutter. Gently press the scraps together and repeat. Arrange the rounds 1 inch apart on 2 parchment-lined baking sheets. Brush them with more cream and sprinkle with a little sugar. Bake them in the middle of the oven until they are just golden, about 12 minutes. Cool the biscuits while you make the whipped cream.\n            \n\n              Make the whipped cream: Combine the cream with the sugar and vanilla in a sealable container. Whisk or shake with the lid on until soft peaks form.\n            \n\n              To serve: Split the biscuits with a fork and spoon some juicy strawberries and whipped cream on the bottom halves of the biscuits. Place the top halves on top. Add more whipped cream and a mint leaf to each, if using.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "sugar", "quantity": 0.25}, {"food": "lemon juice", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "potato flour", "quantity": 2.0}, {"food": "sugar", "quantity": 3.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "ice cream swich", "quantity": 1.5}, {"food": "grape juice", "quantity": 0.5}, {"food": "ice cream swich", "quantity": 1}, {"food": "ice cream swich", "quantity": 1.5}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "", "quantity": 1}], "title": "\nKids Can Make Strawberry Shortcakes\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Heat the olive oil in a large nonstick skillet over medium-high heat. Add the beef, breaking it up with a spoon, and cook until most of the liquid has evaporated, about 5 minutes. Stir in the cumin, chili powder, garlic, 1/2 teaspoon salt and a few grinds of pepper and cook 3 minutes. Stir in the ketchup and cook, stirring regularly, until the beef is browned and completely cooked through, about 2 minutes. Stir in the rice and 1/4 cup water and cook until the rice is heated through, about 3 minutes.\n            \n\n              Spray a rimmed baking sheet with cooking spray. Lay the tortillas on the sheet. Divide the beef mixture among the tortillas and top evenly with the mozzarella. Bake until the mozzarella is melted and the tortilla is beginning to brown, 3 to 5 minutes. Transfer the quesadillas to individual plates and serve with toppings.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "frankfurter beef", "quantity": 0.75}, {"food": "cumin seed", "quantity": 1.0}, {"food": "chili powder", "quantity": 0.5}, {"food": "garlic powder", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 2.0}, {"food": "crisped rice bar", "quantity": 10.0}, {"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 8.0}, {"food": "", "quantity": 1.0}, {"food": "grape juice", "quantity": 0.5}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "lettuce", "quantity": 1}, {"food": "silk banana-strawberry soy yogurt", "quantity": 0.5}, {"food": "", "quantity": 1}], "title": "\nKids Can Make: A Quesadilla Bar\n"}, {"directions": "\n\n              Position an oven rack in the bottom half of the oven, and preheat to 375 degrees F. Line a rimmed baking sheet with parchment paper.\n            \n\n              Whisk together 1 of the eggs, the mustard, 1/2 teaspoon salt, 1/4 teaspoon pepper and granulated garlic in a shallow dish. Mix together the breadcrumbs and 1/4 cup of the Parmesan in another shallow dish.\n            \n\n              Toss the asparagus with the flour in a medium bowl. Dip the asparagus in the egg mixture, shake off excess egg, coat the asparagus in the breadcrumb mixture (pressing it in if needed) and transfer to the prepared baking sheet. Bake until the asparagus is tender and slightly browned about 20 minutes.\n            \n\n              Crack the remaining 4 eggs into individual cups. Heat the oil in a large nonstick skillet over medium heat, then gently pour as many of the eggs into the pan as you can without crowding. Fry the eggs until the whites have set and the yolks are still runny, about 4 minutes.\n            \n\n              Pool 1/4 cup marinara sauce on each of 4 serving plates. Evenly divide the asparagus among them, and top each with an egg. Sprinkle with the remaining 1 tablespoon Parmesan, and garnish with basil.\n            \n", "ingredients": [{"food": "eggs", "quantity": 5.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "garlic powder", "quantity": 0.25}, {"food": "silk plain soy yogurt", "quantity": 0.5}, {"food": "", "quantity": 0.25}, {"food": "asparagus", "quantity": 1.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 4.0}], "title": "\nKids Can Make: Asparagus Marinara\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Line a baking sheet with parchment.\n            \n\n              Unfold the puff pastry, and cut it into 4 equal squares (you don't have to roll the dough out). Arrange the squares, evenly spaced, on the prepared baking sheet. Measure about 1/4 inch in from one side of each square, and score the dough all down that side almost all the way through with a sharp knife. Repeat with the remaining 3 sides, making sure the cuts meet in the corners (you're making a square within a square). Poke each inner square several times with a fork.\n            \n\n              Bake the dough until puffed and lightly golden, 15 to 20 minutes. Let cool for a few minutes, then press on the center of each puff with the bottom of a measuring cup to make a well. Let cool completely. (These shells can be made up to 3 days in advance and stored in an airtight container at room temperature.)\n            \n\n              Crack 1 egg directly into the well of each pastry shell. Dividing evenly, arrange the tomato halves cut-side up on the egg whites. Sprinkle the egg and tomato with salt and pepper. Bake until the egg whites are just set but still slightly jiggly and the yolk is still runny, 15 to 20 minutes.\n            \n\n              Meanwhile, whisk together the harissa, 1 tablespoon water, 1 teaspoon of the oil and a pinch of salt in a small bowl. Toss the herbs, feta, scallions, lemon juice, the remaining 1 teaspoon oil and a pinch of salt in another small bowl.\n            \n\n              Drizzle each baked tart with some of the harissa sauce, and top with a little mound of the herb salad.\n            \n", "ingredients": [{"food": "puff pastry", "quantity": 9.0}, {"food": "eggs", "quantity": 4.0}, {"food": "ruby red grapefruit juice blend", "quantity": 8.0}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 0.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}], "title": "\nKids Can Make: Baked Egg-and-Harissa Tarts\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Generously coat a rimmed baking sheet with cooking spray.\n            \n\n              Remove the tofu from the packaging, and drain the excess water. Halve 1 of the blocks crosswise, halve each piece crosswise, then halve each piece again, for a total of 8 pieces 3 1/2 inches long by 1 3/4 inches wide by 1/2 inch thick. Repeat with the other block of tofu. Lay the pieces on 2 paper towels, and blot dry with 2 more, gently squeezing out as much moisture as possible. Sprinkle the tofu evenly with 1 teaspoon salt, and let stand.\n            \n\n              Put the cornstarch on a plate. Crack the eggs in a shallow bowl, add 1 teaspoon salt and a few grinds of pepper and whisk until combined. Put the panko, 1 teaspoon salt and a few grinds of pepper in another shallow bowl. Line up the tofu, cornstarch, eggs, panko and the prepared baking sheet.\n            \n\n              Working with 1 to 2 pieces of tofu at a time, coat them in the cornstarch, shaking off any excess, dip in the egg to coat, dredge in the panko, pressing the panko gently into the surface of the tofu, then transfer the breaded tofu to the baking sheet. Generously coat the tops of the tofu with cooking spray. Bake until browned and crisp, 30 to 35 minutes, turning the baking sheet halfway through.\n            \n\n              Meanwhile, heat the vegetable oil in a small nonstick skillet over medium heat. Add the ginger and garlic, and cook, stirring constantly, until fragrant and light brown, about 1 minute. Reduce the heat to low, stir in the preserves, sesame oil, vinegar and chili sauce until combined and cook until heated through, about 1 minute. Season the dipping sauce with 1/2 teaspoon salt, transfer to a serving bowl and serve alongside the tofu.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 14.0}, {"food": "cornstarch", "quantity": 0.6666666666666666}, {"food": "eggs", "quantity": 3.0}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "ginger", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "apricot nectar", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 0.5}], "title": "\nKids Can Make: Baked Tofu Tenders\n"}, {"directions": "\nSpecial equipment: a 2 1/2-inch round cookie cutter\n\n              For the biscuits: Position an oven rack in the center of the oven, and preheat to 425 degrees F. Line a baking sheet with parchment.\n            \n\n              Whisk together the flour, chives, baking powder, sugar and salt in a large bowl. Add the goat cheese, and toss, using your hands to break it up into pea-sized pieces. Add the cream, and mix with a wooden spoon until combined. Let the dough stand for 5 minutes.\n            \n\n              Roll the dough out into a round that is slightly less than 1/2 inch thick. Cut out 8 biscuits with a 2 1/2-inch round cookie cutter, and arrange them about 2 inches apart on the prepared baking sheet. Brush them with more cream, and sprinkle with a little salt. Bake the biscuits until just golden, 16 to 18 minutes. Transfer them to a wire rack, and let cool. When the biscuits are cool enough to handle, split them in half. Put 2 bottom halves on each of 4 plates.\n            \n\n              For the quick hollandaise: Whisk the mayonnaise, lemon juice, paprika and 1 tablespoon water in a small bowl, and season with salt and pepper; set aside.\n            \n\n              Heat a large nonstick skillet over medium-high heat. Cook the bacon in batches until browned, 3 to 4 minutes per side. Place 1 slice of bacon on each biscuit bottom, folding if needed.\n            \n\n              Bring a wide pot with about 2 inches of water to a very gentle simmer. Break the eggs into the water, spacing them apart. Cover the pot, and turn off the heat. After 2 to 3 minutes the whites should be set and the yolks still soft. Remove the eggs with a slotted spoon, and place on top of the Canadian bacon slices. Drizzle with hollandaise, sprinkle with chives and sandwich each with a biscuit top.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.0}, {"food": "chives", "quantity": 3.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "salt", "quantity": 1.5}, {"food": "macaroni cheese", "quantity": 6.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "mayonnaise dressing", "quantity": 0.5}, {"food": "lemon juice", "quantity": 1.0}, {"food": "paprika", "quantity": 0.125}, {"food": "black bean mango", "quantity": 1}, {"food": "bacon", "quantity": 8.0}, {"food": "eggs", "quantity": 8.0}], "title": "\nKids Can Make: Biscuit Eggs Benedict\n"}, {"directions": "\n\n              Bring the apple juice to a simmer in a medium saucepan over medium heat. Toss the Gruyere and cornstarch in a medium bowl. Add to the simmering juice by the scant handful, whisking constantly until smooth and letting the sauce come to a boil between additions, about 30 seconds. Remove the saucepan from the heat, stir in the Parmesan and mustard and season with 1/2 teaspoon salt and a few grinds of pepper. Pour into a serving bowl, and serve with the dippers of your choice.\n            \n", "ingredients": [{"food": "apple juice", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "cornstarch", "quantity": 2.0}, {"food": "", "quantity": 0.25}, {"food": "mustard spinach", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "pineapple chunks", "quantity": 1.5}, {"food": "apples", "quantity": 2.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "broccoli raab", "quantity": 2.0}, {"food": "italian veg medley pasta", "quantity": 2.0}, {"food": "mixed nuts", "quantity": 1.0}, {"food": "crackers", "quantity": 1.0}, {"food": "salami", "quantity": 1.0}, {"food": "barley flour or meal", "quantity": 0.5}], "title": "\nKids Can Make: Cheese Fondue\n"}, {"directions": "\n\n              Position 2 oven racks in the center of the oven, and preheat to 400 degrees F. Line 2 baking sheets with parchment.\n            \n\n              Roll out 1 puff pastry sheet with a rolling pin on a lightly floured work surface to a 12-inch square.\n            \n\n              Whisk the egg in a small bowl with 1 tablespoon water until blended.\n            \n\n              Brush the dough with a thin layer of the egg wash. Sprinkle half the Asiago onto the dough, and press it in with the rolling pin or the back of a measuring cup. Cut the dough in half horizontally (a pizza roller is very handy for this). Place one half on top of the other, cheese-side up.\n            \n\n              Cut the dough into 1/2-inch vertical strips; you should have 24. Pick up 1 strip with a hand on each end, and twist in opposite directions until you have made a spiral. Place the spiral on the baking sheet, and gently pinch the ends to adhere them to the parchment. Continue with the remaining strips, placing them about an inch apart, 12 per baking sheet. Brush the twisted dough with the egg wash, and bake until golden and puffy, 15 to 17 minutes, rotating the baking sheets halfway through. Let cool completely on the baking sheet. Repeat the process with the remaining puff pastry and cheese to make 24 more cheese straws. Store in an airtight container at room temperature for up to 3 days.\n            \n", "ingredients": [{"food": "puff pastry", "quantity": 17.0}, {"food": "potato flour", "quantity": 1}, {"food": "egg substitute", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 1.5}], "title": "\nKids Can Make: Cheese Straws\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Heat a large nonstick skillet over medium-high heat. Fry the bacon until crisp, about 5 minutes. Remove the pan from the heat and transfer the bacon to paper towels to drain; when cool enough to handle, crumble.\n            \n\n              Add the butter to the hot pan to melt with the rendered bacon fat; set aside.\n            \n\n              Cut a piece from the center of each slice of bread using a 2 1/2-inch round or other decorative 2 1/2-inch cookie cutter (star, flower, heart). Brush the slices and cutouts with the butter-bacon fat mixture and transfer them to a plate.\n            \n\n              Toast 2 slices of bread and 2 cutouts in the skillet over medium heat until browned on one side, about 1 minute. Crack an egg into each hole and sprinkle each toast with 1 tablespoon of the Parmesan; cook 2 minutes. Flip the slices and cutouts, season with salt and pepper and cook 2 minutes for a runny yolk or slightly longer for a set egg. Repeat with the remaining bread slices, cutouts, eggs and Parmesan.\n            \n\n              Transfer each egg-in-the-hole to a plate and sprinkle with crumbled bacon. Serve with the toasted cutouts, for dipping in the yolk.\n            \n", "ingredients": [{"food": "bacon", "quantity": 4.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "barbecue loaf", "quantity": 0.5}, {"food": "eggs", "quantity": 4.0}, {"food": "", "quantity": 4.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nKids Can Make: Cheesy Eggs-in-the-Hole with Bacon\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Warm the taco shells on a baking sheet, about 5 minutes.\n            \n\n              Crack the eggs into a bowl, add the taco seasoning and whisk well with a fork. Heat a medium nonstick skillet over medium-high heat. Melt the butter in the skillet; when it foams and bubbles, add the eggs and reduce the heat to low. Cook the eggs, stirring regularly with a wooden spatula to break them up, until set, 3 to 4 minutes.\n            \n\n              Line the center of each taco shell with about 2 generous tablespoons of the scrambled eggs. Top with some of the cheese, scallions and lettuce and a spoonful of salsa. Garnish with some chopped tomatoes, and serve with olives and sour cream on the side if using.\n            \n", "ingredients": [{"food": "taco shells", "quantity": 8.0}, {"food": "eggs", "quantity": 6.0}, {"food": "chili powder", "quantity": 1.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "", "quantity": 3.0}, {"food": "Worcestershire sauce", "quantity": 0.5}, {"food": "lettuce", "quantity": 1.0}, {"food": "grape juice", "quantity": 0.5}, {"food": "sour cream", "quantity": 1}], "title": "\nKids Can Make: Crunchy Breakfast Tacos\n"}, {"directions": "\n\n              Coat a wooden spoon and 1/3-cup dry measuring cup with cooking spray. Line a baking sheet with parchment, and coat lightly with cooking spray.\n            \n\n              Melt the butter in a medium saucepan over medium heat. Add the marshmallows, honey, vanilla and a pinch of salt, and stir with the prepared wooden spoon until the marshmallows have completely melted, 4 to 5 minutes. Remove from the heat, add the cereal and stir until the mixture is fully combined.\n            \n\n              Use the prepared measuring cup to scoop out the mixture onto the prepared baking sheet in mounds. Let them cool for a few seconds to make them easier to work with. Spray your hands with cooking spray, and firmly press and pat each mound into a football shape. Let the treats sit at room temperature to harden slightly, about 20 minutes.\n            \n\n              Cut the candy chews lengthwise into quarters. Roll the pieces into thin ropes and cut into short and long lengths to make laces. Arrange the candy on top of each football, pressing in to help them adhere. Store at room temperature in an airtight container for up to 3 days.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "butter oil", "quantity": 4.5}, {"food": "", "quantity": 10.0}, {"food": "honey smoked ham", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "crisped rice bar", "quantity": 6.0}, {"food": "barley flour or meal", "quantity": 12.0}], "title": "\nKids Can Make: Football Cocoa-Crispy Rice Treats\n"}, {"directions": "\n\n              Special equipment: food-safe gloves\n            \n\n              Preheat the oven to 350 degrees F. Spread the pecans out on a baking sheet, and bake until brown and toasted, 8 to 10 minutes. Let cool completely, then very finely chop.\n            \n\n              Put the chocolate, vanilla, orange zest and salt in a large bowl; set aside. Heat the cream and butter in a small saucepan over medium-low heat until very hot and steaming; pour over the chocolate, then let sit for 10 minutes. Stir until all the chocolate has melted and the mixture is smooth. (If all the chocolate has not melted, microwave the mixture in 30-second increments, stirring after each, until smooth.) Add the pecans, apricots and prunes, and stir to combine.\n            \n\n              Transfer the chocolate-fruit mixture to a large baking dish, and let cool to room temperature. Cover with plastic wrap, and refrigerate until the mixture has hardened but is still soft enough to scoop, about 3 hours. (The mixture can be made up to 2 days in advance; let soften at room temperature until scoopable, about 30 minutes.)\n            \n\n              Line a baking sheet with parchment. Scoop heaping teaspoonfuls of truffle mixture, and place them on the prepared sheet. Once all the mixture has been divided up, roll the mounds into smooth, round balls. (Using food-safe gloves for this helps keep it from getting too messy.) Roll each ball into sanding sugar right before serving or wrapping. Keep refrigerated in an airtight container for up to 3 days.\n            \n", "ingredients": [{"food": "pecans", "quantity": 0.3333333333333333}, {"food": "baking chocolate", "quantity": 8.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "orange", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "butter oil", "quantity": 1.0}, {"food": "silk very vanilla", "quantity": 0.3333333333333333}, {"food": "silk very vanilla", "quantity": 0.3333333333333333}, {"food": "sugar", "quantity": 1}], "title": "\nKids Can Make: Fruit-and-Nut Chocolate Truffles\n"}, {"directions": "\nSpecial equipment: Toothpicks\n\n              Carefully wash and dry the 4 largest outer romaine leaves, trying not to tear them. Cut the leaves at the base, where they were connected to the root; the leaves should be about 9 inches long. Using a vegetable peeler, shave the center rib so the leaves roll up more easily. Set aside.\n            \n\n              Stir the cream cheese, scallions, mustard, 1/4 teaspoon salt and a few grinds of pepper in a medium bowl to combine.\n            \n\n              Lay 1 of the tortillas on a clean work surface, and place 1 of the romaine leaves neatly on top. Place 2 slices of the ham next to each other to fit neatly on top of the lettuce. Spread 2 tablespoons of the cream cheese mixture over the ham, then line up a quarter of the roasted pepper strips along one edge. Line up 1/4 cup of the shredded carrots on top of the peppers. Roll up the wrap tightly, starting from the edge with the peppers and carrots, so the wrap holds together with the peppers and carrots in the middle. Place the wrap seam-side down. Repeat with the remaining tortillas, peppers, carrots, ham and cream cheese mixture. Cut the wraps into 1-inch pieces, then skewer each piece from the top through the seam side with a toothpick or skewer.\n            \n", "ingredients": [{"food": "lettuce", "quantity": 1.0}, {"food": "whipped cream substitute", "quantity": 4.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "potato flour", "quantity": 10.0}, {"food": "ham", "quantity": 8.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.25}, {"food": "carrots", "quantity": 1.0}], "title": "\nKids Can Make: Ham and Scallion Cream Cheese Pinwheel Sandwiches\n"}, {"directions": "\nSpecial equipment: a 9 1/2-inch deep-dish glass pie dish\n\n              Preheat the oven to 450 degrees F. Coat a 9 1/2-inch deep-dish glass pie dish with 2 teaspoons of the oil.\n            \n\n              Toss the hash browns, the remaining 2 tablespoons oil, 1 teaspoon salt and 1/4 teaspoon pepper in a medium bowl to mix well. Gently press the hash browns into the prepared pie dish to form a crust, and spray with cooking spray. Bake the crust until it begins to look dry, about 10 minutes. Lower the oven temperature to 400 degrees F, and bake until golden brown, 20 minutes more; set aside until cool to the touch. Lower the oven temperature to 350 degrees F.\n            \n\n              Beat the eggs, half-and-half, 3/4 teaspoon salt and 1/4 teaspoon pepper in a medium bowl. Place the tomatoes, basil and chives on the crust, pour the egg mixture over them and top with the mozzarella. Bake until the center is firm and the quiche no longer jiggles, 35 to 40 minutes. Let cool for 20 minutes, then slice and serve.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "coconut water", "quantity": 16.0}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "eggs", "quantity": 6.0}, {"food": "", "quantity": 0.75}, {"food": "ruby red grapefruit juice blend", "quantity": 1.5}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "chives", "quantity": 0.25}, {"food": "", "quantity": 4.0}], "title": "\nKids Can Make: Hash Brown, Tomato and Mozzarella Quiche\n"}, {"directions": "\n\n              Whisk together the egg white, vinegar and 3 tablespoons water in a small bowl; set aside. Refrigerate the egg yolk in a small bowl, covered, until ready to use.\n            \n\n              Pulse the flour, salt, mustard, paprika and turmeric in a food processor to combine. Add the butter, Cheddar and Parmesan, and pulse until the butter is completely broken up. Pour in the egg white mixture, and pulse until the dough comes together in a ball. (It's OK if it's a little wet.)\n            \n\n              Place the dough on a large piece of plastic wrap, and pat it into a 1/2-inch-thick square. Wrap it up, and refrigerate to chill and firm up the dough, about 1 hour.\n            \n\n              Position 2 oven racks at the top and bottom thirds of the oven, and preheat to 350 degrees F. Line 2 baking sheets with parchment.\n            \n\n              Roll the dough out on a large piece of parchment (to keep it from sticking to the counter) into a 10-inch square about 1/8 inch thick. (Dust the dough with flour if you find it too sticky.) Trim the edges to straighten the square, then cut it into 1-inch squares (a pizza cutter works great).\n            \n\n              Whisk 2 teaspoons water into the egg yolk. Brush the mixture over the tops of each cracker. Sprinkle each with the tiniest pinch of salt.\n            \n\n              Bake the crackers, 2 baking sheets at a time, until they are deep golden brown on the bottom, about 20 minutes, rotating the sheets about halfway through. Let the crackers cool on the baking sheet for a few minutes, then transfer to a cooling rack to cool completely.\n            \n\n              Store the crackers at room temperature in an airtight container for up to 2 days, or freeze them for up to 1 week.\n            \n", "ingredients": [{"food": "egg substitute", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "potato flour", "quantity": 1.25}, {"food": "salt", "quantity": 0.75}, {"food": "mustard spinach", "quantity": 0.5}, {"food": "paprika", "quantity": 0.5}, {"food": "turmeric", "quantity": 0.25}, {"food": "butter oil", "quantity": 6.0}, {"food": "", "quantity": 0.5}, {"food": "", "quantity": 0.5}], "title": "\nKids Can Make: Healthy Cheesy Crackers\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Spray a 12-cup muffin tin generously with the baking spray.\n            \n\n              For the popovers: Whisk the milk, flour, eggs, vanilla and 1/2 teaspoon salt in a medium bowl until combined. Drizzle in the melted butter while whisking until combined; let the batter stand for 5 minutes. Add the baking powder; whisk the batter to combine and divide it evenly among the muffin cups (a scant 1/4 cup batter per muffin cup). Bake the popovers until puffed and browned around the edges, 20 to 25 minutes, rotating the pan about halfway through.\n            \n\n              For the filling: While the popovers are baking, put the broth and flour into a medium saucepan and whisk until the flour is dissolved. Place the saucepan over medium heat and whisk continuously until the mixture comes to a boil; continue to whisk until the mixture is thick enough to coat the back of a spoon, 4 to 5 minutes. Reduce the heat to low and whisk in 2 tablespoons of the Parmesan, 1 teaspoon salt and 1/4 teaspoon pepper. Stir in the peas and carrots, then the chicken; cover to keep warm.\n            \n\n              To assemble: When the popovers are done, turn them out of the pan, using a small spatula if necessary. Arrange 2 popovers on each of six plates or bowls and top with the chicken filling, dividing evenly among the popovers. Garnish with chopped parsley and sprinkle on the remaining 2 tablespoons of grated Parmesan.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1}, {"food": "whole milk", "quantity": 1.0}, {"food": "potato flour", "quantity": 0.75}, {"food": "eggs", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 3.0}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "diced chicken", "quantity": 3.0}, {"food": "potato flour", "quantity": 0.3333333333333333}, {"food": "", "quantity": 4.0}, {"food": "black bean mango", "quantity": 1}, {"food": "pigeon peas", "quantity": 1.0}, {"food": "diced chicken", "quantity": 0.5}, {"food": "parsley", "quantity": 0.25}], "title": "\nKids Can Make: Healthy Chicken Pot Popovers\n"}, {"directions": "\n\n              Combine 2 cups warm water (110 to 115 degrees F), butter pieces and brown sugar in the bowl of a stand mixer fitted with a dough hook. Sprinkle the yeast over the water, and let stand until foamy, about 10 minutes. Whisk together the flour, raisins, 1 teaspoon of the salt and 1 teaspoon of the cinnamon in a large bowl.\n            \n\n              Add half the flour mixture to the yeast, and mix on low speed until incorporated, scraping down the side of the bowl as needed. Add the remaining flour, increase the speed to medium and continue to beat until the dough gathers around the hook and pulls away from the side of the bowl. Once this happens, continue to beat until the dough is smooth, about 5 minutes more. Remove the dough ball, butter the inside of the bowl, return the dough ball to the bowl, cover and let rise in a warm spot until doubled in size, about 1 hour.\n            \n\n              Position 2 racks in the upper and lower thirds of the oven, and preheat the oven to 400 degrees F. Line 2 baking sheets with parchment paper, and spray generously with cooking spray. Punch down the dough, and cut it in half. Divide each half into twelve even pieces, and cover with a towel.\n            \n\n              Roll each piece of dough into an 18-inch rope, working from the middle out. (It helps to hold the dough ends and slap the center of the length on the counter as you stretch and roll.) Make a U shape with one of the dough ropes, lift the ends and twist in the center twice; fold the ends over and down, and pinch to secure them to the bottom of the U to finish the pretzel shape. Transfer the pretzels to the prepared baking sheets. Cover loosely with plastic wrap, and let rest at room temperature until the pretzels rise slightly, about 30 minutes.\n            \n\n              Meanwhile, combine 10 cups water and the baking soda in a large, wide pot, and bring to a low simmer (190 to 200 degrees F), whisking until the baking soda dissolves. Stir together the granulated sugar and the remaining 1 teaspoon salt and 1 teaspoon cinnamon in a small bowl.\n            \n\n              Cut the parchment paper with scissors around each pretzel. Leaving the pretzel on the paper (so it keeps its shape while transporting to the simmering water), remove the pretzels from the baking sheets. Reline each baking sheet with parchment, and spray generously with cooking spray.\n            \n\n              Put each pretzel, top-down, into the simmering water, and remove the paper. Simmer until the pretzels plump, about 1 minute. Carefully flip the pretzels, and continue to simmer 45 seconds more. Remove each with a slotted spoon, shake off excess liquid, place on the prepared baking sheets and sprinkle with some of the cinnamon-sugar mixture.\n            \n\n              Bake the pretzels until they're a few shades darker and the bottoms are nicely browned, 16 to 18 minutes, rotating about halfway through. Brush with the melted butter.\n            \n\n              Store the pretzels at room temperature in an airtight container for up to 2 days, or freeze them for up to 1 month (let thaw at room temperature).\n            \n", "ingredients": [{"food": "butter oil", "quantity": 3.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "yeast extract spread", "quantity": 0.25}, {"food": "wheat flour", "quantity": 5.0}, {"food": "raisins", "quantity": 1.0}, {"food": "salt", "quantity": 2.0}, {"food": "cinnamon", "quantity": 2.0}, {"food": "", "quantity": 1}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "sugar", "quantity": 3.0}], "title": "\nKids Can Make: Healthy Cinnamon-Raisin Soft Pretzels\n"}, {"directions": "\n\n              Process the raisin bran and brown rice cereals, peanut butter, maple syrup, cherries and 1 tablespoon water in a food processor until the mixture is finely chopped and comes together in a big ball. Roll some into a small ball; if it seems too dry and crumbly, add 1 more tablespoon water.\n            \n\n              Scoop the mixture into slightly mounded tablespoons, then roll them into smooth balls. (Dampen your hands with a little water to help you roll.)\n            \n\n              If using the bananas, pulse them in a food processor until finely ground. Pour them into a small bowl. Roll each truffle in the banana dust until coated. If using the cocoa, pour it into a small bowl, then roll each truffle in it until coated.\n            \n\n              Store the balls at room temperature in an airtight container for up to 2 days.\n            \n", "ingredients": [{"food": "corn bran", "quantity": 3.0}, {"food": "crisped rice bar", "quantity": 1.0}, {"food": "peanut butter ", "quantity": 0.6666666666666666}, {"food": "syrup", "quantity": 5.0}, {"food": "maraschino cherries", "quantity": 3.0}, {"food": "onion powder", "quantity": 0.75}], "title": "\nKids Can Make: Healthy Peanut Butter Balls\n"}, {"directions": "\n\n              Position an oven rack in the center of the oven, and preheat to 350 degrees F. Line a 12-cup muffin pan with paper liners, and spray the liners lightly with cooking spray.\n            \n\n              Whisk together the flour, 1/3 cup of the chocolate chips, baking powder and salt in a large bowl. Whisk together the milk, sugar, oil, eggs, vanilla and orange zest in a medium bowl until no sugar clumps remain. Fold the milk mixture into the flour mixture until just combined. (Don't worry if there are a few lumps.)\n            \n\n              Spoon a heaping tablespoon of batter into each muffin cup liner. Stand a strawberry in each, point-side down. Evenly divide the remaining batter among the liners. Smooth the batter around and on top of each strawberry with a spoon. (It's OK if a little bit of strawberry pokes out.) Sprinkle the remaining chocolate chips over the tops.\n            \n\n              Bake until the muffins are golden and spring back when pressed in the center, 22 to 25 minutes. Let cool in the pan for a few minutes, then transfer to a cooling rack to cool completely. Store at room temperature in an airtight container for up to 2 days.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "wheat flour", "quantity": 2.25}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 1.5}, {"food": "salt", "quantity": 0.5}, {"food": "milk", "quantity": 1.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "orange", "quantity": 0.5}, {"food": "strawberries", "quantity": 12.0}], "title": "\nKids Can Make: Healthy Secret Strawberry Chocolate-Chip Muffins\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Spray a 12-cup muffin tin generously with baking spray; set aside.\n            \n\n              For the popovers: Whisk the milk, flour, eggs, vanilla and 1/2 teaspoon salt in a medium bowl until combined. Drizzle in the melted butter while whisking until combined, then let the batter stand for 5 minutes. Whisk in the baking powder, then divide the batter evenly among the muffin cups (a scant 1/4 cup each). Bake until puffed and browned around the edges, 20 to 25 minutes, rotating the pan halfway through.\n            \n\n              For the salad: While the popovers are baking, toss the tomatoes, mozzarella, cucumbers and basil in a medium bowl. Whisk the oil, vinegar, 1/2 teaspoon salt and a few grinds of black pepper in a measuring cup; add to the tomato mixture and toss to coat. Cover the bowl and refrigerate.\n            \n\n              To assemble: When the popovers are done, turn them out of the pan, using a small spatula if necessary. Place 2 popovers on each of six serving plates and top each with 1/2 cup of the tomato mixture. Serve immediately.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1}, {"food": "whole milk", "quantity": 1.0}, {"food": "potato flour", "quantity": 0.75}, {"food": "eggs", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 3.0}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "grape juice", "quantity": 1.5}, {"food": "", "quantity": 0.75}, {"food": "diced chicken", "quantity": 0.5}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "vinegar", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nKids Can Make: Healthy Summer-Salad-Stuffed Popovers\n"}, {"directions": "\nSpecial equipment: A spice grinder\n\n              Make the Spice Mix: Put half the tomato strips in a single layer on a microwavable plate. Microwave in 30-second increments, checking the texture in between, until they begin to harden but are still red and slightly pliable, 1 to 2 minutes. (They may begin to brown and taste bitter if cooked too long.) Let sit until cool and completely hardened, about 2 minutes. Repeat with the remaining tomato strips.\n            \n\n              Transfer the cooled tomato strips to a spice grinder, and grind to a powder. Discard any pieces that won't grind. Add the nutritional yeast, chili powder, cumin, oregano, cayenne and 1 teaspoon salt, and grind to a fine powder.\n            \n\n              Make the taco popcorn: Heat the oil in a large pot over medium heat. Add the popcorn kernels. When one pops, cover the pot, and cook, shaking the pot constantly, until the popping subsides to 1 pop every 20 seconds. Pour in the melted butter, and toss to coat. Add 2 heaping tablespoons of taco spice and 1/2 teaspoon salt, and toss again to coat.\n            \n\n              Store the remaining taco spice blend at room temperature in an airtight container for up to 2 weeks. (You'll have enough to make 3 more batches of popcorn.)\n            \n", "ingredients": [{"food": "tomatoes", "quantity": 20.0}, {"food": "yeast extract spread", "quantity": 2.0}, {"food": "chili powder", "quantity": 2.0}, {"food": "cumin seed", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "butter oil", "quantity": 3.0}, {"food": "popcorn", "quantity": 0.5}], "title": "\nKids Can Make: Healthy Taco Popcorn\n"}, {"directions": "\nSpecial equipment: Your favorite 1 1/2-inch cookie cutters\n\n              Whisk together the egg white, vinegar and 3 tablespoons water in a small bowl; set aside. Refrigerate the egg yolk in a small bowl, covered, until ready to use.\n            \n\n              Pulse the flour, cornstarch, salt, baking powder, mustard, paprika and turmeric in a food processor to combine. Add the butter, Cheddar and Parmesan, and pulse until the butter is completely broken up. Pour in the egg white mixture, and pulse until the dough comes together in a ball. (It's OK if it's a little wet.)\n            \n\n              Transfer the dough to a large piece of plastic wrap, and pat it into a 1/2-inch-thick round. Wrap it up, and refrigerate to chill and firm up the dough, about 1 hour.\n            \n\n              Position 2 oven racks at the top and bottom third of the oven, and preheat the oven to 350 degrees F. Line 2 baking sheets with parchment.\n            \n\n              Roll the dough out on a large piece of parchment (to keep it from sticking to the counter) to about 1/8 inch thick. Cut shapes out with a 1 1/2-inch cookie cutter, and transfer the cutouts to the prepared baking sheets, spacing them about 1/2 inch apart. Gather and reroll the scraps and cut out more crackers; repeat with any remaining scraps. (Dust the dough with flour if you find it too sticky.)\n            \n\n              Whisk 2 teaspoons water into the egg yolk. Brush the tops of each cracker with the mixture. Sprinkle each with some sesame seeds, poppy seeds and the tiniest pinch of salt.\n            \n\n              Bake 2 baking sheets of crackers at a time, until the crackers are deep golden brown on the bottom, about 20 minutes, rotating the sheets about halfway through. Let cool on the baking sheet for a few minutes, then transfer to a cooling rack to cool completely. Bake the remaining cutouts.\n            \n\n              Store the crackers at room temperature in an airtight container for up to 2 days, or freeze them for up to 1 week.\n            \n", "ingredients": [{"food": "egg substitute", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "potato flour", "quantity": 1.5}, {"food": "cornstarch", "quantity": 1.0}, {"food": "salt", "quantity": 0.75}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "mustard spinach", "quantity": 0.5}, {"food": "paprika", "quantity": 0.5}, {"food": "turmeric", "quantity": 0.25}, {"food": "butter oil", "quantity": 6.0}, {"food": "", "quantity": 0.5}, {"food": "", "quantity": 0.5}, {"food": "sesame seeds", "quantity": 1.0}, {"food": "seeds", "quantity": 2.0}], "title": "\nKids Can Make: Healthy, Gluten-Free Cheesy Crackers\n"}, {"directions": "\nSpecial equipment: a 9-by-5-inch loaf pan\n\n              Put the milk, sugar, yeast and 1 cup of the flour in a large resealable plastic bag. Squeeze the air out of the bag and seal. Squish with your hands until well mixed. Let it rest for 10 minutes at room temperature; the mixture will begin to bubble.\n            \n\n              Add the melted butter, salt and remaining 3 1/2 cups flour to the bag, seal and squish again until well blended. Remove the dough from the bag and put it on a floured surface. Knead until smooth, about 5 minutes. \n            \n\n              Butter a 9-by-5-inch loaf pan and add the dough. Cover with a kitchen towel and put in a warm spot until the dough has just risen about 1 1/2 inches over the top of the pan, 2 to 2 1/2 hours. \n            \n\n              Position a rack in the center of the oven and preheat to 375 degrees F. Brush the top of the dough lightly with warm water and bake until golden brown, about 35 minutes. Using oven mitts, remove the loaf from the pan and place in the center of the oven rack. Continue baking until the loaf sounds hollow when rapped lightly with your knuckles on the bottom and top, or an instant-read thermometer inserted in the center registers about 190 degrees F, about 30 minutes more. Transfer the loaf to a cooling rack and cool completely before slicing.\n            \n", "ingredients": [{"food": "whole milk", "quantity": 1.5}, {"food": "sugar", "quantity": 2.0}, {"food": "yeast extract spread", "quantity": 0.25}, {"food": "potato flour", "quantity": 4.5}, {"food": "butter oil", "quantity": 3.0}, {"food": "salt", "quantity": 1.0}], "title": "\nKids Can Make: Homemade Bread\n"}, {"directions": "\nSpecial equipment: 2 or 3 mini muffin trays (for 36 muffins), mini muffin liners\n\n              Position oven racks in the upper and lower thirds of the oven, and preheat to 400 degrees F. Line 2 or 3 mini muffin trays with liners, and coat the liners generously with cooking spray.\n            \n\n              Bring a medium pot of salted water to a boil. Add the macaroni, and follow package directions for al dente. Drain the macaroni, and rinse in cold water until it is cool. Shake off any excess water.\n            \n\n              Put the heavy cream, cream cheese, eggs, mustard, paprika and garlic in a large bowl. Beat on low speed with an electric mixer until combined (the mixture may have small lumps). Add the cooked macaroni, Cheddar and Monterey Jack, and stir until combined.\n            \n\n              Drop heaping tablespoonfuls of the macaroni mixture into the prepared muffin liners. Combine the breadcrumbs and butter with your fingers in a small bowl until the mixture is the texture of wet sand. Sprinkle the top of each macaroni mound with buttered breadcrumbs.\n            \n\n              Bake until the cheese is melted and the bites are golden brown, 25 to 30 minutes. Let cool for at least 5 minutes before serving hot or at room temperature. Serve with hot sauce on the side if desired.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "macaroni cheese", "quantity": 0.5}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "eggs", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 0.5}, {"food": "garlic powder", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "", "quantity": 2.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1}], "title": "\nKids Can Make: Mac 'n' Cheese Bites\n"}, {"directions": "\n\n              Bring a large pot of water to a boil. Add the ravioli and cook according to the package directions. Drain and rinse under cold water until cool enough to handle.\n            \n\n              Position an oven rack in the middle of the oven and preheat to 400 degrees F. Brush the cups of a 12-cup muffin tin with 2 tablespoons of the oil. Set aside.\n            \n\n              Combine the tomatoes, Italian seasoning, carrot, garlic and remaining 2 tablespoons oil in a blender. Blend until well combined but not entirely smooth, about 20 seconds. Season with salt and pepper.\n            \n\n              Spoon 1/2 teaspoon sauce into each oiled cup, top with a ravioli, then with 1 teaspoon sauce and 1 teaspoon mozzarella. Repeat twice so that each cup has 3 raviolis layered on top of each other with sauce and mozzarella. Evenly divide the remaining sauce among the cups. Top each with 1 tablespoon mozzarella and 1/4 teaspoon Parmesan. Bake until the top of each lasagna is golden brown and bubbly, 18 to 20 minutes.\n            \n", "ingredients": [{"food": "macaroni cheese", "quantity": 24.0}, {"food": "vegetable oil", "quantity": 4.0}, {"food": "tomatoes", "quantity": 14.0}, {"food": "seasoning mix", "quantity": 1.5}, {"food": "carrot juice", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 1.5}, {"food": "", "quantity": 1.0}], "title": "\nKids Can Make: Mini Lasagna Cups\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Add the oats, raisins and pumpkin pie spice to the carafe of a blender and pour in the milk, adding more to cover the oats if needed. Stir completely and set aside until the oats are soft, 15 minutes.\n            \n\n              Blend on high speed until pureed and smooth, about 1 minute. Add the yogurt, brown sugar and 1 1/2 cups ice, and blend on high speed until smooth, about 30 seconds. Pour into 2 pint glasses.\n            \n", "ingredients": [{"food": "oats", "quantity": 0.75}, {"food": "raisins", "quantity": 0.25}, {"food": "pumpkin pie spice", "quantity": 0.25}, {"food": "whole milk", "quantity": 1.0}, {"food": "silk vanilla soy yogurt ", "quantity": 0.5}, {"food": "sugar", "quantity": 1.0}], "title": "\nKids Can Make: Oatmeal Cookie Smoothie\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Line the bottom of a 9-inch square baking pan with a foil strip long enough to overhang on 2 opposite sides. Spray the foil lightly with cooking spray; set aside.\n            \n\n              Whisk together the flour, oats, baking soda and salt in a medium bowl; set aside. Whisk the butter, egg, brown sugar and applesauce in a large bowl until combined. Add the dry ingredients to the wet and mix until barely mixed. Stir in the chocolate chips.\n            \n\n              Spread the batter in the prepared baking pan. Bake until the cake is light brown around the edges and a toothpick inserted in the center comes out clean, 25 to 30 minutes. Remove from the oven and let cool on a rack for 15 minutes. Use the foil overhang to lift the cake out of the pan and let cool completely on the rack. Invert onto a plate and peel the foil off. Re-invert the cake onto a cutting board, cut into 12 pieces and serve.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 1.0}, {"food": "oats", "quantity": 0.75}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 6.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "sugar", "quantity": 0.75}, {"food": "applesauce", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.75}], "title": "\nKids Can Make: Oatmeal-Chocolate Snack Cakes\n"}, {"directions": "\nSpecial equipment: A spice grinder\n\n              Position an oven rack in the bottom of the oven, and preheat it to 200 degrees F. Line a baking sheet with parchment, and generously coat with cooking spray. Spread the tomato paste out into a thin layer on the parchment (an offset metal spatula works best). Bake until the paste deepens to brick red and is dull in color and not shiny in any spots, about 2 hours. (It will look and feel like fruit leather.) Let it cool. Tear the paste into small pieces, and finely grind them in batches in the spice grinder.\n            \n\n              Add all the ground tomato paste back into the spice grinder, along with the Parmesan, oregano, garlic salt and pepper flakes, and grind to a fine powder. Store in an airtight container for up to 5 days. The spice blend makes enough for about 6 batches of popcorn.\n            \n\n              To make 1 batch of pizza popcorn: Heat 1/2 tablespoon olive or vegetable oil in a large pot over medium heat. Add 1/2 cup kernels; when one pops, cover the pot, and cook, shaking the pot constantly, until the popping subsides to 1 pop every 20 seconds. Add some melted butter and 2 heaping tablespoons of pizza spice, toss to coat.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "pasta with tomato sauce", "quantity": 6.0}, {"food": "", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "popcorn", "quantity": 3.0}], "title": "\nKids Can Make: Pizza Popcorn\n"}, {"directions": "\nSpecial equipment: Eight 12-inch wooden skewers\n\n              Soak eight 12-inch wooden skewers in water for 30 minutes. Prepare a grill for medium heat. Cut a 12-inch-square piece of aluminum foil.\n            \n\n              Stir together the oil, Italian seasoning and 1 teaspoon salt in a large bowl.\n            \n\n              Dust a work surface with flour. Roll the dough into a rectangle about 11 by 6 by 1/4 inches. Using a pizza wheel or a knife, cut the dough into 1-inch strips, then into 1-inch squares. Add the dough squares, tomatoes and sausage to the seasoned oil, and toss gently to coat.\n            \n\n              Working quickly to keep the dough from getting warm, thread the skewers, alternating sausage pieces (skewer them through the casings), tomatoes and dough squares (skewer them through opposite sides of each square, keeping them as flat as possible so they cook through). Leave 1/2 inch of the skewer at both ends empty. Each skewer should have 4 pieces each of sausage and dough and about 3 tomatoes.\n            \n\n              Grill the skewers, covered, until the tomatoes have dark grill lines and the dough squares have started to puff, 2 to 3 minutes. Put the prepared foil square on the grill, and transfer the skewers onto the foil cooked-side up, so that they are almost touching. Top with the mozzarella, and grill, covered, until the tomatoes are soft, the dough squares have doubled in size and the mozzarella has melted, 3 minutes more.\n            \n\n              Divide the skewers among 4 plates. Tear the basil leaves over the tops. Serve with the marinara sauce, for dipping, and pass the Parmesan and red pepper flakes.\n            \n", "ingredients": [{"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "", "quantity": 1}, {"food": "ruby red grapefruit juice blend", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "seasoning mix", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "potato flour", "quantity": 1}, {"food": "pizza rolls", "quantity": 0.5}, {"food": "grape juice", "quantity": 1.0}, {"food": "pork sausage links", "quantity": 12.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 0.5}], "title": "\nKids Can Make: Pizza Skewers\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Spray a 12-cup muffin tin generously with baking spray and set aside.\n            \n\n              Whisk the milk, flour, eggs, vanilla and 1/2 teaspoon salt in a medium bowl until combined. Drizzle in the melted butter while whisking until combined, then let the batter stand for 5 minutes. Whisk in the baking powder, then divide the batter evenly among the muffin cups (a scant 1/4 cup per muffin). Bake until the popovers are puffed and browned around the edges, 20 to 25 minutes, rotating the pan halfway through.\n            \n\n              While the popovers are baking, bring the berries, 1/2 cup water and granulated sugar to a simmer in a small saucepan over medium heat. Cook until the berries are juicy and soft and the liquid is reduced and thickened, about 10 minutes. Remove from the heat and cover to keep warm.\n            \n\n              When the popovers are done, turn them out of the pan, using a small spatula if necessary. Arrange 2 popovers on each of six plates and garnish with a dollop of the sauce and a dusting of confectioners' sugar if using.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1}, {"food": "whole milk", "quantity": 1.0}, {"food": "potato flour", "quantity": 0.75}, {"food": "eggs", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 3.0}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "mixed nuts", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "sugar", "quantity": 1.0}], "title": "\nKids Can Make: Popovers with Mixed-Berry Sauce\n"}, {"directions": "\n\n              Position an oven rack in the center of the oven, and preheat to 350 degrees F. Line a 9-by-13-inch baking pan with aluminum foil, leaving about a 2-inch overhang on all sides; butter the bottom and sides.\n            \n\n              Pulse 2 cups of the pretzels in a food processor to a fine powder; transfer to a medium bowl, add the flour, baking powder and salt, and stir to combine.\n            \n\n              Melt the butter in a medium saucepan over medium heat. Remove from the heat, and stir in the sugar; set aside to cool completely. Stir in the eggs and vanilla until completely combined. Add the pretzel-flour mixture in 2 batches, stirring after each until fully incorporated. Stir in the butterscotch chips and half the chocolate chips.\n            \n\n              Transfer the dough to the prepared pan, and spread it out evenly. Push the potato chips and the remaining 1/2 cup pretzel sticks into the top of the batter. Scatter the remaining chocolate chips. Bake until golden and a toothpick inserted in the center comes out with only a few crumbs attached, 30 to 35 minutes. Cool completely in the pan on a rack. Use the foil overhang to help lift the bars out of the pan. Cut into 24 squares. Store at room temperature in an airtight container for up to 3 days.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 2.0}, {"food": "turkey sticks", "quantity": 2.5}, {"food": "potato flour", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "salt", "quantity": 0.5}, {"food": "sugar", "quantity": 2.25}, {"food": "eggs", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "potato chips", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "potato chips", "quantity": 1.5}], "title": "\nKids Can Make: Pretzel and Potato-Chip Blondies\n"}, {"directions": "\n\n              Spray a large metal mixing bowl with cooking spray and set aside.\n            \n\n              Cook the marshmallows, butter, agave and 1/4 teaspoon salt in a medium saucepan over medium heat, stirring frequently, until the marshmallows are completely melted and the mixture is blended, about 3 minutes. Remove from the heat, add the puffed rice and stir to coat with the marshmallow-butter mixture.\n            \n\n              Transfer the rice mixture to the prepared bowl and sprinkle with the apricots, flaxseeds and sunflower seeds. Stir with a wooden spoon or hands lightly coated with cooking spray. Form into 8 logs or balls (about 1/2 cup each). Let cool about 30 minutes, then wrap tightly in parchment or plastic wrap.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "", "quantity": 2.0}, {"food": "butter oil", "quantity": 3.0}, {"food": "silk light vanilla", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "cereal bar", "quantity": 4.0}, {"food": "diced chicken", "quantity": 0.25}, {"food": "ground turkey", "quantity": 2.0}, {"food": "sunflower seed kernels", "quantity": 2.0}], "title": "\nKids Can Make: Puffed Rice Snowballs\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Position an oven rack in the center of the oven, and preheat to 400 degrees F. Brush the bottom and sides of a 9-by-5-inch loaf pan with oil.\n            \n\n              Pour the 3 tablespoons oil onto a large dinner plate, and sprinkle with 1/2 teaspoon salt. Pinch off pieces of dough the size of Ping-Pong balls, and roll them into rough balls. Roll each dough ball around in the salted oil until all sides are coated.\n            \n\n              Put half the balls in the prepared pan, squishing them together. Spread half the sauce over the balls, then sprinkle with half the pepperoni, mozzarella and Parmesan. Repeat with the remaining dough balls, sauce, pepperoni and cheeses.\n            \n\n              Put the loaf pan on a rimmed baking sheet (to catch any drips), and bake until the bread is puffed up and golden brown, about 25 minutes. Cover loosely with foil, and continue to bake until the bread is cooked through in the middle, about 25 minutes. Let it rest in the pan for 10 minutes, then use dry oven mitts or kitchen towels to carefully unmold. Sprinkle generously with Parmesan, and serve hot. (Let your guests pull the bread apart!)\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "pizza rolls", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 0.6666666666666666}, {"food": "luncheon slices", "quantity": 24.0}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 0.25}], "title": "\nKids Can Make: Pull-Apart Pizza Bread\n"}, {"directions": "\n\n              Position an oven rack in the center of the oven and preheat to 400 degrees F. Brush the bottom and sides of a 9-by-5-inch loaf pan with oil.\n            \n\n              Pour the 3 tablespoons oil onto a large dinner plate and sprinkle with 1/2 teaspoon salt. Pinch off pieces of dough the size of Ping-Pong balls and roll them into rough balls. Roll each dough ball around in the salted oil until all sides are coated.\n            \n\n              Put half of the dough balls in the prepared pan, squishing them together. Spread half of the pizza sauce over the balls, then sprinkle with half of the pepperoni, mozzarella and Parmesan. Repeat with the remaining dough balls, pizza sauce, pepperoni and cheeses.\n            \n\n              Put the loaf pan on a rimmed baking sheet (to catch any drips) and bake until the bread is puffed up and golden brown, about 25 minutes. Cover loosely with foil and continue to bake until the bread is cooked through in the middle, about 25 minutes more. Let it rest in the pan for 10 minutes, then use dry oven mitts or kitchen towels to carefully unmold. Sprinkle generously with Parmesan and serve hot with more pizza sauce for dipping. (Let your guests pull the bread apart!)\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "pizza rolls", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 0.6666666666666666}, {"food": "luncheon slices", "quantity": 24.0}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 0.25}], "title": "\nKids Can Make: Pull-Apart Pizza Bread\n"}, {"directions": "\nSpecial equipment: six 8-ounce ramekins or ovenproof coffee mugs 1 large roasting pan\n\n              Position an oven rack in the center of the oven, and preheat to 375 degrees F. Spread the bread on a baking sheet, and bake until crispy and dried out, about 10 minutes. Let cool completely.\n            \n\n              Meanwhile, melt the butter in a small skillet over medium heat, and cook until it starts to bubble and foam, about 5 minutes. Continue cooking, stirring constantly, until the foam subsides and brown specks start to appear, 1 to 2 minutes. Transfer the browned butter to a small bowl, scraping the brown bits from the bottom of the skillet, and let cool slightly.\n            \n\n              Whisk together 1/2 cup of the sugar, the eggs, lemon zest, vanilla and salt in a large bowl until the mixture is pale and thick. Whisk in the half-and-half and 3 tablespoons of the browned butter until combined. Stir in the bread and raspberries, and let the mixture sit for 30 minutes, stirring occasionally.\n            \n\n              Brush the inside of six 8-ounce ramekins with the remaining browned butter, and coat with the remaining 1 tablespoon sugar, tapping out any excess. Divide the bread pudding mixture evenly among the ramekins. Set the ramekins in a large roasting pan, and carefully fill the pan with 1/2 inch of hot water. Bake until the custard is just set and the tops are lightly golden brown in spots, about 45 minutes, rotating the pan once halfway through. Let cool for 10 minutes before serving.\n            \n", "ingredients": [{"food": "garlic bread", "quantity": 4.5}, {"food": "butter oil", "quantity": 4.0}, {"food": "sugar", "quantity": 0.5}, {"food": "eggs", "quantity": 4.0}, {"food": "lemons", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 1.5}, {"food": "raspberries", "quantity": 1.5}], "title": "\nKids Can Make: Raspberry-Lemon Bread Pudding\n"}, {"directions": "\n\n              Heat the oven to 350 degrees F. Spread the almonds on a rimmed baking sheet, and toast until lightly browned and fragrant, about 5 minutes; transfer to a small bowl, and set aside.\n            \n\n              Toss the grapes, blueberries, honey and lemon juice in a medium bowl. Stir together the ricotta and lemon zest in a small bowl.\n            \n\n              Dividing evenly, spread the 4 baguette halves with the butter. Transfer to the rimmed baking sheet, and toast until lightly browned and crisp, 5 to 7 minutes.\n            \n\n              Sprinkle the toasted halves with a pinch of salt and a bit of pepper, and spread each with 2 tablespoons of the ricotta mixture. Put each half on an individual serving plate, drizzle with honey, top with a generous 1/4 cup of the fruit mixture and sprinkle with 1 tablespoon of the toasted almonds. Serve with more honey on the side.\n            \n", "ingredients": [{"food": "pasta with sliced franks in tomato sauce", "quantity": 0.25}, {"food": "ruby red grapefruit juice blend", "quantity": 0.75}, {"food": "blueberries", "quantity": 0.5}, {"food": "honey smoked ham", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "lemon juice", "quantity": 1.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}], "title": "\nKids Can Make: Ricotta, Blueberry and Grape Toasts\n"}, {"directions": "\nSpecial equipment: Toothpicks\n\n              Pull the largest four romaine leaves from the outside of the bunch and wash and dry carefully, trying not to tear the leaves. Cut the leaves at the base where they were connected to the root; the pieces should be about 9-inches long. Using a vegetable peeler, shave the center rib so the leaves roll up more easily. Set aside.\n            \n\n              Combine the cream cheese, spinach and basil in a food processor and puree until smooth. Season with 1/4 teaspoon kosher salt and a few grinds of pepper.\n            \n\n              Lay one of the tortillas on a clean work surface and add one of the romaine leaves to fit neatly on top. Place 2 slices of turkey next to each other, covering the lettuce. Spread 2 tablespoons of the cream cheese mixture over the surface of the turkey and line up a quarter of the roasted pepper strips along one edge. Line up 1/4 cup of the shredded carrot just above the peppers. Roll up the wrap tightly starting from the edge with the peppers and carrots, so the wrap holds together with the peppers and carrots in the middle. Place the wrap seam-side down. Repeat with the remaining tortillas, vegetables, turkey and cream cheese spread. Cut the wraps into 1-inch pieces, then pierce each segment with a toothpick or skewer from the outside of the tortilla through the seam on the bottom.\n            \n", "ingredients": [{"food": "lettuce", "quantity": 1.0}, {"food": "whipped cream substitute", "quantity": 4.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 8.0}, {"food": "black bean mango", "quantity": 1}, {"food": "potato flour", "quantity": 10.0}, {"food": "smoked turkey roll", "quantity": 8.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.25}, {"food": "carrots", "quantity": 1.0}], "title": "\nKids Can Make: Roasted Turkey and Basil Cream Cheese Pinwheel Sandwiches\n"}, {"directions": "\nSpecial equipment: Six 4-inch unglazed terra-cotta flower pots\n\n              Heat 1 tablespoon of the oil in a large skillet over medium-high heat. Add the onions, and cook, stirring frequently, until golden brown, about 8 minutes. Remove the skillet from the heat, and let the onions cool.\n            \n\n              Put 1/2 cup warm water (about 110 degrees F) and the sugar in the bowl of an electric stand mixer fitted with a dough hook (or into a large bowl if you'll be kneading by hand), sprinkle the yeast over the water and let sit until foamy, about 5 minutes.\n            \n\n              Add 1 1/2 cups warm water (about 110 degrees F), the browned onions, the 2 remaining tablespoons oil, the flour, rosemary and salt, and mix on medium-high speed with the dough hook (or a wooden spoon) until a dough forms. Knead on medium-high speed, adding a little flour if the dough sticks to the bowl, until the dough is smooth and elastic, about 8 minutes (or turn the dough out onto a lightly floured surface and knead, dusting lightly with flour if necessary, until smooth and elastic, about 10 minutes).\n            \n\n              Brush a large bowl with olive oil. Add the dough, cover with plastic wrap and let stand at room temperature until more than doubled, 1 to 1 1/2 hours.\n            \n\n              Meanwhile, cut out circles of parchment the diameter of the flower pot bottoms, and place 1 circle in the bottom of each pot. Cut long, wide strips of parchment to fully line the sides. Coat the parchment with cooking spray.\n            \n\n              Punch the doubled dough down, and evenly divide into 6 pieces. While holding a piece of dough, tuck the edges under to form a ball, then place it seam-side down in a prepared flower pot. Repeat with the remaining dough balls, and let stand, uncovered, at room temperature until more than doubled, 1 to 1 1/2 hours more. (The dough will rise above the flower pot rim.)\n            \n\n              Position an oven rack in the center of the oven, and preheat to 375 degrees F. Bake the bread until dark golden brown, 25 to 30 minutes. Remove from the oven, and brush the top of each loaf with melted butter. Let cool until warm or room temperature, and serve. (Or wrap with plastic wrap and store at room temperature for up to 2 days.)\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "sugar", "quantity": 4.0}, {"food": "yeast extract spread", "quantity": 0.25}, {"food": "potato flour", "quantity": 5.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "salt", "quantity": 1.0}, {"food": "", "quantity": 1}, {"food": "butter oil", "quantity": 3.0}], "title": "\nKids Can Make: Rosemary Bread in a Flower Pot\n"}, {"directions": "\n\n              Heat the oil in a large nonstick skillet over medium-high heat. Add the ground beef, and cook, stirring frequently, until the beef begins to brown, about 4 minutes. Stir in the chili powder and 1 teaspoon salt, and continue cooking until the meat is cooked through, 2 minutes more. Drain off any excess liquid, and add back 2 tablespoons of it. Reduce the heat to low, stir in the ketchup, sugar, vinegar and 1/2 cup water and simmer, stirring occasionally, until the sauce is slightly thickened, about 8 minutes. Stir in the carrots and corn, and cook, partially covered, until the vegetables are tender and heated through, 5 minutes.\n            \n\n              Scoop some sauce onto 1 half of each slider bun, top with a handful of shredded cabbage and a pickle chip and serve.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "frankfurter beef", "quantity": 1.0}, {"food": "chili powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 0.75}, {"food": "sugar", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "carrots", "quantity": 0.5}, {"food": "corn bran", "quantity": 0.5}, {"food": "potato flour", "quantity": 8.0}, {"food": "swamp cabbage", "quantity": 1.0}, {"food": "pickle loaf", "quantity": 0.25}], "title": "\nKids Can Make: Sloppy Joe Sliders\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F. Line a baking sheet with parchment, and spray the parchment with cooking spray.\n            \n\n              Mix together the cream cheese and 2 tablespoons sugar in a small bowl. Roll each slice of bread flat with a rolling pin, and spread with 1 heaping teaspoon of the cream cheese mixture. Place 2 heaping teaspoons of the diced strawberries at one end of each slice. Starting at that end, roll up each slice. Pinch and press the seam and ends so each roll-up is sealed, and push back in any ingredients that may have snuck out of the ends.\n            \n\n              Whisk the cream and eggs together in a small bowl. Combine the remaining 1/2 cup sugar and the cinnamon in a shallow dish. Dip each roll-up in the egg mixture until completely submerged, shake off excess egg, then cover completely in the cinnamon sugar. Arrange the roll-ups, seam-side down and evenly spaced, on the prepared baking sheet.\n            \n\n              Bake the roll-ups until they're golden brown and the cinnamon sugar forms a crunchy layer, about 15 minutes. Let cool for 5 minutes, then transfer to a cutting board. Trim off any excess caramelized sugar, and slice each roll-up in half on the diagonal (be careful when slicing, as the filling is hot). Serve the roll-ups on a platter, with maple syrup on the side if using.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "macaroni cheese", "quantity": 0.25}, {"food": "sugar", "quantity": 2.5}, {"food": "garlic bread", "quantity": 6.0}, {"food": "diced chicken", "quantity": 5.0}, {"food": "ice cream swich", "quantity": 0.25}, {"food": "eggs", "quantity": 2.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "syrup", "quantity": 1}], "title": "\nKids Can Make: Strawberry French Toast Roll-Ups\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 400 degrees F to warm the tortillas.\n            \n\n              In a small bowl, combine the chili powder, cumin and 1 teaspoon salt. Stir until well mixed.\n            \n\n              Divide the ground beef into 4 equal sections, about 6 ounces each. Gently form the meat into thick disks, then place on a piece of wax paper. Press the patties until they're about 1/2-inch thick and 6 inches in diameter. Sprinkle each patty on both sides with the spice mix, using about 1/2 tablespoon per burger. Cut each patty in half, giving you 8 pieces.\n            \n\n              Heat a 10-inch cast-iron skillet over medium heat for 3 minutes. When the pan is hot, add 1 tablespoon of the oil and place 4 of the patties into the pan. Cook until the meat is browned half of the way up the side, 2 1/2 to 3 minutes. Flip and cook on the other side. Place a half-slice of cheese (torn into a few pieces so it fits on the burger) to cover the patty and melt over the top. Cook until the patty is well-browned on the bottom, another 2 1/2 minutes. Remove the burgers from the pan to a plate, tented with foil, to allow the juices to redistribute, at least 5 minutes. Scrape out any crusty bits on the bottom of the pan and pour off the extra grease. Add the remaining tablespoon of oil and repeat the process for the remaining 4 patties.\n            \n\n              Place the taco shells on a sheet pan to warm in the oven for about 5 minutes. If using soft tacos, wrap the stack of 8 in foil and warm for 5 minutes.\n            \n\n              Line the center of the taco shell with some lettuce and insert the burger. Slide 2 tomato slices alongside the patties and top with 1 teaspoon salsa and some sour cream, and serve.\n            \n", "ingredients": [{"food": "chili powder", "quantity": 3.0}, {"food": "cumin seed", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "frankfurter beef", "quantity": 1.5}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "corn bran", "quantity": 8.0}, {"food": "lettuce", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 0.25}, {"food": "ice cream swich", "quantity": 1}], "title": "\nKids Can Make: Taco Cheeseburger\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F.\n            \n\n              For the dressing: Whisk together the yogurt, lemon juice, oil, vinegar, thyme, 1/2 teaspoon salt and 1/4 teaspoon pepper in a small bowl until combined; set aside.\n            \n\n              For the salad: Spread the walnuts on a baking sheet, and toast until lightly browned and fragrant, 5 to 7 minutes. Let cool for 5 minutes, then break up into 1/4-inch pieces.\n            \n\n              To assemble: Toss the walnuts, chicken, apples, grapes and scallion whites together with the dressing in a large bowl until everything is well coated; season with salt and pepper. Scoop a scant 1/2 cup of the salad into each romaine leaf, and arrange 2 on each serving plate. Garnish with the scallion greens, and serve.\n            \n", "ingredients": [{"food": "silk banana-strawberry soy yogurt", "quantity": 0.5}, {"food": "lemon juice", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "walnuts", "quantity": 0.25}, {"food": "diced chicken", "quantity": 1.5}, {"food": "apple", "quantity": 1.5}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "turnip greens", "quantity": 3.0}, {"food": "chrysanthemum leaves", "quantity": 8.0}], "title": "\nKids Can Make: Waldorf Chicken Boats\n"}, {"directions": "\n\n              Add the blackberries to a medium bowl and sprinkle the sugar over in an even layer. Mix them together and mash with a fork. Let the mixture sit for 20 minutes. Add any extra juices from the watermelon, up to 2 tablespoons, to the berry mixture and stir to combine.\n            \n\n              To serve, arrange 1 cup of the watermelon cubes into an \"X\" shape in a banana split dish. Place one scoop of the ice cream in the middle. Scatter 2 tablespoons of the blackberry sauce over the ice cream. Top with a dollop of whipped cream, 1 or 2 cherries and a tablespoon of nuts. Repeat for the remaining servings.\n            \n", "ingredients": [{"food": "blackberries", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "watermelon seed krnls", "quantity": 4.0}, {"food": "ice cream swich", "quantity": 4.0}, {"food": "ice cream swich", "quantity": 1}, {"food": "maraschino cherries", "quantity": 4.0}, {"food": "barley flour or meal", "quantity": 0.25}], "title": "\nKids Can Make: Watermelon Split\n"}, {"directions": "\n\n              Preheat a grill to medium high. Prepare the french fries as the label directs; keep warm. \n            \n\n              Form the beef into four 6-ounce patties, about 3/4 inch thick; press the center of each patty with your thumb to make a 1/2-inch-deep indentation. Season the patties on both sides with salt and pepper. Lightly brush the grill grates with the vegetable oil, then grill the patties, indentation-side up, until marked on the bottom, about 5 minutes. Flip and cook until marked and slightly firm, about 3 more minutes for medium doneness. During the last minute of grilling, top each patty with a slice of cheese. Remove the patties to a plate and let rest 5 minutes. Grill the buns, cut-side down, until lightly toasted, about 1 minute. \n            \n\n              Spread the bun bottoms with ketchup and top with the burger patties and french fries. Cover with the bun tops. \n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "french toast", "quantity": 1.0}, {"food": "frankfurter beef", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "split pea soup", "quantity": 4.0}, {"food": "", "quantity": 1}], "title": "\nKids'-Menu Burgers\n"}, {"directions": "\n\n              Whisk the sugar and vinegar in a large bowl until the sugar dissolves, then whisk in 2 tablespoons vegetable oil. Add the coleslaw mix and herbs, season with salt and pepper and toss.\n            \n\n              Heat the remaining 1 tablespoon vegetable oil in a large nonstick skillet over medium-high heat. Add the kielbasa and cook until browned on both sides, 2 minutes; transfer to a paper towel-lined plate.\n            \n\n              Spread the mustard on the bread, then sandwich with half of the cheese, the kielbasa, jalapeno and the remaining cheese.\n            \n\n              Wipe out the skillet; add 1/2 tablespoon butter and melt over medium heat. Add 2 sandwiches and press another large skillet on top. Cook, pressing gently, until the bread is golden brown and the cheese melts, 4 to 5 minutes per side, adding another 1/2 tablespoon butter to the skillet when you flip. Transfer to a plate. Repeat with the remaining sandwiches. Serve with the coleslaw.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [{"food": "sugar", "quantity": 3.0}, {"food": "vinegar", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "cheesecake mix", "quantity": 1.0}, {"food": "dill seed", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 8.25}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "garlic bread", "quantity": 8.0}, {"food": "cheddar cheese", "quantity": 8.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}, {"food": "butter oil", "quantity": 2.0}], "title": "\nKielbasa Grilled Cheese\n"}, {"directions": "\n\n              Preheat the oven to 450 degrees F and line a rimmed baking sheet with parchment paper. Turn up four edges of a large piece of foil to make a rectangular tray (about 12 by 5 inches) for the sauerkraut; set aside\n            \n\n              On one side of the baking sheet, toss the potatoes with 1 tablespoon of the olive oil, and sprinkle with some salt and pepper; spread the potatoes into an even layer. Place the kielbasa on the other side of the baking sheet, leaving an empty place in the center for the foil tray. Brush the kielbasa with the remaining olive oil. Roast until the kielbasa begins to brown in spots and the potatoes are almost completely tender, about 15 minutes. \n            \n\n              Toss the sauerkraut with the caraway seeds and spread into an even layer in the prepared foil baking tray. Place the foil tray in the center of the baking sheet. Roast until the potatoes are completely tender and browned, the sauerkraut is warmed through and the kielbasa is browned in spots, 15 minutes more. Divide sausage and vegetables between two plates and enjoy.\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 0.75}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "smoked turkey roll", "quantity": 1.0}, {"food": "sauerkraut", "quantity": 1.0}, {"food": "seeds", "quantity": 0.25}], "title": "\nKielbasa and Sauerkraut Sheet Pan Dinner\n"}, {"directions": "\n\n              Put the potatoes in a large microwave-safe bowl and add 3 tablespoons water; cover with plastic wrap and microwave until tender, about 12 minutes.\n            \n\n              Meanwhile, cut the kielbasa into 4 equal pieces; halve lengthwise. Melt 1/2 tablespoon butter in a large skillet over medium heat. Add the kielbasa and cook, turning occasionally, until browned and heated through, about 10 minutes. Transfer to a plate and cover loosely with foil to keep warm.\n            \n\n              Increase the heat under the skillet to medium high; add the remaining 1 tablespoon butter. Add the broccoli and 1/4 cup water and cook, stirring, until crisp-tender, about 5 minutes. Add the sauerkraut and toss to warm through.\n            \n\n              Drain the potatoes. Warm the milk in the microwave, about1 minute; add to the potatoes along with the mustard, 1/2 teaspoon salt, and pepper to taste. Coarsely mash with a potato masher or fork. Serve the kielbasa with the potatoes and the broccoli.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 1.5}, {"food": "kielbasa", "quantity": 1.0}, {"food": "butter oil", "quantity": 1.5}, {"food": "broccoli raab", "quantity": 1.0}, {"food": "sauerkraut", "quantity": 1.0}, {"food": "whole milk", "quantity": 0.6666666666666666}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "salt", "quantity": 1}], "title": "\nKielbasa with Mashed Potatoes\n"}, {"directions": "\n\n              Make this spicy Korean condiment, then turn it into fried rice or serve it with your steak: Pulse 3 chopped red jalapenos, 4 garlic cloves, 1/4 cup sugar, 2 tablespoons chopped ginger, 1 teaspoon red pepper flakes and 2 tablespoons each fish sauce and salt in a food processor. Cut 1/2 head napa cabbage and 6 scallions into 2-inch pieces; toss with the jalapeno paste. Refrigerate at least 4 hours.\n            \n\n              Photograph by Tina Rupp\n            \n", "ingredients": [], "title": "\nKimchi\n"}, {"directions": "\n\n              Cut the bacon crosswise into 1/2-inch pieces. Toast the sesame seeds in a large skillet over medium heat until golden, shaking the pan, 2 to 3 minutes. \n            \n\n              Cut the nori sheets in half with shears, then cut into 1/2-inch-thick strips. \n            \n\n              Heat a large cast-iron skillet over medium-high heat. Add the bacon and stir-fry until almost cooked through, 6 to 8 minutes. Drain the kimchi, reserving the liquid. Raise the heat to high and stir-fry the kimchi until browned, 7 to 8 minutes. Add the rice, the reserved kimchi liquid, the sesame oil and half of the nori strips. Continue to cook, turning and flattening the rice mixture with a spatula until it starts to form a golden crust, about 8 minutes. (For more of a crust, remove the pan from the heat, cover and set aside 10 minutes.) \n            \n\n              Transfer the fried rice to a serving dish and sprinkle with the remaining nori strips and the toasted sesame seeds.\n            \n\nKimchi\n\n\n              Make this spicy Korean condiment, then turn it into fried rice or serve it with your steak: Pulse 3 chopped red jalapenos, 4 garlic cloves, 1/4 cup sugar, 2 tablespoons chopped ginger, 1 teaspoon red pepper flakes and 2 tablespoons each fish sauce and salt in a food processor. Cut 1/2 head napa cabbage and 6 scallions into 2-inch pieces; toss with the jalapeno paste. Refrigerate at least 4 hours.\n            \n\n              Photograph by Tina Rupp\n            \n", "ingredients": [{"food": "bacon", "quantity": 6.0}, {"food": "sesame seeds", "quantity": 3.0}, {"food": "seaweed", "quantity": 3.0}, {"food": "", "quantity": 3.0}, {"food": "crisped rice bar", "quantity": 4.5}, {"food": "vegetable oil", "quantity": 1.0}], "title": "\nKimchi Fried Rice\n"}, {"directions": "\n\n              Heat a cast-iron skillet over medium heat. Top 1 piece of bread with 1/4 cup grated Cheddar, kimchi, the remaining 1/4 cup grated Cheddar, and then the other slice of bread. Spread 1 tablespoon mayonnaise over the top slice, then add to the skillet mayonnaise-side down and cook for 3 minutes, pressing slightly to flatten. Spread the remaining 1 tablespoon mayonnaise on the top slice of bread, flip, and cook until golden, another 3 minutes. Quarter the sandwich and serve.\n            \n", "ingredients": [{"food": "garlic bread", "quantity": 2.0}, {"food": "", "quantity": 0.5}, {"food": "", "quantity": 0.25}, {"food": "mayonnaise dressing", "quantity": 2.0}], "title": "\nKimchi Grilled Cheese Sandwich\n"}, {"directions": "\n\n              Preheat the oven to 500 degrees F and place a rack on the bottom shelf.\n            \n\n              Place 2 cups of the kimchi and the pear into the bowl of a food processor. Blend to a chunky puree.\n            \n\n              Drain the liquid from the remaining kimchi into the food processor, and then chop into bite-size pieces.\n            \n\n              Cook the bacon in a large saute pan over medium heat until crispy and most of the fat has rendered, 12 to 15 minutes.\n            \n\n              While the bacon is cooking, roll out the pizza dough. Cut a piece of parchment paper to fit the back of an inverted baking sheet. Place the baking sheet in the oven on the bottom shelf. Lightly dust the parchment with flour. Divide the dough in half, and then stretch or roll 1 piece of dough into an 11-inch round directly on the parchment paper.\n            \n\n              Once the bacon is crispy, use a slotted spoon to transfer half of the bacon to a paper-towel-lined plate to drain. Add the kimchi puree to the remaining bacon in the pan. Stir to combine. Bring to a boil over medium-high heat, and then reduce to a simmer. Simmer, uncovered, until slightly thickened, stirring occasionally, about 5 minutes. Stir in 1 teaspoon of the sesame oil. Season with salt and pepper.\n            \n\n              To assemble 1 pizza, spread half of the kimchi sauce on the dough, leaving a 1/2-inch border. Sprinkle half of both cheeses over the kimchi sauce. Spread half of the chopped kimchi over the cheese. Brush the crust with half of the remaining sesame oil and sprinkle with half of the sesame seeds.\n            \n\n              Carefully lift the parchment onto the heated baking sheet. Cook until the crust is golden brown and the cheese is bubbly, 8 to 12 minutes. Remove from the oven. Allow to cool on the baking sheet for 5 minutes before serving. Sprinkle with half of the reserved bacon and garnish with some sliced scallions.\n            \n\n              Repeat with the remaining ingredients to make 1 more pizza.\n            \n", "ingredients": [{"food": "", "quantity": 3.5}, {"food": "pear nectar", "quantity": 1.5}, {"food": "bacon", "quantity": 8.5}, {"food": "pizza rolls", "quantity": 1.0}, {"food": "potato flour", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "sesame seeds", "quantity": 2.0}, {"food": "turnip greens", "quantity": 2.0}], "title": "\nKimchi Pizza with Bacon\n"}, {"directions": "\n\n              Mix 1 1/2 cups diced tomatoes, 3/4 cup chopped kimchi, 1/3 cup chopped cilantro and the juice of 1 lemon. Season with salt.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [], "title": "\nKimchi Salsa\n"}, {"directions": "\nSpecial equipment: 1 dry bean or plastic King Cake baby (available at party-supply stores or mardigrasday.com)\n\n              For the cake: \n            \n\n              Heat the milk in a saucepan until scalding; transfer to a food processor, add the yeast and pulse to combine. Add 1/2 cup flour and the egg yolks; process to combine. Pour the remaining 2 cups flour evenly over the yeast mixture; do not process. Put the lid on; set aside for 90 minutes.\n            \n\n              Add the 2 whole eggs, granulated sugar, lemon zest, salt and nutmeg to the food processor; process to make a slightly textured dough, about 1 minute. With the machine running, slowly add the butter to make a smooth, sticky dough. Transfer the dough to a lightly buttered bowl and cover tightly with plastic wrap; let rise in a warm place for 3 hours. Turn the dough out onto a clean surface and knead briefly; form into a ball and return to the bowl. Cover tightly with plastic wrap and refrigerate for 8 hours or overnight.\n            \n\n              For the filling: \n            \n\n              Plump the raisins in the bourbon in a small saucepan over medium heat. Remove from the heat and add the brown sugar, pecans, vanilla, cinnamon, orange zest, salt and the bean or plastic baby; mix until combined and set aside.\n            \n\n              On a floured surface, roll the dough into a 20-by-7-inch rectangle, with the long edge facing you. Spoon the filling in an even layer over the dough, leaving a 1-inch border along the top and bottom. Fold the bottom and then the top edge over the filling to make a tight roll; pinch to seal. Transfer the roll seam-side down to a parchment-lined baking sheet; tuck one end into the other to form a ring. Cover loosely with plastic wrap and set aside in a warm place until the roll doubles in size, about 2 hours.\n            \n\n              Preheat the oven to 350 degrees. Bake the cake until firm and golden brown, about 40 minutes. Cool on a rack.\n            \n\n              For the glaze: Mix 3 tablespoons water with the confectioners' sugar; brush 3 tablespoons glaze over the cake. Sprinkle with bands of colored sugar; drizzle with more glaze.\n            \n\n              Photograph by Lara Robby/Studio D\n            \n", "ingredients": [{"food": "milk", "quantity": 0.3333333333333333}, {"food": "yeast extract spread", "quantity": 1.0}, {"food": "potato flour", "quantity": 2.5}, {"food": "egg substitute", "quantity": 2.0}, {"food": "sugar", "quantity": 3.0}, {"food": "", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "nutmeg", "quantity": 0.5}, {"food": "healthy request microwavable bowl", "quantity": 1.5}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.5}, {"food": "", "quantity": 0.25}, {"food": "sugar", "quantity": 0.75}, {"food": "pecans", "quantity": 0.6666666666666666}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "orange", "quantity": 2.0}, {"food": "salt", "quantity": 0.25}, {"food": "barley flour or meal", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "sugar", "quantity": 1}], "title": "\nKing Cake\n"}, {"directions": "\n\n              Pour 1/2 to 1 ounce creme de cassis into a chilled flute. Fill the flute with champagne and garnish with a raspberry.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [], "title": "\nKir Royale\n"}, {"directions": "\n\n              Blend the kiwi, ginger, coconut milk, hemp seeds, parsley and agave nectar and 1/2 cup ice in a blender on high speed until light and frothy, about 3 minutes. Pour into a tall glass and serve immediately.\n            \n", "ingredients": [{"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "coconut milk", "quantity": 0.75}, {"food": "chrysanthemum leaves", "quantity": 0.25}, {"food": "seeds", "quantity": 0.25}, {"food": "tamarind nectar", "quantity": 1.0}], "title": "\nKiwi-Ginger Zinger Protein Smoothie\n"}, {"directions": "\n\n              Juice, in this order, the kiwis, watermelon and limes, following your juicer's specific settings for each. Stir in the chia seeds if using and let soak for 5 minutes. Serve the juice immediately over ice, if desired.\n            \n", "ingredients": [{"food": "", "quantity": 2.0}, {"food": "watermelon seed krnls", "quantity": 1.25}, {"food": "limes", "quantity": 2.0}, {"food": "chia seeds", "quantity": 1.0}], "title": "\nKiwi-Watermelon-Lime Juice\n"}, {"directions": "\n\nKebabs: \n\n\n              Smash the garlic cloves, sprinkle with a generous pinch of salt, and, with the flat side of a large knife, mash and smear mixture to a coarse paste. Mix the paste and the remaining 1 tablespoon salt with the meat, onion, parsley, and spices. \n            \n\n              Line a pan with aluminum foil. Divide the meat mixture into 28 rough balls. Mold each piece around the pointed end of a skewer (if you use wooden ones, soak them in water for 15 minutes before threading them), making a 2-inch oval kebab that comes to a point just covering the tip of the skewer. Lay the skewers on the pan, cover, and refrigerate for at least 30 minutes and up to 12 hours. \n            \n\n              Heat a grill pan over medium heat or prepare a grill. Brush the pan lightly with olive oil. Working in batches, grill the kebabs, turning occasionally, until brown all over and just cooked through, about 6 minutes. Transfer to a serving platter and serve with tzatziki and flat bread.\n            \n\nTzatziki: Yogurt Sauce (Greek yogurt and cucumber sauce)\n\n\n              If you're using plain whole milk yogurt, line a small sieve with a coffee filter. Put the yogurt in it, set it over a bowl, and refrigerate 12 hours. Discard the expressed liquid and put yogurt in the bowl. \n            \n\n              Grate the cucumber on the large holes of a box grater into another bowl. Sprinkle with the 2 teaspoons salt and rub into the cucumber with your hands. Set aside 20 minutes, then squeeze the cucumbers to express as much liquid as possible. \n            \n\n              Smash the garlic, sprinkle with a generous pinch of salt, and, with the flat side of a large knife, mash and smear the mixture to a coarse paste. Stir the cucumber, garlic, olive oil, lemon juice, and mint into the yogurt. Refrigerate for at least 1 hour before serving. \n            \n", "ingredients": [{"food": "garlic powder", "quantity": 4.0}, {"food": "salt", "quantity": 1.0}, {"food": "frankfurter beef", "quantity": 1.0}, {"food": "onion powder", "quantity": 3.0}, {"food": "parsley", "quantity": 3.0}, {"food": "ground turkey", "quantity": 1.0}, {"food": "cumin seed", "quantity": 1.0}, {"food": "cinnamon", "quantity": 0.5}, {"food": "allspice", "quantity": 0.5}, {"food": "pepper", "quantity": 0.25}, {"food": "ginger", "quantity": 0.25}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "garlic bread", "quantity": 1}, {"food": "silk plain soy yogurt", "quantity": 2.0}, {"food": "cucumber", "quantity": 1.0}, {"food": "salt", "quantity": 2.0}, {"food": "garlic powder", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "", "quantity": 0.5}], "title": "\nKofta Kebabs with Tzatziki\n"}, {"directions": "\n\n              Peel and quarter 2 pounds kohlrabi. Cook in boiling salted water until soft, about 30 minutes; drain. Puree with 2 tablespoons each heavy cream and butter; season with salt and pepper. Drizzle with olive oil and top with chopped parsley.\n            \n\n              Use a food processor or immersion blender to puree these veggies-they're too fibrous for a potato masher.\n            \n\n              Photograph by Sam Kaplan\n            \n", "ingredients": [], "title": "\nKohlrabi Mash\n"}, {"directions": "\n\n              Soak the red onion in cold water, 10 minutes. Meanwhile, cut the apple into matchsticks and toss with the lemon juice; set aside.\n            \n\n              Toast the pecans in a medium dry skillet over medium heat, stirring occasionally, about 5 minutes. Transfer to a cutting board and let cool slightly, then roughly chop.\n            \n\n              Toss the kohlrabies, 1 teaspoon salt and a few grinds of pepper in a large bowl. Combine the dressing and sugar in a small bowl. Drain the onion, squeezing out any excess water, then add to the kohlrabies along with the apple, carrots, parsley and toasted pecans. Add the dressing mixture and toss to combine; season with salt and pepper. Let sit 1 hour before serving.\n            \n\nBlue Cheese Dressing\n\n\n              Puree 1/2 cup each crumbled blue cheese and sour cream, 1/3 cup buttermilk, 1 small garlic clove (smashed) and 1 tablespoon white wine vinegar in a blender. Transfer to a bowl and stir in 1/4 cup more blue cheese, 2 to 3 dashes Worcestershire sauce and/or hot sauce, and 1 tablespoon chopped parsley. Season with salt and pepper. (Makes about 2 cups.)\n            \n\n              Photograph by Ryan Liebe\n            \n", "ingredients": [{"food": "onion powder", "quantity": 0.25}, {"food": "apple", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "dressing", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "carrots", "quantity": 1.0}, {"food": "parsley", "quantity": 0.5}], "title": "\nKohlrabi-Blue Cheese Slaw\n"}, {"directions": "\n\n              Fill a cocktail shaker halfway with ice. Add the vodka, amaretto, creme de cacao, cream of coconut and heavy cream. Shake well and strain into a cocktail glass. Garnish with coconut, if desired.\n            \n\n              Photograph by Jonathan Kantor\n            \n", "ingredients": [{"food": "", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "dulce de leche", "quantity": 1.0}, {"food": "coconut cream", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "coconut water", "quantity": 1}], "title": "\nKokomo\n"}, {"directions": "\n\n              Pour the kombucha and rum into a rocks glass filled with ice. Stir gently to combine. Serve garnished with a lime wedge.\n            \n", "ingredients": [{"food": "", "quantity": 3.0}, {"food": "coconut water", "quantity": 2.0}, {"food": "", "quantity": 1}], "title": "\nKombucha-cha-cha\n"}, {"directions": "\n\n              Soak the noodles in warm water to soften, 5 to 10 minutes, then drain and snip into pieces with kitchen shears. Meanwhile, combine the soy sauce, 3 tablespoons sesame oil, the garlic, brown sugar and vinegar in a bowl. Put the beef in another bowl and toss with 2 tablespoons of the soy sauce mixture. Heat 2 teaspoons sesame oil in a large nonstick skillet over high heat. Add the onion and 1 teaspoon salt and stir-fry 2 minutes. Add the beef and stir-fry until just cooked through. Transfer to a bowl. Rinse and wipe out the skillet, return to the heat and add 2 teaspoons sesame oil. Add the mushrooms and carrots; stir-fry 3 minutes. Add the noodles and 2 tablespoons of the soy sauce mixture and stir-fry 1 minute; add 1/3 cup water and cook until the noodles are just tender, 3 minutes. Transfer to the bowl with the beef. Wipe out the skillet, return to the heat and add the remaining 2 teaspoons sesame oil. Add the spinach and the remaining soy sauce mixture and cook, stirring, 1 minute. Add to the beef and toss. \n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "noodles", "quantity": 1.0}, {"food": "soy sauce", "quantity": 0.3333333333333333}, {"food": "vegetable oil", "quantity": 5.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "vinegar", "quantity": 1.5}, {"food": "rye grain", "quantity": 12.25}, {"food": "onion powder", "quantity": 1.25}, {"food": "salt", "quantity": 1}, {"food": "mushrooms", "quantity": 10.0}, {"food": "carrots", "quantity": 1.0}, {"food": "mustard spinach", "quantity": 6.0}], "title": "\nKorean Beef Noodles\n"}, {"directions": "\n\n              Whisk the soy sauce, 1 tablespoon sesame oil, the brown sugar and garlic in a shallow dish. Add the steak and turn to coat. Let marinate at room temperature, 20 minutes.\n            \n\n              Brush a large grill pan with vegetable oil and heat over medium-high heat. Remove the steak from the marinade (do not pat dry) and grill 2 to 3 minutes per side for medium rare. Transfer to a cutting board; let rest 5 minutes.\n            \n\n              Meanwhile, toss the scallions with 2 teaspoons sesame oil. Grill, turning, until charred, about 4 minutes; transfer to the cutting board and cut into 1-inch pieces. Slice the steak against the grain; toss with any collected juices.\n            \n\n              Whisk the mayonnaise and gochujang in a small bowl. Toss the kimchi, pear and the remaining 1 tablespoon sesame oil in another bowl. Lightly char the tortillas over a gas burner, about 20 seconds per side (or microwave as the label directs). Serve the steak and scallions in the tortillas with the greens, spicy mayonnaise and kimchi-pear mixture.\n            \n\n              Photograph by Justin Walker\n            \n\n              Whisk the soy sauce, 1 tablespoon sesame oil, the brown sugar and garlic in a shallow dish. Add the steak and turn to coat. Let marinate at room temperature, 20 minutes.\n            \n\n              Brush a large grill pan with vegetable oil and heat over medium-high heat. Remove the steak from the marinade (do not pat dry) and grill 2 to 3 minutes per side for medium rare. Transfer to a cutting board; let rest 5 minutes.\n            \n\n              Meanwhile, toss the scallions with 2 teaspoons sesame oil. Grill, turning, until charred, about 4 minutes; transfer to the cutting board and cut into 1-inch pieces. Slice the steak against the grain; toss with any collected juices.\n            \n\n              Whisk the mayonnaise and gochujang in a small bowl. Toss the kimchi, pear and the remaining 1 tablespoon sesame oil in another bowl. Lightly char the tortillas over a gas burner, about 20 seconds per side (or microwave as the label directs). Serve the steak and scallions in the tortillas with the greens, spicy mayonnaise and kimchi-pear mixture.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [{"food": "soy sauce", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "sugar", "quantity": 1.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "", "quantity": 1.0}, {"food": "mayonnaise dressing", "quantity": 0.3333333333333333}, {"food": "barley flour or meal", "quantity": 2.0}, {"food": "", "quantity": 1}, {"food": "", "quantity": 1.0}, {"food": "pear nectar", "quantity": 1.0}, {"food": "corn bran", "quantity": 12.0}, {"food": "mixed nuts", "quantity": 2.0}, {"food": "soy sauce", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "sugar", "quantity": 1.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "", "quantity": 1.0}, {"food": "mayonnaise dressing", "quantity": 0.3333333333333333}, {"food": "barley flour or meal", "quantity": 2.0}, {"food": "", "quantity": 1}, {"food": "", "quantity": 1.0}, {"food": "pear nectar", "quantity": 1.0}, {"food": "corn bran", "quantity": 12.0}, {"food": "mixed nuts", "quantity": 2.0}], "title": "\nKorean Beef Tacos\n"}, {"directions": "\n\nCucumber Kimchee:\n\n\n              Cucumber Kimchee:\n            \n\n              Prepare ribs according to photo below. Place the ribs in one layer in a large non-reactive baking dish, pour in the Korean BBQ Marinade, and turn the ribs to coat. Cover and refrigerate. Marinate for 2 to 8 hours (longer makes the ribs too salty).\n            \n\n              Prepare an outdoor grill with a high-heat fire.\n            \n\n              Remove the ribs from the marinade. Brush the grill grate lightly with oil. Place the ribs on the grill meaty side down and cook, turning as needed, until well browned but still pink inside, about 10 to 12 minutes. Set ribs aside to rest for 5 minutes. Serve with Cucumber Kimchee.\n            \n\n              Cucumber Kimchee:\n            \n\n              A day before serving, halve the cucumbers crosswise, set them upright on the cut end, and slice lengthwise into quarters, stopping about 1/2 inch from the cut end. Mix the scallions, garlic, ginger, sugar, salt, and red pepper and stuff about a tablespoon of the mixture into each cucumber. Put the cucumbers in a small non-reactive baking dish, cover with plastic wrap, and refrigerate overnight.\n            \n\nKorean BBQ Marinade:\n\n\n              Whisk soy sauce, garlic, ginger, scallions, sugar, sesame oil, and black pepper to taste in a medium bowl. Use marinade immediately or refrigerate for up to 2 days.\n            \n", "ingredients": [{"food": "frankfurter beef", "quantity": 6.0}, {"food": "", "quantity": 1}, {"food": "vegetable oil", "quantity": 1}, {"food": "", "quantity": 4.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "garlic powder", "quantity": 5.0}, {"food": "ginger", "quantity": 3.0}, {"food": "sugar", "quantity": 3.0}, {"food": "salt", "quantity": 1.5}, {"food": "ruby red grapefruit juice blend", "quantity": 1.5}, {"food": "soy sauce", "quantity": 1.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "ginger", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "sugar", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nKorean Short Ribs with Cucumber Kimchee\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 350 degrees F.\n            \n\n              Toast the walnuts until golden brown and fragrant, about 6 minutes. Let cool, then chop about half of the nuts (you should have about 1/2 cup chopped). Pulse the remaining nuts in the food processor until finely ground (about 1/4 cup ground).\n            \n\n              Stir the flour, baking powder, salt and nuts together in a medium bowl. Set aside.\n            \n\n              In another medium bowl, beat the butter, sugar, egg yolk, brandy and vanilla extract together with an electric mixer on medium-high speed until the mixture gets light and fluffy, about 10 minutes.\n            \n\n              At low speed, stir in the nut mixture to make a crumbly dough. Cover the bowl and set dough aside at room temperature for 1 hour.\n            \n\n              Preheat oven to 350 degrees F. Line two baking sheets with parchment or coat with nonstick spray.\n            \n\n              With a tablespoon, scoop out 1-inch pieces of dough and roll into balls between the palms of your hands. Pinch the ends of the balls to make a football shape. Place the cookies on the prepared baking sheets. Bake until the cookies set and start to brown, about 18 minutes.\n            \n\n              Remove cookies from the oven and immediately sprinkle them lightly with the orange water. (If you don't have a brush, simply dip your fingers into the water and flick it over the cookies a few times.) Take care not to douse them, just enough for them to carry the scent of flowers.\n            \n\n              Put the confectioners' sugar in a bag, and add 5 to 6 of the warm cookies to it. Very gently toss the cookies to coat with sugar. Remove them from the bag and cool cookies on a rack. Repeat with remaining cookies. Serve.\n            \n\n              Busy baker's tips: Dough can be frozen for up to 2 weeks. Store baked cookies in an airtight container for up to 1 week. Baked cookies can be wrapped in plastic, then aluminum foil, for up to 2 weeks. To serve, let cookies come to room temperature before dusting with confectioners' sugar.\n            \n\n              Cook's Note: If you can't find orange flower water, try specialty stores or online.\n            \n\n              Copyright (c) 2007 Television Food Network, G.P., All Rights Reserved\n            \n", "ingredients": [{"food": "walnuts", "quantity": 0.75}, {"food": "potato flour", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 0.5}, {"food": "sugar", "quantity": 0.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "coconut water", "quantity": 1.0}, {"food": "sugar", "quantity": 0.75}], "title": "\nKourabiedes (Greece): Walnut Sugar Cookies\n"}, {"directions": "\n\n              Prepare the meat: Combine the mustard seeds, juniper berries, peppercorns, allspice berries and bay leaves in a small skillet over medium heat; cook, swirling the skillet, until toasted, about 3 minutes. Transfer to a bowl to cool, then grind in a spice grinder with the cinnamon, ginger and 1 teaspoon salt. Coat the steak with the spice mixture and refrigerate at least 3 hours or overnight.\n            \n\n              Make the sauce: Combine the mayonnaise, ketchup, horseradish, vinegar, Worcestershire sauce and the shallot in a small bowl.\n            \n\n              Cook the meat: Heat a large cast-iron skillet over medium-high heat and add the vegetable oil. Add the steak and cook 3 to 5 minutes per side for medium rare. Transfer to a cutting board and let rest 5 minutes.\n            \n\n              Meanwhile, reduce the heat under the skillet to low. Add the sauerkraut and sprinkle with the caraway seeds; cook, tossing, until warmed through. Spread the sauerkraut into a thin layer and top with the cheese; let melt.\n            \n\n              Spread the rolls generously with the sauce. Thinly slice the steak against the grain and layer on the roll bottoms. Top each with some of the cheese-covered sauerkraut, sprinkle with the fried onions and cover with the roll tops.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [{"food": "mustard spinach", "quantity": 2.0}, {"food": "goji berries", "quantity": 5.0}, {"food": "black bean mango", "quantity": 5.0}, {"food": "allspice", "quantity": 5.0}, {"food": "chrysanthemum leaves", "quantity": 3.0}, {"food": "cinnamon", "quantity": 0.25}, {"food": "ginger", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 1.25}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "mayonnaise dressing", "quantity": 0.5}, {"food": "", "quantity": 0.25}, {"food": "horseradish", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "sauerkraut", "quantity": 1.75}, {"food": "seeds", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "pizza rolls", "quantity": 4.0}, {"food": "fried chicken", "quantity": 0.5}], "title": "\nKraut Pleaser\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Make the kugel: Brush a 4-quart shallow baking dish with margarine. Bring a large pot of salted water to a boil. Add the noodles and cook as the label directs. Drain well, then transfer to the prepared baking dish. Add the margarine and stir to melt and coat the noodles.\n            \n\n              Beat the cream cheese and 2 tablespoons apricot nectar in a large bowl with a mixer on medium speed until smooth. Add the sugar, then the eggs, one at a time, beating well after each addition. Add the milk and the remaining apricot nectar; beat until smooth and creamy. Pour the mixture over the noodles; stir to coat.\n            \n\n              Make the topping: Combine the cornflakes, melted margarine and sugar in a medium bowl. Sprinkle on top of the noodle mixture and bake until just set in the center, about 1 hour. (If the topping is golden but the kugel is not yet set, turn off the oven and keep the kugel inside up to 20 more minutes.) Let cool 20 to 30 minutes before serving.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "egg substitute", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "apricot nectar", "quantity": 2.0}, {"food": "sugar", "quantity": 0.5}, {"food": "eggs", "quantity": 6.0}, {"food": "milk", "quantity": 2.0}, {"food": "", "quantity": 3.0}, {"food": "margarine spread", "quantity": 6.0}, {"food": "sugar", "quantity": 0.25}], "title": "\nKugel with Apricot Nectar\n"}, {"directions": "\n\n              Mix 1 tablespoon soy sauce and 2 teaspoons each rice wine, cornstarch and water in a medium bowl. Add the chicken and toss; cover and refrigerate until ready to use.\n            \n\n              Whisk the remaining 2 teaspoons soy sauce, 1 tablespoon rice wine and 1 1/2 teaspoons cornstarch, the sugar, chili oil and 2 tablespoons water in a small bowl.\n            \n\n              Heat 2 tablespoons peanut oil in a wok or large skillet over medium-high heat. Add the chicken and stir-fry 30 seconds. Transfer to a plate.\n            \n\n              Heat the remaining 1 tablespoon peanut oil in the skillet. Add the garlic, ginger, scallion whites and precut vegetables; stir-fry until the vegetables are crisp-tender, 5 minutes. Add the chicken and peanuts and stir-fry until the chicken is cooked through, 3 to 5 minutes. Stir the soy sauce-chili oil mixture, add to the skillet and cook until the sauce thickens, 30 seconds. Serve over rice and top with the scallion greens.\n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [{"food": "soy sauce", "quantity": 1.0}, {"food": "crisped rice bar", "quantity": 1.0}, {"food": "cornstarch", "quantity": 3.5}, {"food": "diced chicken", "quantity": 1.25}, {"food": "sugar", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.5}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "turnip greens", "quantity": 2.5}, {"food": "vegetables", "quantity": 4.0}, {"food": "fruit cocktail", "quantity": 0.5}, {"food": "crisped rice bar", "quantity": 1}], "title": "\nKung Pao Chicken\n"}, {"directions": "\n\n              Heat a wok or large skillet over high heat and add the oil. Add the onions and stir-fry until just wilted, about 30 seconds. Add the snow peas and stir-fry until nearly crisp-tender, about 2 minutes more. Add the sauce and stir-fry to coat, about 1 minute.\n            \n\n              Transfer to a platter or large bowl, sprinkle with the nuts and serve. \n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 0.5}, {"food": "pigeon peas", "quantity": 8.0}, {"food": "soy sauce", "quantity": 0.25}, {"food": "barley flour or meal", "quantity": 2.0}], "title": "\nKung Pao Snow Peas\n"}, {"directions": "\n\n              Toss the turkey and 1 teaspoon each soy sauce and mirin in a large bowl; set aside. Combine the 3 finely chopped scallions with the garlic and ginger in a small bowl; set aside. Whisk 1 cup water, the remaining 1 tablespoon plus 2 teaspoons each soy sauce and mirin, the vinegar, cornstarch and sugar in another small bowl; set aside.\n            \n\n              Heat a wok or Dutch oven over high heat. Add the peanut oil, then add the dried peppers and stir-fry until lightly browned, 30 seconds. Immediately add the scallion pieces and stir-fry until tender, about 1 minute. Add the peanuts, turkey and the scallion-garlic mixture; stir-fry 20 seconds. Reduce the heat to medium. Add the soy sauce-cornstarch mixture and cook, stirring, until thick and glossy, about 2 minutes. Serve over the rice.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [{"food": "turkey breast", "quantity": 1.25}, {"food": "soy sauce", "quantity": 2.0}, {"food": "barley flour or meal", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "ginger", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "cornstarch", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "ruby red grapefruit juice blend", "quantity": 6.0}, {"food": "barley flour or meal", "quantity": 0.5}, {"food": "crisped rice bar", "quantity": 2.0}], "title": "\nKung Pao Turkey Stir-Fry\n"}]