[{"directions": "\nSpecial equipment: a long spoon\n\n              Freeze a highball glass for 10 minutes. Pour the milk into the chilled glass. While stirring with a long spoon, pour in 1/4 cup of the syrup of your choice (see below). Slowly top off the glass with flavored seltzer; gently stir until frothy on top and combined. Serve immediately.\n            \n\n              For the chocolate egg cream: Combine the sugar, cocoa powder and 1/2 cup water in a small saucepan. Place over medium heat and whisk. Simmer until the sugar is dissolved and the mixture is syrupy. Cool to room temperature; refrigerate up to 2 weeks. Makes about 3/4 cup.\n            \n\n              For the pink egg cream: Combine the sugar, raspberries and 1/2 cup water in a small saucepan. Place over medium heat and mash the raspberries with a wooden spoon or potato masher. Simmer until the sugar is dissolved and the mixture is syrupy. Cool to room temperature; refrigerate up to 2 weeks. Makes about 3/4 cup.\n            \n\n              For the blueberry egg cream: Combine the sugar, blueberries and 1/2 cup water in a small saucepan. Place over medium heat and mash the blueberries with a wooden spoon or potato masher. Simmer until the sugar is dissolved and the mixture is syrupy. Cool to room temperature; refrigerate up to 2 weeks. Makes about 3/4 cup. \n            \n\n              For the pina colada egg cream: Combine the sugar, pineapple and 1/2 cup water in a small saucepan. Place over medium heat and mash the pineapple with a wooden spoon or potato masher. Simmer until the sugar is dissolved and the mixture is syrupy. Cool to room temperature; refrigerate up to 2 weeks. Makes about 3/4 cup.\n            \n\n              For the matcha egg cream: Combine the sugar, matcha and 1/2 cup water in a small saucepan. Place over medium heat and whisk until sugar and matcha are dissolved. Cool to room temperature; refrigerate up to 2 weeks. Makes about 3/4 cup.\n            \n", "ingredients": [{"food": "milk", "quantity": 0.5}, {"food": "sugar", "quantity": 0.75}, {"food": "onion powder", "quantity": 0.5}, {"food": "", "quantity": 1}, {"food": "sugar", "quantity": 0.75}, {"food": "raspberries", "quantity": 0.5}, {"food": "", "quantity": 1}, {"food": "sugar", "quantity": 0.75}, {"food": "blueberries", "quantity": 0.5}, {"food": "", "quantity": 1}, {"food": "sugar", "quantity": 0.75}, {"food": "pineapple chunks", "quantity": 0.5}, {"food": "", "quantity": 1}, {"food": "sugar", "quantity": 0.75}, {"food": "onion powder", "quantity": 0.25}, {"food": "", "quantity": 1}], "title": "\nLa Croix Egg Creams\n"}, {"directions": "\nSpecial equipment: Small paintbrush\n\n              For the antennae: Unroll the licorice and cut into twelve 1 1/4-inch-long pieces. Separate the two strands from each other, leaving them attached at one end. Roll 2 small (1/4-inch) balls of yellow fondant for each pair of antennae and attach to the separated ends of the licorice. Enclose the remaining fondant in plastic wrap so it does not dry out. Repeat with the remaining pairs of antennae. Set aside to dry.\n            \n\n              For the legs: Cut more licorice into 2 1/2-inch segments. Separate the strands from each other to make 72 legs. Roll 72 small (1/4-inch) balls of yellow fondant to make a foot for each leg. Attach a foot to the end of each leg. Set all the legs aside to dry.\n            \n\n              For the bodies: Shape about 2 teaspoons of red fondant into a ladybug body the size of a small walnut. Make a line in the back of the body with a small knife. Roll a small ball of black fondant about 3/4 inch in diameter for the head. Attach a pair of antennae by sticking the licorice into the head. Using a small brush with a little water, moisten the front of the head and attach 2 yellow sprinkles for eyes.\n            \n\n              Roll enough 1/4-inch balls of black fondant for spots and flatten them slightly. Moisten the backs of the ladybugs and attach the black spots. Attach 3 legs to each side of the body by pressing them in. (Use a skewer to make holes to help guide, if needed.)\n            \n\n              To assemble: Attach each head to a body by brushing the surface of the body with a little water and gently pressing the head on to adhere. Add pupils to the eyes by dipping a skewer into the melted chocolate and making small dots on the yellow sprinkles.\n            \n\n              Frost each cupcake with about 2 tablespoons buttercream. Place the ladybug in the middle and press gently into the frosting. Repeat with the remaining elements.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "frog legs", "quantity": 2.0}, {"food": "", "quantity": 4.0}, {"food": "", "quantity": 2.0}, {"food": "yellow rice", "quantity": 24.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "", "quantity": 12.0}, {"food": "", "quantity": 1.5}], "title": "\nLadybug Cupcakes\n"}, {"directions": "\n\n              Position 2 racks in the middle of the oven; preheat the oven to 325. Generously grease 2 baking sheets with butter (about 2 tablespoons) and dust with flour; tap off the excess flour.\n            \n\n              Measure out the flour and put in a fine-mesh strainer set in a bowl. Beat the egg yolks and 1/2 cup sugar in a stand mixer fitted with the paddle attachment on medium-high speed until thick and pale, 6 to 7 minutes. Add the vanilla and beat until just combined. Transfer the egg yolk mixture to a large bowl. Clean out the mixer and dry.\n            \n\n              Put the egg whites and salt in the mixer; beat with the whisk attachment on medium speed, adding the remaining 1/2 cup plus 2 tablespoons sugar, 1 tablespoonful at a time, until combined, about 3 minutes. Increase the speed to medium high and continue beating until the egg whites are shiny and stiff, 4 to 6 minutes.\n            \n\n              Add one-third of the egg white mixture to the yolk mixture, then sift about one-third of the flour over the eggs. Gently fold the ingredients together with a rubber spatula. Repeat 2 more times, folding in one-third each of the egg white mixture and flour each time. (Do not overmix or the batter will deflate.) Put the confectioners' sugar in the mesh strainer.\n            \n\n              Transfer the batter to a pastry bag fitted with a 1/2-inch round tip. Pipe 3-inch ladyfingers onto the prepared baking sheets, about 11/2 inches apart. Dust the ladyfingers with some of the confectioners' sugar to coat and set aside until the sugar starts to dissolve, about 5 minutes. Dust with another coating of confectioners' sugar. Bake until golden, 20 to 25 minutes, rotating the baking sheets halfway through the cooking time. Remove the ladyfingers with a spatula and transfer to a rack to cool.\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 1}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "eggs", "quantity": 6.0}, {"food": "sugar", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "salt", "quantity": 0.25}, {"food": "sugar", "quantity": 0.5}], "title": "\nLadyfingers\n"}, {"directions": "\n\n              Combine 3/4 cup mint, the panko or matzo meal and 2 tablespoons olive oil in a medium bowl. Add the minced garlic, 1 teaspoon rosemary, the red pepper flakes and 1/2 teaspoon salt and mix until combined. \n            \n\n              Unroll the \"tail\" of each lamb chop (the long thin section folded around the chop). Season the lamb with salt, then press the crumb mixture under the tail section; roll up the tail around the filling and secure with kitchen twine. Put the chops on a plate, cover with plastic wrap and refrigerate 2 to 4 hours. \n            \n\n              Preheat the oven to 450 degrees F. Remove the lamb chops from the refrigerator 20 minutes before cooking. Make the tomato-mint jam: Toss the tomatoes, whole garlic clove, 1 tablespoon olive oil and the remaining 1 teaspoon rosemary on a rimmed baking sheet. Transfer to the oven and roast until the tomatoes are slightly charred, 15 to 20 minutes; let cool slightly, then transfer to a medium bowl. Add the vinegar and sugar and mash with a fork until somewhat smooth. Stir in the remaining 1/4 cup mint and season with salt. \n            \n\n              Heat a skillet over medium-high heat. Add the remaining 1 tablespoon olive oil; sear the lamb chops until browned, about 3 minutes per side. Using tongs, turn the chops onto their sides and sear until the fat browns, about 2 minutes. Transfer to a rimmed baking sheet; roast in the oven until a thermometer inserted into the center registers 140 degrees F for medium rare, about 10 minutes. Let rest 5 minutes; remove the twine and serve with the tomato-mint jam. \n            \n\n              Photograph by Christina Holmes\n            \n", "ingredients": [{"food": "", "quantity": 1.0}, {"food": "barley flour or meal", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "cloves", "quantity": 2.0}, {"food": "rosemary", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "lamb", "quantity": 8.0}, {"food": "fruit cocktail", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "sugar", "quantity": 0.75}], "title": "\nLamb Chops With Tomato-Mint Jam\n"}, {"directions": "\n\n              Put the cucumber slices in a colander and sprinkle with salt and pepper; toss. Let sit 20 minutes to drain.\n            \n\n              Meanwhile, heat 1/4 cup olive oil in a medium saucepan over medium heat. Add the onion, coriander and turmeric and cook, stirring occasionally, until softened, about 10 minutes. Add 1 cup water, the cilantro stems and carrots and bring to a simmer. Cover and cook, stirring occasionally, until the carrots are tender, about 10 minutes. Transfer the vegetable mixture to a food processor and puree until smooth, at least 1 minute. Season with 1 teaspoon salt and a few grinds of pepper; cover to keep warm.\n            \n\n              Gently squeeze out any excess water from the cucumbers and transfer to a medium bowl. Stir in 2 tablespoons olive oil, the vinegar, cilantro leaves, garlic and jalapeno; season with pepper.\n            \n\n              Heat a large cast-iron skillet over high heat. Season the lamb chops with salt and pepper; rub all over with the remaining 2 tablespoons olive oil. Cook the lamb chops two at a time, turning once, until browned, 6 to 7 minutes for medium doneness. Serve with the carrot puree and cucumber salad.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "onion powder", "quantity": 1.0}, {"food": "ground turkey", "quantity": 0.5}, {"food": "turmeric", "quantity": 0.25}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "carrots", "quantity": 1.5}, {"food": "vinegar", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "seeds", "quantity": 0.5}, {"food": "lamb", "quantity": 4.5}], "title": "\nLamb Chops with Carrot Puree and Cucumber Salad\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Line a baking sheet with foil. Toss the fennel and tomatoes with 2 tablespoons olive oil and season with salt and pepper. Spread the vegetables on the baking sheet, with the tomatoes cut-side up. Roast until the tomatoes are soft and the fennel is golden, about 30 minutes, turning halfway through.\n            \n\n              Meanwhile, cook the garlic in the remaining 1 teaspoon olive oil in a medium saucepan over medium heat until golden, about 3 minutes. Add the beans and 2 1/2 cups water and cook, stirring occasionally, until the liquid thickens, about 15 minutes. Stir in the oregano and parmesan, if desired.\n            \n\n              Heat a grill pan over medium-high heat. Season the lamb with salt and pepper and grill until marked on the bottom, about 4 minutes. Flip and cook until just firm to the touch, 4 to 5 more minutes for medium-rare. Divide the beans among plates and top with the lamb and roasted vegetables.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "fennel seed", "quantity": 1.0}, {"food": "plum", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "garlic powder", "quantity": 2.0}, {"food": "fava beans", "quantity": 2.0}, {"food": "barley flour or meal", "quantity": 2.0}, {"food": "parmesan cheese", "quantity": 2.0}, {"food": "low fat big franks", "quantity": 4.0}], "title": "\nLamb Chops with Fennel and Tomatoes\n"}, {"directions": "\n\n              Heat a large skillet over medium-high heat. Dry the lamb chops well and season with salt and pepper, to taste. Add the oil to the pan and heat until shimmering. Lay chops in the pan and cook, turning once, until an instant-read thermometer inserted into the sides of the lamb registers 125 degrees F, about 4 minutes per side. After cooking the lamb on each side, stand it up on it's edges to brown the sides as well, about 2 minutes more. Reduce the heat if needed so the browned bits remaining in the pan don't burn. Remove chops from the skillet and set aside in a warm place.\n            \n\n              Pour off all but 1 1/2 tablespoons fat from the skillet. Add the garlic and cook, tilting the skillet to keep the garlic submerged in the fat, and cook until golden, about 1 minute. Add the wine and rosemary, stirring up browned bits from the bottom of the pan, and simmer over high heat until syrupy, about 3 to 4 minutes. Add the chicken broth and cook until reduced by about half, another 5 to 6 minutes. Remove pan from the heat and briskly whisk in the butter. When the butter has incorporated, whisk in the mustard and heavy cream. Season with additional salt and pepper.\n            \n\n              Serve 2 chops per person with the sauce.\n            \n", "ingredients": [{"food": "low fat big franks", "quantity": 8.0}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 2.0}], "title": "\nLamb Chops with Garlic and Rosemary\n"}, {"directions": "\n\n              In a dish large enough to hold the lamb chops in a single layer, combine half the lemon juice, 1/3 cup olive oil, the rosemary, garlic, 1 teaspoon of the salt and pepper. Add the lamb, turn to coat with the marinade and set aside for about 15 minutes at room temperature or up to 2 hours in the refrigerator.\n            \n\n              Preheat a large skillet over medium-high heat, for about 1 minute. Pat the chops dry and season on 1 side with salt and pepper. Add enough oil to lightly coat the surface of the pan. Working in batches if needed, add the chops seasoned side down to the pan. Cook until crisp and brown, about 2 to 3 minutes. Season the top side with salt and pepper, turn, and continue cooking until just firm and an instant-read thermometer registers 130 to 135 degrees F, about 1 to 2 minutes. Transfer to a platter and tent with foil to keep warm. Allow the chops to rest for 5 to 10 minutes.\n            \n\n              Pour off any fat left in the pan. Return the skillet to medium heat. Add the chicken stock, and scrape up the brown bits on the bottom of the pan with a wooden spoon. Add half the remaining lemon juice and simmer until the mixture is reduced to a glaze, about 4 minutes. Swirl in 2 tablespoons of butter. Add the basil and olives and season. Return the lamb chops to the sauce and toss and turn to coat thoroughly with sauce. Arrange chops on a platter, pour sauce over shops and garnish with basil leaves.\n            \n", "ingredients": [{"food": "lemon juice", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "rosemary", "quantity": 6.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "salt", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "lamb", "quantity": 8.0}, {"food": "diced chicken", "quantity": 0.5}, {"food": "butter oil", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "olives", "quantity": 0.25}], "title": "\nLamb Chops with Lemon-Basil Sauce\n"}, {"directions": "\n\n              Position a broiler pan 4 to 6 inches from the broiler and heat. Brush the chops lightly with some of the olive oil and season with salt and pepper. Carefully lay the chops on the hot pan and broil, turning once about halfway through cooking; 7 minutes for rare, 8 for medium, and 9 for well-done. Remove from the oven and set aside for 5 minutes.\n            \n\n              Divide the chops between 2 plates and spoon about 1 tablespoon of pesto over each chop; serve.\n            \n\nMint Walnut Pesto:\n\n\n              Preheat the oven to 350 degrees F. Spread the nuts in a single layer on a baking sheet. Bake for about 8 minutes, shaking occasionally to brown evenly. Let cool.\n            \n\n              In a food processor, puree the nuts, mint, parsley, cheese, garlic, and salt. With the motor running, drizzle in the olive oil until incorporated. Transfer the pesto to a container, place a piece of plastic wrap on the surface, and refrigerate for up to 3 days.\n            \n", "ingredients": [{"food": "lamb", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 4.0}, {"food": "walnuts", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "parsley", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 1.25}, {"food": "garlic powder", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.25}], "title": "\nLamb Chops with Mint-Walnut Pesto\n"}, {"directions": "\n\nLamb Chops:\n\n\n              Position a broiler pan 4 to 6 inches from the broiler and heat. Brush the chops lightly with some of the olive oil and season with salt and pepper. Carefully lay the chops on the hot pan and broil, turning once about halfway through cooking; 7 minutes for rare, 8 for medium, and 9 for well-done. Remove from the oven and set aside for 5 minutes.\n            \n\n              Divide the chops between 2 plates and spoon about 1 tablespoon of pesto over each chop; serve.\n            \n\nMint Walnut Pesto:\n\n\n              Preheat the oven to 350 degrees F. Spread the nuts in a single layer on a baking sheet. Bake for about 8 minutes, shaking occasionally to brown evenly. Let cool.\n            \n\n              In a food processor, puree the nuts, mint, parsley, cheese, garlic, and salt. With the motor running, drizzle in the olive oil until incorporated. Transfer the pesto to a container, place a piece of plastic wrap on the surface, and refrigerate for up to 3 days.\n            \n", "ingredients": [{"food": "lamb", "quantity": 6.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 4.0}, {"food": "asparagus", "quantity": 1}, {"food": "walnuts", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "parsley", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 1.25}, {"food": "garlic powder", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.25}], "title": "\nLamb Chops with Mint-Walnut Pesto\n"}, {"directions": "\n\n              Whisk 1 cup plain whole-milk yogurt in a bowl. Add 1 1/2 teaspoons crumbled dried mint and 2 tablespoons grated onion. Mash 1 garlic clove into a paste with 1/2 teaspoon kosher salt; add to the yogurt along with 1/2 teaspoon pepper, 1 teaspoon lemon juice and a pinch of cayenne pepper. Season 8 frenched lamb rib chops with salt and pepper; marinate in the yogurt sauce for 1 to 4 hours. Preheat a grill to medium-high on one side and place a drip pan under the cooler side. Lightly oil the grate. Grill the chops over direct heat until marked, 3 to 4 minutes per side. Move to the cooler side of the grill; cover and cook until the meat reaches 120 for medium-rare, 15 minutes. Let rest 10 minutes.\n            \n\n              Photograph by Tina Rupp\n            \n", "ingredients": [], "title": "\nLamb Chops with Mint-Yogurt Marinade\n"}, {"directions": "\n\n              Make the dough: Combine the yeast, sugar, olive oil and 2 cups warm water; let stand 5 minutes. Whisk both flours and the salt in a large bowl. Add the yeast mixture to the flour mixture and stir with a fork until the dough forms. Turn out onto a lightly floured surface; knead until smooth and elastic, about 6 minutes. Place in a bowl brushed with oil, cover and let stand until doubled in size, about 1 hour.\n            \n\n              Punch down the dough and divide into 12 pieces. Roll each piece into a ball, cover and let stand until doubled in size, about 45 minutes.\n            \n\n              Meanwhile, make the topping: Heat 2 tablespoons olive oil in a large skillet over medium heat. Add the pine nuts, onion and bell pepper; cook, stirring, until softened, about 6 minutes. Stir in the tomato paste and cook 1 minute. Add the remaining 1/4 cup olive oil, the lamb, cumin, cinnamon, red pepper flakes, allspice and 1/2 teaspoon salt. Cook, breaking up the meat, until browned, 5 minutes. Stir in the tomatoes and cook 1 minute. Remove from the heat and stir in the yogurt, lemon juice, cilantro and parsley; season with salt.\n            \n\n              Make the sauce: Stir the yogurt, mint, lemon juice and 1/4 cup water in a bowl. Season with salt and pepper. Refrigerate, covered, until ready to use.\n            \n\n              Preheat the grill to medium. Cut twelve 9-inch squares of parchment paper. Stretch each piece of dough into an 8-inch round, brush with olive oil on both sides and stack the rounds, separating each with parchment.\n            \n\n              Invert the dough onto the grill; remove the paper. Grill in batches until golden brown on the bottom, 1 to 2 minutes. Flip and spread each round with 1/4 cup lamb mixture, leaving a border. Continue grilling until the dough is charred in spots and cooked through, about 3 minutes. Transfer the pizzas to a platter. Drizzle with olive oil and serve with the sauce.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "sugar", "quantity": 1.25}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "potato flour", "quantity": 4.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "salt", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 6.0}, {"food": "pine nuts", "quantity": 0.5}, {"food": "onion powder", "quantity": 0.5}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "pasta with tomato sauce", "quantity": 6.0}, {"food": "frankfurter beef", "quantity": 1.0}, {"food": "cumin seed", "quantity": 1.0}, {"food": "cinnamon", "quantity": 0.5}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "allspice", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "plum", "quantity": 2.0}, {"food": "silk banana-strawberry soy yogurt", "quantity": 0.25}, {"food": "lemon juice", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "parsley", "quantity": 2.0}, {"food": "silk banana-strawberry soy yogurt", "quantity": 0.6666666666666666}, {"food": "", "quantity": 0.25}, {"food": "lemon juice", "quantity": 1.0}, {"food": "salt", "quantity": 1}], "title": "\nLamb Pizzas\n"}, {"directions": "\n\n              Position a rack 6 inches from the broiler and preheat. Thinly slice the fennel lengthwise, using a mandoline if you have one. Soak the cut fennel in a bowl of very cold water. Smash the garlic cloves, sprinkle with the 1 teaspoon salt, and, with the flat side of a large knife, mash and smear the mixture to a coarse paste. Stir the garlic, olive oil, and marjoram together and rub all over the lamb. Season with pepper, to taste. Place the lamb, trimmed-side down on a broiler pan. Broil the meat until nicely browned, about 5 minutes. Turn and cook until an instant-read thermometer inserted into the sides of the meat registers 120 degrees F, another 2 to 3 minutes. Set meat aside to rest while preparing the salad.\n            \n\n              Pit and cut the plums and peach into chunks with their skins. Toss fruit in a salad bowl with the mesclun salad greens. Drain and pat the fennel dry, add to the salad.\n            \n\n              Thinly slice the lamb against the grain into bite-size pieces, and add that to the salad as well. Season salad with the salt and pepper, toss with the dressing, and divide evenly among 4 plates. Serve.\n            \n\nSherry Dressing\n\n\n              Whisk the vinegar, mustard, salt, and pepper, to taste, in a small bowl. Gradually whisk in the oil, starting with a few drops and then adding the rest in a steady stream, to make a smooth, slightly thick dressing.\n            \n", "ingredients": [{"food": "fennel seed", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "salt", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "marjoram", "quantity": 2.0}, {"food": "low fat big franks", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "plums", "quantity": 2.0}, {"food": "silk peach soy yogurt", "quantity": 1.0}, {"food": "turnip greens", "quantity": 8.0}, {"food": "", "quantity": 1}, {"food": "vinegar", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "salt", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}], "title": "\nLamb Salad with Peach, Plum and Fennel\n"}, {"directions": "\n\n              Heat a large Dutch oven with a tight-fitting lid over medium-high heat. Pour in enough oil to fill the pan about 1/4-inch deep. Spread flour out on a plate or piece of waxed paper. Season half the lamb with 1 teaspoon of the salt and some pepper. Dredge in the flour and shake off the excess. Cook, uncovered, stirring only occasionally, until well browned, about 8 minutes. Using a slotted spoon, transfer the lamb to a plate. Repeat with the remaining lamb. Discard the oil and wipe out the pan.\n            \n\n              Preheat the oven to 275 degrees F. Return the pot to the stove and melt the butter over medium-high heat. Add the onion and cook, stirring, until lightly browned, about 5 minutes. Stir in the garlic and tomato paste and cook until fragrant, about 2 minutes. Return the lamb to the pot and add the water or broth, and bring to a simmer. Using a piece of kitchen twine, tie together the parsley, thyme, and bay leaves and add the bundle to the pot. Stir in the remaining 2 teaspoons salt and pepper. Cover and transfer to the oven. Stew the meat until tender, about 1 1/2 hours.\n            \n\n              Remove the Dutch oven from the oven. Skim the fat from the cooking liquid with a ladle. Add the potatoes, carrots, celery, and the tomatoes, and bring to a simmer. Cook the stew, uncovered, on top of the stove until the liquid has thickened and the vegetables are tender, about 1 hour. Remove and discard the herb bundle. Stir in the vinegar. Divide among bowls and serve immediately.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.25}, {"food": "", "quantity": 1}, {"food": "lamb", "quantity": 2.5}, {"food": "salt", "quantity": 4.0}, {"food": "black bean mango", "quantity": 1}, {"food": "butter oil", "quantity": 2.0}, {"food": "onions", "quantity": 2.0}, {"food": "garlic powder", "quantity": 5.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "diced chicken", "quantity": 10.0}, {"food": "parsley", "quantity": 6.0}, {"food": "thyme", "quantity": 6.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "sweet potatoes", "quantity": 1.25}, {"food": "carrots", "quantity": 4.0}, {"food": "celery seed", "quantity": 2.0}, {"food": "whole milk", "quantity": 7.0}, {"food": "vinegar", "quantity": 1.0}], "title": "\nLamb Stew\n"}, {"directions": "\n\n              Combine the yogurt, 1 tablespoon lemon juice, 1/4 teaspoon each lemon zest, dried mint and salt, and a few grinds of pepper in a small bowl. Set aside.\n            \n\n              Heat 1 tablespoon olive oil in a large nonstick skillet over medium-high heat. Add the shallot and cook, stirring, until tender, about 4 minutes. Add the lentils and cook until warmed through, about 1 minute. Transfer to a large bowl and toss with the remaining lemon zest and juice, the cherry tomatoes, cucumbers, parsley, pita chips, 2 tablespoons olive oil, 1/2 teaspoon salt and a few grinds of pepper.\n            \n\n              Wipe out the skillet and return to high heat. Season the lamb chops with salt and pepper and rub all over with the remaining 1 tablespoon olive oil and 1 teaspoon dried mint. Add 2 chops to the skillet and cook, turning once, until well browned, 4 to 7 minutes. Transfer to a plate and tent with foil to keep warm. Repeat with the remaining 2 chops.\n            \n\n              Divide the lamb chops among plates. Serve with the lentil salad and yogurt sauce.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "silk banana-strawberry soy yogurt", "quantity": 0.5}, {"food": "grape juice", "quantity": 1.0}, {"food": "", "quantity": 1.25}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "lentils", "quantity": 1.0}, {"food": "silk black cherry soy yogurt", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "parsley", "quantity": 0.5}, {"food": "potato chips", "quantity": 1.5}, {"food": "lamb", "quantity": 4.5}], "title": "\nLamb with Lentil Salad\n"}, {"directions": "\n\n              Snip off top-to-bottom slices all around the marshmallows, leaving a sticky core (which you can eat)-each wedge will have a sticky inside and a powdery outside. You should have about 15 petals.\n            \n\n              Press the sticky sides into the blue sanding sugar. Arrange about 10 petals around the edge of the cupcake so that they extend slightly over the edge. Arrange the remaining petals in a second layer on top of the first.\n            \n\n              Cut 2 small pieces from the black licorice, dab some frosting on the ends and dip in the yellow sanding sugar. Stand it in the center of the flower.\n            \n", "ingredients": [{"food": "", "quantity": 3.0}, {"food": "yellow rice", "quantity": 1}, {"food": "frosting", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1.0}, {"food": "frosting", "quantity": 1}], "title": "\nLarge Marshmallow Flower\n"}, {"directions": "\n\n              In a large saucepan, melt 6 tablespoons of the butter over medium heat. Add the shallot, carrot, and celery, and cook until softened, about 5 minutes. Sift the flour over the vegetables, and cook the mixture, stirring constantly with a wooden spoon until it lightens in color, about 2 minutes. Slowly whisk in the milk and bring to a boil. Add the parsley, thyme, and bay leaf. Reduce the heat to low, and simmer, whisking occasionally, until the sauce is thickened, about 30 minutes. Strain and season with 1/2 teaspoon of the salt, nutmeg, and pepper to taste. Place plastic wrap on the surface of the sauce and set aside until ready to assemble the lasagna. (The sauce can be made a day ahead and refrigerated. Reheat before assembling the lasagna. )\n            \n\n              Meanwhile, cook the noodles. Bring a large pot of water to a boil, season generously with salt, and boil the lasagna noodles according to package instructions. Drain. Spread the noodles out and layer between pieces of plastic wrap. Set aside.\n            \n\n              Preheat the oven to 350 degrees F. Butter an ovenproof 9 x 13-inch casserole dish.\n            \n\n              Cover the bottom of the pan with a layer of noodles. Cover with 1 1/2 cups of the meat sauce, 1 cup of the white sauce and 3 tablespoons of the cheese. Repeat to make 3 more layers ending with the remaining meat sauce, white sauce, and cheese. Dot the top with the remaining tablespoon of butter. Bake until bubbly and hot, about 45 to 50 minutes. Remove from the oven and set aside for 10 minutes to firm up before serving.\n            \n\nMeat and Tomato Sauce:\n\n\n              In a large soup pot or Dutch oven, heat the olive oil over medium heat. Add the pepper flakes and cook for 15 seconds. Add the onion and cook, stirring occasionally, until golden brown, about 15 minutes. Add the garlic and cook until fragrant, about 1 minute. Stir in the tomato paste and cook, stirring constantly, for 1 minute. Add the tomatoes one at a time, crushing them by hand as you go. Season with 1 teaspoon salt and pepper to taste. Simmer the sauce over low heat, covered.\n            \n\n              Meanwhile, heat a large skillet over medium-high heat. Add the beef, pork, veal, savory, thyme, oregano, and fennel seeds. Season with 1 teaspoon salt and pepper. Break up the meat with a wooden spoon, and cook until it loses its raw color, about 7 minutes. Add the meat to the sauce, holding back any excess fat. Add the rind of the Parmesan, if using. Simmer the sauce, covered, over low heat, for 1 1/2 hours. (If the sauce gets too thick, adjust the consistency with water.) Season with salt and pepper to taste. Just before serving, remove the Parmesan rind and add the grated cheese.\n            \n", "ingredients": [{"food": "whole milk", "quantity": 6.0}, {"food": "butter oil", "quantity": 7.0}, {"food": "", "quantity": 1.0}, {"food": "corier leaf", "quantity": 3.0}, {"food": "thyme", "quantity": 1.0}, {"food": "carrot juice", "quantity": 0.5}, {"food": "celery seed", "quantity": 0.5}, {"food": "corier leaf", "quantity": 0.5}, {"food": "potato flour", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "barley flour or meal", "quantity": 1.0}, {"food": "nutmeg", "quantity": 1}, {"food": "lasagna", "quantity": 1.0}, {"food": "", "quantity": 5.5}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 6.0}, {"food": "pasta with tomato sauce", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "pasta with tomato sauce", "quantity": 28.0}, {"food": "black bean mango", "quantity": 1}, {"food": "frankfurter beef", "quantity": 0.5}, {"food": "veal", "quantity": 0.5}, {"food": "pork skins", "quantity": 0.5}, {"food": "barley flour or meal", "quantity": 1.0}, {"food": "thyme", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "fennel seed", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "", "quantity": 0.5}], "title": "\nLasagna Bolognese\n"}, {"directions": "\n\n              Make the ragu: Soak the porcini mushrooms in 2 cups hot water until soft, about 30 minutes. Drain the porcini, reserving the liquid.\n            \n\n              Finely chop the porcini and white mushrooms in a food processor; transfer to a bowl. Add the carrots, celery, garlic, parsley and prosciutto to the processor; pulse until finely chopped.\n            \n\n              Heat the olive oil in a large pot over high heat. Cook the ground beef and pork in batches, breaking them up with a wooden spoon, until browned, 6 to 8 minutes. Transfer the meat to a bowl. Add the wine to the pot, scraping up the browned bits. Add the liquid to the bowl with the meat.\n            \n\n              Melt the butter in the pot; add the onion, chopped carrot mixture, the rosemary, bay leaves and 2 teaspoons salt. Cook, stirring occasionally, until browned, 12 to 15 minutes. Add the tomato paste and mushrooms and cook, stirring, about 8 minutes.\n            \n\n              Return the meat mixture to the pot. Add the cognac and scrape up the browned bits. Cook, stirring, until the liquid is absorbed, about 5 minutes. Add 2 cups water and the reserved mushroom soaking liquid. Crush the tomatoes with your hands over the pot and add with their juices. Simmer over medium-low heat, stirring occasionally, until thickened, about 2 hours, 30 minutes. Cool completely.\n            \n\n              Meanwhile, make the bechamel: Melt the butter in a wide saucepan over medium heat. Add the flour, nutmeg, 2 teaspoons salt and 1/2 teaspoon pepper; cook, whisking, 2 to 3 minutes. Gradually whisk in the milk and cook, whisking, until thickened, 5 to 10 minutes. Reduce the heat to low and cook, whisking, 10 more minutes.\n            \n\n              Assemble the lasagna: Preheat the oven to 400 degrees F. Bring a few inches of salted water to a boil in a wide saucepan. Fill a large bowl with ice water. Line a baking sheet with a damp kitchen towel. Working in batches, boil the pasta until partially cooked, about 4 minutes, then remove with a skimmer and transfer to the ice water to cool. Remove the pasta sheets, shake off the excess water and arrange in a single layer on the towel. Cover the pasta with another damp towel.\n            \n\n              Brush the bottom and sides of a deep 11-by-13-inch baking dish with the butter. Spread 1/2 cup ragu in the pan. Cover with a layer of pasta, then sprinkle with 1/3 cup parmesan and 2/3 cup mozzarella. Spread 1 1/2 cups ragu over the cheese and top with 1 cup bechamel. Repeat with 3 more layers each of pasta, parmesan, mozzarella, ragu and bechamel. Top with a layer of pasta, then cover with the remaining bechamel. Sprinkle with the remaining parmesan and mozzarella. Tuck the edges of the pasta into the baking dish with a knife.\n            \n\n              Place the lasagna on a baking sheet to catch any drips; bake until bubbly and golden, about 40 minutes. Let rest 30 minutes before slicing and serving.\n            \n\n              Photograph by Anna Williams\n            \n", "ingredients": [{"food": "mushrooms", "quantity": 1.0}, {"food": "mushrooms", "quantity": 10.0}, {"food": "carrots", "quantity": 2.0}, {"food": "celery seed", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "parsley", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "frankfurter beef", "quantity": 1.0}, {"food": "pork skins", "quantity": 1.0}, {"food": "martha white foods", "quantity": 2.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "rosemary", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "pasta with tomato sauce", "quantity": 5.0}, {"food": "barley flour or meal", "quantity": 0.5}, {"food": "whole milk", "quantity": 1.0}, {"food": "butter oil", "quantity": 12.0}, {"food": "potato flour", "quantity": 0.5}, {"food": "nutmeg", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "whole milk", "quantity": 6.0}, {"food": "salt", "quantity": 1}, {"food": "lasagna", "quantity": 1.5}, {"food": "butter oil", "quantity": 2.0}, {"food": "parmesan cheese", "quantity": 0.75}, {"food": "barley flour or meal", "quantity": 1.0}], "title": "\nLasagna Bolognese\n"}, {"directions": "\n\n              In a large saucepan, melt 6 tablespoons of the butter over medium heat. Add the shallot, carrot, and celery, and cook until softened, about 5 minutes. Sift the flour over the vegetables, and cook the mixture, stirring constantly with a wooden spoon until it lightens in color, about 2 minutes. Slowly whisk in the milk and bring to a boil. Add the parsley, thyme, and bay leaf. Reduce the heat to low, and simmer, whisking occasionally, until the sauce is thickened, about 30 minutes. Strain and season with 1/2 teaspoon of the salt, nutmeg, and pepper to taste. Place plastic wrap on the surface of the sauce and set aside until ready to assemble the lasagna. (The sauce can be made a day ahead and refrigerated. Reheat before assembling the lasagna. )\n            \n\n              Meanwhile, cook the noodles. Bring a large pot of water to a boil, season generously with salt, and boil the lasagna noodles according to package instructions. Drain. Spread the noodles out and layer between pieces of plastic wrap. Set aside.\n            \n\n              Preheat the oven to 350 degrees F. Butter an ovenproof 9 x 13-inch casserole dish.\n            \n\n              Cover the bottom of the pan with a layer of noodles. Cover with 1 1/2 cups of the meat sauce, 1 cup of the white sauce and 3 tablespoons of the cheese. Repeat to make 3 more layers ending with the remaining meat sauce, white sauce, and cheese. Dot the top with the remaining tablespoon of butter. Bake until bubbly and hot, about 45 to 50 minutes. Remove from the oven and set aside for 10 minutes to firm up before serving.\n            \n\nMeat and Tomato Sauce:\n\n\n              In a large soup pot or Dutch oven, heat the olive oil over medium heat. Add the pepper flakes and cook for 15 seconds. Add the onion and cook, stirring occasionally, until golden brown, about 15 minutes. Add the garlic and cook until fragrant, about 1 minute. Stir in the tomato paste and cook, stirring constantly, for 1 minute. Add the tomatoes one at a time, crushing them by hand as you go. Season with 1 teaspoon salt and pepper to taste. Simmer the sauce over low heat, covered. \n            \n\n              Meanwhile, heat a large skillet over medium-high heat. Add the beef, pork, veal, savory, thyme, oregano, and fennel seeds. Season with 1 teaspoon salt and pepper. Break up the meat with a wooden spoon, and cook until it loses its raw color, about 7 minutes. Add the meat to the sauce, holding back any excess fat. Add the rind of the Parmesan, if using. Simmer the sauce, covered, over low heat, for 1 1/2 hours. (If the sauce gets too thick, adjust the consistency with water.) Season with salt and pepper to taste. Just before serving, remove the Parmesan rind and add the grated cheese. \n            \n", "ingredients": [{"food": "butter oil", "quantity": 7.0}, {"food": "", "quantity": 1.0}, {"food": "carrot juice", "quantity": 0.5}, {"food": "celery seed", "quantity": 0.5}, {"food": "potato flour", "quantity": 0.5}, {"food": "whole milk", "quantity": 6.0}, {"food": "corier leaf", "quantity": 3.0}, {"food": "thyme", "quantity": 1.0}, {"food": "corier leaf", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "hearts of palm", "quantity": 1}, {"food": "black bean mango", "quantity": 1}, {"food": "lasagna", "quantity": 1.0}, {"food": "", "quantity": 5.5}, {"food": "barley flour or meal", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 6.0}, {"food": "pasta with tomato sauce", "quantity": 0.25}, {"food": "pasta with tomato sauce", "quantity": 28.0}, {"food": "salt", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "frankfurter beef", "quantity": 0.5}, {"food": "veal", "quantity": 0.5}, {"food": "pork skins", "quantity": 0.5}, {"food": "barley flour or meal", "quantity": 1.0}, {"food": "thyme", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "fennel seed", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "hearts of palm", "quantity": 2.0}, {"food": "", "quantity": 0.5}], "title": "\nLasagna Bolognese\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: a pastry bag with a 1/2-inch-wide opening or a resealable plastic bag with the corner snipped to make a 1/2-inch-wide opening\n\n              Bring a large pot of water with 1 cup of confectioners' sugar to a boil and cook the noodles until very tender, about 20 minutes. Drain the noodles and transfer to a paper towel-lined baking sheet to dry for 5 minutes. Cut each noodle in half crosswise and roll into a 3-inch-wide tube. Put seam side-down on the lined baking sheet.\n            \n\n              Beat together the ricotta, mascarpone, vanilla and remaining 1/2 cup confectioners' sugar in a medium bowl with an electric mixer on medium-high speed until light and fluffy, about 4 minutes. Spoon into a pastry bag with a 1/2-inch-wide opening or a resealable plastic bag with the corner snipped to make a 1/2-inch-wide opening. Generously fill each noodle tube with the ricotta filling, it should spill out a little at the ends. \n            \n\n              Put the chocolate chips and/or the pistachios in separate small bowls, if using. Dip the ends of the cannolis into the chocolate chips and/or pistachios to coat. Arrange the cannolis on a serving platter and dust with confectioners' sugar. \n            \n", "ingredients": [{"food": "lasagna", "quantity": 6.0}, {"food": "sugar", "quantity": 1.5}, {"food": "whole milk", "quantity": 2.0}, {"food": "", "quantity": 0.25}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.3333333333333333}, {"food": "", "quantity": 0.3333333333333333}], "title": "\nLasagna Cannoli\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Cook the lasagna noodles according to package directions. You may want to cook an extra noodle or 2 in case they rip. Drain and toss with some oil. Drape the noodles over the edge of the pot, without overlapping, to cool.\n            \n\n              Meanwhile, mix the ricotta, Parmesan, tomatoes and 1/2 teaspoon salt together in a medium bowl.\n            \n\n              Lay out the noodles and evenly divide the ricotta mixture on the noodles, spreading it from end to end of each noodle. Top each with about a few pieces of basil and 3 pepperoni slices per roll if using. Roll up and cut each roll in half to make 16 cylinders. Pack 4 pieces, ruffle-side up, in each lunch container and refrigerate. Pack 1/4 cup of marinara sauce in a separate container with each serving.\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "lasagna", "quantity": 8.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "", "quantity": 1.5}, {"food": "", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 5.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "luncheon slices", "quantity": 24.0}, {"food": "Worcestershire sauce", "quantity": 1.0}], "title": "\nLasagna Roll-Ups\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the noodles and cook as the label directs. Drain; drizzle with olive oil and toss.\n            \n\n              Meanwhile, heat 1 tablespoon olive oil in a large Dutch oven or heavy-bottomed pot over medium-high heat. Add the onion and cook, stirring, until softened, about 4 minutes. Add the sausage, garlic and oregano and cook, stirring and breaking up the sausage with a wooden spoon, until the sausage is browned, about 3 minutes. Add the tomato paste and cook, stirring, until darkened, about 2 minutes.\n            \n\n              Add the chicken broth, tomatoes and 1 cup water; cover and bring to a simmer. Uncover and cook until slightly reduced, about 10 minutes. Stir in the noodles, basil, parmesan and heavy cream; simmer 2 more minutes.\n            \n\n              Divide the soup among bowls. Top with ricotta and sliced basil.\n            \n\n              Photograph by Johnny Miller\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "lasagna", "quantity": 8.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 0.5}, {"food": "garlic powder", "quantity": 3.0}, {"food": "", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 2.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "tomatoes", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "parmesan cheese", "quantity": 0.3333333333333333}, {"food": "ice cream swich", "quantity": 0.25}, {"food": "macaroni cheese", "quantity": 1}], "title": "\nLasagna Soup\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              For the raw apple beet slaw: Shred the apple and beets in a food processor fitted with the grater attachment and transfer to a medium bowl. Toss with the oil, dill, vinegar, salt and pepper. Refrigerate and let the flavors meld while you make the rest of the components.\n            \n\n              For the horseradish-pickle mustard: Combine the mustard, horseradish and pickle in a small bowl.\n            \n\n              For the latke bun: Peel the potatoes and onion and shred them in a food processor fitted with the grater attachment; transfer to a dish towel-lined strainer fitted over a large bowl. Let sit for 5 minutes, and then squeeze the veggies using the towel to get out the excess moisture. Transfer to a large bowl. Add the matzo meal, egg and a pinch each of salt and pepper and use your hands to mix them together.\n            \n\n              Fill a large cast-iron skillet with 1/2 inch oil. Heat over medium-high heat until the oil is very hot but not smoking. Working in batches, scoop the potato mixture by 1/3-cupfuls and form a bun shape. Carefully add the latkes to the skillet, flattening each slightly with a spatula. Fry, turning the latkes once, until golden brown and cooked through, about 3 minutes per side. Drain on paper towels and season with salt and pepper. Remove any loose bits of potato mixture from the oil in the pan between batches with a slotted spoon. You should have 12 bun halves.\n            \n\n              For the corned beef burger: Pulse the corned beef in a food processor fitted with the blade attachment until a coarse burger-like consistency. Add the egg and matzo meal and pulse just to combine. Form into 6 burger patties (about 1/4 cup each). Add enough oil to a large cast-iron skillet to coat the pan and heat over over medium heat. Working in batches, cook the burgers until the outsides are brown and crispy, about 4 minutes per side. The insides will still feel on the rare side, and that's ok...and delicious.\n            \n\n              To build Schmear 6 latke buns with applesauce. Top each with a corned-beef burger, then a pile of slaw. Schmear some horseradish-pickle mustard on the remaining 6 latkes, and place on top of the slaw. Cut your burger in half if you can't manage...it's a mouthful!\n            \n", "ingredients": [{"food": "apple", "quantity": 1.0}, {"food": "beets", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "dill seed", "quantity": 1.5}, {"food": "vinegar", "quantity": 1.5}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "spicy black bean enchilada", "quantity": 0.5}, {"food": "horseradish", "quantity": 1.5}, {"food": "pickle loaf", "quantity": 1.0}, {"food": "", "quantity": 1}, {"food": "sweet potatoes", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "soy meal", "quantity": 0.25}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "frankfurter beef", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "soy meal", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "", "quantity": 1}], "title": "\nLatke Burger\n"}, {"directions": "\n\n              Grate the potatoes and onion on the large holes of a box grater into a colander; add the garlic and 1 1/2 teaspoons salt and toss. Let sit 5 minutes, then wrap in a clean kitchen towel and wring out as much liquid as possible. Transfer the potato mixture to a large bowl.\n            \n\n              Add the nutmeg, 1/2 teaspoon pepper and all but about 1 tablespoon each of the chopped celery and parsley to the bowl. Add the egg and flour and stir until combined. Form 1/4 cupfuls of the potato mixture into balls, then flatten between your palms to make thin 2-inch patties; transfer to a plate.\n            \n\n              Preheat the oven to 325 degrees F and line a baking sheet with paper towels. Heat about 1/4 inch of peanut oil in a large nonstick skillet over medium-high heat; working in batches, add the latkes and fry until golden brown, about 5 minutes per side. Remove to the prepared baking sheet to drain, then transfer to the oven to keep warm while you cook the next batch.\n            \n\n              Season with salt and top with the reserved celery and parsley. Serve with applesauce and/or sour cream. (The latkes can be fried up to 2 hours ahead; reheat on a paper towel-lined baking sheet at 325 degrees F, 10 to 15 minutes.)\n            \n\n              Photograph by David Malosh\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 3.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "nutmeg", "quantity": 0.5}, {"food": "pepper", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 0.25}, {"food": "parsley", "quantity": 0.25}, {"food": "egg substitute", "quantity": 1.0}, {"food": "potato flour", "quantity": 0.25}, {"food": "low fat fried chicken", "quantity": 1}, {"food": "sour cream", "quantity": 1}], "title": "\nLatkes with Celery and Herbs\n"}, {"directions": "\n\n              Make the ice cream: Heat the heavy cream, milk, honey, 1/4 cup granulated sugar, the lavender and a pinch of salt in a saucepan over medium heat, stirring occasionally, until hot but not boiling, about 5 minutes.\n            \n\n              Whisk the egg yolks in a medium bowl; slowly drizzle in 1 cup of the hot cream mixture, whisking constantly. Gradually stir the hot egg mixture into the saucepan with the remaining cream mixture. Cook over medium heat, stirring constantly with a wooden spoon, until the custard is slightly thickened and coats the back of the spoon, about 8 minutes. Strain through a fine-mesh sieve into a bowl; discard the lavender. Fill a large bowl halfway with ice water. Carefully place the bowl of custard in the ice water and let sit, stirring the custard occasionally and adding more ice to the water as needed, until the custard is cold, about 30 minutes.\n            \n\n              Meanwhile, preheat the oven to 375 degrees F. Generously coat a 9-inch pie plate with cooking spray. Pulse the graham crackers, the remaining 1 heaping tablespoon granulated sugar and 1/4 teaspoon salt in a food processor until finely ground. Transfer to a bowl and stir in the melted butter. Press the crumb mixture into the bottom and up the side of the prepared pie plate. Bake until lightly browned and set, 10 to 12 minutes. Transfer to a rack; let cool completely.\n            \n\n              Freeze the custard in an ice cream maker according to the manufacturer's instructions, until it's the consistency of soft-serve. Spread in the cooled crust and sprinkle coarse sugar around the edge. Freeze until firm, at least 4 hours.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "ice cream swich", "quantity": 2.5}, {"food": "whole milk", "quantity": 0.75}, {"food": "honey smoked ham", "quantity": 0.3333333333333333}, {"food": "sugar", "quantity": 0.25}, {"food": "", "quantity": 2.0}, {"food": "salt", "quantity": 0.25}, {"food": "egg substitute", "quantity": 4.0}, {"food": "", "quantity": 1}, {"food": "honey smoked ham", "quantity": 9.0}, {"food": "butter oil", "quantity": 5.0}, {"food": "sugar", "quantity": 1}], "title": "\nLavender Ice Cream Pie\n"}, {"directions": "\n\n              Pour the syrup into a champagne glass. Add the sparkling wine. Serve. \n            \n\nLavender Syrup:\n\n\n              Place the water, sugar, and lavender in a saucepan and bring to a boil. Reduce heat, and simmer, partially covered, for 15 minutes. Strain and cool. Cover and refrigerate for up to a week. \n            \n", "ingredients": [{"food": "syrup", "quantity": 1.5}, {"food": "barley flour or meal", "quantity": 4.0}, {"food": "coconut water", "quantity": 2.0}, {"food": "sugar", "quantity": 1.0}, {"food": "", "quantity": 1.0}], "title": "\nLavender Sparkling Wine\n"}, {"directions": "\n\n              Place the water, sugar, and lavender in a saucepan and bring to a boil. Reduce heat, and simmer, partially covered, for 15 minutes. Strain and cool. Cover and refrigerate for up to a week.\n            \n\n              Copyright 2005 Television Food Network, G.P. All rights reserved.\n            \n", "ingredients": [{"food": "coconut water", "quantity": 2.0}, {"food": "sugar", "quantity": 1.0}, {"food": "", "quantity": 1.0}], "title": "\nLavender Syrup\n"}, {"directions": "\n\n              Make the cookies: Beat the butter, granulated sugar and honey in a large bowl with a mixer on medium-high speed until fluffy, about 1 minute. Beat in\n            \n\n              the egg, vanilla and lemon zest. Reduce the mixer speed to low; beat in the flour, baking soda and salt until the dough comes together. Cover and refrigerate until firm, 30 minutes.\n            \n\n              Preheat the oven to 350 degrees F. Line 2 baking sheets with parchment paper. Grind the lavender in a spice grinder until crumbly. Mix with the coarse sugar in a medium bowl.\n            \n\n               Roll rounded teaspoonfuls of dough into balls, then roll in the lavender sugar; arrange 2 inches apart on the prepared pans. Bake, switching the pans halfway through, until the cookies are browned around the edges, 12 to 15 minutes. Let cool 5 minutes on the pans, then transfer to racks to cool completely.\n            \n\n              Meanwhile, make the filling: Beat the butter, lemon zest, lemon juice and vanilla in a large bowl with a mixer on high speed until light, 1 to 2 minutes. Reduce the mixer speed to medium; beat in the confectioners' sugar until smooth. Spread the filling on half the cookies (about 1 teaspoon per cookie). Sandwich with the remaining cookies.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.5}, {"food": "sugar", "quantity": 1.0}, {"food": "honey smoked ham", "quantity": 0.25}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "", "quantity": 2.0}, {"food": "sugar", "quantity": 0.5}, {"food": "butter oil", "quantity": 1.5}, {"food": "lemon juice", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "sugar", "quantity": 2.5}], "title": "\nLavender-Lemon Sandwich Cookies\n"}, {"directions": "\n\n              Combine the sugar, lavender, peppercorns and 1 cup water in a small saucepan. Split the vanilla bean lengthwise, scrape out the seeds with the back of a paring knife and add them to the saucepan. Bring the mixture to a boil over medium heat, stirring to submerge the lavender. Cook until the sugar dissolves, about 2 minutes. Turn off the heat, and let the syrup steep for 10 minutes. Pour the lavender syrup through cheesecloth placed over a fine-mesh strainer, and refrigerate the syrup until completely cooled.\n            \n\n              Fill 4 Collins glasses with ice. Add 2 to 3 ounces of vodka and 1 ounce of the lavender syrup into each glass, and top off with club soda. Crush some peppercorns on a cutting board with the back of a knife. Stir the cocktail with a long spoon, and garnish with lavender, lemon wedges and crushed peppercorns.\n            \n", "ingredients": [{"food": "sugar", "quantity": 0.5}, {"food": "", "quantity": 0.25}, {"food": "", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "", "quantity": 8.0}, {"food": "", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "", "quantity": 1}], "title": "\nLavender-Pink Peppercorn Vodka Sodas\n"}, {"directions": "\nSpecial equipment: A straight-sided 3-quart tall glass bowl or four 16-ounce wide-mouth glass jars with lids\n\n              Soak the onions in ice water for at least 20 minutes. Strain.\n            \n\n              Meanwhile, cook the bacon in a large skillet over medium heat until brown and crisp, 6 to 7 minutes per side. Remove, drain on paper towels and roughly chop.\n            \n\n              Whisk together the blue cheese, mayonnaise, sour cream, vinegar, Worcestershire, 1/4 teaspoon salt and a few grinds of pepper in a medium bowl.\n            \n\n              Using a 3-quart straight-sided tall glass bowl for 1 large salad or four 16-ounce wide-mouth glass jars for 4 individual salads, make a layer with a third of the lettuce, then add the following in separate layers: the tomatoes, the olives, half the remaining lettuce, the carrots, the croutons, and the remaining lettuce. Sprinkle the top with the onions and bacon. (The salad can be put together, covered and refrigerated for up to 2 hours before serving.)\n            \n\n              If making 1 salad, just before serving, transfer it to a large bowl, toss with about half the dressing and season with salt and pepper. If making 4 salads, add dressing to each jar, season with salt and pepper, cover with the lid and shake to coat. Serve the remaining dressing on the side.\n            \n", "ingredients": [{"food": "onion rings", "quantity": 0.5}, {"food": "bacon", "quantity": 6.0}, {"food": "macaroni cheese", "quantity": 0.5}, {"food": "mayonnaise dressing", "quantity": 0.3333333333333333}, {"food": "sour cream", "quantity": 0.3333333333333333}, {"food": "vinegar", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "lettuce", "quantity": 1.0}, {"food": "grape juice", "quantity": 2.0}, {"food": "olives", "quantity": 1.0}, {"food": "carrots", "quantity": 3.0}, {"food": "croutons", "quantity": 2.0}], "title": "\nLayered Blue Cheese, Bacon and Iceberg Salad\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F.\n            \n\n              Combine the sour cream, hot sauce, milk and cream cheese in a food processor and process until smooth. Toss the chicken and hot sauce mixture together in a bowl and spread with a spatula in the bottom of a glass 8-inch square baking dish. Cover the baking dish with foil and bake until warmed through, 25 to 30 minutes. \n            \n\n              Meanwhile, heat the oil in a large nonstick skillet. Add the bacon and cook over medium heat, turning a few times, until evenly browned, 7 to 8 minutes. Transfer the bacon to a paper towel-lined plate to drain; let cool, then crumble. \n            \n\n              Let the baking dish sit at room temperature, 10 minutes. Uncover the baking dish and scatter over the celery, then the lettuce, then the carrots. Drizzle with the blue cheese dressing and sprinkle with the bacon and scallions. Serve with the tortilla chips.\n            \n", "ingredients": [{"food": "sour cream", "quantity": 0.5}, {"food": "Worcestershire sauce", "quantity": 0.5}, {"food": "whole milk", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "diced chicken", "quantity": 1.5}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "bacon", "quantity": 8.0}, {"food": "diced chicken", "quantity": 3.0}, {"food": "lettuce", "quantity": 1.5}, {"food": "carrots", "quantity": 2.0}, {"food": "dressing", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.25}, {"food": "potato chips", "quantity": 1}], "title": "\nLayered Buffalo Chicken Dip\n"}, {"directions": "\n\n              Pour the sour apple schnapps into a 1 1/2-ounce shot glass. Gently pour in the grenadine. (It will sink to the bottom to make the red layer.) Shake the bottle of cinnamon schnapps, then turn the bottle upside down to bring the gold flakes to the top. Measure out 3/4 ounce. Hold a small spoon upside down inside the glass, directly over the apple schnapps layer. Gently pour the cinnamon schnapps over the back of the spoon to make the third layer. \n            \n\n               Photograph by James Wojcik\n            \n", "ingredients": [{"food": "apple", "quantity": 0.5}, {"food": "", "quantity": 0.5}, {"food": "cinnamon", "quantity": 0.75}], "title": "\nLayered Christmas Shooter\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Beat together the cream cheese and milk in a large bowl with an electric mixer until smooth, about 2 minutes.\n            \n\n              Combine the crabmeat, water chestnuts, mustard, onion, Worcestershire, soy sauce, lemon juice, 1/2 teaspoon salt and a few grinds of pepper in a medium bowl and toss gently to combine.\n            \n\n              Spread out the cream cheese mixture in an even layer in a 9- by 13-inch baking dish. Spread the sweet-and-sour sauce on top, leaving about a 1-inch border of cream cheese all around. Spoon the crab mixture on top of the sweet-and-sour sauce. The dip can be prepared up to this point and refrigerated, covered, overnight.\n            \n\n              Just before serving, scatter the lettuce, scallions and cilantro over the crab, leaving a 1-inch border all around. Serve with wonton skins, shrimp chips or rice crackers.\n            \n", "ingredients": [{"food": "macaroni cheese", "quantity": 8.0}, {"food": "milk", "quantity": 0.3333333333333333}, {"food": "barley flour or meal", "quantity": 1.0}, {"food": "coconut water", "quantity": 8.0}, {"food": "hot pockets ham cheese stuffed swich", "quantity": 3.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "soy sauce", "quantity": 1.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "black bean mango", "quantity": 1}, {"food": "Worcestershire sauce", "quantity": 0.5}, {"food": "", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "rice crackers", "quantity": 1}], "title": "\nLayered Crab Rangoon Dip\n"}, {"directions": "\n\n              Microwave 4 ounces chopped bittersweet chocolate with 1/4 cup water on 50 percent power until melted, 2 minutes, stirring halfway through. Divide among 4 small mugs and top each with a spoonful of condensed milk and a shot of hot espresso.\n            \n\n              Photographs by Marko Metzinger/Studio D\n            \n", "ingredients": [], "title": "\nLayered Mocha\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: six 3- to 4-ounce ice-pop molds with wooden or plastic ice-pop sticks (without guards)\n\n              Puree the watermelon with 1/4 cup of the sugar in a blender. Pour into a medium bowl and freeze, stirring every 30 minutes, until the puree resembles a slushy mixture, about 2 hours.\n            \n\n              Fold the chocolate chips into the watermelon slush and pour into six 3- to 4-ounce ice-pop molds, filling them about three-quarters full. Insert wooden or plastic (without guards) ice-pop sticks. Freeze until the mixture is just slightly set, about 30 minutes. \n            \n\n              Meanwhile, mix the coconut milk and 2 tablespoons of sugar in a small bowl and refrigerate.\n            \n\n              After 30 minutes, pour the coconut milk mixture on top of the watermelon mixture, leaving a 1/4-inch headspace at the top. Freeze until the mixture is just slightly set, about 30 minutes.\n            \n\n              Right before the coconut milk mixture is just set, puree the avocado, lime juice, 1/4 cup of water and the remaining 2 tablespoons sugar in a blender until smooth and creamy. Top the coconut layer with the avocado mixture and freeze until solid, about 4 hours.\n            \n\n              Let sit at room temperature for about 5 minutes before unmolding.\n            \n", "ingredients": [{"food": "watermelon seed krnls", "quantity": 3.0}, {"food": "sugar", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "coconut milk", "quantity": 0.25}, {"food": "diced chicken", "quantity": 1.0}, {"food": "", "quantity": 1.0}], "title": "\nLayered Watermelon Ice Pops\n"}, {"directions": "\n\n              Trim the root of the leek, leaving ends intact to hold the leaves together, then halve lengthwise. Rinse well under running water to flush out any grit trapped between the leaves. Cut each half into 3-inch lengths, keeping leaves together. Put leeks in a large skillet with water to cover and 1 teaspoon salt. Simmer over medium heat until the leeks are tender, about 6 minutes. Drain the excess water, add 2 tablespoons butter, and cook over medium heat until the leek edges are golden brown and sweet.\n            \n\n              Cook the bacon in a medium skillet, until just crisp. Transfer to paper towels to drain.\n            \n\n              Preheat oven to 350 degrees F. Brush a 9-inch glass or ceramic pie pan with 2 tablespoons butter and sprinkle the grated Parmesan evenly on top. Put pan on a baking sheet.\n            \n\n              Whisk the half-and-half, eggs and yolks in large glass measuring cup. Season with 1/2 teaspoon salt, pepper, and nutmeg. Spread half the Gruyere evenly in the pan, crumble the bacon on top; repeat with remaining cheese. Place the leeks, browned side up, on the cheese and pour the custard over the fillings.\n            \n\n              Bake until the quiche is just set in the center, about 40 to 50 minutes. Cool completely on a rack before serving.\n            \n", "ingredients": [{"food": "silk light vanilla", "quantity": 2.0}, {"food": "salt", "quantity": 1.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 6.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "macaroni cheese", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "eggs", "quantity": 2.0}, {"food": "egg substitute", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "nutmeg", "quantity": 1}, {"food": "macaroni cheese", "quantity": 4.0}], "title": "\nLeek, Bacon, and Gruyere Crustless Quiche\n"}, {"directions": "\n\n              Preheat the oven 325 degrees F.\n            \n\n              Butter an 8-by-8-inch square glass casserole dish. Halve the leeks lengthwise, and then cut them crosswise into half circles (There should be about 1 3/4 cups.). Put the cut leeks in the basket of a salad spinner, or a colander set in a bowl, and fill with water. Swish the leeks around to flush out any grit. Lift the basket from water--don't pour the water off or you will pour any grit right back over the leeks.\n            \n\n              Heat a medium skillet over medium heat and fry the bacon until crispy, about 5 minutes. Transfer the bacon to a paper towel-lined plate to cool, then crumble. Discard all but 1 tablespoon of the pan drippings, add the butter and leeks, and season with 1/2 teaspoon salt and some pepper. Cook until tender, about 10 minutes.\n            \n\n              Meanwhile, put the potatoes in a small saucepan with the garlic, thyme, and 1 1/2 teaspoons of salt and water, to cover. Bring to a boil over high heat, then drain. Discard the thyme and garlic and add potatoes to the leeks.\n            \n\n              In a medium bowl whisk together the eggs and half-and-half, then stir in the leek mixture, 1 cup of the cheese, the bacon, and nutmeg. Season with 1 teaspoon of salt and some pepper. Transfer the mixture to the prepared dish, cover with foil and bake until just set but still moist, about 55 minutes. Remove from the oven and set aside.\n            \n\n              Position a rack in the upper part of the oven and preheat the broiler. Scatter the remaining 1 cup cheese over the casserole and broil until the cheese browns, about 3 minutes. Set aside for 5 to 10 minutes before serving. Unmold or serve from baking dish.\n            \n", "ingredients": [{"food": "silk light vanilla", "quantity": 2.0}, {"food": "smoked turkey roll", "quantity": 6.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "salt", "quantity": 3.0}, {"food": "black bean mango", "quantity": 1}, {"food": "sweet potatoes", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "thyme", "quantity": 2.0}, {"food": "eggs", "quantity": 6.0}, {"food": "", "quantity": 1.5}, {"food": "macaroni cheese", "quantity": 6.0}, {"food": "nutmeg", "quantity": 0.5}], "title": "\nLeek, Potato, and Bacon Casserole\n"}, {"directions": "\n\n              Heat 2 tablespoons olive oil in a skillet over medium-low heat; add 3 sliced leeks (white and light green parts only) and season with salt and sugar. Cook, stirring occasionally, until tender, 10 minutes. Toss with 12 ounces cooked rigatoni, 1 cup pasta-cooking water, 2 tablespoons olive oil, 1 teaspoon sugar and 2 teaspoons balsamic vinegar. Add 1 small head sliced radicchio and 6 ounces cubed fontina; toss until the cheese melts. Top with chopped toasted hazelnuts.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [], "title": "\nLeek-Radicchio Sauce\n"}, {"directions": "\n\n              Game Plan: Make the vinaigrette while the leeks cook.\n            \n\n              Bring a large pot of water to a boil over high heat, then salt it generously. Trim the root end of the leeks, leaving enough to hold the leaves together, and halve lengthwise. Rinse very well under running water to flush out any grit trapped between the leaves. Add the leeks to the boiling water and cook until tender, 7 to 10 minutes. Transfer the leeks to a paper towel-lined plate to drain. Pat dry and lay them on a serving platter.\n            \n\n              Meanwhile, whisk the vinegar, mustard, water, and the 3/4 teaspoon salt in a small bowl. Gradually whisk in the olive oil, starting with a few drops and then adding the rest in a steady stream to make a smooth, slightly thick dressing. Drizzle the vinaigrette evenly over leeks, turn them to coat, and scatter the parsley and the tarragon, if using, over the top. Serve immediately or up to 2 hours later at room temperature.\n            \n", "ingredients": [{"food": "leeks", "quantity": 6.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "coconut water", "quantity": 1.0}, {"food": "coconut water", "quantity": 0.75}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "parsley", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}], "title": "\nLeeks with Dijon Vinaigrette\n"}, {"directions": "\n\n              Trim the tough dark green tops and stem ends of 12 leeks, but keep the bases intact. Halve lengthwise and rinse well. Boil in salted water until tender, about 10 minutes. Drain and cool in a bowl of salted ice water, then drain and pat dry. Whisk 1 tablespoon dijon mustard, 2 tablespoons white wine vinegar, 1/2 teaspoon salt, and pepper to taste in a bowl. Whisk in 1/3 cup walnut oil and drizzle over the leeks. Top with chopped toasted walnuts and chopped parsley.\n            \n\n              Photograph by Marcus Nilsson\n            \n", "ingredients": [], "title": "\nLeeks with Walnut Vinaigrette\n"}, {"directions": "\n\n              Line an 8-by-8-inch baking dish with a sheet of foil large enough to leave a 2-inch overhang on all sides. Grease the foil with 1 tablespoon of butter.\n            \n\n              Melt the remaining 4 tablespoons butter in a large pot over medium heat. Add the marshmallows, stirring occasionally until they melt completely, about 5 minutes. Remove from the heat and stir in the vanilla and a pinch of salt. \n            \n\n              Working quickly, add the rice cereal and candy to the pot and stir with a rubber spatula until evenly coated. Transfer to the prepared baking dish and press into an even, compact layer. (Wet your hands to keep the mixture from sticking.) Let sit at room temperature until firm, about 30 minutes. Cut into 16 squares. \n            \n\n              Store the treats at room temperature in an airtight container for up to 3 days.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 4.0}, {"food": "", "quantity": 10.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "crisped rice bar", "quantity": 6.0}, {"food": "", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.3333333333333333}], "title": "\nLeftover Easter Candy Crispy Treats\n"}, {"directions": "\n\n              For the broth: Position a rack in the upper third of the oven and preheat to 450 degrees F. Toss the turkey bones and parts, onions, ginger and garlic with the vegetable oil in a large bowl. Lightly sprinkle with salt and transfer to a rimmed baking sheet, spreading everything out into a somewhat even layer (it is okay if some items slightly overlap). Roast turning the bones and vegetables halfway through until the vegetables are slightly charred, about 30 minutes.\n            \n\n              Meanwhile, add the star anise pods, peppercorns and cinnamon sticks to a large pot. Set over medium heat and toast until very fragrant, shaking the pot occasionally, about 5 minutes. Turn off the heat and add the chicken broth, fish sauce, according to taste, and 8 cups of water.\n            \n\n              Add the roasted turkey bones and vegetables to the pot, scraping any browned bits off of the baking sheet and adding them in as well. Bring to a boil over high heat, then reduce the heat to medium-low and gently simmer for 1 hour. Remove from the heat and strain the broth through a fine-mesh sieve and into another large pot. (The broth can be made to this point up to 2 days in advance; let cool, then refrigerate in a covered container.) Stir the shredded turkey meat into the hot broth.\n            \n\n              For the soup: Cook the noodles according to the package instructions. Divide the noodles among 6 bowls then top with the broth and shredded meat. Serve with the bean sprouts, Thai basil, jalapenos, red onion, hoisin sauce, sriracha and a lime wedge on the side so that guests can top their pho as they like.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "smoked turkey roll", "quantity": 1.0}, {"food": "onions", "quantity": 3.0}, {"food": "ginger root", "quantity": 6.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "drumstick pods", "quantity": 4.0}, {"food": "black bean mango", "quantity": 3.0}, {"food": "cinnamon", "quantity": 2.0}, {"food": "diced chicken", "quantity": 12.0}, {"food": "Worcestershire sauce", "quantity": 0.5833333333333333}, {"food": "rice noodles", "quantity": 1.0}, {"food": "brussels sprouts", "quantity": 4.0}, {"food": "basil", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1}, {"food": "", "quantity": 1}], "title": "\nLeftover Roast Turkey Pho\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Stir the sour cream and chipotle chile together in a small bowl. Cover with plastic wraps and refrigerate.\n            \n\n              Scatter half the chips on a rimmed baking sheet. Top with one-third of the turkey, cheeses, Brussels sprouts, butternut squash and fried onions. Scatter the remaining chips on top followed by the remaining two-thirds of turkey, cheeses, Brussels sprouts and fried onions. Bake until the cheeses are melted and bubbly, about 5 to 7 minutes.\n            \n\n              Drizzle the nachos with chipotle sour cream and extra adobo sauce. Garnish with cilantro, black olives, and jalapenos.\n            \n", "ingredients": [{"food": "sour cream", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "tortilla", "quantity": 10.0}, {"food": "meat drippings ", "quantity": 2.0}, {"food": "", "quantity": 3.0}, {"food": "macaroni cheese", "quantity": 2.0}, {"food": "brussels sprouts", "quantity": 2.0}, {"food": "squash", "quantity": 1.5}, {"food": "onions", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}, {"food": "", "quantity": 0.25}], "title": "\nLeftover Thanksgiving Nachos\n"}, {"directions": "\n\n              Heat the oil in a large pot or Dutch oven over medium heat. Add the onion and bell pepper, and cook, stirring occasionally, until the vegetables are soft, about 6 minutes. Stir in the jalapeno and garlic and cook until they soften slightly, about 1 minute.\n            \n\n              Stir in the chili powder, cumin, oregano, 1/2 teaspoon salt and a few grinds of pepper. Add the turkey and stir until well coated in the spices. Pour in the tomatoes and chicken broth and scrape up any spices that may have stuck to the bottom of the pan. Bring the chili to a simmer on medium-low and cook, uncovered, on until the liquid has reduced by a few inches and the chili has thickened, about 1 hour.\n            \n\n              Drain and rinse one of the cans of beans; leave the bean liquid in the second can. Add all the beans plus the reserved bean liquid to the pot and heat until the beans are warmed through, about 10 minutes. Season to taste with more salt and pepper. Serve in bowls over potatoes or rice with a dollop of sour cream and sprinkle of chopped scallions.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "chili powder", "quantity": 0.25}, {"food": "cumin seed", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "meat drippings ", "quantity": 3.0}, {"food": "diced chicken", "quantity": 28.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "fava beans", "quantity": 15.0}, {"food": "sweet potatoes", "quantity": 1}, {"food": "ice cream swich", "quantity": 1}], "title": "\nLeftover Turkey Chili\n"}, {"directions": "\n\n              Cook 1 minced shallot in a skillet with 1 tablespoon butter over medium heat until golden, 3 minutes. Whisk 1 1/4 cups heavy cream, 1 egg yolk and 2 teaspoons grated lemon zest in a bowl; reduce the heat to low and whisk into the skillet along with 1/3 cup grated pecorino. Whisk until slightly thickened, 2 minutes. Season with salt and plenty of pepper. Toss with 12 ounces cooked fettuccine and some pasta-cooking water. Top with more pecorino.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [], "title": "\nLemon Alfredo\n"}, {"directions": "\n\n              Heat a small skillet over medium-high heat. Add the almonds, shake and swirl until golden brown, about 2 to 3 minutes. Set aside to cool.\n            \n\n              Bring a saucepan of water to a boil and salt it generously. Add the green beans and cook until crisp-tender, 5 to 6 minutes. Drain and toss with the butter, zest, and season with salt and pepper. Transfer to a serving bowl. Scatter the almonds over top and serve.\n            \n\n              Copyright 2005 Television Food Network, G.P. All rights reserved.\n            \n", "ingredients": [{"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "fava beans", "quantity": 1.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "black bean mango", "quantity": 1}], "title": "\nLemon Almond String Beans\n"}, {"directions": "\n\n              Bring 1/2 cup each water and white wine, two 9-ounce packages frozen artichoke hearts, 3 wide strips lemon zest and 2 tablespoons each lemon juice and olive oil to a simmer in a large skillet; season with salt and pepper. Cover and cook, stirring halfway through, until the artichokes are tender, about 10 minutes. Uncover and add 2 minced garlic cloves and 2 tablespoons each olive oil and chopped parsley and mint. Cook, stirring, until the garlic softens, 1 to 2 more minutes.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [], "title": "\nLemon Braised Artichokes\n"}, {"directions": "\n\n              Heat 2 minced garlic cloves, 2 or 3 strips lemon zest and 3 tablespoons olive oil in a skillet over medium heat, 3 minutes. Meanwhile, cook 1 head broccoli florets and 1 sliced carrot in boiling salted water, 3 minutes. Drain and toss with the lemon oil, a squeeze of lemon juice, and salt and pepper.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nLemon Broccoli\n"}, {"directions": "\n\n              Put the bulgur, 2 teaspoons salt and 1 1/2 cups water in a saucepan and bring to a boil. Cover immediately, remove from the heat and let stand until all of the water has been absorbed, about 20 minutes.\n            \n\n              Position an oven rack in the top of the oven, put a baking sheet on the rack and preheat the broiler on low. (If the broiler has just 1 setting, preheat the baking sheet on a rack 8 inches from the broiler.)\n            \n\n              Add the lemon juice, mustard, garlic and shallot to a medium bowl and whisk to combine. Whisk in 1 teaspoon salt and a couple turns of ground black pepper. Drizzle in the olive oil, whisking until well combined. Pour half of the mixture into a large bowl or resealable plastic bag. Reserve the remaining half for the bulgur.\n            \n\n              Add the chicken to the marinade, turning to coat evenly. (The chicken is ready for cooking immediately, but you can also marinate it, refrigerated, for up to 12 hours before cooking.)\n            \n\n              Carefully remove the preheated baking sheet from the oven. Remove the chicken from the marinade (discard the marinade), sprinkle with salt and pepper and arrange skin-side up on the baking sheet. Broil until the chicken is crispy and golden brown and an instant-read thermometer inserted in the thickest part of each piece registers 175 degrees F, 15 to 20 minutes.\n            \n\n              While the chicken is cooking, toss the bulgur with the tomatoes, parsley, mint, cucumbers and reserved marinade. Season with salt and pepper.\n            \n\n              Transfer the chicken to a large platter and serve with the bulgur salad.\n            \n", "ingredients": [{"food": "wheat flour", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "lemon juice", "quantity": 0.5}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "low fat fried chicken", "quantity": 8.0}, {"food": "grape juice", "quantity": 1.0}, {"food": "parsley", "quantity": 0.5}, {"food": "", "quantity": 0.25}, {"food": "diced chicken", "quantity": 0.6666666666666666}], "title": "\nLemon Broiled Chicken with Bulgur Salad\n"}, {"directions": "\nSpecial equipment: 10-cup bundt pan\n\n              Position a rack in the middle of the oven and preheat to 350 degrees F. Generously brush the bundt pan with shortening and dust with flour.\n            \n\n              Whisk the flour, baking powder, baking soda and salt together in a large bowl and set aside. In another bowl, whisk the sour cream, lemon zest, lemon juice and vanilla and set aside.\n            \n\n              Whisk the eggs and sugar together in another bowl, stirring vigorously to lighten the eggs. Gradually whisk in the oil until evenly combined. Add the sour cream mixture and stir together. Add the dry ingredients and stir with a wooden spoon just until combined but still a bit lumpy. Pour the batter into the prepared pan.\n            \n\n              Bake the cake until it pulls away from the sides of the pan and a skewer inserted into the center of the cake comes out clean, about 1 hour. Cool 10 minutes; then unmold cake onto a rack placed over a baking sheet. Cool. (The cake can be prepared to this point a day ahead.)\n            \n\n              When ready to serve. Combine the rhubarb, jam, water and salt in a small saucepan and simmer until the rhubarb gets translucent and syrupy, almost jewel like,, about 10 minutes. Add a bit more water, if the glaze gets too thick . Remove from the heat and stir in vanilla. Let cool slightly. Spoon some of the glaze over the top of the cake, and reserve the rest for serving with sliced cake. Serve.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 3.25}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "sour cream", "quantity": 0.75}, {"food": "", "quantity": 1.0}, {"food": "lemon juice", "quantity": 0.25}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "eggs", "quantity": 4.0}, {"food": "sugar", "quantity": 2.25}, {"food": "vegetable oil", "quantity": 0.75}, {"food": "rhubarb", "quantity": 1.5}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "coconut water", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "vanilla extract", "quantity": 0.5}], "title": "\nLemon Bundt Cake with Berry Rhubarb Glaze\n"}, {"directions": "\n\n              Preheat the oven to 325 degrees F. Spray 2 (8-inch) round cake pans with cooking spray. Dust lightly with flour and shake out the excess.\n            \n\n              Reserve half of the raspberries, and combine the other half with 1 tablespoon sugar and crush with a fork. Set aside.\n            \n\n              Sift together the flour, baking powder, baking soda, and salt in a medium bowl, stir with a fork to evenly combine the ingredients. In another bowl, whisk the buttermilk, oil, lemon zest, and lemon juice.\n            \n\n              Whisk together eggs, egg whites and sugar in a large bowl and beat with an electric mixer on medium speed until it holds ribbons, about 2 minutes. Add the flour mixture in 3 parts, alternating with the buttermilk mixture in 2 parts, beginning and ending with the flour. Stir together by hand until evenly combined and no lumps remain.\n            \n\n              Pour the batter evenly into the pans. Bake in the center of the oven until a cake tester comes out clean, about 30 minutes. Cool on a baking rack for 10 minutes, then turn the cakes out onto a baking rack to cool completely.\n            \n\n              Frosting: Bring a few inches of water to a boil in a saucepan that can hold an electric mixer bowl above the water. Whisk the sugar, egg whites, water, cream of tartar, and salt in the bowl by hand. Set the bowl above the boiling water and beat with an electric hand mixer at medium-high speed until stiff peaks form, about 7 minutes. Remove from the heat; beat in the lemon zest and vanilla.\n            \n\n              To assemble the cake: Place 1 layer on a flat serving or cake plate, top side down, and spread with crushed raspberries. Top with 3/4 cup frosting, spreading gently on top of the raspberries. Place the second cake layer on top, top side up, and frost the top and sides. Decorate with the reserved raspberries.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "raspberries", "quantity": 1.5}, {"food": "sugar", "quantity": 1.0}, {"food": "potato flour", "quantity": 2.3333333333333335}, {"food": "baking chocolate", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 0.5}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "lemon juice", "quantity": 1.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "eggs", "quantity": 2.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "sugar", "quantity": 1.25}, {"food": "sugar", "quantity": 0.75}, {"food": "egg substitute", "quantity": 2.0}, {"food": "coconut water", "quantity": 3.0}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "salt", "quantity": 0.125}, {"food": "lemon juice", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}], "title": "\nLemon Cake with Lemon Meringue Frosting\n"}, {"directions": "\n\n              Heat 1 tablespoon olive oil in a large pot over medium-high heat. Add the scallion whites and cook, stirring, until softened, about 2 minutes. Add the chicken broth, 3 cups water, the rice, carrots, turnips and 1/4 teaspoon each salt and pepper. Bring to a boil, then reduce the heat to medium low and simmer until the rice and vegetables are tender, 12 to 15 minutes. Whisk the eggs and 3 tablespoons lemon juice in a medium bowl. Slowly ladle about 1 1/2 cups of the hot broth into the egg mixture, whisking constantly. Add the shredded chicken to the pot, then whisk in the egg-broth mixture. Return the soup to a gentle simmer, then remove from the heat. Stir in the scallion greens and parsley and season with salt and pepper. Put the salad greens in a large bowl and toss with the remaining 3 tablespoons olive oil and 1 tablespoon lemon juice. Season with salt and pepper. Serve with the soup. \n            \n\n              Read more at: http://www.foodnetwork.com/recipes/food-network-kitchens/lemon-chicken-soup-and-salad-recipe.html?oc=linkbackPhotograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 4.0}, {"food": "martha white foods", "quantity": 5.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "crisped rice bar", "quantity": 0.5}, {"food": "pineapple chunks", "quantity": 1.0}, {"food": "turnips", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "eggs", "quantity": 2.0}, {"food": "lemon juice", "quantity": 4.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "parsley", "quantity": 3.0}, {"food": "turnip greens", "quantity": 8.0}], "title": "\nLemon Chicken Soup and Salad\n"}, {"directions": "\n\n              Preheat a grill to medium high and brush the grates with vegetable oil. Toss the chicken with the olive oil, lemon juice, thyme, garlic, 1/2 teaspoon salt and a few grinds of pepper in a large bowl. Thread onto eight 10-inch skewers along with the peppers.\n            \n\n              Grill the kebabs, covered, turning occasionally, until the chicken is cooked through and the peppers are charred, about 10 minutes.\n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1}, {"food": "diced chicken", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "peppers", "quantity": 24.0}, {"food": "thyme", "quantity": 1.5}], "title": "\nLemon Chicken and Shishito Pepper Kebabs\n"}, {"directions": "\n\n              Preheat the oven to 450 degrees F. Toss the squash, sliced lemon, 2 tablespoons olive oil, 1 tablespoon oregano, 1/2 teaspoon salt and a few grinds of pepper in a large bowl. Spread on a rimmed baking sheet. Roast, undisturbed, until the squash is tender and lightly browned around the edges, about 30 minutes.\n            \n\n              Meanwhile, season the chicken with salt and pepper. Heat a large ovenproof skillet over medium-high heat. Add the remaining 2 tablespoons olive oil. Add the chicken; cook until well browned on the bottom, 3 to 5 minutes. Flip the chicken and transfer the skillet to the oven. Roast until the chicken is just cooked through, 5 to 8 minutes.\n            \n\n              Return the skillet to the stovetop over medium heat. Add the garlic and cook until softened, about 1 minute. Add the lemon juice and the remaining 1 tablespoon oregano. Cook, spooning the pan juices over the chicken, 1 minute. Serve the chicken with the roasted squash and lemon; drizzle with the remaining pan juices.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [{"food": "squash", "quantity": 0.75}, {"food": "", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 4.0}, {"food": "garlic powder", "quantity": 3.0}], "title": "\nLemon Chicken with Butternut Squash\n"}, {"directions": "\n\n              Preheat the oven to 200 degrees F. Heat 1 tablespoon olive oil in a large skillet over medium-high heat. Season the chicken with salt and pepper. Working in batches, cook the chicken until browned and cooked through, about 3 minutes per side. Transfer to a rimmed baking sheet; keep warm in the oven.\n            \n\n              Wipe out the skillet and heat the remaining 2 tablespoons olive oil over high heat. Add the shishito peppers and cook, tossing, until browned in spots, 3 minutes. Remove to a plate with a slotted spoon.\n            \n\n              Add the garlic and lemon slices to the skillet and cook, stirring occasionally, without flipping the lemons, until they start browning, 2 minutes. Flip the lemons and cook until soft and golden, about 1 minute. Season with 1/2 teaspoon salt and a few grinds of pepper.\n            \n\n              Reduce the heat to medium; add the lemon juice and wine and cook until reduced by half, 3 minutes. Add the broth; cook until slightly reduced, 5 to 6 minutes. Remove from the heat; stir in the butter until the sauce thickens. Add the parsley; season with salt and pepper. Serve the chicken with the shishitos and rice; top with the sauce.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "peppers", "quantity": 8.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "martha white foods", "quantity": 0.5}, {"food": "diced chicken", "quantity": 11.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "parsley", "quantity": 0.25}, {"food": "crisped rice bar", "quantity": 2.5}], "title": "\nLemon Chicken with Shishito Peppers\n"}, {"directions": "\n\n              Warm pre-made crepes in a skillet with a little butter. Sprinkle with sugar and a squeeze of lemon juice. Spread with lemon curd and fold into triangles. Dust with confectioners' sugar.\n            \n\n              Copyright (c)2011 Food Network Magazine, LLC. Published by Hyperion. Available wherever books are sold. All Rights Reserved. Photograph courtesy of Antonis Achilleos.\n            \n", "ingredients": [], "title": "\nLemon Crepes\n"}, {"directions": "\n\n              Add enough water to a medium saucepan to measure 1-inch deep and bring to a simmer over medium-high heat. Combine the egg yolks, sugar, lemon juice and zest in a medium metal bowl and whisk until smooth. Place the bowl on top of the saucepan (make sure the bottom of the bowl is not touching the water) and whisk until the curd is thickened, light yellow and coats the back of a spoon, about 8 minutes. Remove the curd from the heat and use a spatula to stir in the butter, one piece at a time, allowing each addition to melt before adding the next. Transfer to a clean container and press a sheet of plastic wrap directly against the surface of the curd. Chill thoroughly, at least 3 hours.\n            \n", "ingredients": [{"food": "egg substitute", "quantity": 3.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "lemon juice", "quantity": 1.25}, {"food": "diced chicken", "quantity": 0.5}], "title": "\nLemon Curd\n"}, {"directions": "\n\n              Whisk the sugar, lemon zest, lemon juice and salt in a medium saucepan. Whisk the whole eggs and yolks in a small bowl, then whisk into the lemon mixture.\n            \n\n              Cook the mixture over medium heat, whisking constantly, until it¿s thick like pudding, 6 to 8 minutes. Remove from the heat and whisk in the butter a few pieces at a time until incorporated.\n            \n\n              Strain the mixture through a fine-mesh sieve into a small bowl, pushing it through with a rubber spatula. Press plastic wrap directly onto the surface to prevent a skin from forming. Refrigerate until completely set, at least 4 hours and up to 5 days.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "sugar", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.5}, {"food": "hearts of palm", "quantity": 1}, {"food": "eggs", "quantity": 3.0}, {"food": "butter oil", "quantity": 4.0}], "title": "\nLemon Curd\n"}, {"directions": "\n\n              1. Remove 8 thin strips of zest from the lemon using a vegetable peeler and set aside. Thinly slice the lemon and place in a small pot with the sugar and 1/3 cup water. Bring to a boil and cook until the sugar dissolves. Let cool and strain the syrup.\n            \n\n              2. For each of 8 martini glasses, rub a strip of zest around the rim and then drop in the bottom of the glass for garnish. Combine the gin, elderflower liqueur, lemon syrup and ice in a measuring cup or pitcher and stir until very cold. Remove any unmelted ice or strain into the prepared glasses. Serve icy cold.\n            \n", "ingredients": [{"food": "lemon juice", "quantity": 1.0}, {"food": "sugar", "quantity": 0.25}, {"food": "", "quantity": 2.0}, {"food": "", "quantity": 0.75}, {"food": "ice cream swich", "quantity": 1.5}], "title": "\nLemon Flower Martinis\n"}, {"directions": "\n\n              Bake the Tater Tots as the label directs. Transfer to a bowl; add the parmesan, season with salt and pepper and toss. Set aside.\n            \n\n              Meanwhile, bring a medium pot of salted water to a boil. Add the green beans and cook until tender, about 5 minutes. Drain and transfer to a medium bowl; toss with 1 tablespoon butter, the lemon zest, and salt and pepper to taste. Cover to keep warm.\n            \n\n              Heat the olive oil in a large skillet over medium-high heat. Season the pork chops with salt and pepper; add to the skillet and cook until browned, about 4 minutes per side. Transfer to a plate and let rest.\n            \n\n              Add the garlic to the skillet and cook until lightly browned, about 30 seconds. Add the lemon juice and chicken broth; cook until reduced by half, about 3 minutes. Swirl in the remaining 3 tablespoons butter. Spoon the pan sauce over the pork chops and serve with the Tater Tots and green beans.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "frozen yogurt", "quantity": 1.0}, {"food": "parmesan cheese", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "fava beans", "quantity": 12.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "grape juice", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "pork skins", "quantity": 4.75}, {"food": "garlic powder", "quantity": 3.0}, {"food": "diced chicken", "quantity": 0.5}], "title": "\nLemon Garlic Pork Chops with Parmesan Tater Tots\n"}, {"directions": "\n\n              Make the lemon curd: Combine the egg yolks, granulated sugar and lemon juice in a medium saucepan over medium heat; cook, whisking, until the mixture begins to thicken, about 8 minutes. Stir in the butter, 1 piece at a time, with a wooden spoon. Cook, stirring, until thick enough to coat the back of the spoon, about 7 more minutes. Strain through a fine-mesh sieve into a medium bowl, pressing the curd through with a rubber spatula. Stir in the lemon zest and salt. Fill a large bowl halfway with ice. Set the bowl of curd on the ice and let cool completely, stirring occasionally.\n            \n\n              Make the bars: Coat an 8-inch-square baking dish with cooking spray and line with foil, leaving an overhang on 2 sides. Pulse the cookies in a food processor until finely crushed. Slowly add the melted butter and lemon zest and pulse until the mixture starts coming together.\n            \n\n              Transfer the crumb mixture to the prepared baking dish and press firmly into the bottom. Spread the ice cream over the crumb mixture with a rubber spatula; spread the lemon curd on top. Cover with plastic wrap and freeze until firm, about 4 hours or up to 2 days.\n            \n\n              Lift out of the pan using the overhanging foil. Cut into pieces and dust with confectioners' sugar.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "egg substitute", "quantity": 6.0}, {"food": "sugar", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "butter oil", "quantity": 12.0}, {"food": "lemon juice", "quantity": 0.5}, {"food": "hearts of palm", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "chocolate chip cookies", "quantity": 2.0}, {"food": "butter oil", "quantity": 3.0}, {"food": "lemon juice", "quantity": 0.5}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "sugar", "quantity": 1}], "title": "\nLemon Ice Cream Bars\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. In a medium bowl, combine the flour, 3 tablespoons sugar and a pinch of salt. Add the butter and lemon zest and work into the flour mixture until crumbly using your fingers or a pastry cutter. Separate the whole egg, adding the white to the other two for the meringue topping. Add the yolk to the dough and mix in until a soft dough forms. Press into the bottom and up the sides of a 9-inch pie plate. Bake until golden, about 25 minutes. Cool. Lightly score the pie shell with a sharp knife (cutting about halfway through the crust) into 10 slices to make cutting the frozen pie easier.\n            \n\n              Place the lemon ice cream in a large bowl and mix with a stiff spatula or wooden spoon until smooth, about 2 minutes. Mix in the food coloring if using. Spoon into the pie shell, smooth the top and place in the freezer until firm, 2 hours or overnight.\n            \n\n              Preheat the oven to 500 degrees F. Place all 3 egg whites, the remaining 1/3 cup sugar and a pinch of salt in a large heatproof bowl and put it over a pot with 1-inch of simmering water. Whisk until the sugar is dissolved, the eggs are warm and the mixture is fluffy. Whip with an electric mixer on medium-high speed until cooled, thick, glossy and stiff peaks form, about 2 minutes. Beat in the vanilla extract until just combined. Spread over the frozen pie and place in the oven until the meringue just browns, 1 to 2 minutes. Slice and serve.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.5}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 1.0}, {"food": "lemon juice", "quantity": 0.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 14.0}, {"food": "yellow rice", "quantity": 8.0}, {"food": "vanilla extract", "quantity": 0.5}], "title": "\nLemon Ice Cream Meringue Pie\n"}, {"directions": "\n\n              Preheat the oven to 325 degrees F. Line two baking sheets with parchment paper.\n            \n\n              Combine the coconut, lemon curd, egg whites and salt with a spatula in a medium bowl until a uniform consistency.\n            \n\n              Roll generous tablespoons of the mixture into egg shapes, setting them big-side down onto the prepared baking sheets. Repeat with the rest of the mix. Bake until the bottom and a few of the coconut frays turn deep golden brown, about 20 minutes.\n            \n\n              Meanwhile, cut the jelly beans in half lengthwise and set aside.\n            \n\n              Remove the macaroons from the oven and let them cool enough to handle, but are still warm, about 5 minutes.\n            \n\n              Take one of the jelly bean halves and pinch an end to make a pointed beak. Hold the point, shiny-side up, and push the rounded end into the side of a macaroon. Push 2 mini chocolate chips, peak-side in, into the macaroon on either side of the beak for eyes. Repeat with the rest of the macaroons and serve.\n            \n", "ingredients": [{"food": "coconut water", "quantity": 14.0}, {"food": "lemon juice", "quantity": 0.25}, {"food": "egg substitute", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "fava beans", "quantity": 15.0}, {"food": "baking chocolate", "quantity": 60.0}], "title": "\nLemon Macaroon Chicks\n"}, {"directions": "\n\n              Combine the lemon juice and sugar in a small saucepan with 1/2 cup water. Bring to a boil, then reduce the heat to medium and simmer until the mixture is syrupy, 10 to 15 minutes. Transfer to a small bowl and set aside to cool.\n            \n\n              Make the ice cream cake: Brush a 5-by-9-inch loaf pan with vegetable oil and line with plastic wrap. Scoop the lemon sherbet into the pan and spread into an even layer. Top with the vanilla ice cream in an even layer. Place a piece of plastic wrap directly on the ice cream and press with your hands to smooth the surface and firmly pack the ice cream. Freeze 30 minutes.\n            \n\n              Uncover the ice cream and arrange the ladyfingers in a single layer on top, trimming them as needed to fit. Brush the ladyfingers with half of the prepared lemon syrup. Cover with plastic wrap and freeze until firm, at least 2 hours or overnight.\n            \n\n              Make the meringue: Beat the egg whites and cream of tartar in a large bowl with a mixer on medium-high speed until foamy, about 2 minutes. Gradually beat in the sugar, then increase the mixer speed to high and beat until stiff shiny peaks form, about 4 more minutes.\n            \n\n              Uncover the cake and invert onto a parchment-lined baking sheet; let the pan stand overturned until the cake slips out. Remove the plastic wrap and cover the cake completely with the meringue, using the back of a spoon to make swirly peaks. Freeze until firm, at least 2 more hours.\n            \n\n              Preheat the oven to 500 degrees F. Bake the cake until the meringue peaks are golden, 3 to 5 minutes, or brown the meringue with a kitchen torch. Let the cake soften 10 minutes at room temperature before slicing. Serve with the remaining lemon syrup for drizzling.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "lemon juice", "quantity": 0.5}, {"food": "sugar", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 1}, {"food": "sherbet", "quantity": 1.5}, {"food": "ice cream swich", "quantity": 1.5}, {"food": "", "quantity": 8.0}, {"food": "egg substitute", "quantity": 6.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "sugar", "quantity": 1.0}], "title": "\nLemon Meringue Baked Alaska\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Position a rack in the center of the oven and preheat to 350 degrees F. Line a 9-by-13-inch glass baking dish with foil leaving a 2-inch overhang on two sides. Grease the foil and dish with 1 tablespoon butter.\n            \n\n              For the lemon bar crust: Pulse 1 1/2 cups flour, 1/3 cup sugar, butter, cornstarch and salt together in a food processor until a dough forms, about 1 minute. Press the dough evenly into the bottom of the prepared pan. Bake until the crust is golden at the edges and pale golden in the center, about 30 minutes. Transfer to a wire rack.\n            \n\n              Reduce the oven temperature to 300 degrees F. \n            \n\n              For the lemon bar filling: Whisk together the eggs and egg yolks with the remaining 1 2/3 cups sugar and the remaining 1/2 cup flour in a bowl until smooth. Whisk in the lemon juice. \n            \n\n              Pour the filling over the warm crust and return to the oven. Bake until the filling is just set, about 30 minutes. Cool the bars, completely, on a wire rack, about 30 minutes. \n            \n\n              Meanwhile, for the meringue: Bring a few inches of water to a boil in a large saucepan. Whisk together the sugar, cream of tartar, salt and egg whites in a large bowl that sits comfortable in the saucepan without touching the water. Set the bowl above the boiling water and continue whisking until the mixture is hot to the touch (135 degrees F) and the sugar dissolves, 2 to 3 minutes. Remove from the heat and beat on medium-high speed with an electric mixer until the whites hold soft peaks. Increase the speed to high and continue to beat until the meringue holds stiff, but spreadable peaks. Spread and swirl the meringue on top of the cooled lemon bars. \n            \n\n              Preheat the broiler to high. Set the lemon bars under the broiler until the meringue is evenly toasted and golden brown, about 30 seconds. (Alternatively, brown the meringue with a hand torch.) Cut into 24 squares and serve or refrigerate until ready to serve.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.5}, {"food": "potato flour", "quantity": 2.0}, {"food": "sugar", "quantity": 2.0}, {"food": "cornstarch", "quantity": 3.0}, {"food": "salt", "quantity": 0.25}, {"food": "eggs", "quantity": 4.0}, {"food": "egg substitute", "quantity": 2.0}, {"food": "lemon juice", "quantity": 0.75}, {"food": "sugar", "quantity": 0.5}, {"food": "ice cream swich", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "egg substitute", "quantity": 4.0}], "title": "\nLemon Meringue Bars\n"}, {"directions": "\n\nFor the cake:\n\n\n              Make the lemon curd: Whisk the sugar, egg yolks, lemon juice, lemon zest, cornstarch and salt in a small saucepan over medium-low heat; cook, whisking occasionally, until the sugar dissolves. Continue cooking, whisking constantly, until thick, about 10 minutes. Whisk in the butter a few pieces at a time until melted, then strain through a fine-mesh sieve into a bowl. Press plastic wrap directly onto the surface and refrigerate until set, at least 2 hours.\n            \n\n              Make the meringue: Whisk the egg whites and sugar in a heatproof bowl set over a saucepan of simmering water (do not let the bowl touch the water) until the mixture is warm and the sugar dissolves, 3 to 4 minutes. Remove the bowl from the pan; add the cream of tartar and vanilla and beat with a mixer on medium-high speed until stiff, glossy peaks form, 6 to 8 minutes.\n            \n\n              Assemble the cake: Put 1 cake layer on a platter; spread the lemon curd on top, stopping about 1/2 inch from the edge. Top with the second cake layer and press down gently. Cover the cake with the meringue, using the back of a spoon to make swirly peaks. Brown the meringue with a kitchen torch. Serve immediately or refrigerate up to 1 day.\n            \n\nBasic Vanilla Cake\n\n\n              Preheat the oven to 350 degrees F. Butter two 9-inch-round cake pans and line the bottoms with parchment paper; butter the parchment and dust the pans with flour, tapping out the excess.\n            \n\n              Whisk 3 cups flour, the baking powder and salt in a bowl until combined. Beat 2 sticks butter and the sugar in a large bowl with a mixer on medium-high speed until light and fluffy, about 3 minutes. Reduce the mixer speed to medium; beat in the eggs, one at a time, scraping down the bowl as needed. Beat in the vanilla. (The mixture may look separated at this point.)\n            \n\n              Mix 1/2 cup water with the cream in a liquid measuring cup or bowl. Beat the flour mixture into the butter mixture in 3 batches, alternating with the cream mixture, beginning and ending with flour, until just smooth.\n            \n\n              Divide the batter between the prepared pans. Bake until the cakes are lightly golden on top and the centers spring back when pressed, 25 to 30 minutes. Transfer to racks and let cool 10 minutes, then run a knife around the edge of the pans and turn the cakes out onto the racks to cool completely. Remove the parchment. Trim the tops of the cakes with a long serrated knife to make them level, if desired.\n            \n", "ingredients": [{"food": "sugar", "quantity": 0.75}, {"food": "egg substitute", "quantity": 6.0}, {"food": "lemon juice", "quantity": 0.3333333333333333}, {"food": "lemon juice", "quantity": 1.0}, {"food": "cornstarch", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "butter oil", "quantity": 6.0}, {"food": "egg substitute", "quantity": 4.0}, {"food": "sugar", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "baked beans", "quantity": 1}, {"food": "butter oil", "quantity": 2.0}, {"food": "potato flour", "quantity": 3.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "sugar", "quantity": 1.5}, {"food": "eggs", "quantity": 4.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 0.75}], "title": "\nLemon Meringue Cake\n"}, {"directions": "\n\n              Make the cupcakes: Preheat the oven to 350 degrees F and line a 12-cup muffin pan with paper liners. Whisk the flour, baking powder, baking soda and salt in a bowl until combined. Whisk the eggs, granulated sugar, milk, vegetable oil, lemon zest, lemon juice and vanilla in a large bowl until combined. Whisk the flour mixture into the egg mixture.\n            \n\n              Divide the batter evenly among the prepared muffin cups, filling them to just below the rim. Bake until a toothpick inserted into the center of a cupcake comes out clean, 25 to 30 minutes. Let cool 15 minutes in the pan, then transfer to a rack to cool completely.\n            \n\n              Make the meringue: Beat the egg whites and salt in a large bowl with a mixer on medium speed until foamy, about 1 minute. Increase the mixer speed to high and gradually beat in 2 tablespoons granulated sugar; beat until stiff shiny peaks form, about 3 minutes.\n            \n\n              Combine the remaining 6 tablespoons granulated sugar, the corn syrup and 1/4 cup water in a saucepan over medium-high heat. Cook until the mixture registers 245 degrees F on a candy thermometer, about 6 minutes; remove from the heat. With the mixer on medium speed, slowly pour the hot sugar syrup into the egg whites; increase the speed to high and beat until the meringue is fluffy and cool, about 6 minutes. Beat in the vanilla. Transfer the meringue to a pastry bag fitted with a large round tip and pipe onto the cupcakes; set aside at room temperature to firm up, about 15 minutes.\n            \n\n              Meanwhile, make the glaze: Whisk the confectioners' sugar, lemon juice, limoncello and food coloring in a microwave-safe bowl until smooth. Microwave 1 minute, then whisk again until the sugar dissolves; let cool about 5 minutes, stirring occasionally. Dip the meringue-covered tops of the cupcakes into the glaze, letting the excess drip off. If the glaze gets too thick, microwave 20 seconds.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.75}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 0.25}, {"food": "eggs", "quantity": 2.0}, {"food": "sugar", "quantity": 1.75}, {"food": "whole milk", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.75}, {"food": "", "quantity": 2.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "egg substitute", "quantity": 2.0}, {"food": "salt", "quantity": 0.25}, {"food": "sugar", "quantity": 0.5}, {"food": "silk light vanilla", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 0.25}, {"food": "sugar", "quantity": 2.5}, {"food": "lemon juice", "quantity": 0.25}, {"food": "barley flour or meal", "quantity": 1.0}, {"food": "yellow rice", "quantity": 6.0}], "title": "\nLemon Meringue Cupcakes\n"}, {"directions": "\n\n              Preheat the oven to 200 degrees F. Line a baking sheet with parchment paper. Draw two 4-by-13-inch rectangles about 2 inches apart on the parchment, then flip it over so it is marked-side down.\n            \n\n              Make the meringue: Beat the egg whites in a medium bowl with a mixer on medium-high speed until foamy, about 1 minute. Gradually beat in the granulated sugar and continue beating until stiff shiny peaks form, about 6 minutes. Gently fold in the confectioners' sugar with a rubber spatula (do not overmix).\n            \n\n              Transfer the meringue to a pastry bag fitted with a 3/4-inch round tip. Using the rectangles as a guide, pipe 4-inch-long lines of meringue side by side in each rectangle. (The lines should touch each other.) Transfer to the oven and bake, rotating the baking sheet occasionally, until the meringue is firm and crisp but not brown, about 2 hours. Remove from the oven and let cool completely on the baking sheet.\n            \n\n              Meanwhile, make the lemon curd: Combine the egg yolks, lemon zest, lemon juice and granulated sugar in a medium saucepan; cook over medium heat, whisking, until thickened, about 7 minutes. Whisk in the butter, a few pieces at a time, until incorporated. Transfer the curd to a small bowl, then set in a larger bowl of ice; stir occasionally until the curd is completely cool, then refrigerate until ready to use.\n            \n\n              Make the ginger cream: Combine the heavy cream, confectioners' sugar, crystallized ginger and vanilla in a bowl and beat with a mixer on medium-high speed until stiff peaks form, about 5 minutes.\n            \n\n              Assemble the napoleon: Place a meringue rectangle on a platter. Spoon the lemon curd on top, leaving a 1/2-inch border. Top with the ginger cream. Place the other meringue rectangle on top and gently press; refrigerate 1 hour. Dust with confectioners' sugar before serving.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "egg substitute", "quantity": 4.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "sugar", "quantity": 0.75}, {"food": "egg substitute", "quantity": 3.0}, {"food": "lemon juice", "quantity": 0.5}, {"food": "lemon juice", "quantity": 0.25}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "butter oil", "quantity": 4.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "sugar", "quantity": 3.0}, {"food": "ginger", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 0.5}], "title": "\nLemon Meringue Napoleon with Ginger Cream\n"}, {"directions": "\n\n              Make the crusts: Pulse the flour, almonds, sugar and salt in a food processor until the nuts are finely ground. Add the butter and pulse until the mixture looks like coarse meal. Add 3 tablespoons ice water and pulse until the dough starts coming together. Turn the dough out onto a piece of plastic wrap, pat into a disk and wrap in the plastic. Refrigerate until cold but still malleable, about 15 minutes. Meanwhile, preheat the oven to 375 degrees F.\n            \n\n              Lightly butter four 4-inch tart pans with removable bottoms. Divide the prepared dough into 4 pieces, then press into the bottom and up the side of each prepared pan. Freeze until firm, about 10 minutes, then use a paring knife to trim the excess pastry.\n            \n\n              Place the tart shells on a baking sheet, line each with foil and fill with pie weights or dried beans. Bake until golden around the edges, about 20 minutes. Remove the foil and weights and continue baking until the crusts are golden brown all over, 5 to 10 more minutes. Let cool, then carefully loosen the crusts but leave in the pans on the baking sheet.\n            \n\n              Meanwhile, make the filling: Whisk the sugar, lemon zest, lemon juice, orange juice, cornstarch and 1/4 cup water in a medium saucepan until smooth. Whisk in the whole egg and egg yolks. Cook over medium heat, whisking, until the mixture simmers, about 5 minutes. Add the butter and limoncello and continue whisking over medium heat until thick like pudding, 4 to 6 more minutes. Spoon the curd into the prepared crusts.\n            \n\n              Make the meringue: Beat the egg whites in a medium bowl with a mixer on medium speed until foamy, about 1 minute. Sprinkle in the cream of tartar and continue beating until soft peaks form, about 3 minutes. Gradually beat in the sugar and beat until stiff shiny peaks form, 4 to 5 more minutes. Transfer the meringue to a pastry bagfitted with a star tip and pipe onto the tarts. Bake at 375 degrees F until the meringue is set and golden, about 15 minutes. Let cool completely before unmolding.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.0}, {"food": "almonds", "quantity": 0.5}, {"food": "sugar", "quantity": 0.25}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "lemon juice", "quantity": 0.5}, {"food": "orange juice", "quantity": 0.3333333333333333}, {"food": "cornstarch", "quantity": 2.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "butter oil", "quantity": 6.0}, {"food": "barley flour or meal", "quantity": 3.0}, {"food": "egg substitute", "quantity": 3.0}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "sugar", "quantity": 7.0}], "title": "\nLemon Meringue Tartlets\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Coat a 9-by-5-inch loaf pan with cooking spray and line the bottom with parchment paper. Coat the parchment with cooking spray.\n            \n\n              Thinly slice 2 lemons and remove the seeds; set aside for topping. Grate the zest of 2 lemons. Squeeze enough of the lemons to measure 1/2 cup juice.\n            \n\n              Whisk the flour, baking powder and salt in a medium bowl. Beat 1 cup granulated sugar, the olive oil, eggs, lemon zest, 1/4 cup lemon juice and the vanilla in a large bowl with a mixer on medium-high speed until combined and creamy, about 2 minutes. Reduce the mixer speed to low and beat in the flour mixture in three batches, alternating with the milk. Increase the mixer speed to medium high and beat until combined, about 1 minute.\n            \n\n              Pour the batter into the prepared loaf pan and bake until the cake is golden brown and a toothpick inserted into the center comes out clean, 40 to 50 minutes. Transfer to a rack and let cool 40 minutes in the pan, then remove to the rack to cool completely.\n            \n\n              Meanwhile, make the topping: Put the lemon slices in a small saucepan and cover with water. Bring to a boil, then drain. Return the lemon slices to the saucepan and repeat the boiling process two more times. Return the lemon slices to the saucepan and add 1 cup water, the remaining 3/4 cup granulated sugar and 2 tablespoons lemon juice. Bring to a boil, then reduce the heat so the liquid gently simmers; cook until the liquid is syrupy and the lemon slices are tender and translucent, about 15 minutes. Let cool completely.\n            \n\n              Make the glaze: Combine the confectioners' sugar and 1 tablespoon lemon juice in a bowl until smooth, adding the remaining 1 tablespoon lemon juice if the glaze is too thick. Spoon the glaze over the cake, letting it drip down the sides. Remove the candied lemon slices from the syrup, letting the excess drip back into the saucepan. Arrange on top of the cake.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "lemons", "quantity": 6.0}, {"food": "potato flour", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "sugar", "quantity": 1.75}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "whole milk", "quantity": 0.5}, {"food": "sugar", "quantity": 0.75}], "title": "\nLemon Olive Oil Cake\n"}, {"directions": "\n\n              Simmer 1 cup orzo in a saucepan with 2 1/2 cups water, 2 tablespoons olive oil, 1 teaspoon dried mint, 1 teaspoon salt, 1/2 teaspoon paprika and 2 strips lemon zest, stirring occasionally, until the orzo is tender, 12 to 15 minutes. Let cool slightly. Stir in 2 chopped scallions, the juice of 1 lemon, and salt to taste.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nLemon Orzo\n"}, {"directions": "\n\n              Bring a medium saucepan of salted water to a boil. Add the orzo and cook as the label directs. Reserve 1/4 cup cooking water, then drain. Transfer the orzo to a large bowl and add 2 tablespoons butter, the lemon zest, half of the lemon juice and 2 tablespoons of the reserved pasta cooking water. Season with salt and pepper; toss, adding more pasta cooking water as needed to loosen. Cover to keep warm.\n            \n\n              Pat the scallops dry and season with salt and pepper. Heat the olive oil in a large nonstick skillet over medium-high heat. Add the scallops and cook until browned on the bottom, about 3 minutes. Flip and cook until just cooked through, 1 to 2 more minutes. Transfer to a plate; cover to keep warm.\n            \n\n              Add the garlic to the skillet. Cook, stirring, until golden, about 10 seconds. Add the wine, 1/4 cup water and the remaining lemon juice. Cook until reduced by half, about 3 minutes. Add the capers and the remaining 3 tablespoons butter; swirl to melt. Stir in the parsley.\n            \n\n              Add the arugula and tomatoes to the orzo; toss. Serve with the scallops and pan sauce.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "", "quantity": 1.0}, {"food": "butter oil", "quantity": 5.0}, {"food": "grape juice", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "sea lion", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "martha white foods", "quantity": 0.5}, {"food": "capers", "quantity": 1.0}, {"food": "parsley", "quantity": 2.0}, {"food": "arugula", "quantity": 2.0}, {"food": "barley flour or meal", "quantity": 1.0}], "title": "\nLemon Orzo with Scallops\n"}, {"directions": "\n\n              Preheat the broiler and line a baking sheet with foil. Scoop out the seeds from the zucchini, leaving a 1/4-inch-thick shell. Brush the zucchini all over with 1 tablespoon olive oil and season with salt and pepper. Transfer to the baking sheet and broil until just soft, about 1 minute per side; set aside.\n            \n\n              Meanwhile, bring a saucepan of salted water to a boil. Add the pasta and cook as the label directs; drain. Heat the remaining 1 tablespoon olive oil in a large skillet over medium heat. Add the shallot and cook, stirring, until tender, about 1 minute. Add the heavy cream and chicken broth, bring to a simmer and cook until slightly thickened, 5 to 6 minutes.\n            \n\n              Add the havarti, 2 tablespoons parmesan, 1/2 teaspoon salt and a few grinds of pepper to the saucepan; stir until the cheese melts. Remove from the heat and stir in the egg yolk, pasta, parsley and lemon zest.\n            \n\n              Combine the breadcrumbs and the remaining 1 tablespoon parmesan in a small bowl. Fill the zucchini halves with the pasta mixture and sprinkle with the parmesan breadcrumbs. Return to the broiler until golden brown, about 1 minute.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [{"food": "", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "italian veg medley pasta", "quantity": 0.5}, {"food": "", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "diced chicken", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 0.75}, {"food": "parmesan cheese", "quantity": 3.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "parsley", "quantity": 0.25}, {"food": "lemon juice", "quantity": 1.0}, {"food": "", "quantity": 1.0}], "title": "\nLemon Pasta-Stuffed Zucchini\n"}, {"directions": "\n\n              Heat the olive oil in a large Dutch oven over medium-high heat. Add the onion and cook, stirring, until softened, about 5 minutes. Add the couscous and cook, stirring, until toasted, 3 to 5 minutes. Add the chicken broth, bay leaves, 1 teaspoon salt and a few grinds of pepper. Bring to a boil, stirring. Reduce the heat to low; cover and cook until the liquid is absorbed and the couscous is tender, about 10 minutes. Discard the bay leaves.\n            \n\n              Add the dates, scallions, parsley, dill and lemon zest to the pot and stir; season with salt and pepper. Transfer to a serving bowl. Drizzle with olive oil and top with pomegranate seeds.\n            \n\n              Photograph by Ryan Liebe\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "couscous", "quantity": 2.5}, {"food": "diced chicken", "quantity": 3.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "dates", "quantity": 0.75}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "parsley", "quantity": 0.25}, {"food": "dill seed", "quantity": 2.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "seeds", "quantity": 1}], "title": "\nLemon Pearl Couscous with Dates\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F. Lightly brush a 12-cup muffin tin with butter and set aside. Sift the flour, baking powder, and salt into a medium bowl and set aside. \n            \n\n              In a standing mixer fitted with the paddle attachment, or with an electric hand-held mixer in a large bowl, cream the butter, zest, and 2/3 cup sugar until light and fluffy, about 2 minutes. Scrape down the sides of the bowl with a rubber spatula. Add the eggs, one at a time, beating well after each addition. Remove the bowl from the mixer. Stir in the poppy seeds. \n            \n\n              Fold the flour in 3 parts into the butter mixture, alternating with the milk in 2 parts, until just combined. Take care not to overmix the batter. Divide the batter evenly into the muffin tin and sprinkle the tops with sugar. Bake until golden brown, about 25 minutes. Cool muffins in the pan on a rack. Serve warm.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 0.5}, {"food": "lemon juice", "quantity": 1.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "eggs", "quantity": 2.0}, {"food": "seeds", "quantity": 4.0}, {"food": "milk", "quantity": 0.5}], "title": "\nLemon Poppy Seed Muffins\n"}, {"directions": "\n\n              Preheat oven to 325 degrees. Butter and flour bundt pan. Mix lemon zest with sugar in small bowl. In a large bowl, beat together the butter and sugar with an electric mixer until light and fluffy. Beat in vanilla and eggs one at a time. Beat in lemon juice, baking powder and soda and salt. Mix in the flour until well combined. Stir in poppyseeds. Pour the batter into prepared bundt pan. Bake at 325 degrees for 45 minutes or until a knife comes out clean. Cool cake for fifteen minutes and then flip out of pan. To make icing, combine confectioner's sugar and lemon juice In small bowl and stir until smooth. When cake has cooled, drizzle icing over cake and serve.\n            \n", "ingredients": [{"food": "", "quantity": 2.0}, {"food": "sugar", "quantity": 1.5}, {"food": "butter oil", "quantity": 2.5}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "eggs", "quantity": 5.0}, {"food": "lemon juice", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 1.25}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "hearts of palm", "quantity": 1}, {"food": "potato flour", "quantity": 2.75}, {"food": "", "quantity": 0.25}, {"food": "lemon juice", "quantity": 0.25}, {"food": "sugar", "quantity": 1.0}], "title": "\nLemon Poppyseed Coffeecake\n"}, {"directions": "\n\n              Slice 4 peeled potatoes into 1 1/2-inch rounds. Toss in an ovenproof skillet with 1/3 cup lemon juice, 1/4 cup olive oil, 4 smashed garlic cloves, 4 oregano sprigs, and salt and pepper. Add enough water to come halfway up the sides of the potatoes. Cover, bring to a boil and cook 5 minutes. Uncover and roast at 500 degrees F, 30 more minutes.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nLemon Potatoes\n"}, {"directions": "\n\n              Remove the zest of 1 lemon in wide strips with a vegetable peeler. Juice both lemons to make about 5 tablespoons. Chop 1 cup of the strawberries and combine with 1 tablespoon granulated sugar and 1 tablespoon lemon juice in a bowl; set aside to macerate while you make the pudding.\n            \n\n              Meanwhile, whisk the remaining 1/2 cup granulated sugar, the cornstarch and salt in a medium bowl. Whisk in the egg yolks and 1/4 cup half-and-half until smooth. Bring the remaining 1 1/2 cups half-and-half and the lemon zest to a boil in a medium saucepan over medium-high heat. Remove from the heat and let sit 10 minutes to infuse. Gradually whisk in the sugar-yolk mixture, then the remaining 1/4 cup lemon juice.\n            \n\n              Return the saucepan to medium-high heat and cook, whisking constantly, until the pudding comes to a boil and thickens, about 3 minutes. Continue cooking, whisking constantly, about 1 more minute. Remove from the heat and whisk in the butter until smooth. Strain the mixture through a fine-mesh sieve, pressing it through with a rubber spatula; discard the lemon zest.\n            \n\n              Divide the macerated strawberries among 8 clear plastic cups or glasses; top with the lemon pudding. Press plastic wrap directly onto the surface of each and refrigerate until set, at least 4 hours or overnight.\n            \n\n              When the pudding is set, pulse the remaining 3/4 cup strawberries in a mini food processor until smooth. Beat the heavy cream and confectioners' sugar in a large bowl with a mixer on medium speed until soft peaks form, about 1 minute. Add the strawberry puree and continue beating until stiff peaks form. Top the pudding with the strawberry whipped cream and sprinkle with the crumbled cookies. Top with sliced strawberries.\n            \n\n              Photograph by Ryan Liebe\n            \n", "ingredients": [{"food": "lemons", "quantity": 2.0}, {"food": "strawberries", "quantity": 1.75}, {"food": "sugar", "quantity": 0.5}, {"food": "cornstarch", "quantity": 2.0}, {"food": "salt", "quantity": 0.125}, {"food": "egg substitute", "quantity": 3.0}, {"food": "", "quantity": 1.75}, {"food": "butter oil", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 0.75}, {"food": "sugar", "quantity": 2.0}, {"food": "chocolate chip cookies", "quantity": 4.0}], "title": "\nLemon Pudding with Strawberry Cream\n"}, {"directions": "\n\n              Heat a grill to medium-low heat. (The heat coming from a dying charcoal grill or a gas grill cooling down will also work well.)\n            \n\n              Halve each graham cracker sheet crosswise into 2 squares. Dollop about 1 teaspoon of the jam on one half and top with 4 raspberries. Dollop about 1 teaspoon of the lemon curd on the other half. Repeat with the remaining ingredients.\n            \n\n              Take the graham cracker squares and chocolate to your grill (as the marshmallows toast they will become soft and start to droop off the skewer). Working with a few at a time, skewer a marshmallow on a long fork or metal skewer and hold over the heat about 2 inches above the grates. Toast, turning occasionally, until the marshmallow puffs and turns golden brown, 1 to 2 minutes.\n            \n\n              Place the marshmallow on top of the graham square with the fresh raspberries and gently press the graham half with the lemon curd on top of the marshmallow. Pull the skewer out the marshmallow while pressing down so it is sandwiched between the lemon and raspberry halves, and squeeze the curd and jam toward the edge of the graham. Enjoy immediately while warm and gooey.\n            \n\n              Cook's Note: If you love apple pie, try making these s'mores using cinnamon graham crackers and substituting apple butter for the lemon curd.\n            \n", "ingredients": [{"food": "crackers", "quantity": 8.0}, {"food": "silk raspberry soy yogurt", "quantity": 3.0}, {"food": "raspberries", "quantity": 32.0}, {"food": "lemon juice", "quantity": 3.0}, {"food": "", "quantity": 8.0}], "title": "\nLemon Raspberry S'mores\n"}, {"directions": "\n\n              Slice 1 lemon half into 4 thin rounds and set aside. Grate the zest of the other lemon half and set aside; squeeze some of the juice into a bowl and mix in the yogurt and 1/4 teaspoon paprika. Preheat the broiler. Heat 1 teaspoon olive oil in a medium saucepan over medium heat. Add the garlic, oregano and red pepper flakes and cook until the garlic is golden, about 2 minutes. Add the lima beans, 1 1/2 cups water and the lemon zest; partially cover the pan, bring to a simmer and cook until the beans are tender, about 20 minutes. Season with salt and pepper. Remove from the heat and stir in the parsley, 1 tablespoon of the yogurt mixture and the remaining 1 teaspoon olive oil. Meanwhile, mix the remaining 1/2 teaspoon paprika, 1/2 teaspoon salt, and pepper to taste in a small bowl. Sprinkle all over the salmon; arrange on a foil-lined baking sheet and top each fillet with a lemon slice. Broil until just cooked through, 6 to 8 minutes. Serve with the lima beans and top with the yogurt mixture. \n            \n\n               Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "lemon juice", "quantity": 1.0}, {"food": "silk plain soy yogurt", "quantity": 0.5}, {"food": "paprika", "quantity": 0.75}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "", "quantity": 0.75}, {"food": "hearts of palm", "quantity": 1}, {"food": "lima beans", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "parsley", "quantity": 2.0}, {"food": "vegetarian fillets", "quantity": 4.0}], "title": "\nLemon Salmon with Lima Beans\n"}, {"directions": "\n\n              Heat the olive oil in a saucepan over medium heat. Add the onion, 1 teaspoon of salt, ginger, and bay leaf, stirring occasionally, until the onion is tender and translucent, about 6 minutes.\n            \n\n              Add the rice and cook until it begins to brown, about 4 minutes. Stir in the water along with the lemon zest. Bring to a simmer. Reduce the heat to low, cover, and cook for 15 minutes. Pull from the heat and set aside for 5 minutes undisturbed. Fluff with a fork season with some pepper and serve.\n            \n", "ingredients": [{"food": "salt", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "salt", "quantity": 2.0}, {"food": "ginger", "quantity": 1.0}, {"food": "corier leaf", "quantity": 1.0}, {"food": "crisped rice bar", "quantity": 1.0}, {"food": "coconut water", "quantity": 2.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nLemon Scented Rice\n"}, {"directions": "\n\n              Make Classic Shortbread dough, beating 1 teaspoon lemon zest with the butter. Mix 2 cups confectioners' sugar with the zest and juice of 1 lemon. Spread over the finished shortbread and sprinkle with yellow decorating sugar. Slice into squares.\n            \n", "ingredients": [], "title": "\nLemon Shortbread Squares\n"}, {"directions": "\n\n              Preheat a grill to medium high. Combine the breadcrumbs and 1 teaspoon olive oil in a small skillet over medium heat; cook, stirring, until golden, about 5 minutes. Transfer to a small bowl and let cool. Stir in the lemon zest, grated garlic and cheese; set aside.\n            \n\n              Tear off 4 large sheets of heavy-duty foil. Divide the artichoke hearts among the sheets. Season with salt and top each with an oregano sprig and a few lemon slices; add a tablespoon of butter to each. Season the shrimp with salt and place on top of the lemon slices. Sprinkle the shrimp with the red pepper flakes, parsley and minced garlic; drizzle with the vermouth and the remaining 1/4 cup olive oil. Bring two opposite ends of the foil together and fold twice to seal. Fold in the other sides and seal, leaving room for heat to circulate.\n            \n\n              Grill the foil packets until the shrimp are just cooked through and the mixture is saucy, about 10 minutes. Carefully open the packets and sprinkle with the breadcrumb mixture.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "cloves", "quantity": 5.0}, {"food": "parmesan cheese", "quantity": 2.0}, {"food": "artichoke hearts", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 4.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "parsley", "quantity": 0.25}, {"food": "barley flour or meal", "quantity": 0.5}], "title": "\nLemon Shrimp Scampi with Artichokes\n"}, {"directions": "\n\n              Preheat 2 medium non-stick skillets over medium-low heat for 5 minutes. \n            \n\n              Meanwhile, lay the fillets on a piece of wax paper, parchment, or a baking sheet and blot dry with paper towels. Season the fillets with salt and pepper. (If the fillets tapers down to a very thin tail, fold the tail back to make a more uniformly thick fillet.) Put the flour on a plate. Dredge the rounded-sides of the fillets in the flour and shake off any excess. \n            \n\n              Raise the heat to medium-high and add 1 tablespoon of butter to each skillet. When the butter stops foaming, add 2 fillets to each pan, rounded-side down, and cook, lightly shaking the skillets occasionally, until golden brown, about 2 minutes. Turn off the heat, flip the fillets with a spatula, and let the fillets finish cooking in the residual heat in the pans, about 2 minutes more. Transfer the fillets to 4 warm plates and cover loosely with foil. \n            \n\n              Add the lemon juice and water to one of the skillets. While moving the skillet in a circular motion, add the remaining 3 tablespoons butter, little by little, until melted and a smooth, creamy sauce is formed. Stir in the parsley and thyme and season with salt and pepper to taste. Spoon some of the sauce over each fillet and serve immediately. \n            \n", "ingredients": [{"food": "barley flour or meal", "quantity": 4.0}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "butter oil", "quantity": 5.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "coconut water", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}], "title": "\nLemon Sole\n"}, {"directions": "\n\n              Position racks in the upper and lower thirds of the oven; preheat to 350 degrees F. Whisk the flour, baking powder and salt in a medium bowl.\n            \n\n              Beat the butter, granulated sugar and lemon zest in a large bowl with a mixer on medium-high speed until fluffy, about 3 minutes. Beat in the egg and both extracts. Reduce the mixer speed to low and beat in the flour mixture until just combined.\n            \n\n              Fill a cookie press with the dough according to the manufacturer?s directions; press the dough 1 1/2 inches apart onto unlined baking sheets. Decorate with sanding sugar and/or nonpareils.\n            \n\n              Bake, switching the pans halfway through, until the cookies are golden around the edges, 14 to 17 minutes. Let cool 5 minutes on the pans, then transfer to racks to cool completely.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 1.5}, {"food": "sugar", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "sugar", "quantity": 1}], "title": "\nLemon Spritz Cookies\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              For the crust: Lightly brush a 9- by 13-inch baking pan with butter. Beat the butter and granulated sugar with an electric mixer in a large bowl until light and fluffy, about 4 minutes. Whisk the flour, cornstarch and salt together in a medium bowl. Slowly add the dry ingredients to the butter and mix just until combined. Evenly press the dough into the prepared pan. Cover and refrigerate at least 1 hour. \n            \n\n              Preheat the oven to 325 degrees F. Pierce the dough all over with a fork. Bake until golden, about 30 minutes. Cool. \n            \n\n              For the filling: Whisk the sweetened condensed milk, granulated sugar, flour, salt, eggs and yolks in a large bowl until thick and light. Lightly whisk in the citrus juices. Pour the filling into the crust. Bake until set but still loose in the center, about 25 minutes. Cool to room temperature, and then refrigerate at least 1 hour.\n            \n\n              Cut into 2-inch squares and just before serving, dust generously with confectioners' sugar.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.5}, {"food": "", "quantity": 1}, {"food": "butter oil", "quantity": 1.5}, {"food": "cornstarch", "quantity": 3.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "salt", "quantity": 0.25}, {"food": "", "quantity": 1}, {"food": "milk", "quantity": 0.5}, {"food": "sugar", "quantity": 0.5}, {"food": "potato flour", "quantity": 0.3333333333333333}, {"food": "salt", "quantity": 1}, {"food": "eggs", "quantity": 2.0}, {"food": "egg substitute", "quantity": 2.0}, {"food": "lemon juice", "quantity": 0.75}, {"food": "orange juice", "quantity": 1.0}, {"food": "sugar", "quantity": 1}], "title": "\nLemon Squares\n"}, {"directions": "\n\n              In a small measuring cup, mix the lemon juice with the sugar and 1/4 cup water until the sugar is dissolved. Set aside.\n            \n\n              Place the cream cheese, lemon curd and heavy cream in a food processor and process until smooth and a bit fluffy.\n            \n\n              To assemble the tiramisu, place half the ladyfingers in the bottom of an 8-inch square baking dish, breaking a few to fit, and drizzle with half of the lemon syrup. Top with half the lemon cream and 1 cup mixed berries. Repeat the layers, using the remaining ladyfingers, syrup and lemon cream.\n            \n\n              Cover with plastic wrap and chill at least 8 hours or overnight. Before serving, top with the remaining 2 cups of berries and dust with powdered sugar. Serve with whipped cream on the side.\n            \n", "ingredients": [{"food": "lemon juice", "quantity": 0.25}, {"food": "sugar", "quantity": 0.25}, {"food": "macaroni cheese", "quantity": 12.0}, {"food": "lemon juice", "quantity": 8.0}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "chocolate chip cookies", "quantity": 22.0}, {"food": "mixed nuts", "quantity": 3.0}, {"food": "sugar", "quantity": 1}, {"food": "ice cream swich", "quantity": 1}], "title": "\nLemon Tiramisu Trifle\n"}, {"directions": "\n\n              Make Classic Sugar Cookies with 1 cup granulated sugar total (omit confectioners') and lemon zest instead of orange; omit baking powder. Chill. Pulse 1/4 cup granulated sugar and 1 tablespoon lemon zest in a food processor. Roll dough into two 1-inch-thick logs and roll in the lemon sugar. Freeze logs 20 minutes, then slice 1 inch thick. Bake 20 to 25 minutes at 325 degrees.\n            \n", "ingredients": [], "title": "\nLemon Volcanoes\n"}, {"directions": "\n\n              Position racks in the upper and lower thirds of the oven; preheat to 350 degrees F. Line 2 baking sheets with parchment paper. Whisk the flour, baking soda, cream of tartar and salt in a medium bowl; set aside.\n            \n\n              Beat the butter, sugar and lemon zest in a large bowl with a mixer on medium-high speed until light and fluffy, 3 minutes. Beat in the eggs, one at a time, then beat in the lemon juice and vanilla. Reduce the mixer speed to low; beat in the flour mixture in two batches until combined. Stir in the white chocolate chips with a wooden spoon.\n            \n\n              Drop heaping tablespoonfuls of dough about 2 inches apart on the prepared pans. Bake, switching the pans halfway through, until the cookies are just golden around the edges, 10 to 12 minutes. Let cool 3 to 5 minutes on the baking sheets, then transfer to a rack to cool completely.\n            \n\n              Photograph by Ryan Liebe\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.25}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 0.75}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 1.5}, {"food": "sugar", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 1.5}], "title": "\nLemon White Chocolate Chip Cookies\n"}, {"directions": "\n\n              Preheat the oven to 475 degrees F. Bring a large pot of unsalted water to a boil. Spray a rimmed baking sheet with cooking spray.\n            \n\n              Add the turkey, breadcrumbs, eggs, onions, 1/4 cup of the Parmesan, chopped basil, oregano, garlic, 1 1/4 teaspoons salt, 3/4 teaspoon black pepper, fennel seeds and red pepper flakes to a large bowl and mix with your hands until evenly combined. Form the mixture into 24 meatballs (about 1 1/2 tablespoons each) and place them on the prepared baking sheet, evenly spaced. Spray the meatballs with cooking spray and roast until cooked through, 12 to 15 minutes, turning each meatball over about halfway through.\n            \n\n              Meanwhile, add the linguine to the boiling water and cook according to package directions. Strain, reserving 1 cup pasta cooking water.\n            \n\n              Bring the reserved pasta water, cream and oil to a boil in a large saucepan over high heat. Add the linguine and toss to combine. Add the lemon juice and meatballs and toss to combine. Add the remaining 1/4 cup Parmesan and 1/8 teaspoon salt and toss to combine. Adjust seasoning with salt if needed.\n            \n\n              Transfer the linguine and meatballs to four large pasta bowls or a large rimmed platter. Sprinkle with the lemon zest and torn basil.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "lean pockets", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "eggs", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.8333333333333333}, {"food": "", "quantity": 0.5}, {"food": "basil", "quantity": 2.25}, {"food": "", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "fennel seed", "quantity": 0.5}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "spaghetti", "quantity": 10.0}, {"food": "ice cream swich", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 1.5}, {"food": "grape juice", "quantity": 1.0}], "title": "\nLemon Whole-Grain Linguine with Turkey Meatballs\n"}, {"directions": "\n\n              Adjust the oven rack to the top position and preheat to 450 degrees F. Toss together the potatoes, carrots, celery, onions, 1 teaspoon of the olive oil, 1/2 teaspoon salt and a few grinds of pepper on a rimmed baking sheet and arrange in a single layer. Roast until the vegetables brown slightly and the potatoes just begin to soften, about 20 minutes, tossing halfway through.\n            \n\n              Meanwhile, rub the chicken breast skin with the remaining 1 teaspoon oil and sprinkle with the poultry seasoning and 1/2 teaspoon salt. Once the vegetables begin to soften, put the chicken breasts on top and roast until the skin is golden brown and the chicken reaches an internal temperature of 165 degrees F, 20 to 25 minutes.\n            \n\n              Remove the chicken breasts and let them rest for a few minutes. Toss the roasted vegetables with juice from 1 of the lemon halves and the parsley. Cut the bones from the chicken breasts and slice the meat. Divide the chicken and roasted vegetables among 4 plates. Cut the remaining lemon half into wedges and serve alongside.\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 1.0}, {"food": "carrots", "quantity": 2.0}, {"food": "celery seed", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.5}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "diced chicken", "quantity": 3.0}, {"food": "poultry seasoning", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "parsley", "quantity": 0.25}], "title": "\nLemon and Herb Roast Chicken and Vegetables\n"}, {"directions": "\n\n              1. Smash the garlic cloves, sprinkle with 2 teaspoons kosher salt, and, with the flat side of a large knife, mash and smear the mixture into a coarse paste. Transfer to a lidded storage container. Add 1/2 teaspoon pepper and the lemon zest. Whisk in 1/4 cup of the lemon juice and 1/3 cup olive oil. Add the chicken cutlets; toss to coat. Cover and refrigerate 1 hour or up to overnight.\n            \n\n              2. Heat a heavy grill pan over medium-high heat. Working in batches, cook the chicken cutlets until charred and cooked through, about 2 minutes per side. Transfer the chicken to serving plates.\n            \n\n              3. Toss the arugula and tomatoes in a medium bowl with the remaining 2 tablespoons olive oil, the remaining 1 1/2 tablespoons lemon juice, and season with salt and pepper. Divide evenly and mound on top of each chicken cutlet. Top with cheese. Serve.\n            \n", "ingredients": [{"food": "garlic powder", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "lemon juice", "quantity": 1.0}, {"food": "lemon juice", "quantity": 0.3333333333333333}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "diced chicken", "quantity": 8.0}, {"food": "arugula", "quantity": 4.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "", "quantity": 0.25}], "title": "\nLemon and Pepper Marinated Chicken Cutlets with Arugula\n"}, {"directions": "\n\n              Bring 4 cups water, 1/2 cup basil leaves, 1/2 lemon, 3 tablespoons olive oil and a pinch of salt to a boil. Add 4 ears of corn; cook about 5 minutes. Mix 1/2 cup torn basil, 1 teaspoon lemon zest, 1 tablespoon lemon juice and 3 tablespoons olive oil. Drain the corn and toss with the flavored oil and a splash of the cooking water.\n            \n\n              Photograph by Kate Sears\n            \n", "ingredients": [], "title": "\nLemon-Basil Corn\n"}, {"directions": "\n\n              Make the egg mixture for Perfect French Toast using 1/2 teaspoon ground ginger instead of nutmeg. Spread lemon curd on 4 thick slices brioche, top with blueberries, then another bread slice. Press together; dip in the egg mixture, then fry and bake as directed. Top with confectioners' sugar.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [], "title": "\nLemon-Berry French Toast\n"}, {"directions": "\n\n              Toss 1 cup each strawberries and mixed berries with 1 tablespoon granulated sugar and the juice of 1/2 lemon in a medium bowl; set aside to macerate, 30 minutes.\n            \n\n              Meanwhile, puree 1 cup mixed berries in a blender until smooth. Refrigerate the remaining 2 cups each strawberries and mixed berries for topping.\n            \n\n              Beat the cream cheese, confectioners' sugar, vanilla, the zest of both lemons and the juice of 1 lemon in a large bowl with a mixer on medium-high speed until fluffy, about 4 minutes. Add the heavy cream and beat until slightly stiff peaks form, 1 to 2 minutes. Transfer half of the whipped cream mixture to a separate bowl and fold in the berry puree.\n            \n\n              Line a 9-by-5-inch loaf pan with plastic wrap, leaving an overhang on all sides. Spread 1 cup of the plain whipped cream mixture in the pan (refrigerate the rest for topping). Cover with a single layer of cookies. Spread 1 cup of the berry whipped cream over the cookies, then top with half of the macerated berries and another 1 cup berry whipped cream. Repeat with another layer of cookies, berry whipped cream and the remaining macerated berries and berry whipped cream. Top with another layer of cookies (you may have some left over). Cover with plastic wrap and refrigerate at least 6 hours or overnight.\n            \n\n              Before serving, toss the remaining 2 cups each strawberries and mixed berries with the remaining 1 tablespoon granulated sugar and juice of 1/2 lemon in a large bowl; set aside to macerate, 30 minutes.\n            \n\n              Uncover the cake and invert onto a platter; remove the plastic. Cover with the reserved plain whipped cream. Top with the macerated berries.\n            \n\n              Photograph by Kana Okada\n            \n", "ingredients": [{"food": "strawberries", "quantity": 3.0}, {"food": "mixed nuts", "quantity": 4.5}, {"food": "sugar", "quantity": 2.0}, {"food": "grape juice", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 3.0}, {"food": "chocolate chip cookies", "quantity": 2.0}], "title": "\nLemon-Berry Icebox Cake\n"}, {"directions": "\n\n              Cook 1 thinly sliced chile de arbol in 1/4 cup olive oil in a pot over medium heat until toasted, 2 to 3 minutes. Add the grated zest of 1 lemon, the juice of 2 lemons and 6 tablespoons butter and stir until melted. Toss with 12 ounces cooked linguine, adding up to 1 cup pasta-cooking water to loosen the sauce. Stir in 1/2 cup grated parmesan and season with salt. Top with 1 more crumbled chile de arbol.\n            \n\n              Photograph by Linda Xiao\n            \n", "ingredients": [], "title": "\nLemon-Butter Sauce with Chiles\n"}, {"directions": "\n\n              Whisk 1 1/4 cups granulated sugar,1/4 cup light brown sugar, 2 tablespoons flour and 1/2 teaspoon salt in a bowl. Whisk 1/2 cup room-temperature buttermilk, 4 room-temperature eggs, 6 tablespoons cooled melted butter, the zest and juice of 1 lemon and 1 teaspoon vanilla in a separate bowl; whisk in the sugar mixture. Pour into a 9-inch graham cracker crust and bake at 350 degrees F until golden and just set, about 45 minutes; let cool. Dust with confectioners' sugar.\n            \n", "ingredients": [], "title": "\nLemon-Buttermilk Pie\n"}, {"directions": "\n\n              Bring the sugar and 1/2 cup water to a boil in a small saucepan, stirring until the sugar has dissolved. Remove the pan from the heat, and stir in the cilantro. Let cool, then transfer the syrup to a 3-quart pitcher.\n            \n\n              Add the wine, liqueur, lemon soda and soda water to the pitcher, and stir to combine. Add the lemons, and cover the pitcher with plastic wrap. Refrigerate the sangria to chill, at least 4 hours up to overnight.\n            \n\n              To serve, fill 8 glasses halfway with ice, then pour the sangria and lemons into each glass.\n            \n", "ingredients": [{"food": "sugar", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "barley flour or meal", "quantity": 750.0}, {"food": "", "quantity": 0.5}, {"food": "lemon juice", "quantity": 11.0}, {"food": "coconut water", "quantity": 0.5}, {"food": "lemons", "quantity": 2.0}], "title": "\nLemon-Cilantro Sangria\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Make the cake: Brush a rimmed 11-by-17-inch baking sheet with vegetable oil and line with parchment paper. Oil the parchment and dust with potato starch, tapping out any excess.\n            \n\n              Spread the coconut on a separate baking sheet; bake until lightly toasted, about 8 minutes. Let cool. Finely grind all but 1/4 cup coconut in a food processor; add the matzo meal and process until finely ground. Transfer to a large bowl and stir in the potato starch and salt.\n            \n\n              Combine 1/4 cup vegetable oil with the lemon zest and juice in a bowl; set aside. Put the eggs in their shells in a bowl and cover with hot tap water; let stand 5 minutes. Crack the eggs into a bowl; add the granulated sugar and beat with a mixer on medium-low speed until combined, 1 minute. Increase the speed to medium high and beat until thick and fluffy, 12 minutes. Fold the egg mixture into the matzo meal mixture with a rubber spatula until combined. Stir in the lemon-oil mixture until just combined. Spread the batter on the baking sheet; bake until the cake is golden and springs back when pressed, 18 to 20 minutes. Transfer to a rack and let cool 5 minutes in the pan; run a knife around the edge of the cake to loosen.\n            \n\n              Dust a kitchen towel with confectioners' sugar and invert the cake onto the towel. Peel off the parchment. Starting with a long side, carefully roll up the cake, using the towel to help you. Wrap the towel tightly around the rolled cake and let cool completely, about 15 minutes.\n            \n\n              Make the frosting: Put the egg whites, granulated sugar, lemon zest and juice, and salt in a heatproof bowl. Set the bowl over a saucepan of simmering water (do not let the bowl touch the water); whisk until the sugar is dissolved, 3 minutes. Remove the bowl from the pan and beat with a mixer on medium-high speed until thick, glossy and cool, 3 to 5 minutes.\n            \n\n              Assemble the cake: Unroll the cooled cake and spread with the raspberry jam. Reroll the cake, cover with the frosting and top with the reserved 1/4 cup coconut. Serve with raspberries.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.25}, {"food": "potato flour", "quantity": 0.3333333333333333}, {"food": "coconut water", "quantity": 1.0}, {"food": "soy meal", "quantity": 0.3333333333333333}, {"food": "salt", "quantity": 0.25}, {"food": "grape juice", "quantity": 1.0}, {"food": "eggs", "quantity": 8.0}, {"food": "sugar", "quantity": 1.0}, {"food": "sugar", "quantity": 1}, {"food": "silk raspberry soy yogurt", "quantity": 1.0}, {"food": "raspberries", "quantity": 1}, {"food": "egg substitute", "quantity": 2.0}, {"food": "sugar", "quantity": 0.5}, {"food": "lemon juice", "quantity": 0.25}, {"food": "lemon juice", "quantity": 2.0}, {"food": "hearts of palm", "quantity": 1}], "title": "\nLemon-Coconut Matzo Jelly Roll\n"}, {"directions": "\n\n              Soak 1 1/2 cups basmati rice in cold water, 15 minutes; drain. Heat 1 tablespoon vegetable oil in a saucepan over medium-high heat. Add 2 teaspoons cumin seeds; cook 30 seconds. Add 1 chopped onion and cook, stirring, 5 minutes. Add 2 1/4 cups water, 1 teaspoon kosher salt, the rice and 3 strips lemon zest. Bring to a simmer, cover and cook over low heat, 15 minutes. Let stand off the heat, 10 minutes. Stir in 1/4 cup toasted sliced almonds, and lemon juice to taste.\n            \n\n              Photograph by Anna Williams\n            \n", "ingredients": [], "title": "\nLemon-Cumin Rice\n"}, {"directions": "\n\n              Whisk 3 egg whites, 3 tablespoons sugar and a pinch of salt until frothy. Stir in 3 cups shredded coconut, 1/3 cup currants and 1 teaspoon lemon zest. Drop by packed tablespoonfuls onto an oiled baking sheet. Bake at 325 degrees F until golden, 25 to 30 minutes. Let cool, then dip in melted chocolate.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [], "title": "\nLemon-Currant Macaroons\n"}, {"directions": "\n\n              Divide the shrimp between two 8- or 9-inch pie pans and pat them completely dry with a paper towel. Arrange the shrimp so they lay flat and are evenly spaced in the pans.\n            \n\n              Heat 2 large skillets over medium heat. Season the shrimp with salt and pepper; add a teaspoon of butter to one of the pans and turn the heat to high. When the foam subsides, invert a pan of shrimp over the skillet so they fall into the pan all at once. Repeat with the other shrimp. Cook the shrimp, without moving them, until they turn golden brown on the bottom, about 2 minutes. Add a remaining teaspoon of butter to each pan and turn off the heat. Turn the shrimp over with tongs and cook for 1 minute in the residual heat of the pans. Add half the zest, juice, and dill to each pan, and shake the pan to combine.\n            \n\n              Divide the shrimp among 4 plates or arrange on a platter. Serve hot or at room temperature.\n            \n", "ingredients": [{"food": "pasta with tomato sauce", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 4.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "dill seed", "quantity": 1.0}], "title": "\nLemon-Dill Shrimp\n"}, {"directions": "\n\n              Trim 1 bunch broccoli rabe and cut into 2-inch pieces. Cook in boiling salted water until tender, 2 to 3 minutes; drain. Saute 2 sliced garlic cloves in olive oil in a large skillet until golden. Add the broccoli rabe, 1 teaspoon grated lemon zest, 1¿2 teaspoon kosher salt and a few grinds of pepper; toss. Top with shredded asiago.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [], "title": "\nLemon-Garlic Broccoli Rabe\n"}, {"directions": "\n\n              Preheat the oven to 450 degrees F. Heat the olive oil in a large nonstick ovenproof skillet over medium-high heat. Sprinkle the chicken with 1/2 teaspoon each salt and pepper, and 2 tablespoons flour. Add to the skillet and cook, turning, until slightly golden on all sides, about 5 minutes. Add the garlic, lemon zest and lemon juice and turn the chicken to coat. Transfer the skillet to the oven; roast until the chicken is golden brown and cooked through, about 20 minutes. \n            \n\n              Meanwhile, melt the butter in a medium saucepan over medium-high heat. Add the corn and 1/4 teaspoon each salt and pepper; cook, stirring occasionally, until the corn softens, about 5 minutes. Stir in the remaining 1 tablespoon flour, then add the milk and bring to a boil. Reduce the heat to medium low and simmer, stirring, until thickened, about 5 minutes. Stir in the chives and season with salt and pepper. \n            \n\n              Divide the chicken among plates and drizzle with the pan juices. Serve with the creamed corn. \n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "potato flour", "quantity": 3.0}, {"food": "garlic powder", "quantity": 12.0}, {"food": "hearts of palm", "quantity": 2.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "corn bran", "quantity": 1.0}, {"food": "whole milk", "quantity": 0.75}, {"food": "chives", "quantity": 2.0}], "title": "\nLemon-Garlic Chicken With Creamed Corn\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Bring 3 cups water to a boil in a medium saucepan over high heat, covered. Uncover and slowly whisk in the grits, 1 teaspoon salt and 1/2 teaspoon black pepper. Reduce the heat to medium low and cook, stirring occasionally, until thickened, about 5 minutes. Stir in the parmesan and 1 tablespoon butter. Remove from the heat and season with salt and black pepper. Cover to keep warm.\n            \n\n              Meanwhile, season the shrimp with salt and black pepper. Melt the remaining 2 tablespoons butter in a large skillet over medium-high heat. Add the shrimp, garlic and cayenne, if using, and cook, tossing, until the shrimp are pink, 3 to 4 minutes. Remove from the heat and add 2 tablespoons water, the lemon juice and parsley; stir to coat the shrimp with the sauce and season with salt and black pepper.\n            \n\n              Divide the grits among shallow bowls and top with the shrimp and sauce. Serve with lemon wedges.\n            \n", "ingredients": [{"food": "", "quantity": 0.75}, {"food": "black bean mango", "quantity": 1}, {"food": "parmesan cheese", "quantity": 0.25}, {"food": "butter oil", "quantity": 3.0}, {"food": "shrimp", "quantity": 1.25}, {"food": "garlic powder", "quantity": 2.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "", "quantity": 0.5}, {"food": "parsley", "quantity": 2.0}], "title": "\nLemon-Garlic Shrimp and Grits\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Bring 3 cups of water to a boil in a medium saucepan over high heat, covered. Uncover and slowly whisk in the grits, 1 teaspoon salt and 1/2 teaspoon pepper. Reduce the heat to medium low and cook, stirring occasionally, until thickened, about 5 minutes. Stir in the parmesan and 1 tablespoon butter. Remove from the heat and season with salt and pepper. Cover to keep warm.\n            \n\n              Meanwhile, season the shrimp with salt and pepper. Melt the remaining 2 tablespoons butter in a large skillet over medium-high heat. Add the shrimp, garlic and cayenne, if using, and cook, tossing, until the shrimp are pink, 3 to 4 minutes. Remove from the heat and add 2 tablespoons water, the lemon juice and parsley; stir to coat the shrimp with the sauce and season with salt and pepper.\n            \n\n              Divide the grits among shallow bowls and top with the shrimp and sauce. Serve with lemon wedges.\n            \n", "ingredients": [{"food": "", "quantity": 0.75}, {"food": "black bean mango", "quantity": 1}, {"food": "parmesan cheese", "quantity": 0.25}, {"food": "butter oil", "quantity": 3.0}, {"food": "shrimp", "quantity": 1.25}, {"food": "garlic powder", "quantity": 2.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "", "quantity": 0.5}, {"food": "parsley", "quantity": 2.0}], "title": "\nLemon-Garlic Shrimp and Grits\n"}, {"directions": "\n\n              Sprinkle the chicken on both sides with salt and pepper. Melt the butter in a large skillet over medium-high heat. Add the chicken skin-side down and cook until golden brown and crispy and the skin releases easily from the skillet, 6 to 7 minutes.\n            \n\n              Reduce the heat to medium and flip the chicken over. Scatter the potatoes, then lemon and then the garlic around the chicken. Add 1 cup water, red pepper flakes and 1/2 teaspoon salt. Cover and cook until the potatoes can be pierced easily with a fork, 8 to 10 minutes. Remove the lid and continue to cook until the liquid has evaporated, an instant read thermometer inserted into the thickest part of the chicken reaches 165 degrees F and the potatoes start to crisp from the remaining fat in the pan, 8 to 10 minutes. Sprinkle with parsley. \n            \n\n              Divide the arugula among 4 plates and top with the chicken and potatoes. . Spoon any juices left in the skillet over each dish.  \n            \n", "ingredients": [{"food": "diced chicken", "quantity": 4.0}, {"food": "black bean mango", "quantity": 1}, {"food": "butter oil", "quantity": 2.0}, {"food": "sweet potatoes", "quantity": 0.75}, {"food": "luncheon slices", "quantity": 1.25}, {"food": "garlic powder", "quantity": 4.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "parsley", "quantity": 2.0}, {"food": "arugula", "quantity": 4.0}], "title": "\nLemon-Garlic Skillet Chicken and Potatoes\n"}, {"directions": "\n\n              Pat the tilapia dry with paper towels, then season with 1/2 teaspoon salt and a few grinds of pepper. Spread the flour on a plate; dredge the tilapia in the flour, tapping off the excess. Heat 2 tablespoons olive oil in a large nonstick skillet over medium-high heat. Add the tilapia and cook until golden brown, about 3 minutes per side. Transfer to a plate; tent with foil to keep warm. Wipe out the skillet.\n            \n\n              Heat 3 tablespoons olive oil in the skillet over medium heat. Add the garlic and cook, stirring, until it starts browning, about 2 minutes. Add the chicken broth, wine, and lemon zest and juice. Increase the heat to high, bring to a boil and cook until the liquid is reduced by half, about 5 minutes; season with salt and pepper. Add the butter and whisk until slightly thickened, about 1 minute; stir in the parsley.\n            \n\n              Meanwhile, toss the spinach with the remaining 1 tablespoon olive oil and a few grinds of pepper. Divide among plates, top with the fish and drizzle with some pan sauce. Serve with lemon wedges.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [{"food": "vegetarian fillets", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "potato flour", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 6.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "diced chicken", "quantity": 0.75}, {"food": "martha white foods", "quantity": 0.5}, {"food": "grape juice", "quantity": 1.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "parsley", "quantity": 0.25}, {"food": "mustard spinach", "quantity": 1.0}], "title": "\nLemon-Garlic Tilapia with Spinach\n"}, {"directions": "\n\n              Whisk the flour, baking powder, baking soda and salt in a medium bowl. Beat the butter, granulated sugar and brown sugar in a large bowl with a mixer on medium-high speed until light and fluffy, about 3 minutes. Beat in the egg and vanilla until combined. Reduce the mixer speed to low and beat in the flour mixture until just incorporated.\n            \n\n              Transfer half of the dough to a separate bowl and stir in the lemon zest and juice. Beat the molasses, ginger, cinnamon and allspice into the remaining dough. Lay out a large sheet of plastic wrap. Drop alternating spoonfuls of the two doughs onto the plastic to form an 11-by-8-inch rectangle. Use the plastic to roll the dough into a 2-by-11-inch log, twisting the ends closed. Refrigerate until firm, at least 2 hours or overnight.\n            \n\n              Position racks in the upper and lower thirds of the oven; preheat to 350 degrees F. Line 2 baking sheets with parchment paper. Slice the dough into 1/2-inch-thick rounds and arrange about 2 inches apart on the prepared baking sheets; sprinkle with sanding sugar. Bake, switching the pans halfway through, until the edges of the cookies are set, 14 to 18 minutes. Let cool 2 minutes on the baking sheets, then transfer to racks to cool completely.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.5}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 2.0}, {"food": "sugar", "quantity": 1.0}, {"food": "sugar", "quantity": 0.25}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "molasses", "quantity": 0.25}, {"food": "ginger", "quantity": 1.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "allspice", "quantity": 0.25}, {"food": "sugar", "quantity": 1}], "title": "\nLemon-Ginger Marble Cookies\n"}, {"directions": "\n\n              Finely grate the ginger into a fine-mesh sieve set over a bowl. Press with the back of a spoon to squeeze out the juice (you'll need 1 tablespoon juice); set aside. Whisk the flour, cornstarch and salt in a medium bowl.\n            \n\n              Beat the butter and 1/2 cup confectioners' sugar in a large bowl with a mixer on medium-high speed until light and fluffy, 3 to 5 minutes. Beat in the lemon zest, 2 tablespoons lemon juice, the vanilla and ginger juice. Reduce the mixer speed to low; add the flour mixture and beat until just incorporated.\n            \n\n              Divide the dough between 2 sheets of plastic wrap; form into two 1-by-9-inch logs. Wrap and freeze until firm, about 1 hour.\n            \n\n              Position racks in the upper and lower thirds of the oven and preheat to 350 degrees F. Line 2 baking sheets with parchment. Unwrap the logs and slice into 1/4-inch-thick rounds; arrange 1 inch apart on the prepared baking sheets. Bake, switching the pans halfway through, until the edges are golden, about 13 minutes. Let cool5 minutes on the baking sheets, then transfer to racks to cool completely.\n            \n\n              Make the icing: Put the remaining 1/3 cup confectioners' sugar in a bowl; stir in 2 to 3 teaspoons lemon juice, a little at a time, until the icing is spreadable. Spread on the cookies and top with crystallized ginger; let set 30 minutes.\n            \n\n              Photograph by Andrew Purcell\n            \n", "ingredients": [{"food": "ginger", "quantity": 1.0}, {"food": "potato flour", "quantity": 1.5}, {"food": "cornstarch", "quantity": 3.0}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 1.5}, {"food": "sugar", "quantity": 0.8333333333333333}, {"food": "lemon juice", "quantity": 2.0}, {"food": "lemon juice", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "ginger", "quantity": 1}], "title": "\nLemon-Ginger Wafers\n"}, {"directions": "\n\n              Juice the lemons, then the ginger, following your juicer's specific settings for each. Stir in the cayenne, agave syrup and coconut water. Add the chia seeds if using and let soak for 5 minutes. Serve the juice immediately over ice, if desired.\n            \n", "ingredients": [{"food": "lemons", "quantity": 6.0}, {"food": "ginger", "quantity": 2.0}, {"food": "pepper", "quantity": 0.375}, {"food": "syrup", "quantity": 1.0}, {"food": "coconut water", "quantity": 0.5}, {"food": "chia seeds", "quantity": 1.0}], "title": "\nLemon-Ginger Zapper\n"}, {"directions": "\n\n              Remove 2 wide strips zest from 1 lemon with a vegetable peeler. Combine 1 strip zest with the vegetable oil in a small saucepan over medium heat and cook until the edges of the zest turn slightly golden, about 5 minutes. Let the lemon oil cool.\n            \n\n              Meanwhile, cook the rice as the label directs, adding the remaining strip lemon zest to the water. Transfer the rice to a large bowl, discarding the zest, and fluff with a fork. Let cool to room temperature. \n            \n\n              Meanwhile, make the dressing: Juice both lemons into a medium bowl. Add the vinegar, brown sugar, 1 1/4 teaspoons salt and 1/2 teaspoon pepper and whisk until the sugar dissolves. Discard the zest from the lemon oil, then whisk the oil into the dressing. Add the onion slices and let marinate 15 minutes. \n            \n\n              Add the carrot, cucumber, peanuts, cilantro, mint, basil and watercress to the bowl with the rice. Add the dressing mixture and gently toss. Per Serving: Calories: 378; Total Fat: 15.5 grams; Saturated Fat: 1 gram; Protein: grams; Total carbohydrates: 55 grams; Sugar: 4 grams; Fiber: 1.5 grams; Cholesterol: 0 milligrams; Sodium: 159 milligrams \n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "lemons", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "onion powder", "quantity": 0.5}, {"food": "carrot juice", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "crisped rice bar", "quantity": 2.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "sugar", "quantity": 2.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "peanuts", "quantity": 0.5}, {"food": "", "quantity": 0.5}, {"food": "", "quantity": 0.5}, {"food": "basil", "quantity": 0.5}, {"food": "chrysanthemum leaves", "quantity": 1.0}], "title": "\nLemon-Herb Rice Salad\n"}, {"directions": "\n\n              Bring the chicken broth to a boil in a medium saucepan; keep warm over low heat.\n            \n\n              Heat 1 tablespoon olive oil and 1 tablespoon butter in a medium saucepan over medium heat. Add the leek, season with salt and cook, stirring occasionally, until softened, about 5 minutes. Add the rice, season with salt and cook, stirring occasionally, until the rice is coated, about 1 minute. Add the wine and cook, stirring constantly, until completely absorbed, about 1 minute.\n            \n\n              Ladle about 1/2 cup hot chicken broth into the risotto and cook, stirring, until absorbed. Continue to add the broth in about 1/2-cup increments, stirring until absorbed before adding more, until the rice is tender and creamy, about 18 minutes. (If you¿ve used up all the broth and the rice is not yet tender, stir in a little hot water.)\n            \n\n              During the last 5 minutes of cooking the risotto, heat a medium nonstick skillet over high heat and add the remaining 1 tablespoon olive oil. Season the scallops with salt and pepper and add to the skillet. Cook, undisturbed, until browned and crisp, 2 to 3 minutes. Flip the scallops and continue to cook until just cooked through, about 1 more minute. Remove to a plate.\n            \n\n              Stir the remaining 2 tablespoons butter, the parmesan, lemon juice and all but a pinch of the lemon zest into the risotto until creamy. (Add a splash of water to loosen, if necessary.) Season with salt and stir in the parsley and chives. Divide between bowls and top with the scallops; sprinkle with the remaining lemon zest.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "butter oil", "quantity": 3.0}, {"food": "silk light vanilla", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "crisped rice bar", "quantity": 0.75}, {"food": "martha white foods", "quantity": 0.3333333333333333}, {"food": "sea lion", "quantity": 8.0}, {"food": "pepper", "quantity": 1}, {"food": "parmesan cheese", "quantity": 0.3333333333333333}, {"food": "grape juice", "quantity": 1.0}, {"food": "parsley", "quantity": 0.25}, {"food": "chives", "quantity": 2.0}], "title": "\nLemon-Herb Risotto with Scallops\n"}, {"directions": "\n\n              Pat the chickens very dry with paper towels. Season inside the cavities with salt and pepper. Combine the butter, lemon zest, parsley, chervil, chives, tarragon, 2 teaspoons salt and a few grinds of pepper in a mini food processor; pulse until almost smooth. Gently loosen the skin on the chicken breasts and thighs with your fingers. Rub half of the herb butter evenly under the skin of both chickens, then rub the remaining herb butter all over the chickens. Refrigerate, uncovered, at least 30 minutes to dry out the skin.\n            \n\n              About 30 minutes before roasting, bring the chickens to room temperature. Preheat the oven to 450 degrees F. Stuff the lemon quarters into the chicken cavities. Tie the legs together with kitchen twine and tuck the wings under the body. Arrange the chickens breast-side up on a rack set on a rimmed baking sheet or in a shallow roasting pan, leaving a bit of space between them; scatter the lemon wedges on the rack around the chickens.\n            \n\n              Roast until the breasts and tops of the legs are golden, about 30 minutes. Rotate the pan and reduce the oven temperature to 350 degrees F. Continue roasting until the skin is golden and crisp all over and a thermometer inserted into the thickest part of the thigh registers 165 degrees F, 40 to 50 more minutes.\n            \n\n              Remove the chickens from the oven; let rest 15 minutes in the pan. Remove the twine and carve the chickens (see below); serve with the roasted lemon wedges.\n            \n", "ingredients": [{"food": "", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 6.0}, {"food": "", "quantity": 4.0}, {"food": "parsley", "quantity": 0.5}, {"food": "chervil", "quantity": 0.5}, {"food": "chives", "quantity": 0.5}, {"food": "", "quantity": 0.25}], "title": "\nLemon-Herb Roast Chicken\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 425 degrees F. Whisk the olive oil, minced garlic, lemon zest and juice, anchovies, basil, parsley, paprika and 1 teaspoon salt in a large bowl. Add the shrimp, tomatoes, scallions and jalapeno; toss.\n            \n\n              Tear off eight 16-inch sheets of parchment paper. Make the packets (see photo gallery), using a double layer of parchment for each packet: Arrange about one-quarter of the shrimp mixture on a double layer, using a slotted spoon. Top with 2 tablespoons clam juice, 1/2 tablespoon butter and one-quarter of the liquid from the bowl. Seal as directed. Repeat to make 3 more packets; divide between 2 baking sheets.\n            \n\n              Transfer to the oven and bake until the parchment puffs and the shrimp are just cooked through, about 20 minutes. Let rest 5 minutes before opening.\n            \n\n              Meanwhile, toast the baguette slices in a grill pan until marked; rub with the remaining garlic clove. Carefully open the packets and serve with the grilled bread. Photograph by David Malosh\n            \n\n              Be careful when opening parchment packets - the steam is hot!\n            \n\n              Photograph by David Malosh\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "cloves", "quantity": 2.0}, {"food": "grape juice", "quantity": 1.0}, {"food": "", "quantity": 2.0}, {"food": "basil", "quantity": 3.0}, {"food": "parsley", "quantity": 2.0}, {"food": "paprika", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "shrimp", "quantity": 2.0}, {"food": "grape juice", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "grape juice", "quantity": 0.5}, {"food": "butter oil", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}], "title": "\nLemon-Herb Shrimp Packets\n"}, {"directions": "\n\n              Place 2 thinly sliced lemons in a pitcher. For still infused water, add 2 quarts of water. For sparkling water, add 1 quart of seltzer during prep and a second quart just before serving. Refrigerate 2 to 4 hours to allow the lemons to infuse. Stir well and strain, discarding the lemons. For serving, add fresh lemon slices for garnish and plenty of ice. The infused water will keep refrigerated for up to 2 days.\n            \n", "ingredients": [], "title": "\nLemon-Infused Water\n"}, {"directions": "\n\n              Grate the zest of 2 large lemons; thinly slice the fruit into rounds. Discard seeds. Toss the zest and slices with 3/4 teaspoon dried lavender, 1/4 teaspoon salt and 2 cups sugar. Cover for 24 hours. The next day, beat 4 eggs and 4 tablespoons melted butter; stir into the filling. Pour into pie shell.\n            \n\n              Perfect All-Butter Piecrust\n            \n\n              Pulse 3 1/2 cups flour, 1/4 cup sugar and 1 teaspoon salt in a food processor. Add 1 diced stick cold butter; process until combined. Add 2 more diced sticks cold butter; pulse three times, or until the mixture resembles coarse meal. Add 1 tablespoon white or cider vinegar. Gradually pour in 1/3 cup ice water, pulsing about four times until combined. Turn out onto a clean surface and press into a cohesive dough without overworking (you should see bits of butter). Wrap in plastic wrap and press into a 1-inch-thick disk; refrigerate at least 1 hour before rolling out.\n            \n\n              How to Make a Pie\n            \n\n              Divide the chilled dough in half; roll 1 piece into a 12-inch, 1/8-inch-thick circle on a lightly floured surface (refrigerate the other piece).\n            \n\n              Roll the dough onto a rolling pin, then unroll it into a 9-inch glass pie plate, letting it hang over the edge; add filling.\n            \n\n              Roll out the other piece of dough and place over the filling; press the crust edges together and trim, leaving a 1-inch overhang. Roll up or pinch the overhang to seal.\n            \n\n              Place a foil-lined baking sheet on a rack in the lower third of the oven; preheat to 450 degrees. Wrap an oiled, wide band of foil around the pie edge to protect the crust. Make slashes in the top of the crust; chill for 30 minutes.\n            \n\n              Reduce the oven to 400 degrees. Bake the pie for 30 minutes. Remove the foil band, brush the crust with heavy cream and sprinkle with sugar. Bake until golden brown, about 30 minutes; cool before slicing.\n            \n\n              Photograph by Karl Juengel\n            \n", "ingredients": [], "title": "\nLemon-Lavender Pie\n"}, {"directions": "\n\n              Slice 4 pounds butternut or calabaza squash into thick wedges and remove the seeds. Place cut-side up in a baking dish. Combine 1/3 cup maple syrup, 1/3 cup water, the zest and juice of 1 lemon, 1/2 teaspoon red pepper flakes, and a pinch each of salt and pepper; pour over the squash and dot with 4 tablespoons butter. Bake 20 minutes at 350, then flip the squash and bake until caramelized and tender, 25 more minutes, basting halfway through. \n            \n\n              Photograph by Marcus Nilsson. \n            \n\n              Calories: 161; Total Fat: 6 grams; Saturated Fat: 4 grams; Protein: 2 grams; Total carbohydrates: 29 grams; Sugar: 11 grams; Fiber: 3.5 grams; Cholesterol: 15 milligrams; Sodium: 46 milligrams\n            \n", "ingredients": [], "title": "\nLemon-Maple Squash\n"}, {"directions": "\n\n              Preheat the oven to 450 degrees F. Put the potatoes in a saucepan and cover with cold water; season with salt. Bring to a boil, then reduce the heat to medium and simmer until tender, 15 minutes. Reserve 1/4 cup cooking water, then drain the potatoes; return to the pot. Add the sour cream, butter and reserved cooking water and mash with a masher or fork. Stir in the chives and season with salt and pepper. Cover to keep warm.\n            \n\n              Meanwhile, place the chicken skin-side up on a rimmed baking sheet; season with salt and pepper. Bake 20 minutes; remove from the oven.\n            \n\n              Mix the mustard, lemon juice, garlic, 2 teaspoons olive oil and the thyme; brush on the chicken and push to the sides of the pan. Toss the broccolini with the remaining 1 teaspoon olive oil in the middle of the pan; season with salt and pepper. Bake until the chicken is cooked through and the broccolini is tender, 10 minutes. Serve with the potatoes.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "sour cream", "quantity": 0.5}, {"food": "butter oil", "quantity": 3.0}, {"food": "chives", "quantity": 2.0}, {"food": "pepper", "quantity": 1}, {"food": "diced chicken", "quantity": 8.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "thyme", "quantity": 1.0}, {"food": "", "quantity": 1.0}], "title": "\nLemon-Mustard Chicken with Chive Mashed Potatoes\n"}, {"directions": "\n\n              Preheat the oven to 450 degrees F. Put the potatoes in a large pot and cover with cold water by 1 inch; season with salt. Bring to a boil and cook over medium-high heat until just tender, about 7 minutes; drain.\n            \n\n              Meanwhile, pulse the bread in a food processor to make coarse crumbs; combine with the olive oil, garlic, lemon zest, 1 teaspoon salt and a few grinds of pepper in a large bowl. Add the potatoes and toss.\n            \n\n              Arrange the potatoes cut-side down on a baking sheet. Roast until golden and tender, about 10 minutes. Sprinkle with the parsley and parmesan; continue roasting until golden brown, about 5 more minutes. Transfer to a serving dish, season with salt and serve with lemon wedges.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 1.5}, {"food": "sweet potatoes", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "garlic bread", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "garlic powder", "quantity": 2.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "pepper", "quantity": 1}, {"food": "parsley", "quantity": 0.25}, {"food": "parmesan cheese", "quantity": 0.5}], "title": "\nLemon-Parmesan Roasted Potatoes\n"}, {"directions": "\n\n              Boil 2 bunches asparagus 4 to 5 minutes; drain. Mix 1/2 cup chopped parsley, 1 tablespoon each lemon zest and juice, 1 minced garlic clove, 2 tablespoons olive oil, and salt and pepper in a bowl. Drizzle the asparagus with olive oil and top with the parsley mixture.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nLemon-Parsley Asparagus\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Remove the peel from the lemon in strips with a vegetable peeler (take care not to peel too deeply; leave the pith on the lemon). Put the peel in a container with the sugar, and shake to disperse. Let it sit for at least a full day before using.\n            \n", "ingredients": [{"food": "lemon juice", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}], "title": "\nLemon-Peel Sugar\n"}, {"directions": "\n\n              Bring a large pot of water to a boil. Drop the pasta into the water and cook according to package directions, drain, reserving some of the pasta water. Toss the pasta with a splash of oil and set aside.\n            \n\n              Meanwhile, remove the kernels from the corn with a sharp knife. Hold the shaved cobs over a bowl and scrape with the back of the knife to extract the milk, set aside. Discard the cobs.\n            \n\n              Melt the butter in a large skillet, add the corn kernels, garlic, peppers and turmeric. Cook, stirring, until the vegetables are tender, about 6 minutes. Add the corn milk, 2-percent milk, 3 tablespoons of the Parmesan, 3/4 teaspoon salt and 1/2 teaspoon pepper. Bring to a gentle simmer, cook until slightly thickened (like the consistency of heavy cream), about 5 minutes.\n            \n\n              Add the cooked pasta, lemon zest and 1/4 teaspoon salt. Gently toss the pasta in the sauce (thin out with reserved pasta water if desired). Divide among four bowls. Sprinkle each with the remaining 1 tablespoon Parmesan and some black pepper. Serve with lemon wedges.\n            \n", "ingredients": [{"food": "italian veg medley pasta", "quantity": 8.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "corn bran", "quantity": 2.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "turmeric", "quantity": 1}, {"food": "milk", "quantity": 1.5}, {"food": "", "quantity": 0.25}, {"food": "black bean mango", "quantity": 1}, {"food": "lemon juice", "quantity": 1.0}], "title": "\nLemon-Pepper Corn Pasta\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the fettuccine and cook as the label directs. Drain, reserving about 1/2 cup cooking water.\n            \n\n              Meanwhile, melt the butter in a skillet over medium heat. Add the shallot and a pinch of salt and cook, stirring occasionally, until lightly golden, about 3 minutes. Whisk the cream, egg yolk and lemon zest in a bowl. Reduce the heat to low and add the cream mixture and cheese to the skillet. Cook, whisking, until slightly thickened, about 2 minutes. Season with salt and 2 to 3 teaspoons pepper.\n            \n\n              Add the pasta to the skillet and toss, adding enough of the reserved cooking water to loosen the sauce. Divide among bowls and garnish with more pecorino. Serve with crusty bread, if desired.\n            \n\n              Photograph by Antinos Achilleos\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "", "quantity": 12.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1.25}, {"food": "egg substitute", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 0.3333333333333333}, {"food": "pepper", "quantity": 1}, {"food": "garlic bread", "quantity": 1}], "title": "\nLemon-Pepper Fettuccine\n"}, {"directions": "\n\n              Heat the butter in a large skillet over medium-high heat. Add the mushrooms in an even layer and sprinkle with the lemon zest. Cook, undisturbed, until browned, about 2 minutes. Toss with 1/4 teaspoon salt and 3/4 teaspoon pepper and continue to cook until the mushrooms are tender but not mushy, 4 to 5 minutes. Add additional salt and pepper to taste. Transfer to a serving dish and sprinkle with the chives. Serve warm.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 20.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "barley flour or meal", "quantity": 1.5}], "title": "\nLemon-Pepper Mushrooms\n"}, {"directions": "\n\n              Preheat the broiler. Toss the asparagus with 2 tablespoons olive oil, 1/2 teaspoon salt and a few grinds of pepper on a baking sheet; spread in a single layer. Broil, stirring occasionally, until tender, 4 to 6 minutes. Let cool slightly.\n            \n\n              Bring a saucepan of water to a boil. Add the egg and reduce the heat; simmer 5 minutes. Drain and transfer to a bowl of ice water.\n            \n\n              Peel the egg and transfer to a blender. Add the garlic, lemon juice, parmesan and mustard and puree until smooth. With the machine running, drizzle in the remaining 8 tablespoons olive oil and blend until thick and creamy. Stir in the crushed peppercorns. Spoon the lemon-pepper sauce over the asparagus and top with more parmesan.\n            \n\n              Photograph by Ryan Liebe\n            \n", "ingredients": [{"food": "asparagus", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 10.0}, {"food": "salt", "quantity": 1}, {"food": "egg substitute", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "parmesan cheese", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "black bean mango", "quantity": 0.5}], "title": "\nLemon-Pepper Parmesan Asparagus\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Pulse the butter, lemon zest and juice, garlic, thyme, paprika, 2 teaspoons salt and 1 tablespoon pepper in a food processor until smooth.\n            \n\n              Put the chickens on a rimmed baking sheet. Loosen the skin on the breasts and legs with your fingers. Rub about three-quarters of the lemon-pepper butter under the skin, then rub the rest all over the chickens. Refrigerate, uncovered, 2 hours or up to 8 hours before roasting.\n            \n\n              Tie the chicken legs together with twine and tuck the wings under the body; place breast-side up on a rack in a large roasting pan. Pour the wine into the pan and transfer to the oven; roast until the chickens are golden and crisp and a thermometer inserted into the thickest part of the thigh registers 170 degrees F, about 1 hour, 50 minutes. (Tent with foil if the skin browns too quickly.)\n            \n\n              Let the chickens rest 10 minutes before portioning (see below). Season with salt.\n            \n\n              Grab one of the legs with tongs and pull it away from the body; cut through the skin with kitchen shears.\n            \n\n              Pull the leg out and back to pop the joint; remove the leg with the shears. Repeat on the other side.\n            \n\n              Separate the drumsticks from the thighs with the shears.\n            \n\n              Cut off the wings as close to the body as possible.\n            \n\n              Insert the shears into the tail end of the chicken and cut along the breastbone.\n            \n\n              Pull back one of the breasts and cut it off the backbone. Repeat on the other side.\n            \n\n              Photograph by David Malosh\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.0}, {"food": "grape juice", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "thyme", "quantity": 2.0}, {"food": "paprika", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 2.0}, {"food": "martha white foods", "quantity": 1.0}], "title": "\nLemon-Pepper Roast Chicken\n"}, {"directions": "\n\n              Pulse the peppercorns in a spice grinder until coarsely ground. Add the salt and sugar and pulse a few more times. Transfer to a bowl and stir in the olive oil, lemon zest, and garlic. Microwave until hot but not boiling, about 45 seconds. Let cool.\n            \n", "ingredients": [{"food": "martha white foods", "quantity": 1.0}, {"food": "sea lion", "quantity": 1.5}, {"food": "sugar", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "lemons", "quantity": 0.25}, {"food": "garlic powder", "quantity": 2.0}], "title": "\nLemon-Pepper Slather\n"}, {"directions": "\n\n              Let the turkey sit at room temperature, 30 minutes. Position an oven rack in the lowest position (remove the other racks); preheat to 350 degrees F.\n            \n\n              Remove the neck and giblets from the turkey; set aside for the gravy. Finely grate the zest from all 4 lemons; combine with the peppercorns and 1 tablespoon salt. Pat the turkey very dry with paper towels. Season the inside with about one-quarter of the lemon-pepper mixture, then rub the rest all over the skin. Cut one of the lemons into quarters; stuff inside the cavity along with the onion, celery and thyme sprigs. Tie the legs together with kitchen twine. Put the turkey on a rack set in a large roasting pan and tuck the wings under the body.\n            \n\n              Cook the bacon in a large skillet over medium heat until crisp, 7 to 8 minutes. Transfer to paper towels to drain, reserving the drippings in the skillet. Chop the bacon; set aside for the gravy. Add the butter to the skillet with the drippings and stir until melted, then pour into a bowl and stir in the juice of 2 lemons. Let the lemon butter cool slightly, then brush all over the turkey. Transfer to the oven and roast 1 hour. Meanwhile, make the Classic Gravy.\n            \n\n              After the turkey has roasted 1 hour, baste it with the drippings. Continue roasting, basting every 30 minutes, until the skin is golden brown and a thermometer inserted into the thigh registers 165 degrees F, about 2 more hours.\n            \n\n              Transfer the turkey to a cutting board and let rest 30 minutes before carving; reserve the drippings for the gravy. Stir the bacon into the finished gravy.\n            \n\nClassic Gravy\n\n\n              Prepare the stock: Melt 2 tablespoons butter in a large saucepan over medium heat. Add the turkey neck and giblets; cook, turning, until browned, about 5 minutes. Add the onion, carrot, celery, thyme and bay leaves; stir to coat. Add the wine and bring to a boil, scraping up any browned bits from the bottom of the pan. Cook until reduced by half, 2 to 3 minutes. Add the broth, reduce the heat to low and simmer about 1 hour. Strain through a fine-mesh sieve into a large measuring cup; reserve the saucepan. You should have 7 cups stock-if you're short, add more broth.\n            \n\n              Melt the remaining 8 tablespoons butter in the reserved saucepan over medium heat. Add the flour and whisk until smooth and bubbling, about 2 minutes. Gradually whisk in the 7 cups stock; bring to a simmer and cook, whisking occasionally, until thickened, about 10 minutes. Set aside until the turkey is done.\n            \n\n              Pour the turkey pan drippings into a fat separator and let stand until the fat rises to the top. Discard the fat (or drizzle on your stuffing). Whisk the defatted drippings into the gravy; season with salt and pepper. Reheat before serving.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "smoked turkey roll", "quantity": 1.0}, {"food": "lemons", "quantity": 4.0}, {"food": "black bean mango", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "onion powder", "quantity": 1.0}, {"food": "pineapple chunks", "quantity": 2.0}, {"food": "thyme", "quantity": 3.0}, {"food": "bacon", "quantity": 9.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "", "quantity": 1}, {"food": "butter oil", "quantity": 10.0}, {"food": "liver sausage", "quantity": 1}, {"food": "onion powder", "quantity": 1.0}, {"food": "carrot juice", "quantity": 1.0}, {"food": "celery seed", "quantity": 1.0}, {"food": "thyme", "quantity": 3.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "martha white foods", "quantity": 0.5}, {"food": "diced chicken", "quantity": 8.0}, {"food": "potato flour", "quantity": 0.75}, {"food": "meat drippings ", "quantity": 1}, {"food": "salt", "quantity": 1}], "title": "\nLemon-Pepper Turkey with Bacon Gravy\n"}, {"directions": "\n\n              Position racks in the upper and lower thirds of the oven and preheat to 325 degrees F. Line 2 baking sheets with parchment paper. Pulse the pistachios in a food processor until finely ground but not powdery. Whisk the egg whites with the sugar, lemon zest, vanilla and salt in a large bowl until frothy. Stir in the ground pistachios, then stir in the coconut until completely combined.\n            \n\n              Scoop heaping tablespoons of the coconut mixture onto the prepared pans. Bake, switching the pans halfway through, until the macaroons are golden, 25 to 30 minutes. Let cool 10 minutes on the pans, then transfer to a rack to cool completely.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "", "quantity": 0.3333333333333333}, {"food": "egg substitute", "quantity": 3.0}, {"food": "sugar", "quantity": 0.5}, {"food": "lemon juice", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.75}, {"food": "salt", "quantity": 0.125}, {"food": "coconut water", "quantity": 1.0}], "title": "\nLemon-Pistachio Macaroons\n"}, {"directions": "\n\n              Position racks in the upper and lower thirds of the oven; preheat to 350 degrees F. Line 2 baking sheets with parchment paper. Whisk the flour, poppy seeds, baking soda and salt in a medium bowl. Beat the butter and granulated sugar in a large bowl with a mixer on medium-high speed until light and fluffy, about 4 minutes. Add the egg, vanilla and 1 tablespoon lemon zest and beat until combined. Reduce the mixer speed to low; beat in the flour mixture, then increase the speed to medium high and beat until just combined.\n            \n\n              Roll tablespoonfuls of dough into balls and arrange 2 inches apart on the prepared baking sheets. Bake, switching the pans halfway through, until the cookies are light golden and just set, 15 to 20 minutes. Let cool 5 minutes on the baking sheets, then transfer to racks to cool completely.\n            \n\n              Make the glaze: Whisk the confectioners' sugar, the remaining 1 teaspoon lemon zest and enough lemon juice to make a spreadable glaze. Spread on the cookies; sprinkle with nonpareils and let set, about 20 minutes.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.0}, {"food": "seeds", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 10.0}, {"food": "sugar", "quantity": 0.75}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "sugar", "quantity": 1.5}, {"food": "", "quantity": 1}], "title": "\nLemon-Poppy Seed Cookies\n"}, {"directions": "\n\n              Cut a 24-by-6-inch strip of parchment paper. Butter the side of an 8-inch springform pan, then line the side with the parchment; the paper will extend above the rim of the pan so you can build a tall cake.\n            \n\n              Mix the crushed cookies, sugar and melted butter in a bowl until combined. Press the mixture into the bottom and about 1/4 inch up the side of the prepared pan. Freeze until firm, about 15 minutes.\n            \n\n              Scoop the lemon sorbet over the crust in small batches, packing it in with an offset spatula; smooth the top. Freeze until firm, about 45 minutes. Repeat with the raspberry sorbet and freeze until firm, about 45 more minutes.\n            \n\n              Place the chocolate in a heatproof bowl. Heat the cream in a small saucepan or in the microwave until barely simmering; pour the hot cream over the chocolate and let stand 1 minute, then stir until smooth. Remove the side of the springform pan and the parchment. Spread the chocolate mixture over the top of the cake and freeze until set, about 10 minutes. Serve immediately or cover and freeze for up to 2 days.\n            \n\n              Photograph by Kana Okada\n            \n", "ingredients": [{"food": "butter oil", "quantity": 3.0}, {"food": "chocolate chip cookies", "quantity": 0.75}, {"food": "sugar", "quantity": 1.0}, {"food": "lemon juice", "quantity": 3.0}, {"food": "silk raspberry soy yogurt", "quantity": 3.0}, {"food": "baking chocolate", "quantity": 6.0}, {"food": "ice cream swich", "quantity": 0.3333333333333333}], "title": "\nLemon-Raspberry Sorbet Cake\n"}, {"directions": "\n\n              Cut 1 pounds peeled Yukon Gold potatoes into 1-inch chunks; toss with 3 tablespoons olive oil, 3 chopped garlic cloves, 1 teaspoon kosher salt and 1/2 teaspoon each pepper and dried oregano in a 9-by-13-inch baking dish. Add 1/4 cup each lemon juice and chicken broth. Roast at 425 degrees F until the potatoes are tender, about 30 minutes. Toss with chopped parsley.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [], "title": "\nLemon-Roasted Potatoes\n"}, {"directions": "\n\n              Pile the rosemary on a cutting board and sprinkle with 1 tablespoon sugar; finely chop, then transfer to a medium bowl. Add the coconut, the remaining 1/3 cup sugar, the lemon zest, vanilla and salt. Use your fingers to rub and toss the mixture until thoroughly combined. Let sit at room temperature, 1 hour.\n            \n\n              Position racks in the upper and lower thirds of the oven and preheat to 325 degrees F. Line 2 baking sheets with parchment paper.\n            \n\n              Whisk the egg whites in a medium bowl until frothy. Fold into the coconut mixture with a rubber spatula until combined.\n            \n\n              Drop tablespoonfuls of the mixture about 1 inch apart on the prepared baking sheets. With damp fingers, form each mound into a cone shape. Bake, switching the pans halfway through, until the edges are golden and the macaroons are dry, 16 to 20 minutes. Let cool 10 minutes on the baking sheets, then transfer to a rack to cool completely.\n            \n\n              Photograph by Andrew Purcell\n            \n", "ingredients": [{"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "coconut water", "quantity": 3.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "salt", "quantity": 0.25}, {"food": "egg substitute", "quantity": 2.0}], "title": "\nLemon-Rosemary Macaroons\n"}, {"directions": "\n\n              Slice each chicken breast in half horizontally to make 2 thin cutlets. Sprinkle lightly with water, place between two sheets of plastic wrap and pound until 1/4 inch thick. Season with salt and pepper. \n            \n\n              Pour some flour into a shallow dish and season with salt. Lightly beat the eggs with the lemon juice in another shallow dish. \n            \n\n              Heat the olive oil in a large skillet over medium heat. Dredge the cutlets in the flour, shaking off any excess; dip in the lemon-egg mixture, coating both sides. Add the cutlets to the skillet and cook until golden on the bottom, about 2 minutes. Add the sage leaves to the skillet, then turn the cutlets and cook until golden on the other side, about 2 more minutes. Transfer the cutlets and sage to a paper towel-lined plate. \n            \n\n              Pour out any remaining oil from the skillet. Add the wine and chicken broth and cook over medium-high heat until reduced by half, about 5 minutes. Add the butter and swirl until melted. \n            \n\n              Transfer the chicken to a platter. Top with the fried sage and drizzle with the pan sauce. Serve with lemon wedges and grains on the side.\n            \n\nWarm Farro Salad\n\n\n              Toss 2 cups cubed winter squash and 1 pint cherry tomatoes with olive oil and salt on a baking sheet; roast at 425 degrees F until tender, 25 minutes. Meanwhile, combine 1 cup farro or barley in a saucepan with 1/2 teaspoon salt, a pinch of red pepper flakes, a bay leaf and enough water to cover by 1 inch. Bring to a simmer over high heat, then reduce the heat to medium low and cook, uncovered, until al dente, 15 to 20 minutes. Drain the farro (remove the bay leaf) and toss with the squash, tomatoes, 1 tablespoon olive oil and 3 tablespoons each chopped parsley and grated pecorino. Season with salt and pepper.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "potato flour", "quantity": 1}, {"food": "eggs", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "chrysanthemum leaves", "quantity": 4.0}, {"food": "martha white foods", "quantity": 0.5}, {"food": "diced chicken", "quantity": 0.75}, {"food": "butter oil", "quantity": 1.0}, {"food": "barley flour or meal", "quantity": 1}], "title": "\nLemon-Sage Chicken Cutlets\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Whisk the flour, baking powder, baking soda, wheat germ, salt, lemon zest and thyme in a medium bowl. Using a pastry blender or your fingers, work the butter into the flour mixture until it is in pea-size pieces. Gently stir in the buttermilk with a wooden spoon until just moistened. The dough will be loose.\n            \n\n              Turn the dough out onto a lightly floured surface and knead 3 to 5 times, just until it comes together. (Don't overknead or the biscuits will be tough.) Roll out to 1/2 inch thick, then cut out biscuits using a floured 2-inch-round cutter. Arrange on an ungreased baking sheet. Reroll the scraps and cut out more biscuits. Brush the tops with water and sprinkle lightly with salt and thyme.\n            \n\n              Bake the biscuits until golden brown, 12 to 15 minutes. Serve warm.\n            \n\n              Photograph by Yunhee Kim\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "wheat germ", "quantity": 2.0}, {"food": "salt", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "thyme", "quantity": 1.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 1.0}], "title": "\nLemon-Thyme Biscuits\n"}, {"directions": "\n\n              Toss 2 bunches trimmed carrots and 2 sliced lemons on a rimmed baking sheet with olive oil, a few thyme sprigs and 1 teaspoon chopped thyme leaves; season with salt and pepper. Roast at 425 degrees until the carrots are tender and the lemons are browned, 25 to 30 minutes.\n            \n", "ingredients": [], "title": "\nLemon-Thyme Roasted Carrots\n"}, {"directions": "\n\n              Reserve 4 berries for garnish and divide the remaining berries among four 8-ounce mason jars or tempered glasses.\n            \n\n              Put 2 cups of the cream and 1/2 cup of the sugar in a small saucepan. Split the vanilla bean, scrape the seeds into the cream and drop in the bean halves. Bring the mixture to a boil over medium to medium-high heat and boil for 4 minutes, stirring occasionally and taking care that it doesn't boil over (which can happen really easily). Remove from the heat, discard the vanilla bean halves and stir in the lemon juice.\n            \n\n              Divide the cream among the glasses (the berries will float up to the top). Refrigerate until set, at least 3 hours or overnight.\n            \n\n              Before serving, gently whip the remaining 1/2 cup cream with the remaining 1/2 teaspoon sugar, and dollop over the possets. Top each serving with one of the reserved raspberries. (If you serve the possets the next day, you can let them warm for 20 minutes or so at room temperature before serving.)\n            \n", "ingredients": [{"food": "raspberries", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 2.5}, {"food": "sugar", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "lemon juice", "quantity": 0.25}], "title": "\nLemon-Vanilla Bean Posset with Raspberries\n"}, {"directions": "\n\n              Make the cake: Preheat the oven to 375 degrees F. Coat an 11-by-17-inch rimmed baking sheet or jelly roll pan with cooking spray; line the bottom with parchment paper and spray the parchment. Beat the egg whites and lemon juice in a large bowl with a mixer on medium speed until soft peaks form, about 3 minutes. Add 1/2 cup confectioners' sugar. Increase the speed to medium high and beat until stiff peaks form, 3 to 4 minutes.\n            \n\n              Whisk the egg yolks with the vegetable oil, milk and vanilla seeds in a separate large bowl until smooth. Sift the remaining 1 cup confectioners? sugar, the flour, baking powder and salt into a medium bowl; whisk into the yolk mixture until smooth. Stir about one-third of the whites into the batter with a rubber spatula, then fold in the remaining whites in two batches. Spread the batter in the prepared pan; bake until the cake springs back when gently pressed, 12 to 14 minutes.\n            \n\n              Immediately sift confectioners' sugar generously over the top of the warm cake and loosen the edges with a knife; lay a clean kitchen towel (not terry cloth) over the cake. Place another baking sheet over the towel and flip the cake with the baking sheets to invert it onto the towel. Remove the top baking sheet and parchment. Starting at a short end, roll up the cake and the towel together into a spiral. Transfer seam-side down to a rack and let cool completely.\n            \n\n              Meanwhile, make the frosting: Whisk the egg whites, granulated sugar, vanilla seeds and salt in a heatproof bowl set over a saucepan of simmering water (do not let the bowl touch the water). Cook, whisking, until the sugar dissolves, 2 to 3 minutes. Transfer the mixture to a stand mixer and beat with the whisk attachment on medium-high speed until cooled and stiff peaks form, 6 to 8 minutes. Beat in the butter, 1 piece at a time, until combined (the mixture may look curdled). Add the lemon zest and juice. Switch to the paddle attachment and continue to beat until smooth, about 2 minutes.\n            \n\n              Gently unroll the cake. Spread 2 cups of the frosting over the cake about 1/4 inch from the edges, then top with a layer of the lemon curd; swirl together. Reroll the cake (without the towel). Trim the ends with a serrated knife. Transfer to a platter and spread the remaining frosting on the top and sides of the cake.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "eggs", "quantity": 6.0}, {"food": "lemon juice", "quantity": 0.5}, {"food": "sugar", "quantity": 1.5}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "whole milk", "quantity": 0.25}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "potato flour", "quantity": 1.25}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.25}, {"food": "egg substitute", "quantity": 5.0}, {"food": "sugar", "quantity": 1.3333333333333333}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "butter oil", "quantity": 3.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "lemon juice", "quantity": 0.5}], "title": "\nLemon-Vanilla Cake Roll\n"}, {"directions": "\n\n              Whisk the all-purpose flour, semolina flour, baking powder, baking soda and salt in a large bowl. In a separate bowl, beat the butter and sugar with a mixer on medium speed until light and fluffy, about 2 minutes.\n            \n\n              Whisk the olive oil, whole egg, egg yolk, limoncello, vanilla, lemon zest and lemon juice in a large liquid measuring cup or bowl. Add to the butter mixture and beat on medium speed until smooth. Reduce the mixer speed to low; add the flour mixture and beat until just combined. Cover the dough with plastic wrap and chill 30 minutes. \n            \n\n              Preheat the oven to 350 degrees F. Line 2 baking sheets with parchment paper. Roll the dough into 2-inch-long, 1/2-inch-thick logs; arrange about 2 inches apart on the prepared baking sheets. Bake in batches until golden around the edges, about 18 minutes, rotating the baking sheets halfway through. Let cool 2 minutes on the baking sheets, then transfer to racks to cool completely.\n            \n\n              Meanwhile, put the white chocolate in a heatproof bowl and set over a saucepan of barely simmering water (do not let the bowl touch the water); stir until the chocolate melts. Drizzle the cookies with the melted white chocolate and sprinkle with the pistachios. Let set at room temperature, about 15 minutes.\n            \n\n              Photograph by Anna Williams\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.75}, {"food": "potato flour", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 12.0}, {"food": "sugar", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "grape juice", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 8.0}, {"food": "", "quantity": 0.5}], "title": "\nLemon-White Chocolate Cookies\n"}, {"directions": "\n\n              Put 1/2 teaspoon lemon juice and 1 tablespoon gin in each glass. Add ice and a few lemon slices. Fill the glasses halfway with white wine, then top with seltzer. Gently stir.\n            \n\n              Photograph by Anna Williams\n            \n", "ingredients": [], "title": "\nLemon-Wine Spritzers\n"}, {"directions": "\n\n              Whisk 2 egg whites, 1/4 cup sugar and a pinch of salt in a heatproof bowl set over a pan of simmering water until the sugar dissolves. Remove the bowl; beat with a mixer until stiff peaks form. Whisk 1 1/2 cups low-fat Greek yogurt, 1 teaspoon lemon zest and 1 tablespoon lemon juice in a separate bowl; fold in the egg whites. Chill 2 hours. Serve with crumbled shortbread cookies.\n            \n\n              Photograph by Anna Williams\n            \n", "ingredients": [], "title": "\nLemon-Yogurt Mousse\n"}, {"directions": "\n\n              Preheat oven to 425 degrees F.\n            \n\n              Toss pine nuts with 1 tablespoon of olive oil and spread out on a sheet pan. Toast the nuts in the oven, shaking the pan about half way through, until evenly brown, about 7 minutes. Transfer to a serving bowl. Reserve the baking sheet.\n            \n\n              Toss the zucchini with 2 tablespoons of the olive oil, the garlic, lemon zest, salt and pepper. Spread out on the baking sheet and roast until crisp tender and slightly brown, about 10 to 12 minutes.\n            \n\n              Toss zucchini and lemon with the nuts, and scatter dollops of the cheese on top. Serve.\n            \n", "ingredients": [{"food": "pine nuts", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "pineapple chunks", "quantity": 1.75}, {"food": "garlic powder", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 6.0}], "title": "\nLemon-Zesty Zucchini with Pine Nuts\n"}, {"directions": "\nSpecial equipment: parchment paper\n\n              Position 2 racks in the upper and lower thirds of the oven and preheat to 400 degrees F. Cut four 16-inch long sheets of parchment paper. Fold each sheet in half and open like a book. Divide the pieces of parchment between 2 baking sheets (2 pieces per sheet).\n            \n\n              Place the noodles in a large bowl and cover completely with warm water. Let sit for 5 minutes to soften, then drain well. Dry the bowl and put the noodles back in, along with the spinach and carrot: reserve.\n            \n\n              Whisk the coconut milk, curry paste, fish sauce, garlic, lime zest and juice, and brown sugar together in a medium bowl. Add 1/4 cup of the coconut marinade to the noodles, season with 1/8 teaspoon salt and toss to coat. Add the shrimp to the remaining marinade and toss to coat. \n            \n\n              Divide the noodles and vegetables between the 4 sheets of parchment, placing on one side of the fold. Drizzle each serving with 2 tablespoons water. Top with shrimp and drizzle with remaining marinade. Cut each lemongrass stalk into 4 pieces and smash with mallet or other heavy item. Place 2 in each pack.\n            \n\n              Fold over the top half of the parchment, crimping and overlapping small folds along the open edge to seal tightly. Bake until the parchment puffs, about 12 minutes; the shrimp will be cooked through.\n            \n\n              Transfer each pack to a plate. Avoiding the hot steam, carefully cut open each pack and discard the lemongrass stalks. Serve with lime wedges.\n            \n", "ingredients": [{"food": "rice noodles", "quantity": 4.0}, {"food": "mustard spinach", "quantity": 4.0}, {"food": "hearts of palm", "quantity": 2.0}, {"food": "coconut milk", "quantity": 0.5}, {"food": "ruby red grapefruit juice blend", "quantity": 1.5}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "lime juice", "quantity": 1.0}, {"food": "sugar", "quantity": 0.75}, {"food": "salt", "quantity": 1}, {"food": "shrimp", "quantity": 1.0}, {"food": "", "quantity": 2.0}], "title": "\nLemongrass Coconut Shrimp and Noodles Parchment Pack\n"}, {"directions": "\n\n              Toast the whole spices in a dry skillet over medium heat until fragrant, 2 to 3 minutes. Cool slightly and crush in a mortar and pestle or in a spice grinder. Mix the sugar, salt, and spices together.\n            \n\n              Roughly chop both the lemongrass stalks and cilantro, then mix them together, this can be done either by hand or in a food processor.\n            \n\n              Lay the salmon, skin side down on a cutting board. Pull the pin bones from the fillets if needed. Scatter the curing mixture over the fish, and then the lemongrass and cilantro mixture. (This may seem like a lot of rub but use it all.) Sandwich the fillets together, skin side out, and wrap tightly in plastic wrap. Set the package on a plate, cover with another plate or small baking sheet. Place 2 to 3 cans on top to weight down the fish. Refrigerate for 2 to 3 days flipping the salmon daily.\n            \n\n              Unwrap the salmon, and rinse under cold running water to remove the spices and herbs. Dry thoroughly with paper towels. Slice the salmon at a slight angle, as thin as you can.\n            \n\n              If doing this ahead lay the salmon on a parchment lined pan, cover and refrigerate until ready to serve. Serve on a slice of cucumber or a fingerling potato. Garnish with herbs and serve.\n            \n", "ingredients": [{"food": "seeds", "quantity": 1.0}, {"food": "fennel seed", "quantity": 1.0}, {"food": "seeds", "quantity": 2.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "salt", "quantity": 0.5}, {"food": "", "quantity": 4.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 25.0}, {"food": "sweet potatoes", "quantity": 25.0}, {"food": "barley flour or meal", "quantity": 1}], "title": "\nLemongrass-Cured Salmon Canapes\n"}, {"directions": "\n\n              Chop 1 bunch broccoli into florets; peel and slice the stems. Cook in 1 to 2 inches salted boiling water until tender, 5 minutes. Drain. Cook 1 clove chopped garlic, 3 to 5 minced anchovy fillets and a pinch of red pepper flakes in a skillet with 3 tablespoons olive oil over medium heat, 30 seconds. Add the broccoli, the juice of 1/2 lemon and salt. Drizzle with olive oil.\n            \n", "ingredients": [], "title": "\nLemony Broccoli With Anchovies\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F. Line one 12-cup standard muffin tin with cupcake liners.\n            \n\n              Sift together the flour, baking powder and 3/4 teaspoon of the salt.\n            \n\n              Beat together the butter and 1 cup of the sugar with an electric mixer until pale and fluffy, about 5 minutes. Beat in the egg, yolk, zest and 1 1/2 teaspoons of the vanilla. Reduce the speed to low and add the flour mixture in three additions alternating with the milk, beginning and ending with the flour mixture. Divide the batter among the muffin cups and bake until a tester inserted in the middle of the cakes come out clean, 20 to 25 minutes. Cool the cakes for 10 minutes in the tin, and then remove and cool completely on a rack.\n            \n\n              Put the lemon curd in a piping bag fitted with a 1/8-inch-round pastry tip. Insert the tip into the center of each cupcake and pipe in equal amounts of curd.\n            \n\n              Combine the egg whites, corn syrup, the remaining 1/2 cup sugar, the remaining 1 teaspoon vanilla and the remaining pinch of salt in a metal bowl set over a saucepan of simmering water. Beat with an electric mixer until thick and fluffy, about 7 minutes. Remove from the heat and beat until the frosting is slightly cooled, about 2 minutes longer.\n            \n\n              Mound the frosting on top of the cupcakes. If desired, use a kitchen torch to brown the frosting and garnish with a lemon candy.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.75}, {"food": "baking chocolate", "quantity": 1.5}, {"food": "salt", "quantity": 0.75}, {"food": "butter oil", "quantity": 1.5}, {"food": "sugar", "quantity": 1.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 2.5}, {"food": "milk", "quantity": 1.0}, {"food": "lemon juice", "quantity": 0.5}, {"food": "egg substitute", "quantity": 2.0}, {"food": "silk light vanilla", "quantity": 0.25}, {"food": "fava beans", "quantity": 1}], "title": "\nLemony Cupcakes\n"}, {"directions": "\n\n              Cover the chickpeas with 3 cups water in a large pot with 1 teaspoon baking soda and refrigerate 8 hours or overnight to soak.\n            \n\n              The next day, strain the chickpeas and discard the soaking liquid. Rinse the chickpeas and return them to the pot. Add the remaining teaspoon baking soda and water to cover by about 3 inches. Bring to a boil over high heat, then turn the heat down to a simmer and cook, skimming off and discarding any foam that rises to the surface, until the chickpeas are very soft and creamy (not crumbly) when pressed between a thumb and forefinger, about 40 minutes. If the liquid boils off while cooking, add more water to cover and continue to cook.\n            \n\n              Strain the chickpeas and discard the liquid. Let the chickpeas sit in the strainer to drain and dry out for 5 minutes. Put the chickpeas in the bowl of a food processor along with the tahini, lemon juice, garlic, all but a pinch of the dill and 1 1/2 teaspoons salt and process until the mixture is a paste, scraping down the bowl as necessary. With the motor running, slowly pour in 1/4 cup of the ice water and continue to process until the mixture is smooth and light, about 5 minutes, adding more water a tablespoon at a time until the desired consistency is reached.\n            \n\n              Transfer the hummus to a shallow bowl and cover by lightly pressing plastic wrap directly onto the surface of the hummus; let sit at room temperature until ready to serve, up to 1 hour. (The hummus can also be made a day ahead and refrigerated. Take the hummus out of the refrigerator to warm up 30 minutes before serving.)\n            \n\n              Before serving, remove the plastic wrap from the hummus. Smooth the outer rim of the hummus with the back of a large kitchen spoon, creating a slight well in the center. Dollop the yogurt in the center. Scatter the radish slices and capers on top, sprinkle with the reserved dill and serve with slices of pumpernickel bread and cucumbers.\n            \n", "ingredients": [{"food": "chickpeas", "quantity": 8.0}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "", "quantity": 0.75}, {"food": "", "quantity": 3.5}, {"food": "garlic powder", "quantity": 3.0}, {"food": "dill seed", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "silk banana-strawberry soy yogurt", "quantity": 0.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "garlic bread", "quantity": 1}], "title": "\nLemony Dill Hummus Dip\n"}, {"directions": "\n\n              Cover the chickpeas with 3 cups water in a large pot with 1 teaspoon baking soda and refrigerate 8 hours or overnight to soak.\n            \n\n              The next day, strain the chickpeas and discard the soaking liquid. Rinse the chickpeas and return them to the pot. Add the remaining teaspoon baking soda and water to cover by about 3 inches. Bring to a boil over high heat, then turn the heat down to a simmer and cook, skimming off and discarding any foam that rises to the surface, until the chickpeas are very soft and creamy (not crumbly) when pressed between a thumb and forefinger, about 40 minutes. If the liquid boils off while cooking, add more water to cover and continue to cook.\n            \n\n              Strain the chickpeas and discard the liquid. Let the chickpeas sit in the strainer to drain and dry out for 5 minutes. Put the chickpeas in the bowl of a food processor along with the tahini, lemon juice, garlic, all but a pinch of the dill and 1 1/2 teaspoons salt and process until the mixture is a paste, scraping down the bowl as necessary. With the motor running, slowly pour in 1/4 cup of the ice water and continue to process until the mixture is smooth and light, about 5 minutes, adding more water a tablespoon at a time until the desired consistency is reached.\n            \n\n              Transfer the hummus to a shallow bowl and cover by lightly pressing plastic wrap directly onto the surface of the hummus; let sit at room temperature until ready to serve, up to 1 hour. (The hummus can also be made a day ahead and refrigerated. Take the hummus out of the refrigerator to warm up 30 minutes before serving.)\n            \n\n              Before serving, remove the plastic wrap from the hummus. Smooth the outer rim of the hummus with the back of a large kitchen spoon, creating a slight well in the center. Dollop the yogurt in the center. Scatter the radish slices and capers on top, sprinkle with the reserved dill and serve with slices of pumpernickel bread and cucumbers.\n            \n", "ingredients": [{"food": "chickpeas", "quantity": 8.0}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "", "quantity": 0.75}, {"food": "", "quantity": 3.5}, {"food": "garlic powder", "quantity": 3.0}, {"food": "dill seed", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "silk banana-strawberry soy yogurt", "quantity": 0.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "garlic bread", "quantity": 1}], "title": "\nLemony Dill Hummus Dip\n"}, {"directions": "\n\n              Trim 1 bunch broccoli; peel the stems and quarter the bunch lengthwise. Toss with olive oil; season with salt and pepper. Grill until charred and tender, 2 to 3 minutes per side. Whisk 3 tablespoons olive oil, the zest and juice of 1 lemon, 1 tablespoon each grated pecorino and water and 1 teaspoon dijon mustard; season with salt and pepper and drizzle over the broccoli. Top with shaved pecorino.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [], "title": "\nLemony Grilled Broccoli\n"}]