[{"directions": "\n\n              Dough:\n            \n\n              Preheat the oven to 325 degrees F.\n            \n\n              To make the filling: Puree the filling ingredients in a food processor until evenly combined, about 1 to 2 minutes. Remove and set aside. Clean the processor bowl.\n            \n\n              Put the flour, baking powder, the 1 tablespoon confectioners' sugar, and salt in the bowl of food processor and pulse 3 to 4 times to mix. Add the butter, oil, and milk pulsing until the dough just comes together. Take care not to overwork the dough; it will be slightly wet.\n            \n\n              Remove dough from the processor, and roll into 20 equally sized balls. In the palm of your hand, press and pat each ball of dough into a 2 3/4-inch round. Place a rounded teaspoon of filling in the center of each round and draw the edges up and around the filling. Pinch the dough together to make a sealed ball, and then carefully roll the cookie between your palms to make a smooth round ball. Press gently to flatten the cookie slightly, then place them seamed side down on a parchment-lined baking sheet. Repeat with the remaining dough and filling. Gently prick the cookies with a fork or a wooden skewer in a decorative pattern taking care not to pierce the dough to the filling.\n            \n\n              Bake the cookies until firm and slightly puffed, and the tops are pale but the bottoms are just beginning to turn slightly golden, about 25 to 30 minutes. Dust generously with confectioners' sugar, cool and dust again.\n            \n\n              Apricot Golden Raisin Nut Filling:\n            \n\n              Puree in a food processor until evenly combined.\n            \n\n              Quince-Walnut Filling:\n            \n\n              Puree in a food processor until evenly combined.\n            \n", "ingredients": [{"food": "soft tofu", "quantity": 0.5}, {"food": "coconut water", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "ginger", "quantity": 0.25}, {"food": "orange", "quantity": 0.5}, {"food": "potato flour", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "sugar", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "milk", "quantity": 0.25}, {"food": "mixed nuts", "quantity": 0.3333333333333333}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.3333333333333333}, {"food": "apricot nectar", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "walnuts", "quantity": 0.5}, {"food": "jam", "quantity": 0.3333333333333333}, {"food": "salt", "quantity": 1}], "title": "\nMaamoul: Stuffed Date-Orange Cookies\n"}, {"directions": "\n\n              1.Preheat oven to 400 degrees F. \n            \n\n              2. Lightly butter a 9- by 13-inch casserole dish. Bring a large pot of cold water to a boil and generously salt. Add pasta and boil, stirring occasionally, until almost al dente, about 8 minutes. Drain pasta, transfer to a large bowl, and cool slightly. \n            \n\n              3. Melt butter with garlic clove in a medium skillet over medium heat. Add bread crumbs, parsley, and thyme and toss together. Remove garlic clove; set crumbs aside. \n            \n\n              4. Toss pasta with cheeses. Fold in bechamel sauce. Mix in tomatoes, red pepper, salt, and pepper. Transfer to prepared baking dish and scatter bread crumbs over top. Bake until sauce bubbles and crumbs crisp and brown, 25 to 30 minutes. Let rest for 10 minutes before serving. \n            \n\nBechamel:\n\n\n              Melt butter in a medium saucepan over medium heat. Stir in flour with a wooden spoon and cook about 2 minutes. Slowly whisk in milk and bring to a boil. Add parsley, thyme, bay leaf, and onion. Reduce heat to a gentle simmer and cook, whisking occasionally, until sauce is thick, about 15 minutes. Remove herbs and onion and season with 1/2 teaspoon salt, nutmeg, and pepper.\n            \n", "ingredients": [{"food": "italian veg medley pasta", "quantity": 1.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "bread crumbs", "quantity": 21.0}, {"food": "parsley", "quantity": 1.0}, {"food": "thyme", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 6.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "smoked turkey roll", "quantity": 3.0}, {"food": "hot pockets ham cheese stuffed swich", "quantity": 1.0}, {"food": "tomatoes", "quantity": 10.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "butter oil", "quantity": 2.0}, {"food": "potato flour", "quantity": 0.25}, {"food": "milk", "quantity": 4.0}, {"food": "parsley", "quantity": 1.0}, {"food": "thyme", "quantity": 1.0}, {"food": "corier leaf", "quantity": 0.5}, {"food": "onion powder", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "nutmeg", "quantity": 1}], "title": "\nMac & Cheese with Red Peppers & Tomatoes\n"}, {"directions": "\n\n              Position a rack in the upper third of the oven and preheat to 450 degrees F. Bring a medium saucepan of salted water to a boil. Add the macaroni and cook as the label directs; drain.\n            \n\n              Mist a baking sheet with cooking spray and arrange the tomato and baguette slices on it in a single layer; season with salt and pepper. Bake until the bread is golden brown, about 7 minutes.\n            \n\n              Mince the shallots, carrot and celery in a food processor. Mist a saucepan with cooking spray. Add the vegetables and cook over medium-high heat until softened, 4 to 5 minutes. Add the flour and cook, stirring, 2 minutes. Gradually stir in the broth and bring to a boil; cook, stirring, until thickened, 6 to 7 minutes. Remove from the heat.\n            \n\n              Add the milk, cheeses and macaroni and stir until the cheeses melt. Season with pepper. Top the toasts with tomatoes; serve on the soup.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "", "quantity": 4.0}, {"food": "", "quantity": 1}, {"food": "plum", "quantity": 2.5}, {"food": "luncheon slices", "quantity": 4.5}, {"food": "pepper", "quantity": 1}, {"food": "shallots", "quantity": 3.0}, {"food": "carrot juice", "quantity": 1.0}, {"food": "celery seed", "quantity": 1.0}, {"food": "potato flour", "quantity": 0.25}, {"food": "diced chicken", "quantity": 3.75}, {"food": "", "quantity": 1.25}, {"food": "cheddar cheese", "quantity": 6.0}, {"food": "parmesan cheese", "quantity": 0.25}], "title": "\nMac and Cheese Soup\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the broccoli and cook until bright green and crisp-tender, 3 to 4 minutes. Remove to a plate with a slotted spoon; let cool. Return the water to a boil. Add the pasta and cook as the label directs. Reserve 1 cup cooking water, then drain.\n            \n\n              Whisk the eggs, evaporated milk, the reserved cooking water, the Mexican cheese, 1/2 cup parmesan, the mustard, nutmeg, 1/2 teaspoon salt and a few grinds of pepper in a large saucepan. Cook over medium-low heat, whisking constantly, until the mixture starts to thicken and bubble, 6 to 8 minutes. Stir in the pasta and broccoli until coated. Transfer the mixture to a 3-quart baking dish and top with the tomatoes.\n            \n\n              Preheat the broiler. Combine the remaining 1/4 cup parmesan, the breadcrumbs and melted butter in a small bowl; sprinkle over the macaroni and cheese. Broil, rotating the pan, until the topping is golden brown, 4 to 5 minutes.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "broccoli raab", "quantity": 1.0}, {"food": "italian veg medley pasta", "quantity": 8.0}, {"food": "eggs", "quantity": 2.0}, {"food": "milk", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 2.0}, {"food": "parmesan cheese", "quantity": 0.75}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "pepper", "quantity": 1}, {"food": "grape juice", "quantity": 0.5}, {"food": "", "quantity": 0.25}, {"food": "butter oil", "quantity": 1.0}], "title": "\nMac and Cheese with Broccoli and Tomatoes\n"}, {"directions": "\n\n              1. Preheat oven to 400 degrees F. Butter a large baking dish. Bring a large pot of salted water to a boil. Add the macaroni and cook until al dente, about 6 minutes. Drain and rinse under cold running water.\n            \n\n              2. Meanwhile, melt the butter in a large saucepan over medium-high heat. Stir in the flour and cook, stirring, until blended and pale yellow. Whisk in the milk, then season with 1/2 teaspoon salt and 1/4 teaspoon pepper. Increase the heat to high and bring to a boil, stirring until thickened and smooth. Reduce the heat to medium and stir in the Asiago and 1 cup Parmesan.\n            \n\n              3. Combine the macaroni, sauce, tomatoes, and basil in a large bowl. Add the chicken and stir until combined. Season with salt and pepper. Pour into the baking dish.\n            \n\n              4. Mix the panko with the remaining 1/2 cup Parmesan, parsley, salt, pepper, and olive oil. Sprinkle over the macaroni and bake until heated through and golden, 25 to 30 minutes. Let sit for 5 minutes before serving.\n            \n", "ingredients": [{"food": "macaroni cheese", "quantity": 12.0}, {"food": "butter oil", "quantity": 6.0}, {"food": "potato flour", "quantity": 0.5}, {"food": "whole milk", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "macaroni cheese", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 1.5}, {"food": "tomatoes", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "parsley", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 0.25}], "title": "\nMac and Cheese with Chicken, Tomato and Basil\n"}, {"directions": "\n\n              Preheat the broiler. Bring a large pot of salted water to a boil. Add the pasta and cook as the label directs. Drain, then transfer to an 8-inch square baking dish.\n            \n\n              Meanwhile, cook the sausage in a medium saucepan over medium-high heat, breaking up the meat, until browned and crisp, about 10 minutes. Add the flour, chili powder, cumin and 1/2 teaspoon salt and cook, stirring, until combined, about 1 minute. Slowly whisk in the milk, scraping up any browned bits. Add the processed cheese and whisk until melted and smooth, 1 to 2 minutes. Remove from the heat and whisk in the eggs. Return the saucepan to medium-low heat and cook, whisking, until thickened, 1 to 2 minutes. Whisk in the sour cream and tomatoes.\n            \n\n              Pour the cheese sauce over the pasta and stir to combine. Sprinkle with the shredded cheese and broil until melted and bubbling, 2 to 3 minutes.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "barley flour or meal", "quantity": 6.0}, {"food": "pork turkey sausage", "quantity": 3.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "chili powder", "quantity": 0.75}, {"food": "cumin seed", "quantity": 0.25}, {"food": "whole milk", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "eggs", "quantity": 2.0}, {"food": "sour cream", "quantity": 0.3333333333333333}, {"food": "diced chicken", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 1.0}], "title": "\nMac and Queso with Sausage\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Bring a large pot of generously salted water to a boil. Fill a large bowl with ice water.\n            \n\n              Cut the tops off the peppers and reserve. Remove the seeds and membranes. Put the peppers and the tops in the boiling water and cook until just tender, 2 to 3 minutes. Plunge the peppers into the ice bath. Once cool, remove them and use a sharp knife to carve a jack-o-lantern face into one side of each pepper.\n            \n\n              Return the water to a boil, add the macaroni and cook until al dente, about 6 minutes. Reserve 1 cup of the pasta water and drain (don't rinse the pasta). \n            \n\n              Heat the half-and-half in a large saucepan over medium heat until it just comes to a simmer. Continue simmering until reduced to about 3/4 cup, about 10 minutes. Add the cream cheese and stir until melted. Whisk in the Cheddar until all the cheese is melted and the sauce is smooth.\n            \n\n              Off the heat, add the macaroni to the saucepan and stir to combine. Stir in some of the reserved pasta water to thin the sauce if needed. Season with salt if needed. Let sit for 10 minutes, then divide the mac and cheese among the peppers and cap each with a pepper top.\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "orange", "quantity": 6.0}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "", "quantity": 1.25}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "", "quantity": 4.0}], "title": "\nMac-O-Lantern and Cheese Bowls\n"}, {"directions": "\n\n              Make the crust: Pulse the flour, coconut and salt in a food processor until the coconut is finely chopped. Add the butter and shortening and pulse until the mixture looks like coarse meal with pea-size bits of butter. Drizzle in 3 tablespoons ice water and pulse until the dough begins to come together (add more water, 1/2 tablespoon at a time, if necessary). Turn out onto a sheet of plastic wrap and pat into a disk. Wrap tightly and refrigerate until firm, at least 1 hour and up to 1 day.\n            \n\n              Preheat the oven to 375 degrees F. Roll out the dough into an 11-inch round on a lightly floured surface. Ease into a 9-inch pie plate. Fold the overhanging dough under itself and crimp the edges with your fingers. Pierce the bottom all over with a fork. Refrigerate the crust until firm, about 15 minutes. Line the crust with foil, then fill with pie weights or dried beans. Bake until the edges are golden, 20 to 25 minutes. Remove the foil and weights and continue baking until golden all over, 10 to 15 more minutes. Transfer to a rack and let cool completely.\n            \n\n              Meanwhile, make the filling: Heat 1 1/2 cups milk and the macadamia nuts in a medium saucepan over medium heat (do not boil). Whisk the egg yolks, 1/2 cup sugar, the cornstarch, vanilla and the remaining 1/4 cup milk in a bowl until combined. Gradually whisk half of the hot milk mixture into the egg mixture, then pour back into the saucepan with the remaining milk mixture and cook, stirring constantly with a wooden spoon, until the mixture thickens and just begins to boil, 2 to 3 minutes. Remove from the heat and stir in the white chocolate until smooth. Transfer the filling to a large bowl and let cool to room temperature, stirring occasionally, about 30 minutes.\n            \n\n              Once the filling is cool, bring a few inches of water to a simmer in a medium saucepan. Whisk the egg whites and the remaining 1/4 cup sugar in a large heatproof bowl. Set the bowl over the pan (do not let the bowl touch the water) and whisk until the sugar dissolves and the mixture is warm. Remove the bowl from the pan and beat with a hand mixer until the egg whites are glossy and stiff, about 5 minutes. Fold the beaten egg whites into the filling, then spread in the prepared crust. Cover loosely with plastic wrap and refrigerate until set, at least 6 hours or overnight.\n            \n\n              Just before serving, make the whipped cream for topping: Beat the heavy cream and confectioners' sugar with a mixer until medium peaks form. Transfer to a piping bag fitted with a star tip and pipe around the edge of the pie. Top with the macadamia nuts and toasted coconut.\n            \n\n              Photograph by Kat Teutsch\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.25}, {"food": "coconut water", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 3.5}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "whole milk", "quantity": 1.75}, {"food": "macadamia nuts", "quantity": 0.5}, {"food": "eggs", "quantity": 2.0}, {"food": "sugar", "quantity": 0.75}, {"food": "cornstarch", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 3.0}, {"food": "ice cream swich", "quantity": 0.75}, {"food": "sugar", "quantity": 1.0}, {"food": "macadamia nuts", "quantity": 0.25}, {"food": "coconut water", "quantity": 2.0}], "title": "\nMacadamia Nut Cream Pie\n"}, {"directions": "\n\n              To mellow the minced onion, soak it in cold water while you make the salad.\n            \n\n              Bring a large pot of cold water to a boil over high heat and salt it generously. Add the macaroni and boil, stirring occasionally, until al dente, about 8 minutes. Drain the macaroni in a colander, put in a serving bowl, and toss with the milk. Allow the macaroni to cool slightly while you make the dressing.\n            \n\n              For the dressing: Whisk the vinegar, mustard, the 2 teaspoons salt, and black pepper to taste in a large bowl. Gradually whisk in the olive oil, starting with a few drops and then adding the rest in a steady stream to make a smooth, slightly thick dressing. Whisk in the sour cream.\n            \n\n              Drain the onions, pat dry, and add to the macaroni along with the ham, peas, celery, and dill. Add the dressing and fold to coat the pasta evenly. Serve immediately or cover and refrigerate until ready to serve.\n            \n", "ingredients": [{"food": "onion powder", "quantity": 0.25}, {"food": "coconut water", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "milk", "quantity": 2.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "sour cream", "quantity": 0.3333333333333333}, {"food": "ham", "quantity": 6.333333333333333}, {"food": "pigeon peas", "quantity": 0.75}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "dill seed", "quantity": 2.0}], "title": "\nMacaroni Salad with Dill and Ham\n"}, {"directions": "\n\n              Position a rack about 6 to 8-inches, from the broiler and preheat.\n            \n\n              Bring a large pot of water to a boil, salt it generously, and add the elbow pasta and cook until tender but still slightly more firm than al dente (about 5 minutes). Drain the pasta in a colander set in the sink; don't rinse.\n            \n\n              Meanwhile, melt 1/4 cup butter in a large saucepan over medium heat. Scatter the flour over the butter and mix with a wooden spoon into a paste. Continue stirring in a figure \"8\" making sure to get into the corners of the pan, until the paste puffs slightly and lightens in color, about 1 minute. Off the heat gradually whisk the milk into the paste. Return to medium-high heat and whisk until thickened, then simmer, stirring occasionally until the sauce has the consistency of heavy cream, about 8 to 10 minutes. Season with salt, pepper and nutmeg. Whisk in mustard. On the lowest heat setting, whisk 3 cups of the cheese into the sauce alternating with chicken stock.\n            \n\n              Toss the hot pasta with the cheese sauce in a large bowl to coat evenly. Transfer to a dutch oven.\n            \n\n              Mix the panko breads crumbs, melted butter, and remaining 1 cup cheddar together; scatter over the macaroni.\n            \n\n              Place macaroni and cheese under the broiler and cook until hot and bubbly and the breadcrumbs are brown and toasty, about 2 to 4 minutes. Let cool 10 minutes and serve.\n            \n\n              Copyright 2005 Television Food Network, G.P. All rights reserved.\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "butter oil", "quantity": 0.75}, {"food": "potato flour", "quantity": 0.5}, {"food": "milk", "quantity": 4.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "nutmeg", "quantity": 1}, {"food": "", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "bread crumbs", "quantity": 1.0}], "title": "\nMacaroni and Cheese\n"}, {"directions": "\n\n              Set an oven rack about 6 inches from the heat source and preheat the oven to 425 degrees F.\n            \n\n              Bring a large pot of salted water to a boil. Add the macaroni and cook until it is al dente, about 6 minutes. Strain, reserving 1 3/4 cups of the pasta water. Set aside.\n            \n\n              Cook the bacon in a large saucepan over medium heat until it is crispy and most of the fat has been rendered, about 15 minutes. Transfer the bacon to a paper-towel-lined plate. Pour the fat into a small heat-safe measuring cup. Add enough olive oil to total 1/4 cup of fat. Reserve.\n            \n\n              Carefully wipe out the saucepan (or give it a quick rinse if it is really dirty). Add the half-and-half and 2 teaspoons pepper and bring to a simmer over medium heat. Cook until reduced to 1 1/2 cups, about 15 minutes. Add the cream cheese and stir until melted. Whisk in the Cheddar and Gruyere until all the cheese is melted and the sauce is smooth.\n            \n\n              Add the macaroni and the reserved pasta water to the saucepan and stir to combine. (It will look very loose, but the pasta will suck up a lot of the sauce as it bakes.) Season to taste with salt if needed. Gently fold in the bacon and 3/4 of the sliced scallions. Pour into a 13-by-9-inch baking dish.\n            \n\n              Toss the bread crumbs with the reserved bacon-fat mixture and a pinch of salt in a medium bowl. Sprinkle the mixture evenly over the top of the macaroni and cheese and bake until the cheese is bubbly and the bread crumbs are lightly browned and crispy, about 10 minutes. Garnish with the remaining scallions and serve.\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "bacon", "quantity": 8.5}, {"food": "vegetable oil", "quantity": 1}, {"food": "", "quantity": 2.5}, {"food": "black bean mango", "quantity": 1}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "", "quantity": 8.0}, {"food": "", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "bread crumbs", "quantity": 1.0}], "title": "\nMacaroni and Cheese Carbonara\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Melt 4 tablespoons of the butter in a small saucepan over medium heat. Turn off the heat and whisk in the maple syrup and hot sauce. Season with salt. Cover to keep warm.\n            \n\n              Gently stir the macaroni and cheese into the pancake batter. Heat a large nonstick skillet over medium heat. Add 1 tablespoon of the butter and swirl to coat. \n            \n\n              Scoop 3 pancakes into the pan, about 1/3 cup each. Use the back of a spoon to lightly spread out the batter, making sure that there is enough space around each pancake so they do not touch. Sprinkle 2 tablespoons of Cheddar on top of each pancake, using the back of a spoon to lightly press into the batter. Cook until there are a few bubbles around the edges of the pancakes and the undersides are lightly browned, about 3 minutes. Flip the pancakes and cook until the cheese is completely melted and lightly browned, about 2 minutes more. \n            \n\n              Carefully wipe out the skillet and repeat the process with the remaining pancake batter and Cheddar, adding 1 tablespoon butter to the skillet for each new batch.\n            \n\n              Serve the pancakes in stacks of 3 topped with the remaining butter and hot sauce-maple syrup mixture.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.0}, {"food": "syrup", "quantity": 0.3333333333333333}, {"food": "Worcestershire sauce", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "macaroni cheese", "quantity": 2.0}, {"food": "", "quantity": 2.5}, {"food": "", "quantity": 1.5}], "title": "\nMacaroni and Cheese Pancakes\n"}, {"directions": "\n\n              Soak 1/4 cup minced red onion in cold water, 10 minutes; drain. Cook 8 ounces elbow macaroni as the label directs; drain and rinse under cold water. Toss the macaroni, onion, 1 chopped celery stalk, 1 chopped hard-cooked egg, 1/3 cup mayonnaise, a pinch of cayenne pepper, 1 tablespoon each olive oil and white wine vinegar, and 3 tablespoons chopped parsley. Season with salt and pepper.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [], "title": "\nMacaroni and Egg Salad\n"}, {"directions": "\n\n              1. Preheat the oven to 325 degrees F. Butter a 2 1/2-quart baking dish. Bring a large pot of salted water to a boil over medium heat. Add the penne and cook, until just al dente, about 5 minutes. Drain and transfer to a large bowl. Add the havarti, gouda, and fontina cheeses and 1 tablespoon butter to the hot pasta and stir gently until cheeses begin to melt.\n            \n\n              2. In a medium bowl, whisk the egg, evaporated milk, paprika, half the garlic, 1/2 teaspoon salt and pepper. Stir the egg mixture into the macaroni pasta. Transfer to the prepared baking dish; bake covered for 10 minutes. \n            \n\n              3. Meanwhile, pulse the bread in a food processor with the olive oil, remaining garlic, and 1/4 teaspoon each salt and pepper; stir in the thyme leaves. \n            \n\n              4. Uncover the casserole, sprinkle the pasta with the breadcrumb mixture, and bake until bubbly and golden brown, about 15 minutes more. Serve immediately.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "barley flour or meal", "quantity": 1.0}, {"food": "", "quantity": 1.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "milk", "quantity": 2.0}, {"food": "paprika", "quantity": 0.5}, {"food": "garlic powder", "quantity": 2.0}, {"food": "pepper", "quantity": 1}, {"food": "", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "thyme", "quantity": 1.0}], "title": "\nMacaroni and Three Cheeses with Garlic Breadcrumbs\n"}, {"directions": "\n\n              Preheat the oven to 325 degrees F and line a baking sheet with parchment paper. Whisk the egg whites, sugar, salt and vanilla in a large bowl until combined; fold in the coconut.\n            \n\n              Flatten heaping tablespoonfuls of the coconut mixture into 2-inch disks; place them about 1 inch apart onto the baking sheet. Bake until golden brown around the edges, 20 to 25 minutes. Let cool 10 minutes on the baking sheet, then transfer to a rack to cool completely.\n            \n\n              Gently sandwich the macaroons with the vanilla ice cream; freeze until set, at least 15 minutes.\n            \n", "ingredients": [{"food": "egg substitute", "quantity": 3.0}, {"food": "sugar", "quantity": 0.5}, {"food": "salt", "quantity": 0.125}, {"food": "vanilla extract", "quantity": 0.25}, {"food": "coconut water", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 3.0}], "title": "\nMacaroon Ice Cream Sandwiches\n"}, {"directions": "\n\n              Heat 2 tablespoons of the olive oil over medium heat in a large nonstick skillet with the garlic until fragrant, about 1 minute. Stir in the fennel and onions and cook until brown and tender, about 8 to 10 minutes. Add the thyme, rosemary, lemon and orange peel, pepper flakes, olives, and tomatoes. Season with salt and pepper and cook until herbs and zest are fragrant, about 3 minutes more. Transfer vegetables to a serving platter and cover with foil to keep warm.\n            \n\n              Wipe out the skillet.\n            \n\n              Make 1-inch diagonal slashes into the fishes' skin to prevent the mackerel from curling while cooking. Add the remaining olive oil to the skillet over high heat and season the mackerel with salt and pepper. Place fish skin side down in the skillet and cook undisturbed until crisp brown and a spatula can easily be slipped under the fish to flip, about 2 to 3 minutes. Turn the fish over and cook another 2 minutes, until just firm. Set on top of the fennel mixture and serve.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 4.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "thyme", "quantity": 1.0}, {"food": "rosemary", "quantity": 1.0}, {"food": "lemon peel", "quantity": 2.0}, {"food": "orange peel", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1}, {"food": "black bean mango", "quantity": 0.3333333333333333}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "black bean mango", "quantity": 1}, {"food": "mackerel", "quantity": 4.0}], "title": "\nMackerel with Fennel, Olives, and Sun Dried Tomatoes\n"}, {"directions": "\n\n              Combine 1/3 cup green melon liqueur with 1 cup tonic water in a liquid measuring cup and pour into 12 plastic test-tube shot glasses (available at party-supply stores). If you set them under black light, they'll glow in the dark thanks to the tonic.\n            \n\n              Photograph by Ralph Smith\n            \n", "ingredients": [], "title": "\nMad Scientist Shooters\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Cut the potatoes into long wedges about 1-inch thick. Toss the potatoes with the olive oil and Cajun seasoning. Heat an ovenproof large nonstick skillet over medium-high heat and add the potatoes in a single layer. Cook, turning, until browned on all sides, about 15 minutes. Slowly add 1/4 cup water to the skillet and transfer the entire skillet to the oven. \n            \n\n              Continue to cook the potatoes, turning once, until the potatoes are tender and the outsides are crisped, about 20 more minutes. Meanwhile, mix the yogurt with the mustard and a pinch salt. Serve the potatoes warm with the mustard dipping sauce. \n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "seasoning mix", "quantity": 1.0}, {"food": "silk banana-strawberry soy yogurt", "quantity": 3.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "salt", "quantity": 1}], "title": "\nMade-Over Blackened Cajun Skillet Fries\n"}, {"directions": "\n\n              Position rack in the lower third of the oven and heat oven to 325 degrees F. Use an 8 by 8 silicon baking pan or line a similar sized metal or glass baking dish with foil or parchment paper so it hangs over the edges by about 1 inch. Spray the prepared pan completely.\n            \n\n              Put the butter, oil and chocolate in a microwave-safe bowl, and heat at 75 percent power for 2 minutes. Stir, and microwave again until completely melted, about 2 minutes more. (Alternatively put the chocolate and butter in a heatproof bowl. Bring a saucepan filled with 1 inch or so of water to a very slow simmer; set the bowl over, not touching, the water, and stir occasionally until melted and smooth.)\n            \n\n              Stir the brown and white sugars, vanilla and salt into the chocolate mixture with a wooden spoon. Add the eggs and coffee and beat vigorously until fully incorporated and the batter is thick and glossy. Add the cocoa, flour and baking soda and stir just until it disappears.\n            \n\n              Pour the batter into the pan and bake until the top is crispy and a toothpick inserted into the middle comes out with a few crumbs, about 30 minutes (40 minutes if not using silicon).\n            \n\n              Cool the brownies in the pan on the counter. Lift brownies out of the pan by the foil, if needed. Peel off the foil and cut into 2-inch squares. Serve. Store extra brownies in a tightly sealed container at room temperature for up to 3 days.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 4.0}, {"food": "sugar", "quantity": 0.75}, {"food": "sugar", "quantity": 0.25}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "salt", "quantity": 0.5}, {"food": "eggs", "quantity": 2.0}, {"food": "silk coffee", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.25}, {"food": "potato flour", "quantity": 0.75}, {"food": "baking chocolate", "quantity": 0.25}], "title": "\nMade-Over Deep Dish Brownies\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Cut the potatoes into long wedges about 1-inch thick. Toss the potatoes with the olive oil and Cajun seasoning. Heat an ovenproof large nonstick skillet over medium-high heat and add the potatoes in a single layer. Cook, turning, until browned on all sides, about 15 minutes. Slowly add 1/4 cup water to the skillet and transfer the entire skillet to the oven. \n            \n\n              Continue to cook the potatoes, turning once, until the potatoes are tender and the outsides are crisped, about 20 more minutes. Meanwhile, mix the yogurt with the mustard and a pinch salt. Serve the potatoes warm with the mustard dipping sauce.\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "seasoning mix", "quantity": 1.0}, {"food": "silk banana-strawberry soy yogurt", "quantity": 3.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "salt", "quantity": 1}], "title": "\nMade-over Blackened Cajun Skillet Fries\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 350 degrees F. Butter a 9-by-13-inch baking dish.\n            \n\n              Combine the melted butter and graham cracker crumbs in a small bowl with your hands (the mixture should hold together when squeezed). Pour the mixture into the prepared dish and press it into the bottom in an even layer, using the bottom of a measuring cup to help. Pour the sweetened condensed milk over the crumbs, then sprinkle the chocolate chips, butterscotch chips, pecans and coconut over the milk.\n            \n\n              Bake until the sides are golden brown and begin to pull away from the dish, 30 to 40 minutes. Let cool completely in the dish. Cut into 48 small pieces (they are rich). The cookies can be refrigerated in an airtight container for up to 3 days.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.0}, {"food": "cracker barrel", "quantity": 2.0}, {"food": "milk", "quantity": 14.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "peanut butter ", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "coconut water", "quantity": 1.0}], "title": "\nMagic Bars\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Butter an 8-inch square baking dish that is at least 2 inches deep. Place the buttered dish in the oven while you mix the batter.\n            \n\n              Whisk together the heavy cream, 1 teaspoon of the sugar and 1/2 teaspoon salt in a small bowl and set aside. \n            \n\n              Whisk together the eggs and melted butter in a large bowl until well blended. Add the milk, vinegar, the remaining sugar and 1 teaspoon salt and beat until mixed well. Whisk together the cornmeal, flour, baking powder and baking soda in a medium bowl. \n            \n\n              Add the flour mixture to the egg mixture and stir until just combined. Pour the batter into the preheated dish, then slowly, pour the seasoned cream into the center of the batter about 1-inch away from the edge. Don't stir the cream into the batter.\n            \n\n              Bake until the top of the cornbread is lightly browned, and a toothpick inserted near the edge of the bread (not the center) comes out clean, about 50 minutes. Serve warm.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 3.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "sugar", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "eggs", "quantity": 2.0}, {"food": "milk", "quantity": 2.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "yellow rice", "quantity": 1.0}, {"food": "potato flour", "quantity": 0.75}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 0.5}], "title": "\nMagic Cornbread\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Make the crust: In a mixing bowl, stir together the graham cracker crumbs, sugar and butter until fully combined. Press the mixture firmly into a 9-inch pie plate. Set aside.\n            \n\n              Make the filling: In a medium bowl, mix the condensed milk, lemon juice, zest and egg yolks. Pour into the crust. Make the meringue: Beat the egg whites and cream of tartar in a medium bowl with an electric hand mixer until soft peaks form. Gradually beat in the sugar until stiff peaks form. Spread the meringue over the pie and seal the edge of the crust. Bake 15 to 20 minutes, or until the meringue browns slightly. (Be sure to watch the pie while it's baking. Meringue can burn quickly.) Let cool slightly on a rack, then chill in the refrigerator at least 2 hours before serving.\n            \n\n              Photograph by Anna Williams\n            \n", "ingredients": [{"food": "cracker barrel", "quantity": 1.5}, {"food": "sugar", "quantity": 0.25}, {"food": "butter oil", "quantity": 0.75}, {"food": "milk", "quantity": 1.0}, {"food": "lemon juice", "quantity": 0.5}, {"food": "lemon juice", "quantity": 1.0}, {"food": "egg substitute", "quantity": 3.0}, {"food": "egg substitute", "quantity": 3.0}, {"food": "ice cream swich", "quantity": 0.25}, {"food": "sugar", "quantity": 0.3333333333333333}], "title": "\nMagic Lemon Meringue Pie\n"}, {"directions": "\n\n              Preheat the broiler to high. Split the baguette or rolls and brush both sides lightly with butter. Broil until lightly toasted, about 2 minutes.\n            \n\n              Remove from the broiler and spread both sides with mayonnaise. Toss the scallions, carrot and cucumber in the dressing. Stack the sandwiches with fish, the tossed vegetables, herbs, watercress and chili sauce, if desired.\n            \n\nThai Red Curry Mahi Mahi Salad\n\n\n              Preheat the broiler to high. Line a broiler pan with foil and lightly oil.\n            \n\n              Skim 2 tablespoons cream from the top of the coconut milk (reserve the milk to flavor rice as a side dish, if desired). Fry the coconut cream in a small skillet over medium heat until glossy, about 2 minutes. Stir in the curry paste and cook until fragrant, 2 minutes. Spread the mixture over the fish in the broiler pan; broil until browned and just cooked through, about 15 minutes. Cut the fish into 4 pieces.\n            \n\n              Whisk the lime juice, sugar, 2 tablespoons water and fish sauce in a bowl until the sugar dissolves. Stir in the chili sauce and garlic.\n            \n\n              Arrange the lettuce, watercress, cucumber, scallions, pepper, herbs, nuts and lime wedges with 4 pieces of fish on a platter; drizzle with the Thai salad dressing. \n            \n\n              Photograph by Antonis Achiellos\n            \n", "ingredients": [{"food": "pizza rolls", "quantity": 0.5}, {"food": "butter oil", "quantity": 1.0}, {"food": "mayonnaise dressing", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "barley flour or meal", "quantity": 0.5}, {"food": "cucumber", "quantity": 0.5}, {"food": "salad dressing", "quantity": 1.0}, {"food": "vegetarian fillets", "quantity": 2.0}, {"food": "barley flour or meal", "quantity": 0.5}, {"food": "watercress", "quantity": 0.5}, {"food": "Worcestershire sauce", "quantity": 1}, {"food": "coconut milk", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "", "quantity": 1.25}, {"food": "lime juice", "quantity": 0.3333333333333333}, {"food": "sugar", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "watercress", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "barley flour or meal", "quantity": 1.0}, {"food": "barley flour or meal", "quantity": 1.0}], "title": "\nMahi Mahi Banh Mi (Vietnamese Sandwiches)\n"}, {"directions": "\n\n              Preheat the broiler. Spread the almonds on a rimmed baking sheet and broil, stirring frequently, until golden, 2 to 3 minutes. Combine the toasted almonds, 2 tablespoons olive oil, the lemon juice, honey, mustard, 1/4 cup water, 1/4 teaspoon salt, and pepper to taste in a blender and blend until smooth. Transfer to a bowl and stir in the parsley.\n            \n\n              Toss the asparagus with the remaining 1 tablespoon olive oil, 1 tablespoon water, the lemon zest, and salt and pepper to taste on the same baking sheet. Spread in a single layer and broil until the asparagus is bright green and crisp-tender, about 4 minutes. Transfer to a plate and keep warm.\n            \n\n              Sprinkle the fish with 1/4 teaspoon each salt and pepper and arrange on the same baking sheet, rounded side down; broil until opaque, about 3 minutes. Turn the fillets, brush with some of the almond sauce and continue broiling until just firm and cooked through, 3 to 5 more minutes. Divide the fish and asparagus among plates and top with the remaining almond sauce.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "pasta with sliced franks in tomato sauce", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "honey smoked ham", "quantity": 0.5}, {"food": "mustard spinach", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "parsley", "quantity": 1.0}, {"food": "asparagus", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "vegetarian fillets", "quantity": 4.0}], "title": "\nMahi Mahi With Asparagus and Almond Sauce\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F. Season the fish with salt and pepper. Heat 1 tablespoon butter in a large nonstick skillet over medium-high heat. Sear the fish until golden brown on one side, about 3 minutes. Transfer to a rimmed baking sheet, cooked-side up, and roast in the oven until just cooked through, about 10 minutes.\n            \n\n              Meanwhile, melt the remaining 3 tablespoons butter in the skillet over medium-high heat. Add the cauliflower and cook, stirring, until golden brown and crisp-tender, about 6 minutes. Add the almonds, raisins, coriander, 1/4 teaspoon salt, and pepper to taste; cook until the almonds are golden, about 2 minutes. Remove from the heat and stir in the lemon juice and parsley.\n            \n\n              Divide the fish among plates and serve with the cauliflower and lemon wedges.\n            \n", "ingredients": [{"food": "vegetarian fillets", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 4.0}, {"food": "cauliflower", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.25}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.25}, {"food": "ground turkey", "quantity": 0.25}, {"food": "lemon juice", "quantity": 1.0}, {"food": "parsley", "quantity": 0.25}, {"food": "", "quantity": 1}], "title": "\nMahi Mahi With Cauliflower\n"}, {"directions": "\n\n              Fill a large steamer or pot with about 2 inches of water. Add 1 tablespoon sea salt and bring to a boil over medium heat. Put 2 lobsters (about 1 1/2 pounds each) in the steamer basket or directly in the pot; cover and steam until the shells turn bright red, 8 to 10 minutes. Remove the lobsters and rinse under cold water until slightly cool. Remove the meat from the shells and roughly chop; chill the meat. Mix 1/3 cup mayonnaise, 1/4 cup diced celery, and the zest and juice of 1 lemon in a bowl. Stir in the chilled lobster meat and season with salt. Divide among 4 split-top hot dog buns and top with celery leaves.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [], "title": "\nMaine-Style Lobster Rolls With Mayonnaise\n"}, {"directions": "\n\n              Start with cold heavy cream and mix on high speed.\n            \n\n              After about 3 minutes, you'll have whipped cream; continue mixing.\n            \n\n              After about 6 more minutes, the butter will clump and separate from the liquid. Strain and wrap the butter in cheesecloth, then squeeze out the liquid.\n            \n\n              Tip:  To make perfect rounds, shape flavored butter into a log using parchment paper; wrap and chill, then slice.\n            \n\n              Pumpkin\n            \n\n              Mash 1/4 cup canned pure pumpkin, 1 stick softened butter, 1/4 teaspoon orange zest, 1/2 teaspoon each sugar and pumpkin pie spice, and a pinch of salt.\n            \n\n              Spiced Cranberry\n            \n\n              Simmer 1/2 cup cranberries with 1 tablespoon water, 1/4 cup sugar, 1 strip lemon zest, 1 cinnamon stick and 1 clove, 6 to 8 minutes. Discard the zest, cinnamon and clove; let cool. Pulse in a food processor with 1 stick softened butter and a pinch of salt.\n            \n\n              Bourbon-Raisin\n            \n\n              Microwave 1/2 cup raisins with 1 tablespoon bourbon, covered, 45 seconds; let cool. Pulse in a food processor with 1 stick softened butter, 1 tablespoon chopped chives and a pinch of salt.\n            \n\n              Sage Brown Butter\n            \n\n              Melt 1 stick butter over medium heat and cook until browned. Add 1/4 cup sage and fry 30 seconds; drain on paper towels, then chop. Let the brown butter cool; mash with 1 stick softened butter, the sage and a pinch of salt.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [], "title": "\nMake Your Own Butter\n"}, {"directions": "\n\n              For the filling: Peel and core the apples, and cut them into 1/2-inch-thick slices. Toss them with the granulated sugar and lemon juice. Melt the butter in a large skillet over medium-high heat. Add the apples, and cook, stirring occasionally, until the firmer apples soften but still hold their shape, 15 to 18 minutes. Add the cream, flour, cinnamon and salt, and stir until the juices thicken, about 2 minutes. Remove the skillet from the heat, and let the filling cool completely. Transfer it to a 9-by-13-inch baking dish.\n            \n\n              For the topping: Mix the flour, oats, walnuts, granulated sugar, butter and salt together in a medium bowl, using your fingers to work the butter into the flour, until the mixture comes together and holds its shape when squeezed.\n            \n\n              Drop small clumps of the topping over the filling, and wrap the baking dish well with plastic wrap. Label and date, and freeze for up to 2 weeks.\n            \n\n              To serve: Position an oven rack in the top third of the oven, and preheat to 350 degrees F. Unwrap the crisp, and bake, frozen and uncovered, until the filling is hot and bubbly and the top is golden brown, 50 minutes to 1 hour. Dust the crisp with confectioners' sugar, and serve warm with scoops of vanilla ice cream if you like.\n            \n", "ingredients": [{"food": "mixed nuts", "quantity": 4.0}, {"food": "sugar", "quantity": 0.75}, {"food": "lemon juice", "quantity": 3.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "ice cream swich", "quantity": 0.25}, {"food": "potato flour", "quantity": 3.0}, {"food": "cinnamon", "quantity": 1.5}, {"food": "salt", "quantity": 0.25}, {"food": "potato flour", "quantity": 0.75}, {"food": "oats", "quantity": 0.5}, {"food": "walnuts", "quantity": 0.5}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "butter oil", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "sugar", "quantity": 1}, {"food": "ice cream swich", "quantity": 1}], "title": "\nMake-Ahead Apple Crisp\n"}, {"directions": "\n\n              Set aside 1/2 cup of the cranberries. Bring the remaining cranberries, sugar, vinegar, orange zest, cinnamon stick, ginger, 1/4 teaspoon salt and a few grinds of pepper to a simmer in a medium saucepan over medium heat, stirring frequently, until the sugar dissolves and the cranberries soften, about 3 minutes. Add the figs and raisins, raise the heat to bring the mixture to a high simmer, then cook until the cranberries burst and the chutney is saucy and coats the back of a spoon, about 10 minutes. Remove the pan from the heat, and stir in the reserved 1/2 cup cranberries.\n            \n\n              Let the chutney cool to room temperature. Transfer it to an airtight container or resealable plastic bag, label and date, and freeze for up to 2 weeks.\n            \n\n              Let the chutney thaw in the refrigerator the night before you plan to serve it. To serve, heat it in a microwave-safe bowl in 30-second increments until the chill is gone. If the chutney is too thick, thin it out with a few tablespoons of water.\n            \n", "ingredients": [{"food": "frozen yogurt", "quantity": 12.0}, {"food": "sugar", "quantity": 1.25}, {"food": "vinegar", "quantity": 0.5}, {"food": "orange", "quantity": 4.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "ginger", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "figs", "quantity": 1.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.5}], "title": "\nMake-Ahead Cranberry-Fig Chutney\n"}, {"directions": "\nSpecial equipment: A deep 9 1/2-inch pie pan\n\n              For the pie dough: Pulse the flour, 4 tablespoons of the butter, the lard, sugar and salt in a food processor until the mixture has the consistency of a fine meal. Add the remaining 8 tablespoons butter, and pulse until you have pea-sized pieces. Sprinkle the vodka and water over the mixture, and pulse until the dough just comes together. Evenly divide the dough between 2 pieces of plastic wrap, and gently press or pat into rounds. Wrap tightly, and refrigerate until firm, about 1 hour up to overnight. (The dough can be frozen for up to 2 months.)\n            \n\n              For the filling: Peel and core the apples, then cut them into 1/2-inch-thick slices. Toss with the sugar and lemon juice in a large bowl. Melt 4 tablespoons of the butter in a large skillet over medium-high heat. Add the apples, and cook, stirring occasionally, until the firmer apples soften but hold their shape, 15 to 18 minutes. (The softer apples, like McIntosh, will get very soft and saucy.) Add the flour, cinnamon, cream and salt, and stir until the juices thicken, about 2 minutes. Remove from the heat, and let cool completely. (The filling can be refrigerated, covered, up to 2 days ahead.)\n            \n\n              To assemble: Roll out 1 disk of dough into a 13-inch round on a lightly floured surface or between 2 pieces of floured parchment or wax paper. (If the dough gets too warm, refrigerate it to firm it up.) Ease it into a deep 9 1/2-inch pie pan. Mound the cooled filling slightly in the center of the dough, and dot with the remaining 2 tablespoons butter.\n            \n\n              Roll out the remaining disk of dough into a 12-inch round. Place it over the filling, and press the 2 crusts together around the edge. Fold the overhanging dough under itself, and crimp as desired. Brush the top and edges with heavy cream, and sprinkle generously with sugar. Pierce the top with a knife a few times (or make decorative cutouts) to let steam escape. Refrigerate at least 1 hour.\n            \n\n              To bake: Position an oven rack in the bottom slot of the oven, set a baking sheet on it and preheat to 425 degrees F for at least 30 minutes. Place the pie on the hot baking sheet, and lower the heat to 375 degrees F. Bake until the pie is golden and the filling is bubbly, 1 hour 10 minutes to 1 hour 20 minutes, rotating as needed. (Cover the edge of the crust with foil if it browns too quickly.) Transfer to a rack, and let cool until set, 3 hours.\n            \n\n              Serve the cooled pie, or wrap it tightly in foil, label and date, and freeze for up to 2 weeks. Warm it in a 350-degree-F oven for 20 minutes before serving.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.5}, {"food": "butter oil", "quantity": 1.5}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "sugar", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "", "quantity": 0.25}, {"food": "coconut water", "quantity": 3.0}, {"food": "", "quantity": 1}, {"food": "mixed nuts", "quantity": 4.0}, {"food": "sugar", "quantity": 0.75}, {"food": "lemon juice", "quantity": 3.0}, {"food": "butter oil", "quantity": 6.0}, {"food": "potato flour", "quantity": 3.0}, {"food": "cinnamon", "quantity": 1.5}, {"food": "ice cream swich", "quantity": 0.25}, {"food": "salt", "quantity": 0.25}], "title": "\nMake-Ahead Deep-Dish Apple Pie\n"}, {"directions": "\nSpecial equipment: Two 12-cup muffin tins\n\n              Warm 1/4 cup of the milk in a small saucepan over medium-low heat to anywhere between 100 and 115 degrees F. Pour the milk into the bowl of a stand mixer fitted with a hook attachment. Add the sugar and yeast, and let stand until foamy, about 5 minutes. Add the softened butter, half the flour, half the remaining milk and fine salt. Mix on medium-high speed just to incorporate. Add the egg, mix until fully incorporated, then add the remaining flour and milk. Knead with the hook on medium-high speed until the dough is smooth and pulls away from the sides, about 5 minutes (the dough will still be sticky).\n            \n\n              Lightly butter a large bowl with some of the melted butter, and turn the dough out into it. Cover with plastic wrap, and let stand in a slightly warm place until doubled in size, about 2 hours.\n            \n\n              Lightly butter two 12-cup muffin tins with some of the melted butter. Punch the dough down. Divide it into 24 even pieces, and roll them into rough balls. Roll each ball in the melted butter to coat, letting the excess drip off, and plop it into a muffin cup. Cover lightly with plastic wrap, and let rise in the refrigerator at least 8 hours and up to 1 day.\n            \n\n              Position oven racks in the lower and upper thirds of the oven, and preheat to 375 degrees F. Remove the tins from the refrigerator, and let stand at room temperature 1 hour (the dough won't puff up significantly). Sprinkle evenly with sea salt, and bake, rotating the tins halfway through, until just lightly golden but still rather pale and almost cooked through, 10 to 15 minutes.\n            \n\n              Let the parbaked rolls cool slightly in the tins, then transfer to cooling racks to cool completely. Pack them in resealable plastic bags, label and date, and freeze for up to 2 weeks.\n            \n\n              To serve, preheat the oven to 350 degrees F. Bake the frozen rolls on a parchment-lined baking sheet until warmed through and golden brown on top, about 20 minutes. Brush the warm rolls with melted butter.\n            \n", "ingredients": [{"food": "whole milk", "quantity": 1.0}, {"food": "sugar", "quantity": 3.0}, {"food": "yeast extract spread", "quantity": 0.25}, {"food": "butter oil", "quantity": 6.0}, {"food": "potato flour", "quantity": 3.5}, {"food": "salt", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "sea lion", "quantity": 1}], "title": "\nMake-Ahead Dinner Rolls\n"}, {"directions": "\nSpecial equipment: A 3-quart baking dish\n\n              Bring a large pot of salted water to a boil. Add the green beans, and cook until bright green and crisp-tender, about 10 minutes. Drain and shake off any excess moisture; set aside.\n            \n\n              Melt the butter in a medium pot over medium heat. Add the onions, and cook, stirring, until soft, about 8 minutes. Add the mushrooms and a pinch of salt, and continue to cook, stirring, until they are soft and most of their liquid has evaporated, about 10 minutes. Sprinkle the flour over the vegetables, and stir until all the flour has been absorbed, about 1 minute. Add the chicken broth, half-and-half, 3/4 teaspoon salt and several grinds of pepper. Bring to a boil, then reduce to a simmer and cook, stirring, until the sauce thickens and coats the back of a spoon, about 5 minutes. Remove the pot from the heat, add the green beans and stir to coat in the sauce. Transfer the mixture to a 3-quart baking dish.\n            \n\n              Let the casserole cool to room temperature. Wrap well with plastic wrap and foil, label and date, then freeze for up to 2 weeks.\n            \n\n              To serve, preheat the oven to 350 degrees F. Discard the plastic wrap and foil from the frozen casserole. Cover with new foil, and bake until warmed through, about 45 minutes. Uncover, and top with the fried onions. Continue to bake until the casserole is hot and bubbly and the onions have crisped slightly, about 20 minutes more.\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "fava beans", "quantity": 1.5}, {"food": "butter oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}, {"food": "potato flour", "quantity": 2.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "fried chicken", "quantity": 1.5}], "title": "\nMake-Ahead Green Bean Casserole\n"}, {"directions": "\nSpecial equipment: An extra-large pot, a roasting pan and rack, a meat thermometer\n\n              Bring 1 quart water, 3/4 cup salt, brown sugar, peppercorns, bay leaves and lemon zest to a boil in an extra-large pot (large enough to hold the turkey breast). Reduce the heat to a simmer, and cook for 10 minutes. Remove the pot from the heat, and add 4 quarts water. Let cool to room temperature.\n            \n\n              Add the turkey breast to the pot (use a plate to help submerge it if needed), cover and refrigerate for at least 12 hours and up to 1 day.\n            \n\n              Remove the turkey breast from the pot, and discard the brine. Blot the breast dry all over with paper towels.\n            \n\n              Position an oven rack in the center of the oven, and preheat to 350 degrees F. Pulse the butter, parsley, sage, thyme, paprika and cayenne in a food processor to combine. Rub half the herbed butter under and over the skin of the turkey breast; roll the rest into a log, and freeze. Place the breast on a rack set in a roasting pan, and roast, rotating as needed to ensure even browning, until the deepest part of the breast registers an internal temperature of 165 degrees F, 1 hour 45 minutes to 2 hours.\n            \n\n              Let the turkey breast cool completely. Wrap it well with plastic wrap and foil, label and date, and freeze, deep in the freezer, for up to 2 weeks.\n            \n\n              Two days before you plan to serve it, put the turkey breast in a baking dish and transfer it to the refrigerator to thaw.\n            \n\n              To serve, preheat the oven to 350 degrees F. Remove the breast from the bone, and slice. Shingle the slices onto a large baking dish, pour in the stock and dot the turkey with slices of the frozen herbed butter. Wrap the dish tightly with foil, and reheat in the oven until the turkey is hot and the butter is melted, 40 to 50 minutes. Transfer the turkey to a platter, and drizzle with some of the pan liquid.\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "sugar", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 3.0}, {"food": "", "quantity": 1.0}, {"food": "turkey breast", "quantity": 7.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 0.25}, {"food": "sage", "quantity": 1.0}, {"food": "thyme", "quantity": 1.0}, {"food": "paprika", "quantity": 0.25}, {"food": "pepper", "quantity": 0.125}, {"food": "diced chicken", "quantity": 0.5}], "title": "\nMake-Ahead Roasted Turkey Breast\n"}, {"directions": "\n\n              Melt 1 tablespoon of the butter in a large nonstick skillet over medium-high heat. Add the sausage and cook, breaking it up into bite-sized pieces, until it is browned and cooked through, about 5 minutes. Transfer the sausage with a slotted spoon to a large bowl.\n            \n\n              Melt 5 tablespoons of the remaining butter in the skillet. Add the onions, celery, sage, thyme, 1 teaspoon salt and several grinds of pepper, and cook, stirring frequently, until the onions and celery are soft and lightly browned, about 10 minutes. Add the mixture to the bowl with the sausage; add the bread cubes, and toss to coat.\n            \n\n              Let the bread-sausage mixture cool to room temperature. Transfer it to a resealable plastic bag, label and date, and freeze for up to 2 weeks.\n            \n\n              To serve, preheat the oven to 350 degrees F. Butter a 9-by-13-inch baking dish. Heat the stock and 4 tablespoons of the remaining butter in a saucepan over medium-high heat until the butter melts. Whisk the eggs and parsley together in a large bowl. Break the frozen stuffing with your hands into smaller chunks, add to the bowl and toss. Add the stock-butter mixture, and toss to combine. Transfer to the prepared baking dish, and dot with the 2 remaining tablespoons butter. Cover tightly with foil, and bake until the stuffing is hot, 50 minutes to 1 hour. Uncover and continue to bake until golden brown on top, about 20 minutes more. Serve warm.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.5}, {"food": "sweet potatoes", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.5}, {"food": "celery seed", "quantity": 4.5}, {"food": "sage", "quantity": 1.0}, {"food": "thyme", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "barbecue loaf", "quantity": 1.5}, {"food": "diced chicken", "quantity": 2.0}, {"food": "eggs", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 0.5}], "title": "\nMake-Ahead Sausage Stuffing\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Put the turkey pieces on a rimmed baking sheet, and sprinkle lightly with salt and pepper. Roast until browned and cooked through, about 30 minutes.\n            \n\n              Transfer the roasted turkey pieces to a medium saucepan; scrape up any brown bits from the baking sheet, and add them to the saucepan. Add the stock, thyme and bay leaves. Bring to a simmer, then cook for 30 minutes to enrich the stock with roasted-turkey flavor. Strain the liquid into a heat-safe bowl, and keep warm.\n            \n\n              Melt the butter in the saucepan over medium-high heat. Add the flour, and whisk until the mixture is smooth, toasted and a deep golden brown. Slowly pour in the warm broth, whisking continuously, and continue whisking until the mixture comes to a simmer. Continue to cook, still whisking, until the gravy is thick and coats the back of a spoon, about 5 minutes more. Season to taste with salt and pepper.\n            \n\n              Let the gravy cool to room temperature. Transfer it to an airtight container or resealable plastic freezer bag, label and date, and freeze for up to 2 weeks.\n            \n\n              To serve, reheat the frozen gravy in a saucepan or a microwave. Be sure to whisk vigorously as the gravy heats up to keep lumps from forming. Adjust the seasoning as needed.\n            \n", "ingredients": [{"food": "smoked turkey roll", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "diced chicken", "quantity": 8.0}, {"food": "thyme", "quantity": 5.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "potato flour", "quantity": 0.5}], "title": "\nMake-Ahead Turkey Gravy\n"}, {"directions": "\n\n              Whip the cream, corn syrup and vanilla together with an electric mixer on medium-high speed until medium peaks form. Transfer to a shallow baking dish or pie pan and spread out into an even layer. Wrap well with plastic wrap, label and date and freeze for up to 2 weeks.\n            \n\n              To thaw: Remove from the freezer and let thaw in the refrigerator for 1 day before serving, or let sit at room temperature until thawed, about 1 hour.\n            \n", "ingredients": [{"food": "ice cream swich", "quantity": 2.0}, {"food": "silk light vanilla", "quantity": 0.3333333333333333}, {"food": "vanilla extract", "quantity": 0.5}], "title": "\nMake-Ahead Whipped Cream\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Roast the potatoes on a rimmed baking sheet until soft and tender, about 1 hour. Let cool for a few minutes, then use paper towels or a kitchen towel to help remove the skins.\n            \n\n              Process the sweet potato meat, butter, 1 1/2 teaspoons salt, cinnamon, allspice and cayenne in a food processor until smooth. Let cool to room temperature. Transfer to an airtight, microwave-safe container, label and date, and freeze for up to 2 weeks.\n            \n\n              To serve, reheat in the microwave, stirring often. Transfer to a serving dish, and top with the pecans and scallions.\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 3.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "cinnamon", "quantity": 0.5}, {"food": "allspice", "quantity": 1}, {"food": "pepper", "quantity": 1}, {"food": "pecans", "quantity": 0.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}], "title": "\nMake-Ahead Whipped Sweet Potatoes\n"}, {"directions": "\n\n              Cook the brown rice according to the package directions. Transfer to a large bowl and cool completely. \n            \n\n              Meanwhile, heat the oil in a large skillet over medium-high heat. Add the onions and cook, stirring frequently, until soft and lightly browned, about 4 minutes. Add the tomato paste, chile powder and cumin and cook, stirring, until fragrant, about 1 minute. Add the black beans, squash, 1 cup water and 1/2 teaspoon salt. Bring to a simmer and cook until the beans are soft and most of the liquid has reduced but the mixture is still slightly saucy, 8 to 10 minutes. Add the spinach, in batches if needed, and fold in until wilted. Allow to cool completely. \n            \n\n              Lay the tortillas out on a clean work surface. Put 1/2 cup of the rice in the center of each tortilla, about 1 inch from the edges, and top with about 1/2 cup of the bean filling. Sprinkle each with 2 heaping tablespoons Cheddar, and add a few dashes of hot sauce. Fold the edge nearest to you over the filling, fold in the sides and finish rolling up. Wrap tightly first in plastic wrap and then in foil, and freeze for up to 2 weeks. \n            \n\n              To reheat in a microwave: Wrap the frozen burrito in parchment paper and microwave on high until hot in the center, 4 to 5 minutes. \n            \n\n              For the crunchy oven method: Preheat the oven to 425 degrees F. Spray each side of the burrito generously with cooking spray and place seam-side down on a baking sheet. Cook until golden and crispy on the outside and hot inside, turning about halfway through, 25 to 30 minutes. \n            \n\n              Serve with reduced-fat sour cream, salsa and guacamole if desired.\n            \n", "ingredients": [{"food": "crisped rice bar", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "onion powder", "quantity": 2.0}, {"food": "cumin seed", "quantity": 1.0}, {"food": "fava beans", "quantity": 15.0}, {"food": "pineapple chunks", "quantity": 10.0}, {"food": "salt", "quantity": 1}, {"food": "mustard spinach", "quantity": 5.0}, {"food": "wheat flour", "quantity": 10.0}, {"food": "", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1}, {"food": "whiskey sour mix", "quantity": 1}], "title": "\nMake-it-don't-buy-it Frozen Vegetarian Burritos\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Coat a 2-quart baking dish with nonstick cooking spray.\n            \n\n              Whisk together both flours, 1/2 cup of the brown sugar, 1/4 cup cocoa, baking powder, and salt in a large bowl. In a separate bowl whisk 1/2 cup of the malt powder with the milk, egg white, butter, and vanilla until the malt dissolves. Stir into the dry ingredients until only a few small lumps remain and spread the batter in the prepared baking dish.\n            \n\n              Combine the remaining 1/4 cup of brown sugar with the remaining 2 tablespoons of cocoa and sprinkle over the batter. Stir the remaining 1/2 cup malt powder into the boiling water and pour it over the batter. Bake until the cake springs back when lightly touched and a toothpick inserted in the center comes out with a few moist crumbs, 30 to 35 minutes. Cool for 30 minutes on a wire rack. If desired, dust the top of the cake with confectioners' sugar and immediately spoon the warm cake and sauce onto plates or shallow bowls.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 0.6666666666666666}, {"food": "potato flour", "quantity": 0.3333333333333333}, {"food": "sugar", "quantity": 0.75}, {"food": "onion powder", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "salt", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "milk", "quantity": 0.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "coconut water", "quantity": 1.5}, {"food": "sugar", "quantity": 1}], "title": "\nMalted Chocolate Pudding Cake\n"}, {"directions": "\n\n              Whisk the flour, malted milk powder and baking powder in a medium bowl. Beat the butter and granulated sugar in a large bowl with a mixer on medium-high speed until light and fluffy, 3 to 5 minutes. Add the egg and vanilla and beat until incorporated. Reduce the mixer speed to low; add the flour mixture in 2 batches and beat until just incorporated. Divide the dough between 2 sheets of plastic wrap; shape each into a disk. Wrap and refrigerate until firm, 1 hour or overnight.\n            \n\n              Position racks in the upper and lower thirds of the oven; preheat to 350 degrees F. Line 2 baking sheets with parchment paper. Working with 1 disk at a time, roll out the dough on a floured surface until 1/4 inch thick. Cut out cookies with 2- to 3-inch cookie cutters; arrange about 1 inch apart on the prepared baking sheets. Reroll the scraps once and cut out more cookies. Freeze until firm, 5 to 10 minutes.\n            \n\n              Bake, switching the pans halfway through, until the cookies are golden around the edges, 12 to 15 minutes. Let cool 5 minutes on the baking sheets, then transfer to racks to cool completely.\n            \n\n              Make the royal icing: Whisk the confectioners' sugar and meringue powder in a large bowl. Add 5 tablespoons water; beat with a mixer on medium-high speed until soft glossy peaks form, adding up to 1 more tablespoon water if necessary. Tint as desired with food coloring. Spread or pipe on the cookies. Sprinkle with sanding sugar. Let set, 1 hour. Go to page 242 for decorating tips.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.25}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "butter oil", "quantity": 2.0}, {"food": "sugar", "quantity": 0.75}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "onion powder", "quantity": 2.0}, {"food": "", "quantity": 1}, {"food": "sugar", "quantity": 1}], "title": "\nMalted Sugar Cookies\n"}, {"directions": "\n\n              Slice a piece of cucumber and reserve for garnish. Peel, halve and seed the remaining cucumber. Puree in a blender until smooth, then strain through a fine mesh sieve.\n            \n\n              Fill a highball glass three-quarters of the way with ice. Add 2 ounces cucumber puree, the gin, lime juice and simple syrup and stir. (To make a batch of simple syrup, simmer equal parts sugar and water in a saucepan until the sugar dissolves, then cool.) Fill the glass with seltzer and stir again. Garnish with the reserved cucumber slice.\n            \n\n              Photograph by Jonathan Kantor\n            \n", "ingredients": [{"food": "cucumber", "quantity": 1.0}, {"food": "", "quantity": 1.25}, {"food": "lime juice", "quantity": 1}, {"food": "hearts of palm", "quantity": 1}, {"food": "", "quantity": 1}], "title": "\nMama's Little Helper\n"}, {"directions": "\n\n              Preheat a grill to medium-high. Place the 2 tablespoons vegetable oil, the olives, garlic, oregano, chili powder, paprika, coriander, cumin and allspice in a food processor; pulse until smooth. Scrape the mixture into a large bowl and stir in 2 tablespoons mayonnaise.\n            \n\n              Mix the pork into the olive mixture; season with salt and pepper. Shape into 4 patties, about 1/2 inch thick. Make a deep pocket in each; stuff with some manchego, then close the patty around the cheese.\n            \n\n              Brush the burgers with oil; season with salt and pepper. Brush the grill with oil; grill the burgers until marked on the bottom, 5 minutes. Flip and continue grilling until just cooked through, 5 more minutes.\n            \n\n              Brush the cut sides of the rolls with the remaining 1 tablespoon mayonnaise; grill until lightly toasted. Serve the burgers on the rolls with your choice of toppings.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "olives", "quantity": 0.25}, {"food": "garlic powder", "quantity": 4.0}, {"food": "", "quantity": 1.0}, {"food": "chili powder", "quantity": 1.0}, {"food": "smoked turkey roll", "quantity": 2.0}, {"food": "ground turkey", "quantity": 1.0}, {"food": "cumin seed", "quantity": 1.0}, {"food": "allspice", "quantity": 0.5}, {"food": "mayonnaise dressing", "quantity": 3.0}, {"food": "pork skins", "quantity": 1.25}, {"food": "salt", "quantity": 1}, {"food": "macaroni cheese", "quantity": 0.25}, {"food": "pizza rolls", "quantity": 4.0}, {"food": "onion powder", "quantity": 1}], "title": "\nManchego-Stuffed Pork Burgers\n"}, {"directions": "\n\n              Combine one-third of the mango, cilantro, jalapeno, lime juice and 1 teaspoon salt in a blender. Pulse until broken down but still chunky, scraping the inside of the carafe as necessary. Stir in the remaining mango, bell pepper and scallions.\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "", "quantity": 0.3333333333333333}, {"food": "salt", "quantity": 1}], "title": "\nMango Blender Salsa\n"}, {"directions": "\n\n              Whisk the mango pulp, sugar, lemon juice, cornstarch and salt in a medium saucepan. Whisk in the egg yolks.\n            \n\n              Cook the mixture over medium heat, whisking constantly, until it¿s thick like pudding, 5 to 7 minutes. Remove from the heat and whisk in the butter a few pieces at a time until incorporated.\n            \n\n              Strain the mixture through a fine-mesh sieve into a small bowl, pushing it through with a rubber spatula. Press plastic wrap directly onto the surface to prevent a skin from forming. Refrigerate until completely set, at least 4 hours and up to 5 days.\n            \n\n              Choose your fruit and mix up the ultimate spread.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "black bean mango", "quantity": 1.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "lemon juice", "quantity": 3.0}, {"food": "cornstarch", "quantity": 4.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "egg substitute", "quantity": 3.0}, {"food": "butter oil", "quantity": 3.0}], "title": "\nMango Curd\n"}, {"directions": "\n\n              Puree all ingredients in a blender until smooth. Refrigerate until ready to serve.\n            \n\nSpiced Simple Syrup:\n\n\n              Put all the ingredients in a small saucepan, and bring to a boil, stirring occasionally. When sugar is dissolved, remove from heat. Cool, strain, and refrigerate.\n            \n\n              Yield: about 2/3 cup\n            \n", "ingredients": [{"food": "black bean mango", "quantity": 0.5}, {"food": "silk plain soy yogurt", "quantity": 1.0}, {"food": "orange juice", "quantity": 0.25}, {"food": "", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "sugar", "quantity": 0.5}, {"food": "coconut water", "quantity": 0.5}, {"food": "drumstick pods", "quantity": 4.0}, {"food": "allspice", "quantity": 2.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "whole milk", "quantity": 1.0}], "title": "\nMango Lassi\n"}, {"directions": "\n\n              Make the topping: Combine 1 cup sugar, the lime zest, lime juice and 1 cup water in a small saucepan and bring to a boil, stirring to dissolve the sugar. Add the jalapeno slices, reduce the heat to medium and cook, stirring occasionally, until tender, about 10 minutes. Remove from the heat and let the jalapeno cool in the syrup, at least 1 hour.\n            \n\n              Strain the jalapeno; reserve the syrup. Spread 1/2 cup sugar on a small plate. One at a time, toss half of the jalapeno slices in the sugar until lightly coated. (Set the remaining jalapeno slices aside.) Let the sugared jalapeno slices dry until hardened, at least 4 hours or overnight.\n            \n\n              Make the crust: Preheat the oven to 350 degrees F. Pulse the remaining 1/4 cup sugar and 2 unsugared jalapeno slices in a food processor until ground. Add the cookie crumbs and butter and pulse to combine. Press into the bottom and up the side of a 9-inch pie plate. Bake until golden brown, 12 to 14 minutes. Transfer to a rack to cool completely.\n            \n\n              Make the filling: Combine the orange juice and gelatin in a small microwave-safe bowl and set aside to soften, about 5 minutes. Puree the mangoes in a blender until smooth, about 1 minute. Add the reserved jalapeno syrup, the vanilla and 1 teaspoon salt and puree until smooth. Microwave the juice-gelatin mixture until just hot and liquefied, about 30 seconds. Stir to make sure the gelatin is dissolved, then add to the mango mixture in the blender and puree until smooth. Strain the mango mixture through a fine-mesh sieve into a bowl, then pour into the cooled crust. Press a sheet of plastic wrap onto the surface to prevent a skin from forming. Refrigerate until set, at least 6 hours or overnight.\n            \n\n              Make the meringue: Combine the sugar, cornstarch, cream of tartar, egg whites and the remaining 1/2 teaspoon salt in a large heatproof bowl. Set the bowl over a medium saucepan of simmering water (do not let the bowl touch the water) and cook, stirring constantly, until the sugar dissolves and the egg whites are hot to the touch, 3 to 4 minutes. Remove the bowl from the water and beat with a mixer on medium-high speed until the mixture is light and fluffy and stiff peaks just form, about 2 minutes.\n            \n\n              Finely chop the remaining unsugared jalapeno slices and combine with a large spoonful of the meringue in a small bowl. Add to the remaining meringue and whisk to combine. Transfer to a piping bag fitted with a large open star tip. Pipe the meringue on top of the pie to make a dome with spiky peaks. Lightly brown the meringue with a kitchen torch and top with the reserved sugared jalapeno slices.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "sugar", "quantity": 1.75}, {"food": "grape juice", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.3333333333333333}, {"food": "butter oil", "quantity": 5.0}, {"food": "orange juice", "quantity": 0.25}, {"food": "onion powder", "quantity": 1.25}, {"food": "pineapple chunks", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "salt", "quantity": 1.5}, {"food": "sugar", "quantity": 1.0}, {"food": "cornstarch", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "egg substitute", "quantity": 5.0}], "title": "\nMango Meringue Pie with Candied Chiles\n"}, {"directions": "\n\n              Combine the mango pulp, agave syrup and three-quarters of the orange zest in a small saucepan. Using tongs, lightly char each bay leaf directly over the flame of a gas burner on high heat, 3 to 4 seconds. Add 2 of the toasted bay leaves to the mango mixture and bring to a boil, then remove from the heat and let cool completely.\n            \n\n              Pour the mango mixture into a small pitcher, discarding the soaked bay leaves. Stir in the mezcal and orange and lemon juices. Add ice and stir until well chilled, at least 15 seconds.\n            \n\n              Combine the salt and remaining orange zest on a plate. Dip the rims of 4 glasses in water, then dip in the orange salt to coat.\n            \n\n              Pour 2 tablespoons grenadine into each prepared glass. Fill the glasses with ice, then pour in the cocktail. Top with seltzer and garnish with the remaining toasted bay leaves.\n            \n\n              Photograph by Linda Xiao\n            \n", "ingredients": [{"food": "black bean mango", "quantity": 1.0}, {"food": "syrup", "quantity": 0.5}, {"food": "orange juice", "quantity": 1.5}, {"food": "chrysanthemum leaves", "quantity": 6.0}, {"food": "", "quantity": 1.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "salt", "quantity": 2.0}, {"food": "", "quantity": 0.5}, {"food": "dessert topping", "quantity": 1}], "title": "\nMango Mezcal Breeze\n"}, {"directions": "\n\n              Divide prepared rice pudding among bowls and top with chopped mango. Drizzle with warm dulce de leche and sprinkle with toasted coconut.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nMango Rice Pudding\n"}, {"directions": "\n\n              Combine the salmon and lime juice in a large bowl, making sure the salmon is fully submerged (add more lime juice if necessary to cover). Cover with plastic wrap and refrigerate 6 to 8 hours.\n            \n\n              Combine the cilantro, vinegar, sugar and 2 teaspoons salt in another large bowl. Drain the salmon, reserving 1/4 cup of the lime juice. Add the salmon and reserved lime juice to the cilantro mixture and toss; season with pepper. Cover and refrigerate, at least 1 hour or overnight.\n            \n\n              Just before serving, peel and dice the mango and avocado and dice the apple; fold into the ceviche. Drizzle with the sesame oil and sprinkle with the sesame seeds. Serve with tortilla chips.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "wild rice", "quantity": 1.5}, {"food": "lime juice", "quantity": 1.5}, {"food": "", "quantity": 2.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "sugar", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "black bean mango", "quantity": 1.0}, {"food": "avocado", "quantity": 1.0}, {"food": "breakfast tart", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "sesame seeds", "quantity": 1.0}, {"food": "potato chips", "quantity": 1}], "title": "\nMango Salmon Ceviche\n"}, {"directions": "\n\n              Toss 1 cup each diced mango and black beans with 1/4 cup diced red onion. Add 2 tablespoons each chopped pickled jalapenos and the liquid from the jar, chopped cilantro and lime juice. Season with salt. Serve in tortilla scoops.\n            \n", "ingredients": [], "title": "\nMango Salsa Scoops\n"}, {"directions": "\n\n              Fill 2 ice cube trays with the mango nectar; freeze until solid.\n            \n\n              Working in batches, puree the mango ice cubes, dark rum, coconut rum, Triple Sec, pineapple juice, and lime juice in a blender until smooth. Serve.\n            \n", "ingredients": [{"food": "mango nectar", "quantity": 2.5}, {"food": "", "quantity": 4.0}, {"food": "coconut water", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "grape juice", "quantity": 1.5}, {"food": "lime", "quantity": 1.0}], "title": "\nMango Tango\n"}, {"directions": "\n\n              Stir the chia seeds and coconut milk together in a small bowl. Allow to sit for 30 minutes so that the chia seeds plump slightly.\n            \n\n              Put the mango, 2 tablespoons cold water, honey if using, lime juice and ice cubes into a blender. Blend on high until very smooth. Add the chia seed and coconut milk mixture and pulse until just combined; avoid blending the chia seeds too much. Add 1 to 2 tablespoons of cold water if needed to adjust consistency.\n            \n", "ingredients": [{"food": "chia seeds", "quantity": 1.0}, {"food": "coconut milk", "quantity": 0.5}, {"food": "black bean mango", "quantity": 0.75}, {"food": "honey smoked ham", "quantity": 1.0}, {"food": "lime juice", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 0.75}], "title": "\nMango, Coconut and Chia Smoothie\n"}, {"directions": "\n\n              Combine the sugar and 1/2 cup water in a medium saucepan and bring to a simmer over medium-high heat. Cook, stirring occasionally, until the sugar dissolves, about 1 minute; transfer to a blender and let cool completely.\n            \n\n              Add the mango nectar, cubed mango, lime juice and a pinch of salt to the blender and puree until smooth. Press through a fine-mesh sieve into an 8-inch-square stainless-steel or glass baking dish.\n            \n\n              Freeze until ice crystals begin forming around the edges, about 45 minutes. Use a fork to scrape the crystals toward the center of the pan, then continue freezing, scraping every 30 minutes, until frozen, about 4 hours. Serve topped with chile powder.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "sugar", "quantity": 0.75}, {"food": "mango nectar", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1.0}, {"food": "", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "onion powder", "quantity": 1}], "title": "\nMango-Chile Granita\n"}, {"directions": "\n\n              Combine the sugar, chopped chiles and 1/2 cup water in a small saucepan. Bring to a boil, reduce the heat to medium and cook, stirring occasionally, until the sugar is dissolved. Transfer to a small bowl and refrigerate until cold, at least 1 hour.\n            \n\n              Combine the rum, mango nectar and yuzu juice in a pitcher. Strain the chile syrup into the pitcher; stir until incorporated. Divide among ice-filled glasses. Add a few drops of grenadine to each drink and top with a splash of seltzer. Garnish with a halved chile.\n            \n\n              Photograph by Ryan Liebe\n            \n", "ingredients": [{"food": "sugar", "quantity": 0.5}, {"food": "ruby red grapefruit juice blend", "quantity": 3.0}, {"food": "martha white foods", "quantity": 1.0}, {"food": "mango nectar", "quantity": 1.0}, {"food": "grape juice", "quantity": 0.25}, {"food": "", "quantity": 0.5}, {"food": "", "quantity": 1}], "title": "\nMango-Chile Sunrise\n"}, {"directions": "\n\n              Bring a large saucepan of salted water to a boil over high heat. Add the rice and cook, stirring until tender, 25 to 35 minutes (depending on the rice blend).\n            \n\n              Meanwhile, bring a separate saucepan of salted water to a boil over medium-high heat. Add the quinoa and cook until tender, about 12 minutes.\n            \n\n              Drain the grains and rinse under cold water until cool; shake off the excess water.\n            \n\n              Whisk the lime juice and zest, the peanut oil, sugar, 1 teaspoon salt, and pepper to taste in a large bowl. Add the rice mixture, mango, cucumber, jalapeno, scallions, cilantro and peanuts and stir to combine. Season with salt.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "crisped rice bar", "quantity": 1.5}, {"food": "quinoa", "quantity": 0.25}, {"food": "grape juice", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "sugar", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "black bean mango", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "", "quantity": 0.5}, {"food": "peanuts", "quantity": 0.3333333333333333}], "title": "\nMango-Cucumber Rice Salad\n"}, {"directions": "\n\n              Combine 3 cups guava nectar, 1 cup milk, 1 1/2 teaspoons vanilla and 3 tablespoons sugar in a large bowl; add 3 cups frozen mango chunks. Working in batches, puree in a blender until smooth and frothy. Divide among small glasses.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [], "title": "\nMango-Guava Batidos\n"}, {"directions": "\n\n              Whisk 1/2 cup mayonnaise, 1/4 cup hot mango chutney, the juice of 3 limes, 1/2 teaspoon kosher salt and 1/2 to 1 finely chopped Thai chile in a large bowl. Add 8 cups shredded coleslaw mix, 1 julienned mango, 1 thinly sliced red bell pepper and 4 sliced scallions; toss. Refrigerate 2 hours. Toss with 1/2 cup fresh cilantro and 1/2 cup chopped peanuts before serving.\n            \n\n              Photograph by Bobbi Lin\n            \n", "ingredients": [], "title": "\nMango-Peanut Slaw\n"}, {"directions": "\n\n              Juice, in this order, the mango, pineapple and limes, following your juicer's specific settings for each. Stir in the chia seeds if using and let soak for 5 minutes. Serve the juice immediately over ice, if desired.\n            \n", "ingredients": [{"food": "black bean mango", "quantity": 1.0}, {"food": "pineapple chunks", "quantity": 2.0}, {"food": "limes", "quantity": 2.0}, {"food": "chia seeds", "quantity": 1.0}], "title": "\nMango-Pineapple Juice\n"}, {"directions": "\n\n              Combine the lime zest and 1 tablespoon salt on a small plate. Moisten the rim of 4 glasses with lime wedges; dip in the salt mixture.\n            \n\n              Puree the tequila, orange liqueur, lime juice, frozen mango and 2 cups ice in a blender until smooth. Pour into the prepared glasses and garnish with lime wedges.\n            \n", "ingredients": [{"food": "lime juice", "quantity": 1.75}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 6.0}, {"food": "orange", "quantity": 8.0}, {"food": "black bean mango", "quantity": 4.0}], "title": "\nMango-Rita\n"}, {"directions": "\n\n              Pour the beers into an 8-by-8-inch baking dish. Freeze until slushy, whisking every 30 minutes, for about 4 hours. Meanwhile, put the cherries in a small bowl and pour the orange liqueur over. Cover and refrigerate for 4 hours. \n            \n\n              For each cocktail, spoon about 1 cup beer slush into a rocks glass. Pour 1 3/4 ounces sweet vermouth, 1 1/2 ounces bourbon and 3 dashes bitters into a cocktail shaker. Fill with ice, shake and strain over the slush in the glass. Garnish with 2 liqueur-soaked cherries. Serve immediately.\n            \n\n              Copyright 2013 Television Food Network, G.P. All rights reserved\n            \n\n              From Food Network Kitchens\n            \n", "ingredients": [{"food": "", "quantity": 12.0}, {"food": "frozen yogurt", "quantity": 12.0}, {"food": "orange", "quantity": 3.0}, {"food": "sweet potatoes", "quantity": 10.5}, {"food": "", "quantity": 9.0}, {"food": "", "quantity": 2.0}], "title": "\nManhattan Beer Slushie\n"}, {"directions": "\n\n              Heat the oil in a large pot over medium heat. Add the onion, celery, garlic, and crushed red pepper and cook, covered, stirring occasionally, until soft, about 8 minutes. Stir in the tomato paste and cook, stirring, for about 1 minute more. Tie the parsley sprigs, fresh thyme, and bay leaf together with a piece of kitchen twine and add to the pot with the potatoes. Pour in the clam juice and bring to a boil. Lower the heat and simmer, covered, until the potatoes are tender, about 10 minutes. Stir in the tomatoes and clams. Cover and bring to a low simmer. Season with pepper to taste. Divide among warm soup bowls and sprinkle with the parsley. Serve immediately.\n            \n\n              Copyright 2001 Television Food Network, G.P. All rights reserved\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.5}, {"food": "onion powder", "quantity": 1.0}, {"food": "celery seed", "quantity": 1.5}, {"food": "garlic powder", "quantity": 7.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1}, {"food": "pasta with tomato sauce", "quantity": 0.25}, {"food": "parsley", "quantity": 3.0}, {"food": "thyme", "quantity": 3.0}, {"food": "corier leaf", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.75}, {"food": "grape juice", "quantity": 5.0}, {"food": "pasta with tomato sauce", "quantity": 28.0}, {"food": "", "quantity": 1.5}, {"food": "salt", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "parsley", "quantity": 2.0}], "title": "\nManhattan Clam Chowder\n"}, {"directions": "\n\n              Cook the bacon in a Dutch oven or large pot over medium-high heat, stirring occasionally, until slightly browned, about 3 minutes. Add the celery, potatoes, onion, carrot, garlic, bay leaves, thyme, 1 teaspoon salt and 1/2 teaspoon pepper. Cook, stirring occasionally, until the celery and onion begin to soften, about 3 minutes.\n            \n\n              Add the tomatoes to the pot and cook 2 minutes. Add the clams and their juices, 1 cup water and the bottled clam juice; cover and bring to a boil. Reduce the heat to medium and simmer, covered, until the potatoes are tender, 20 to 25 minutes. Season with salt and pepper. Serve with oyster crackers.\n            \n\n              Per serving: Calories 408; Fat 17 g (Saturated 6 g); Cholesterol 65 mg; Sodium 1,184 mg; Carbohydrate 39 g; Fiber 6 g; Protein 24 g\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [{"food": "bacon", "quantity": 3.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "sweet potatoes", "quantity": 3.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "carrot juice", "quantity": 1.5}, {"food": "garlic powder", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 6.0}, {"food": "salt", "quantity": 1}, {"food": "tomatoes", "quantity": 1.0}, {"food": "frozen yogurt", "quantity": 1.0}, {"food": "grape juice", "quantity": 2.0}, {"food": "crackers", "quantity": 1}], "title": "\nManhattan Clam Chowder\n"}, {"directions": "\n\n              Bring a large pot of water to a boil over high heat, and season generously with salt. Fill a medium bowl with ice water and season with salt, as well. Boil the spinach, uncovered, until tender, about 3 to 4 minutes. Remove with a slotted spoon, (do not drain), and immediately plunge the spinach into the ice water. Drain and squeeze the excess water from the spinach, and finely chop. Alternatively, if using thawed spinach, simply squeeze, and finely chop.\n            \n\n              In the same large pot of boiling water, cook the pasta shells until al dente, tender but still slightly firm. Drain and pat dry.\n            \n\n              Preheat the oven to 350 degrees F.\n            \n\n              Cover the bottom of a 9- x 13-inch ovenproof baking dish with 1 cup of the marinara sauce. In a medium mixing bowl, evenly combine the ricotta, mozzarella, and 1/3 cup of the Parmesan, the eggs, and the spinach. Season with the 1/2 teaspoon salt, nutmeg, and pepper to taste. Spoon the cheese mixture into the manicotti shell and line them up in the baking dish. Cover with the remaining sauce. Scatter the remaining cheese on top and dot with the butter. Bake for 30 minutes. Serve immediately.\n            \n\nMARINARA SAUCE\n\n\n              Heat the oil in a medium saucepan over medium-high heat. Saute the onion and garlic, stirring, until lightly browned, about 3 minutes. Add the tomatoes and the herb sprigs and bring to a boil. Lower the heat and simmer, covered, for 10 minutes.\n            \n\n              Remove and discard the herb sprigs. Stir in the salt and season with pepper to taste. Use now, or store covered in the refrigerator for up to 3 days, or freeze for up to 2 months.\n            \n\n              Yield: 3 1/2 cups\n            \n\n              Copyright 2001 Television Food Network, G.P. All rights reserved.\n            \n", "ingredients": [{"food": "mustard spinach", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "tostada shells", "quantity": 12.0}, {"food": "Worcestershire sauce", "quantity": 3.0}, {"food": "macaroni cheese", "quantity": 1.5}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "nutmeg", "quantity": 1}, {"food": "pepper", "quantity": 1}, {"food": "diced chicken", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.25}, {"food": "garlic powder", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.5}, {"food": "hearts of palm", "quantity": 1}, {"food": "hearts of palm", "quantity": 1}, {"food": "salt", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nManicotti\n"}, {"directions": "\n\n              For the crust: Pour the flour, cornmeal, sugars and salt into the bowl of a food processor fitted with a metal blade and process to combine. Scatter the butter over the top and pulse with the dry mixture to coat, and then continue pulsing until cool and almost sandy, about eight 3-second pulses. Drizzle the yolk over the top, and pulse again until the ingredients are moist and barely starting to clump, about another 8 pulses. The dough should just hold together when you squeeze it in your palm. If not, add 1 teaspoon of cold water and pulse briefly. \n            \n\n              Turn the dough out onto a lightly-floured work surface. Smear out the dough across the work surface using the heel of your hand until it begins to come together. Gather the dough back together and shape it into a disc. Wrap in plastic and chill for 1 hour. \n            \n\n              Let the dough warm up slightly before rolling it out (if you roll it while it is cold, it will crack). Roll the dough on a lightly-floured work surface with a rolling pin into a 1/8 to 3/16-inch-thick circles, 10 to 11 inches in diameter. Fit the dough into an 8-inch tart pan with a removable bottom. Don't worry if it cracks a bit; you can patch it with some of the trimmings. Press the dough firmly into the bottom of the pan where it meets the sides, and then roll the rolling pin across the pan to cut off the overhang. Press the dough firmly against the sides of the pan and back up to the top using your fingers (sometimes the rolling pin pushes the dough down the sides of the pan a bit). Chill in the refrigerator for 30 minutes. \n            \n\n              Preheat the oven to 350 degrees F. Position the rack on the lowest rung of the oven and put a baking sheet on top. Line the chilled crust with a 10-inch coffee filter and weight it down with dried beans or rice. Place on the hot baking sheet and bake until the sides begin to turn golden brown, 15 to 20 minutes. Remove the shell from the oven, carefully remove the beans and filter and then return to the oven until completely golden brown and baked through, another 10 to 15 minutes. Reduce the heat to 325 degrees F. Let cool before adding the filling, about 10 minutes. \n            \n\n              For the filling: Pulse the maple sugar, flour and salt in a food processor until combined. Add the melted butter and pulse to combine, and then add the buttermilk and vanilla and pulse to combine again. Add the eggs and pulse until just combined-don't over-mix. Strain into the tart shell. Bake the tart until the sides are set (they may puff slightly) and the middle still jiggles slightly when you tap the pan, 30 to 35 minutes. Cool on a rack for at least 45 minutes. Serve warm or at room temperature, garnished with cookies as desired.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.0}, {"food": "cornmeal", "quantity": 2.0}, {"food": "sugar", "quantity": 2.0}, {"food": "sugar", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 6.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "sugar", "quantity": 1}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "potato flour", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 5.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.75}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}], "title": "\nMaple Buttermilk Tart\n"}, {"directions": "\n\n              Line the bottom and sides of a 9-by-5-inch loaf pan with parchment paper; brush the parchment with vegetable oil. Bring the maple syrup to a boil in a large saucepan over medium heat, then reduce the heat to medium low. Dip the back of a spoon in vegetable oil and run it over the top of the foam to help it subside. Increase the heat to medium and continue cooking until a candy thermometer registers 246 degrees F, 25 to 30 minutes. Pour the syrup into a heatproof bowl and let cool, 5 minutes. \n            \n\n              Beat the syrup with a mixer on medium-low speed until it starts to lighten in color and turn opaque, 30 seconds to 1 minute. Pour into the prepared pan and spread with an offset spatula; let cool completely, about 1 hour. Lift out of the pan and cut into pieces.\n            \n\n              Photograph by Sam Kaplan\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1}, {"food": "syrup", "quantity": 2.0}], "title": "\nMaple Candy\n"}, {"directions": "\n\n              1. Preheat the oven to 300 degrees F. In a small saucepan, bring maple syrup to a simmer over medium heat. Reduce heat and continue to cook stirring until slightly reduced and thickened, 3 to 5 minutes. (The syrup will foam up a bit as it simmers.) Stir in the butter and chipotle until the butter melts.\n            \n\n              2. Toss the nuts in a medium bowl with the maple mixture to coat evenly, season with 3/4 teaspoon. Spread the nuts out in a single layer on a parchment-lined baking sheet. Bake until golden, stirring occasionally, 20 to 25 minutes. Stir and cool completely. Serve.\n            \n", "ingredients": [{"food": "syrup", "quantity": 0.5}, {"food": "butter oil", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "mixed nuts", "quantity": 2.0}, {"food": "salt", "quantity": 1}], "title": "\nMaple Chipotle Nuts\n"}, {"directions": "\n\n              Pour enough oil in a large skillet so it's about 1 inch deep. Heat oil over medium-high heat until a deep-fry thermometer registers between 280 to 300 degree F.\n            \n\n              Meanwhile, whisk together the flour, sugar, baking powder and salt in a large bowl. Make a well in the center; add the milk, egg, and 1 tablespoon maple syrup. Whisk the dry and wet ingredients together until smooth.\n            \n\n              Transfer batter into a large size pastry bag with a # 3 or 4 open tip. Carefully squeeze batter in a circular pattern and then back and forth into the oil, to make a free form spider web-like design, about 3 to 4 inches in diameter. Cook until bottoms are golden, about 2 minutes. Using tongs or slotted spoon, turn fritters over and cook until golden on other side, about 1 minute more. Transfer the fritters to paper towels to drain briefly. Brush lightly with maple syrup and dust with confectioners' sugar. Repeat with remaining batter. Serve warm or at room temperature alone or with the garnishes.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1}, {"food": "potato flour", "quantity": 1.5}, {"food": "sugar", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "cinnamon", "quantity": 0.75}, {"food": "salt", "quantity": 0.125}, {"food": "milk", "quantity": 0.75}, {"food": "egg substitute", "quantity": 1.0}, {"food": "syrup", "quantity": 1.25}, {"food": "sugar", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}], "title": "\nMaple Cinnamon Spider Web Fritters\n"}, {"directions": "\n\n              1. Preheat the oven to 400 degrees F. Combine the mustard and oil with a fork. Add the maple syrup, vinegar, 1/2 teaspoon salt, and 1/2 teaspoon pepper and stir briskly until combined. \n            \n\n              2. Salt the flank steak on both sides and spoon half the marinade over the steak. Allow to marinate at room temperature, about 15 minutes. \n            \n\n              3. In the meantime, wash the endive, pat dry, and cut into quarters, keeping the stems intact. Lay the endive on a baking sheet and drizzle with olive oil and salt to taste. Roast until the endive begins to soften and brown at the edges, about 15 minutes. Sprinkle with the lemon juice and garnish with parsley.\n            \n\n              4. Turn the oven up to broil. Place the flank steak in the broiler and broil for 4 minutes. Flip and broil until nicely charred and an instant read thermometer reads 110 degrees F, about 4 minutes on the other side. Let rest 10 minutes before slicing.\n            \n\n              5. Slice the steak across the grain and spoon the remaining marinade over top. Serve with the endive and more mustard on the side.\n            \n", "ingredients": [{"food": "rye grain", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "syrup", "quantity": 0.5}, {"food": "vinegar", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 1.5}, {"food": "endive", "quantity": 4.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "parsley", "quantity": 1}], "title": "\nMaple Glazed Flank Steak with Roasted Endive\n"}, {"directions": "\n\n              Preheat oven to 225 degrees F.\n            \n\n              In a small saucepan, combine the oil and syrup and heat, stirring, over low heat. Remove from the heat and add the vanilla extract.\n            \n\n              In a large bowl, toss together the wheat germ, sesame seeds, coconut, oats, pumpkin seeds, cashews, and almonds. Add the syrup mixture and stir to coat evenly. Spread the granola mixture out on a baking sheet. Bake until golden brown, about an 1 hour and 30 minutes. Stir the mixture occasionally while baking so it toasts evenly.\n            \n\n              Transfer the warm toasted granola to a large bowl and stir in the dried fruits and let cool. Store in a tightly sealed container a room temperature for 2 weeks or freeze for up to 2 months.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.25}, {"food": "syrup", "quantity": 0.6666666666666666}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "wheat germ", "quantity": 0.5}, {"food": "sesame seeds", "quantity": 0.25}, {"food": "coconut water", "quantity": 0.5}, {"food": "oats", "quantity": 3.5}, {"food": "pumpkin flowers", "quantity": 0.5}, {"food": "", "quantity": 0.5}, {"food": "whole milk", "quantity": 0.5}, {"food": "diced chicken", "quantity": 1.0}], "title": "\nMaple Granola\n"}, {"directions": "\n\n              Preheat the oven to 225 degrees F. Toss the oats, almonds, pecans, pumpkin seeds, wheat germ and sesame seeds in a large bowl. \n            \n\n              Melt the butter with 2 tablespoons maple syrup in a small saucepan over medium-low heat. Remove from the heat and stir in the vanilla. Pour the syrup mixture over the oat mixture and stir to coat evenly. \n            \n\n              Spread the mixture on a baking sheet. Bake until golden brown, stirring occasionally, about 1 1/2 hours. Remove the mixture from the oven, but leave the oven on. \n            \n\n              Transfer the granola to a large bowl. Stir in the remaining maple syrup, the dried fruit and egg whites. Spray twelve 1/2-cup nonstick muffin cups with nonstick cooking spray and firmly press about 1/3 cup of the mixture into each. Bake until set, about 45 minutes. \n            \n\n              Transfer the muffin tin to a rack and cool 15 minutes before unmolding. Store cooled granola up to 1 month at room temperature in a tightly sealed container.\n            \n\n              From Food Network Kitchen\n            \n", "ingredients": [{"food": "oats", "quantity": 1.5}, {"food": "pork skins", "quantity": 0.25}, {"food": "pecans", "quantity": 0.25}, {"food": "pumpkin flowers", "quantity": 0.25}, {"food": "wheat germ", "quantity": 0.25}, {"food": "sesame seeds", "quantity": 2.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "syrup", "quantity": 0.3333333333333333}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "mixed nuts", "quantity": 1.0}, {"food": "egg substitute", "quantity": 2.0}, {"food": "", "quantity": 1}], "title": "\nMaple Granola To-Go Breakfast Cookies\n"}, {"directions": "\n\n              Whisk the flour, baking powder, salt and nutmeg in a large bowl; make a well in the center. In another large bowl, whisk the eggs, granulated sugar, maple sugar, vegetable oil and maple extract until well combined. Pour the egg mixture into the well in the flour mixture and whisk until incorporated.\n            \n\n              Preheat a pizzelle iron until a drop of water sizzles on the surface, about 10 minutes. Lightly brush the hot surface with vegetable oil. Spoon about 1 tablespoon batter into the center of the imprint (if you have a pizzelle iron with more than one imprint, fill each with 1 tablespoon batter). Close the iron and cook until there is no more steam coming out, about 45 seconds.\n            \n\n              Open and remove the pizzelle from the iron using a small offset spatula and transfer to a rack to cool (the pizzelle will crisp as they cool). Repeat with the remaining batter, lightly brushing the iron with more vegetable oil occasionally. Lightly dust the pizzelle with confectioners' sugar before serving.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 1.5}, {"food": "salt", "quantity": 0.25}, {"food": "nutmeg", "quantity": 0.25}, {"food": "eggs", "quantity": 3.0}, {"food": "sugar", "quantity": 0.75}, {"food": "sugar", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "vanilla extract", "quantity": 0.25}, {"food": "sugar", "quantity": 1}], "title": "\nMaple Pizzelle\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F.\n            \n\n              In a 13 by 9-inch baking dish, combine the butter, maple syrup, brown sugar, and brandy. Peel the pears, halve lengthwise, and remove the seeds with a melon baller or teaspoon. Add the pears to the baking dish and coat with the maple mixture. Arrange the pears cut-side down, and bake until tender, about 50 minutes, basting occasionally. Meanwhile, put the cranberries in a small bowl and cover with hot water; set aside until plump. Drain and coarsely chop the cranberries.\n            \n\n              Transfer the pears to plates. Pour the baking juices into a small bowl, and whisk in 1 or 2 teaspoons of water to blend into a sauce. Top each pear with a small scoop of frozen yogurt, and scatter granola and cranberries over the pears. Drizzle the syrup over the top. Serve immediately.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 3.0}, {"food": "syrup", "quantity": 0.25}, {"food": "sugar", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "prickly pears", "quantity": 8.0}, {"food": "cranberries", "quantity": 0.25}, {"food": "frozen yogurt", "quantity": 2.0}, {"food": "granola bar", "quantity": 0.25}], "title": "\nMaple Roasted Pears\n"}, {"directions": "\n\n              Make the cookies: Whisk the flour, baking powder and salt in a medium bowl. Beat the butter and maple sugar in a large bowl with a mixer on medium-high speed until fluffy, 4 minutes. Add the egg and vanilla; beat until combined. Reduce the mixer speed to medium low; add the flour mixture and beat until just combined. Transfer the dough to a sheet of plastic wrap; shape into a disk. Wrap and refrigerate until firm, at least 1 hour.\n            \n\n              Position racks in the upper and lower thirds of the oven; preheat to 350 degrees F. Divide the dough into thirds. Working with 1 piece at a time, roll out the dough on a floured surface until 1/8 inch thick. Cut out stars with a 2-inch cutter; arrange 1 inch apart on 2 ungreased baking sheets and sprinkle with gold sugar. Refrigerate the cutouts 15 minutes.\n            \n\n              Bake, switching the pans halfway through, until the cookies are set and lightly browned on the bottoms, 13 to 16 minutes. Let cool completely on the baking sheets.\n            \n\n              Make the filling: Melt the white chocolate in the microwave in 30-second intervals, stirring, until smooth. Let cool. Stir in the butter with a rubber spatula, then stir in the confectioners¿ sugar, maple extract and lemon juice until smooth. Sandwich between the cookies.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.25}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "hearts of palm", "quantity": 1}, {"food": "butter oil", "quantity": 6.0}, {"food": "sugar", "quantity": 0.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "sugar", "quantity": 1}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "sugar", "quantity": 0.25}, {"food": "vanilla extract", "quantity": 0.25}, {"food": "lemon juice", "quantity": 0.5}], "title": "\nMaple Stars\n"}, {"directions": "\n\n              Preheat the oven to 325 degrees F. Cut a piece of foil 8 by 16-inches. Butter the corners and sides of an 8-by-8-inch baking pan. Line the pan with the foil, leaving an overhang on two sides.\n            \n\n              Beat the butter and sugar in the bowl of an electric mixer fitted with the paddle attachment on medium-high speed until light and fluffy, about 5 minutes. Reduce the speed to medium and add the egg yolk, syrup, vanilla extract and vanilla bean seeds if using. Reduce the speed to low, add the flours and salt, all at once, and beat until just combined. Add the walnuts and continue to mix until fully combined.\n            \n\n              Using your hands, drop the dough in pieces evenly into the prepared pan. Flour your hands lightly and press the dough together and into the corners of the pan. Put a piece of waxed paper on top of the dough and use something square and heavy-another pan, a pound of cold butter-to press the dough into the pan and make a smooth, even top. Chill until firm, about 30 minutes.\n            \n\n              When it is firm, use a fork to score the dough all over. Bake until deep golden brown and starting to pull away from the sides of the pan, about 45 minutes. Cool completely on a rack, about 2 hours, then wrap with plastic wrap, and let sit at room temperature overnight.\n            \n\n              Place a lightweight cutting board or a baking rack over the top of the pan. Flip and set on the counter. Gently pull the pan from the foil and the foil from the pan to lift off the pan. Gently peel the foil off the bar. Place another lightweight cutting board on top, and flip the bar right-side-up.\n            \n\n              Using a sharp, serrated knife, slice the square in half. Then slice each half into 8 bars.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 2.0}, {"food": "sugar", "quantity": 0.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "syrup", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "potato flour", "quantity": 1.75}, {"food": "rice flour", "quantity": 0.25}, {"food": "sea lion", "quantity": 0.25}, {"food": "walnuts", "quantity": 1.5}], "title": "\nMaple Walnut Shortbread Bars\n"}, {"directions": "\n\n              sToppings: Apple butter, crisp bacon and maple syrup on cheesy skins\n            \n\n              How to Make Classic Potato Skins:\n            \n\n              Pierce 4 large russet potatoes with a fork. Bake directly on the oven rack at 350 degrees until tender, about 1 hour. Let cool, then quarter lengthwise and scoop out the flesh, leaving a 1/4-inch shell. Brush both sides with melted butter and season with salt and pepper. Bake, skin-side up, at 450 degrees until crisp, about 15 minutes. Add your favorite team toppings. (For cheesy skins, flip the baked shells over before topping, sprinkle with 1 cup grated cheddar cheese and bake an extra 5 minutes.)\n            \n\n              See all 32 Team Potato Skins\n            \n\n              Photograph by Karl Juengel/Studio D\n            \n", "ingredients": [], "title": "\nMaple-Bacon Potato Skins\n"}, {"directions": "\n\n              Pat the chicken dry and season all over with salt. Heat a large heavy skillet over high heat and add the olive oil. When the oil is hot, add the chicken skin-side down and cook, undisturbed, until the skin is browned and crisp, about 5 minutes.\n            \n\n              Turn the chicken and add the apples, shallots and sage to the skillet. Reduce the heat to medium high and cook until the chicken is browned on the bottom, 4 to 5 minutes. Transfer the chicken to a plate and continue to cook the apples and shallots, stirring, until golden, about 2 more minutes.\n            \n\n              Meanwhile, make the glaze: Mix the chicken broth, maple syrup, vinegar and 1/2 teaspoon salt in a small bowl. Add the mixture to the skillet with the apples and shallots and boil until reduced by about three-quarters, 2 to 3 minutes. Return the chicken to the skillet, turning to coat, until cooked through, about 2 more minutes.\n            \n\n              Photograph by Antonis Achilleos\n            \n\n              Pat the chicken dry and season all over with salt. Heat a large heavy skillet over high heat and add the olive oil. When the oil is hot, add the chicken skin-side down and cook, undisturbed, until the skin is browned and crisp, about 5 minutes.\n            \n\n              Turn the chicken and add the apples, shallots and sage to the skillet. Reduce the heat to medium high and cook until the chicken is browned on the bottom, 4 to 5 minutes. Transfer the chicken to a plate and continue to cook the apples and shallots, stirring, until golden, about 2 more minutes.\n            \n\n              Meanwhile, make the glaze: Mix the chicken broth, maple syrup, vinegar and 1/2 teaspoon salt in a small bowl. Add the mixture to the skillet with the apples and shallots and boil until reduced by about three-quarters, 2 to 3 minutes. Return the chicken to the skillet, turning to coat, until cooked through, about 2 more minutes.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "shallots", "quantity": 8.0}, {"food": "sage", "quantity": 0.25}, {"food": "diced chicken", "quantity": 0.5}, {"food": "syrup", "quantity": 0.25}, {"food": "vinegar", "quantity": 0.25}, {"food": "diced chicken", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "shallots", "quantity": 8.0}, {"food": "sage", "quantity": 0.25}, {"food": "diced chicken", "quantity": 0.5}, {"food": "syrup", "quantity": 0.25}, {"food": "vinegar", "quantity": 0.25}], "title": "\nMaple-Glazed Chicken\n"}, {"directions": "\n\n              For the polenta: Heat the olive oil in a small skillet over medium heat. Add the sage to the oil and cook until the sage is slightly crisped, about 1 minute. Remove from the heat and set aside. Meanwhile, put the broth and milk in a medium saucepan and bring to a boil over high heat. Slowly whisk in the polenta, reduce the heat to low, and cook, whisking occasionally, until the polenta is thick and creamy, about 15 minutes. Pull the saucepan from the heat and whisk in the pumpkin, sage with the oil, cheese, salt, and pepper. Hold in a warm place.\n            \n\n              For the pork chops: Heat a large skillet over medium-high heat. Dry the pork chops well and season with salt and pepper, to taste. Add the oil to the pan and heat until shimmering. Lay the chops in the pan and cook until lightly browned on the first side, about 4 minutes. Turn the chops and cook until the second side is browned and the chops are cooked through, about 3 minutes more. Transfer the chops to a platter.\n            \n\n              Pour off the excess oil from the pan. Add the vinegar, and return the pan to the heat and use a wooden spoon to scrape up any brown bits that cling to the pan. Stir in the mustard, maple syrup, and chicken broth, along with any juices from the pork chops. Cook over high heat until the mixture is syrupy, about 5 minutes. Season to taste.\n            \n\n              Serve the pork chops with the pumpkin polenta and drizzle with the sauce.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 4.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "milk", "quantity": 2.0}, {"food": "", "quantity": 0.6666666666666666}, {"food": "pumpkin flowers", "quantity": 1.5}, {"food": "", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "pork loin", "quantity": 4.0}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "syrup", "quantity": 0.25}, {"food": "diced chicken", "quantity": 0.25}], "title": "\nMaple-Glazed Pork Chops with Pumpkin Polenta\n"}, {"directions": "\n\n              Position wire racks on 2 rimmed baking sheets. Lay 1 pound bacon in a single layer on the racks and bake 7 minutes at 375 degrees F. Brush with maple syrup and continue baking until caramelized, about 25 minutes, flipping, brushing with syrup and seasoning with pepper every 5 minutes. Let cool 5 minutes on the racks.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [], "title": "\nMaple-Pepper Bacon\n"}, {"directions": "\n\n              Thread a small chunk each of Black Forest ham, weisswurst or bratwurst, and slab bacon onto 12 small skewers. Bake on a foil-lined baking sheet at 450 degrees F until just starting to brown, about 10 minutes. Mix 3 tablespoons maple syrup with a pinch of cayenne; brush on both sides of the skewers and sprinkle generously with coarsely ground black pepper. Continue baking until the bacon is crisp, 7 to 9 more minutes. Brush with the remaining syrup mixture and sprinkle with more black pepper.\n            \n\n              Photograph by Ryan Liebe\n            \n", "ingredients": [], "title": "\nMaple-Pepper Meat Skewers\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Toss the sweet potatoes on a large, foil-lined rimmed baking sheet with the oil; season, to taste, with salt and pepper. Roast the potatoes for 20 minutes.\n            \n\n              Remove the pan from the oven and toss the potatoes with the syrup.\n            \n\n              Back in the oven, roast, tossing twice, until the potatoes are beginning to brown and are tender, about 15 minutes more. To serve, sprinkle warm potatoes with freshly grated lemon zest, sea salt, and nutmeg to taste.\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "syrup", "quantity": 1.0}, {"food": "lemon juice", "quantity": 0.5}, {"food": "nutmeg", "quantity": 1}], "title": "\nMaple-Roasted Sweet Potatoes\n"}, {"directions": "\n\nFor the cake and filling:\n\n\n              Make the frosting: Whisk the egg whites and maple sugar in a heatproof bowl set over a saucepan of simmering water (do not let the bowl touch the water) until the mixture is warm and the sugar dissolves, about 5 minutes. Remove the bowl from the pan and beat with a mixer on high speed until stiff, shiny peaks form, about 5 minutes. Beat in the butter a few pieces at a time, then continue beating until smooth. (Don't worry if the mixture looks separated at first; keep beating and it will come together.) Beat in the maple extract.\n            \n\n              Assemble the cake: Poke holes all over the tops of the 2 cake layers using a toothpick. Spoon the reserved walnut syrup over the cakes, letting it soak into the holes.\n            \n\n              Coarsely chop the walnuts. Transfer 1 cup frosting to a medium bowl; fold in the chopped nuts. Put 1 cake layer on a platter and spread the walnut frosting on top. Top with the second cake layer. Cover the whole cake with the remaining maple frosting. Decorate with more walnuts.\n            \n\nBasic Vanilla Cake\n\n\n              Preheat the oven to 350 degrees F. Butter two 9-inch-round cake pans and line the bottoms with parchment paper; butter the parchment and dust the pans with flour, tapping out the excess.\n            \n\n              Whisk 3 cups flour, the baking powder and salt in a bowl until combined. Beat 2 sticks butter and the sugar in a large bowl with a mixer on medium-high speed until light and fluffy, about 3 minutes. Reduce the mixer speed to medium; beat in the eggs, one at a time, scraping down the bowl as needed. Beat in the vanilla. (The mixture may look separated at this point.)\n            \n\n              Mix 1/2 cup water with the cream in a liquid measuring cup or bowl. Beat the flour mixture into the butter mixture in 3 batches, alternating with the cream mixture, beginning and ending with flour, until just smooth.\n            \n\n              Divide the batter between the prepared pans. Bake until the cakes are lightly golden on top and the centers spring back when pressed, 25 to 30 minutes. Transfer to racks and let cool 10 minutes, then run a knife around the edge of the pans and turn the cakes out onto the racks to cool completely. Remove the parchment. Trim the tops of the cakes with a long serrated knife to make them level, if desired.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "egg substitute", "quantity": 5.0}, {"food": "sugar", "quantity": 1.25}, {"food": "butter oil", "quantity": 4.0}, {"food": "vanilla extract", "quantity": 0.75}, {"food": "baked beans", "quantity": 1}, {"food": "syrup", "quantity": 2.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "potato flour", "quantity": 3.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "sugar", "quantity": 1.5}, {"food": "eggs", "quantity": 4.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 0.75}], "title": "\nMaple-Walnut Cake\n"}, {"directions": "\n\n              Fill a roasting pan halfway with water and set on a rack in the lower third of the oven; position another rack in the middle and preheat to 350 degrees F. Wrap the outside (bottom and side) of a 9-inch springform pan with foil. Make the crust: Pulse the graham crackers in a food processor a few times until crushed. Add the walnuts and brown sugar and continue pulsing until finely ground. Add the melted butter, nutmeg and salt and pulse to combine. Press into the bottom and about 1 inch up the side of the prepared pan. Bake until the crust is lightly golden, about 10 minutes. Transfer to a rack and let cool completely.\n            \n\n              Make the filling: Beat the cream cheese in a stand mixer with the paddle attachment on medium speed until nearly smooth, about 1 minute. Add the maple syrup and granulated sugar and beat until smooth, about 2 more minutes. Add the eggs, one at a time, beating after each addition. Increase the speed to medium high and beat in the flour, heavy cream, lemon juice and maple extract until the filling is smooth and silky, about 1 more minute.\n            \n\n              Pour the filling into the cooled crust. Transfer the cheesecake to the oven, placing it on the middle rack directly over the water bath. Bake until golden and set around the edge but the center still jiggles slightly, about 1 hour 10 minutes. Transfer to a rack and let cool to room temperature, then cover and refrigerate until cold and set, at least 5 hours or overnight. Let the cheesecake sit at room temperature 20 minutes, then run a thin knife around the edge and remove the springform ring.\n            \n\n              Photograph by Kana Okada\n            \n", "ingredients": [{"food": "crackers", "quantity": 1.0}, {"food": "walnuts", "quantity": 0.75}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "butter oil", "quantity": 4.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "hearts of palm", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "sugar", "quantity": 0.5}, {"food": "eggs", "quantity": 4.0}, {"food": "potato flour", "quantity": 3.0}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "lemon juice", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.25}, {"food": "syrup", "quantity": 0.75}], "title": "\nMaple-Walnut Cheesecake\n"}, {"directions": "\n\n              Whisk the flour, baking soda and salt in a medium bowl. Beat the butter and brown sugar in a large bowl with a mixer on medium-high speed until fluffy, about 3 minutes. Beat in the maple syrup, egg, vanilla and maple extract. (The mixture may look curdled.) Reduce the mixer speed to medium low; add the flour mixture and beat until combined. Cover and refrigerate until the dough is no longer sticky, about 30 minutes (it will still be soft).\n            \n\n              Position racks in the upper and lower thirds of the oven and preheat to 350 degrees F. Coat 2 baking sheets with cooking spray. Put the turbinado sugar in a shallow dish. Roll tablespoonfuls of the dough into 1-inch balls, then roll in the turbinado sugar. Press a walnut half into the center of each cookie and arrange 2 inches apart on the prepared baking sheets.\n            \n\n              Bake, switching the pans halfway through, until the edges of the cookies are set but the centers are still soft, 12 to 14 minutes. Let cool 5 minutes on the baking sheets, then transfer to racks to cool completely.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.5}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "syrup", "quantity": 0.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 0.25}, {"food": "", "quantity": 1}, {"food": "sugar", "quantity": 0.5}, {"food": "", "quantity": 0.5}], "title": "\nMaple-Walnut Cookies\n"}, {"directions": "\n\n              Make the crust: Pulse the flour, granulated sugar and salt in a food processor to combine. Add the shortening and pulse until the mixture looks like cornmeal. Add the butter and pulse until it is in pea-size pieces. Add the vinegar and 2 tablespoons ice water; pulse until the dough just comes together but is still crumbly. Turn out onto a piece of plastic wrap; shape into a disk and wrap. Refrigerate until firm, at least 1 hour or overnight.\n            \n\n              Roll out the dough into a 12-inch round on a lightly floured surface. Ease into a 9 1/2 -inch deep-dish pie plate. Fold the overhanging dough under itself and crimp with your fingers or a fork. Refrigerate until firm, about 30 minutes.\n            \n\n              Preheat the oven to 350 degrees F. Line the crust with foil, then fill with pie weights or dried beans. Bake until lightly golden around the edge, about 20 minutes. Remove the foil and weights and continue baking until golden all over, about 15 more minutes. Transfer to a rack and let cool completely.\n            \n\n              Meanwhile, make the filling: Spread the walnuts on a baking sheet; bake until toasted, about 7 minutes. Let cool completely.\n            \n\n              Dissolve the gelatin in 1/4 cup warm water. Whisk the maple syrup, granulated sugar, 1/4 cup heavy cream and the eggs in a saucepan over medium heat. Cook, stirring constantly with a wooden spoon, until slightly thickened, about 7 minutes. Let cool slightly, then stir in the dissolved gelatin and maple extract until smooth. Cover and refrigerate until just cooled and pudding-like, about 15 minutes.\n            \n\n              Beat the remaining 1 3/4 cups heavy cream and the confectioners' sugar in a large bowl with a mixer on medium-high speed until soft peaks form, about 3 minutes. Transfer 2 cups of the whipped cream to a medium bowl and fold in 1/2 cup toasted walnuts, then fold the walnut whipped cream into the chilled maple pudding until well combined. (Set aside the remaining walnuts and refrigerate the remaining whipped cream for topping.)\n            \n\n              Pour the filling into the cooled crust. Refrigerate until firm, 2 to 4 hours. Top with the remaining whipped cream and walnuts just before serving.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.25}, {"food": "sugar", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 4.0}, {"food": "butter oil", "quantity": 6.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "walnuts", "quantity": 0.75}, {"food": "onion powder", "quantity": 1.25}, {"food": "syrup", "quantity": 0.5}, {"food": "sugar", "quantity": 0.25}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 0.25}, {"food": "sugar", "quantity": 0.25}], "title": "\nMaple-Walnut Cream Pie\n"}, {"directions": "\n\n              Beat the butter, 1/2 cup confectioners' sugar, 1/3 cup maple syrup, 1/4 teaspoon salt and the maple extract in a large bowl with a mixer on medium speed until smooth and creamy, about 2 minutes. Reduce the mixer speed to low; add the flour in 2 batches and beat until just combined.\n            \n\n              Turn out the dough onto a lightly floured surface and dust with flour. Gently knead a few times until soft but not sticky, lightly dusting the surface with more flour as needed. Pat into an 8-inch square (about 1/2 inch thick). Cut into 1-by-2-inch rectangles, flouring the knife if needed.\n            \n\n              Spread the walnuts on a plate. Gently press each rectangle in the walnuts to coat. Arrange about 1 1/2 inches apart on 2 baking sheets. Refrigerate until firm, about 30 minutes.\n            \n\n              Position racks in the upper and lower thirds of the oven; preheat to 325 degrees F. Bake, switching the pans halfway through, until the cookies are firm and lightly browned on the bottom, about 25 minutes. Let cool 5 minutes on the baking sheets, then transfer to racks to cool completely.\n            \n\n              Make the glaze: Mix the remaining 1/2 cup confectioners' sugar, 3 tablespoons maple syrup and a pinch of salt in a small bowl until smooth. Drizzle on the cookies. Let set, about 15 minutes.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "butter oil", "quantity": 2.0}, {"food": "sugar", "quantity": 1.0}, {"food": "syrup", "quantity": 0.3333333333333333}, {"food": "salt", "quantity": 0.25}, {"food": "vanilla extract", "quantity": 0.25}, {"food": "potato flour", "quantity": 2.5}, {"food": "walnuts", "quantity": 1.0}], "title": "\nMaple-Walnut Shortbread\n"}, {"directions": "\n\n              Beat 2 sticks butter, 3/4 cup dark brown sugar and 3/4 cup maple sugar until fluffy; beat in 1 teaspoon vanilla and 2 eggs. Whisk 1 1/2 cups whole-wheat flour, 3/4 teaspoon baking soda and 1 teaspoon salt, then stir into the butter mixture. Spoon 1 teaspoon finely chopped walnuts and 1/4 teaspoon maple syrup into mini muffin cups, then top each with a tablespoonful of dough. Bake 20 to 25 minutes at 350 degrees.\n            \n", "ingredients": [], "title": "\nMaple-Walnut Trunks\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: Szechuan peppercorns, salted fermented black beans, and hot bean paste can be found online and in most Asian markets.\n\n              Heat a wok over medium-high heat and toast the Sichuan peppercorns until fragrant, about 10 seconds. Remove from heat and transfer the peppercorns to a bowl to cool. Coarsely grind the peppercorns in a spice grinder or with a mortar and pestle and set aside. In a medium bowl, stir together the chicken broth, hot bean paste, cornstarch, hot sesame oil, soy sauce and sugar; set aside.\n            \n\n              Heat the wok over medium-high heat. Add the canola oil, garlic, ginger and fermented black beans and cook until fragrant, stirring often, about 10 seconds. Add the ground pork and cook, stirring occasionally and breaking up the meat with a wooden spatula or spoon, until it is browned, 3 to 5 minutes. (Lower the heat to medium if the garlic starts to burn.) Add the reserved ground peppercorns, the tofu and the soy sauce mixture. Cook, stirring once to combine, until the sauce is reduced, thickened and glossy, about 2 minutes. \n            \n\n              Remove from heat and garnish with the scallions. Serve with steamed jasmine rice.\n            \n", "ingredients": [{"food": "whole milk", "quantity": 2.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "hot pockets ham cheese stuffed swich", "quantity": 3.0}, {"food": "cornstarch", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "soy sauce", "quantity": 2.0}, {"food": "sugar", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "hearts of palm", "quantity": 1.0}, {"food": "fava beans", "quantity": 2.0}, {"food": "pork skins", "quantity": 1.0}, {"food": "firm tofu", "quantity": 14.5}, {"food": "silk light vanilla", "quantity": 0.3333333333333333}, {"food": "crisped rice bar", "quantity": 5.0}], "title": "\nMapo Tofu\n"}, {"directions": "\n\n              Stack the roast beef, turkey, pastrami and corned beef on 1 slice of bread. Top with lettuce, tomato and the other slice of bread. (Use a skewer to hold the sandwich together.)\n            \n\n              Slice the sandwich in half and serve with Russian dressing on the side, if desired.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [{"food": "roast beef", "quantity": 0.8333333333333333}, {"food": "smoked turkey roll", "quantity": 1.0}, {"food": "pastrami", "quantity": 1.25}, {"food": "frankfurter beef", "quantity": 1.25}, {"food": "garlic bread", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 2.0}, {"food": "dressing", "quantity": 1}], "title": "\nMarathon Sandwich\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Lightly mist a 9-by-5-inch metal loaf pan with nonstick cooking spray and dust well with all-purpose flour to cover the pan completely, tapping out the excess. Put the chocolate in a medium microwave-safe bowl and microwave on high in 30-second intervals, stirring, until melted and smooth, 1 minute to 1 minute 30 seconds. Set aside to cool slightly while preparing the batter. Combine the bananas and sugar in a large bowl and mash with a potato masher or fork until mostly smooth with just a few small pieces of banana left. Add the oil and eggs and stir until combined. Using a wooden spoon or rubber spatula, mix in both flours, the baking powder, baking soda and salt. Stir in the buttermilk and vanilla. Stir 1 cup batter into the melted chocolate. Fill the loaf pan with half the banana batter and then half the chocolate batter. Repeat the layers and gently swirl together using a spoon or knife. Bake until golden brown on top and a toothpick inserted in the center comes out clean, about 45 minutes. Cool in the pan 15 minutes, and then turn out onto a wire rack to cool completely. Serve warm or at room temperature. Cook's Note: To prepare your loaf pan for baking, you can also use a nonstick spray with flour already in it. Flouring the pan helps the bread rise well and prevents any collapse after it comes out of the oven. Per serving: Calories: 203; Total Fat 8 grams; Saturated Fat: 2 grams; Protein: 4 grams; Total carbohydrates: 31 grams; Sugar: 16 grams Fiber: 2 grams; Cholesterol: 32 milligrams; Sodium: 212 milligrams\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 0.75}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "silk very vanilla", "quantity": 2.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "eggs", "quantity": 2.0}, {"food": "wheat flour", "quantity": 0.75}, {"food": "baking chocolate", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 1.0}], "title": "\nMarbled Banana Bread\n"}, {"directions": "\n\n              Position a rack in the middle of the oven and preheat to 350 degrees F. Line a 9 by 13-inch baking pan with parchment paper, so that the edges of the paper come up the sides. Lightly butter the paper.\n            \n\n              Put both the semisweet and unsweetened chocolates and the butter in a heatproof medium bowl. Fill a medium saucepan with a couple inches of water and bring to a simmer over medium heat. Turn off the heat; set the bowl of chocolate over the water to melt. Whisk until smooth. (Alternatively, melt in a microwave at half power, for 1 minute, stir and then heat for another minute or until melted.)\n            \n\n              Whisk the flour and salt in a bowl.\n            \n\n              In a large bowl whisk together the eggs, sugar, and vanilla. Stir the chocolate mixture into the egg mixture until smooth. Add the dry ingredients and mix until just blended. Take care not to over mix the batter. Transfer the batter to the prepared pan.\n            \n\n              For the marble swirl: Whisk the cream cheese with the sugar, egg, and vanilla until smooth. Drop very large spoonfuls of the cream cheese mixture onto the surface of the brownie batter. Insert a butter knife through the batter to the bottom of the pan. With the flat edge of the knife, make swirling motions through the batters, occasionally lifting the knife through the top, until the dark and light batters are marbled.\n            \n\n              Bake until a toothpick inserted into the center of the brownies comes out coated with a fudge-y crumb, 30 to 35 minutes. Cool the brownies in the pan on a rack.\n            \n\n              To take the brownies out of the pan, lift the edges of the paper. Cut the brownies into squares. Serve.\n            \n\n              Copyright 2003 Television Food Network, G.P. All rights reserved\n            \n", "ingredients": [{"food": "butter oil", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 3.0}, {"food": "baking chocolate", "quantity": 3.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "salt", "quantity": 0.125}, {"food": "eggs", "quantity": 3.0}, {"food": "sugar", "quantity": 1.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "sugar", "quantity": 0.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}], "title": "\nMarbled Brownies\n"}, {"directions": "\n\n              Put the potatoes and sweet potatoes in a large saucepan and cover with cold water by 1 inch. Add a generous pinch of salt, bring to a simmer and cook until the potatoes are easily pierced with a knife, 35 to 40 minutes. Drain and let cool slightly. Peel the Yukon gold potatoes and transfer to a medium bowl. Peel the sweet potatoes and transfer to a separate bowl.\n            \n\n              Divide the butter between the 2 bowls. Add the heavy cream and sour cream to the Yukon gold potatoes and mash well with a potato masher; season with salt and black pepper. Add the brown sugar and cayenne to the bowl with the sweet potatoes and mash well; season with salt and black pepper.\n            \n\n              Dollop the potatoes and sweet potatoes into a warmed serving dish and swirl using a large spoon. (The potatoes can be made up to 2 hours ahead; set aside in a baking dish. Reheat, covered, at 350 degrees F, 15 to 20 minutes.)\n            \n\n              Photograph by Chris Court\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 6.0}, {"food": "ice cream swich", "quantity": 0.3333333333333333}, {"food": "sour cream", "quantity": 0.3333333333333333}, {"food": "black bean mango", "quantity": 1}, {"food": "sugar", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}], "title": "\nMarbled Mashed Sweet Potatoes\n"}, {"directions": "\n\n              Whisk the flour, sugar, baking powder and salt in a medium bowl. Stir in the melted butter and eggs until combined. Transfer one-third of the dough to a small bowl; add the cocoa powder and milk and stir with a wooden spoon until combined. Gently stir the cocoa dough back into the plain dough until it looks marbled.\n            \n\n              Position racks in the upper and lower thirds of the oven and preheat to 350 degrees F. Line 2 baking sheets with parchment paper. Drop tablespoonfuls of dough about 1 inch apart on the prepared baking sheets; sprinkle generously with sugar.\n            \n\n              Bake until the cookies are slightly puffed,6 to 7 minutes. Remove from the oven and make an indentation in the center of each cookie with the back of a teaspoon. Spoon about 1/2 teaspoon pudding into each indentation, then return to the oven, switching the position of the pans; continue baking until lightly golden and set, about 6 more minutes. Let cool 5 minutes on the baking sheets, then transfer to racks to cool completely.\n            \n\n              Photograph by Andrew Purcell\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.75}, {"food": "sugar", "quantity": 0.75}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 6.0}, {"food": "eggs", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.25}, {"food": "milk", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.3333333333333333}], "title": "\nMarbled Pudding Thumbprints\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Put the russet and sweet potatoes directly on the oven rack and bake 30 minutes. Pierce each potato a few times with a fork and continue to bake until tender, 15 to 20 more minutes for the sweet potato and 20 to 25 more minutes for the russet potatoes. Let cool slightly.\n            \n\n              Peel the sweet potato. Transfer to a bowl and mash lightly with a fork until almost smooth. Trim a thin slice off the top of each russet potato, cutting lengthwise. Scoop most of the flesh into another bowl, leaving the shells intact. Add the sour cream and butter to the bowl and mash with a fork. Stir in the scallions, 1/2 cup cheese, the nutmeg, 1 1/4 teaspoon salt, and pepper to taste. Gently fold in the sweet potato.\n            \n\n              Brush the potato skins with olive oil and season with salt and pepper. Generously fill with the marbled potato mixture and sprinkle with the remaining 1/4 cup cheese.\n            \n\n              Reduce the oven temperature to 375 degrees F. Place the stuffed potatoes on a baking sheet and bake until the cheese melts, 25 to 30 minutes.\n            \n\n              Photograph by Tina Rupp\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 4.0}, {"food": "sweet potato puffs", "quantity": 1.0}, {"food": "sour cream", "quantity": 0.25}, {"food": "butter oil", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "cheddar cheese", "quantity": 0.75}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1}], "title": "\nMarbled Stuffed Potatoes\n"}, {"directions": "\n\n              Fill a cocktail shaker with ice. Add tequila, lime juice, Simple Syrup and orange liqueur. Cover and shake until mixed and chilled, about 30 seconds. (In general, the drink is ready by the time the shaker mists up.) Place Lime-salt-sugar on a plate. Press the rim of a chilled rocks or wine glass into the mixture to rim the edge. Strain margarita into the glass. \n            \n\nSimple Syrup:\n\n\n              Put the sugar and water in a small saucepan. Cook over low heat, stirring, until the sugar dissolves. (Alternatively, heat in the microwave.) Store in a sealed container in the refrigerator for up to 1 month. \n            \n\nLime-salt-sugar:\n\n\n              Blend together lime, salt and sugar in a small blender or mini food chopper. \n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "", "quantity": 3.0}, {"food": "lime juice", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "orange", "quantity": 0.5}, {"food": "", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "coconut water", "quantity": 1.0}, {"food": "lime", "quantity": 1}, {"food": "salt", "quantity": 2.0}, {"food": "sugar", "quantity": 2.0}], "title": "\nMargarita\n"}, {"directions": "\n\n              Fill a cocktail shaker with ice. Add tequila, lime juice, and simple syrup and orange liqueur. Cover and shake until mixed and chilled, about 30 seconds. Spread lime-salt-sugar on a plate. Moisten the rim of a chilled rocks or wine glass with a lime wedge and press into mixture to rim edge. Strain margarita into glass.\n            \n\nSimple Syrup:\n\n\n              Place sugar and water in a small saucepan. Cook over low heat, stirring, until sugar dissolves. Remove from heat and let cool. Store in a sealed container in refrigerator for up to 1 month.\n            \n\nLime-salt-sugar:\n\n\n              Blend zest, salt and sugar together in a small blender or mini food chopper. Use immediately.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "", "quantity": 3.0}, {"food": "lime juice", "quantity": 2.0}, {"food": "syrup", "quantity": 1.0}, {"food": "orange", "quantity": 0.5}, {"food": "", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "coconut water", "quantity": 1.0}, {"food": "lime", "quantity": 1}, {"food": "salt", "quantity": 2.0}, {"food": "sugar", "quantity": 2.0}], "title": "\nMargarita\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              For the crust: Preheat the oven to 350 degrees F. Process the graham crackers and sugar in a food processor to a fine crumb. Add the melted butter and tequila, and pulse until moist. Press the crumbs into a 9-inch pie plate, and bake until firm, 12 to 15 minutes. Let the crust cool completely on a wire rack.\n            \n\n              For the filling: Whisk together the condensed milk, limeade, tequila, lime juice, liqueur and salt in a large bowl until smooth and combined. Beat the cream with an electric mixer fitted with a whisk attachment on medium-high speed in another large bowl until stiff peaks form. Reduce the speed to low, and drizzle in the condensed milk mixture. Return the mixer to medium-high, and beat until the mixture is completely incorporated and fluffy, about 30 seconds, stopping to scrape down the side of the bowl if necessary. Transfer the filling to the cooled crust, cover loosely with plastic wrap and freeze until firm, at least 6 hours or overnight.\n            \n\n              Transfer the pie to the refrigerator 30 minutes before serving. Garnish with lime wedges dipped in salt, and serve.\n            \n", "ingredients": [{"food": "cracker barrel", "quantity": 14.0}, {"food": "sugar", "quantity": 3.0}, {"food": "butter oil", "quantity": 6.0}, {"food": "", "quantity": 1.0}, {"food": "milk", "quantity": 14.0}, {"food": "lemon concentrate", "quantity": 0.5}, {"food": "", "quantity": 0.25}, {"food": "lime juice", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "salt", "quantity": 0.25}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "lime", "quantity": 0.5}], "title": "\nMargarita Pie\n"}, {"directions": "\n\n              Marinate 1/2 pound shrimp in a margarita mix with a dash of cayenne; grill. Top lime-flavored chips with 1 1/2 cups each shredded white cheddar and muenster. Bake, then top with grilled shrimp, diced onion, avocado, cilantro and lime juice.\n            \n\n              Photograph by Jonny Valiant\n            \n", "ingredients": [], "title": "\nMargarita Shrimp Nachos\n"}, {"directions": "\n\n              Make the dough: Combine the yeast, 1 cup warm water (about 100 degrees F) and the sugar in a food processor and pulse once to combine. Let sit until foamy, 5 to 10 minutes. Add the olive oil and pulse to combine. Mix the flour and 2 teaspoons salt in a medium bowl; add to the food processor and pulse until the dough pulls away from the side and gathers around the blade.\n            \n\n              Turn the dough out onto a lightly floured surface and form into 2 even balls. Transfer to 2 lightly oiled bowls; cover with plastic wrap and let rise in a warm place until doubled in size, 2 to 4 hours. (You can make the dough ahead; wrap in plastic and refrigerate up to 1 week or freeze up to 2 months. Bring to room temperature before using.)\n            \n\n              Set a pizza stone or large baking sheet on the lowest oven rack and preheat to 500 degrees F. Meanwhile, make the topping: Combine the tomatoes, olive oil, garlic, red pepper flakes and 1 teaspoon salt in a bowl.\n            \n\n              Stretch 1 ball of dough into a 12-inch round on a lightly floured pizza peel or inverted baking sheet. Spread about 1/2 cup of the tomato mixture on the dough, leaving a 1/2-inch border. Top with half of the mozzarella, then brush the edge lightly with olive oil.\n            \n\n              Slide the pizza onto the hot stone or baking sheet and bake until the crust is golden and the cheese is bubbling, 8 to 10 minutes. Transfer to a cutting board and let cool 2 minutes before slicing. Repeat to make the second pizza.\n            \n", "ingredients": [{"food": "whole milk", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.75}, {"food": "salt", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 6.0}, {"food": "yeast extract spread", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "potato flour", "quantity": 3.0}, {"food": "salt", "quantity": 1}], "title": "\nMargherita Pizza\n"}, {"directions": "\n\n              Stretch dough into two thin 9-inch rounds. Top each with 1/2 cup crushed San Marzano tomatoes, dried oregano, salt, pepper and olive oil; bake until golden. Sprinkle with 1/2 pound diced mozzarella, torn basil and salt. Bake until the cheese melts, then drizzle with olive oil.\n            \n\n              How to make a pizza:\n            \n\n              Step 1: Place a pizza stone or an inverted baking sheet on the lowest oven rack and preheat to 500 degrees.\n            \n\n              Step 2: Stretch 1 pound dough on a floured pizza peel, large wooden cutting board or parchment paper.\n            \n\n              Step 3: Top as desired, then slide the pizza (with the parchment paper, if using) onto the stone or baking sheet. Bake until golden, about 15 minutes.\n            \n\n              Pizza Dough\n            \n\n              Whisk 3 3/4 cups flour and 1 1/2 teaspoons salt. Make a well and add 1 1/3 cups warm water, 1 tablespoon sugar and 1 packet yeast. When foamy, mix in 3 tablespoons olive oil; knead until smooth, 5 minutes. Brush with olive oil, cover in a bowl and let rise until doubled, about 1 hour 30 minutes. Divide into two 1-pound balls. Use 1 pound per recipe unless noted.\n            \n\n              See all 50 easy pizza toppings\n            \n\n              Photographs by Kana Okada\n            \n", "ingredients": [], "title": "\nMargherita Pizza\n"}, {"directions": "\n\n              Boil 2 1/2 cups water and 1 cup sugar, stirring to dissolve the sugar, then remove from the heat and add 2/3 cup lime juice, 1/3 cup tequila, 5 tablespoons triple sec and 1/4 teaspoon salt. Let cool, then stir in 2 teaspoons grated lime zest and pour into a small glass baking dish; cover and freeze for about 4 hours before scraping with a fork. For the full effect, dip the rims of the serving bowls in equal parts sugar and kosher salt, and a pinch of lime zest. Garnish with lime slices.\n            \n\n              Photograph by Lisa Shin\n            \n", "ingredients": [], "title": "\nMargranita\n"}, {"directions": "\n\n              In a small saucepan, combine the sugar, vanilla bean and seeds, citrus zests, and water. Bring to a boil and then reduce the heat to low. Simmer very gently to make a loose syrup, about 25 minutes. Remove from the heat and add the citrus juices. Combine the berries in a bowl. Strain the warm syrup over the berries and marinate at room temperature for 30 minutes. Serve.\n            \n", "ingredients": [{"food": "sugar", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "", "quantity": 0.5}, {"food": "coconut water", "quantity": 1.0}, {"food": "orange juice", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "raspberries", "quantity": 0.5}, {"food": "blueberries", "quantity": 0.5}, {"food": "strawberries", "quantity": 0.5}], "title": "\nMarinated Berries\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Put the vinegar, herbs, mustard, powders if using and oil in a large re-sealable plastic bag. Close the bag and shake to combine all the ingredients. Open the bag, drop in the chicken breast in the bag. Close and shake the bag to coat evenly. Freeze for up to 2 weeks.\n            \n\n              Thaw in the refrigerator overnight, under cold, running water, or in the microwave at 30 percent power for 1 minute at a time.\n            \n\n              Heat a grill or grill pan. When the grill is hot, place the chicken on the grill and cook for about 4 minutes per side, or until cooked through. You can also bake the thawed chicken in a 375 degree F oven for 15 minutes, or until cooked through.\n            \n", "ingredients": [{"food": "vinegar", "quantity": 1.0}, {"food": "corier leaf", "quantity": 2.0}, {"food": "rye grain", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "black bean mango", "quantity": 1}, {"food": "fat free chicken breast ", "quantity": 4.0}], "title": "\nMarinated Chicken Breasts\n"}, {"directions": "\n\n              In a small saucepan, combine the sugar, citrus zests, and water. Bring to a simmer and cook until the sugar has dissolved. Remove from the heat and add the citrus juices and vanilla. Combine the berries in a bowl. Pour the warm syrup over the berries and marinate at room temperature for 30 minutes. Serve marinated berries over a scoop of vanilla frozen yogurt. \n            \n", "ingredients": [{"food": "sugar", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "coconut water", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "lime juice", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.25}, {"food": "raspberries", "quantity": 0.5}, {"food": "blueberries", "quantity": 0.5}, {"food": "strawberries", "quantity": 0.5}, {"food": "frozen yogurt", "quantity": 1.0}], "title": "\nMarinated Fresh Berries\n"}, {"directions": "\n\n              Core 1 1/2 pounds small green tomatoes and cut into wedges. Bring 2 cups water and 1/2 cup white wine vinegar to a boil in a saucepan. Add the tomatoes in batches and cook until crisp-tender, about 3 minutes; drain and let cool. Whisk 1/4 cup each white wine vinegar, olive oil, chopped parsley and chopped mint and 1 tablespoon each kosher salt, sugar and minced Fresno chile in a large bowl. Add the tomatoes and toss. Refrigerate at least 4 hours or overnight.\n            \n\n              Photograph by Bobbi Lin\n            \n", "ingredients": [], "title": "\nMarinated Green Tomatoes\n"}, {"directions": "\n\n              Combine 2 ounces Canadian whisky,1/2 ounce orange curacao, and 3 dashes bitters, in a cocktail shaker; fill with ice. Shake well and strain into an old fashioned glass with ice. Garnish with a wedge each of lemon, and orange.\n            \n\n              Photograph by John Paterson/Studio D\n            \n", "ingredients": [], "title": "\nMarlene Dietrich\n"}, {"directions": "\n\n              Make the cake: Preheat the oven to 350 degrees F. Brush an 8-inch square baking pan with canola oil. Beat the egg whites and granulated sugar with a mixer until stiff peaks form, about 8 minutes.\n            \n\n              Meanwhile, whisk both flours, the almonds and baking powder in a bowl. Beat the egg yolks in a large bowl. Whisk 1/2 cup oil, the orange and lemon juices and the marmalade into the yolks until combined. Stir in the dry ingredients, then fold in the beaten egg whites until just combined. Add the raisins, if desired.\n            \n\n              Transfer the batter to the prepared pan. Bake until the cake is golden and springs back when touched, about 30 minutes.\n            \n\n              Meanwhile, make the syrup: Bring 3/4 cup water and the granulated sugar to a boil in a saucepan; squeeze in the orange juice and add the peel. Simmer until syrupy, about 20 minutes. Cool slightly.\n            \n\n              Pour the syrup over the cake while both are still warm. Cool completely, then cover with plastic wrap and let soak overnight. Cut into squares and top with confectioners' sugar and/or almonds.\n            \n\n              Photograph by Roland Bello\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.5}, {"food": "eggs", "quantity": 3.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "potato flour", "quantity": 0.75}, {"food": "potato flour", "quantity": 1.25}, {"food": "almonds", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "orange juice", "quantity": 0.5}, {"food": "lemon juice", "quantity": 0.25}, {"food": "orange", "quantity": 0.5}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.25}, {"food": "sugar", "quantity": 1}, {"food": "sugar", "quantity": 0.75}, {"food": "orange", "quantity": 0.5}], "title": "\nMarmalade Cake\n"}, {"directions": "\n\n              For each drink, combine 3 ounces gin, 1 ounce dry vermouth, 1/2 ounce lemon juice and 1 tablespoon orange marmalade in a cocktail shaker with ice; shake well, then pour into a glass.\n            \n\n              Photograph by Anna Williams\n            \n", "ingredients": [], "title": "\nMarmalade Cocktails\n"}, {"directions": "\n\n              Melt 2 tablespoons butter in a large skillet over medium-high heat. Stir in the marmalade, then add the carrots, orange juice, brown sugar, 1/2 teaspoon salt, and pepper to taste. Bring to a boil, then cover and reduce the heat to medium low. Simmer, stirring occasionally, until the carrots are almost tender, 13 to 15 minutes.\n            \n\n              Uncover and add the remaining 2 tablespoons butter to the skillet. Increase the heat to medium high and cook, stirring, until the liquid is reduced, 8 to 10 minutes. Transfer to a platter and sprinkle with the candied pecans.\n            \n\n              Photograph courtesy Anna Williams\n            \n", "ingredients": [{"food": "butter oil", "quantity": 4.0}, {"food": "orange", "quantity": 2.0}, {"food": "carrots", "quantity": 2.0}, {"food": "orange juice", "quantity": 0.75}, {"food": "sugar", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "pecans", "quantity": 0.3333333333333333}], "title": "\nMarmalade-Glazed Carrots With Candied Pecans\n"}, {"directions": "\n\n              Snip the chicks horizontally, starting at the heads, into 1/8-inch-thick petals. You should have about 8 petals of varying sizes.\n            \n\n              Arrange 4 petals at 12, 3, 6 and 9 o'clock around the cupcake. Put the remaining 4 petals on top and between them. Put the gumball in the center.\n            \n", "ingredients": [{"food": "", "quantity": 3.0}, {"food": "frosting", "quantity": 1.0}, {"food": "barley flour or meal", "quantity": 1.0}], "title": "\nMarshmallow Chick Flower\n"}, {"directions": "\nSpecial equipment: a 12-cup bundt pan and a piping bag fitted with a long thin round tip\n\n              Prepare a 12-cup bundt pan according to the cake mix package directions. Mix the cake according to the package directions. Fold the egg whites into the batter with a rubber spatula until fully combined. Pour the batter into the prepared bundt pan and bake according to the package directions. Let cool completely.\n            \n\n              Combine the butter and marshmallow creme in a large bowl and beat with an electric mixer until smooth and well combined. Add the confectioners' sugar and cream and beat until fluffy, about 3 minutes. Put the marshmallow mixture into a piping bag fitted with a long thin round tip.\n            \n\n              Flip the cake so it is flat-side up and make 12 evenly-spaced holes in the bottom of the cake using a skewer, pressing only halfway down into the cake and wiggling the skewer slightly to widen the holes until they are each about 1 inch wide. Insert the piping tip in each of the hollowed-out holes and pipe in some marshmallow mixture until it starts to ooze out the top of the hole. Flip the cake flat-side down onto a cake stand or serving platter. Serve immediately or cover and refrigerate for up to 2 days.\n            \n", "ingredients": [{"food": "shortening cake mix", "quantity": 15.0}, {"food": "egg substitute", "quantity": 6.0}, {"food": "butter oil", "quantity": 6.0}, {"food": "", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "ice cream swich", "quantity": 1.0}], "title": "\nMarshmallow Creme-Filled Bundt Cake\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: an 8-inch cake pan, an 8-inch half-sphere pan (or an 8-inch oven-safe bowl with a completely rounded bottom) and sharp kitchen shears\n\n              For the cake: Preheat the oven to 350 degrees F. Spray an 8-inch round cake pan and 8-inch half-sphere cake pan with cooking spray and dust with flour, tapping out the excess (see Cook's Note).\n            \n\n              Prepare the cake batter according to the package directions. Pour a little more than half the batter into the half-sphere pan and pour the remaining batter into the round pan. Bake until the cake round is baked through and a toothpick inserted in the center comes out clean, 22 to 25 minutes. Remove to a rack to cool. Reduce the oven temperature to 325 degrees F and continue baking the half-sphere until a toothpick inserted in the center comes out clean, 10 to 15 minutes more. Remove to a rack to cool. Remove the cakes from the pans while still warm and let cool completely on the rack. \n            \n\n              For the igloo and polar bears: If the top of either cake domed while baking, shave it flat with a serrated knife before proceeding. Place the cake round bottom-side down on a large rimmed serving tray. Spread the top of the cake with the marshmallow creme almost to the edge (a wet offset spatula is helpful when spreading the creme). Place the half-sphere cake flat-side down on top of the cake round. \n            \n\n              Cut the doughnut in half to make 2 half circles, trimming the insides of the pieces if necessary to make 2 arched doorways for the igloo. Frost the 2 pieces, stick them together so you have a short tunnel and attach it to the igloo with more frosting. Spread the remaining frosting all over the cake and doorway. \n            \n\n              Set aside 8 regular marshmallows, then snip the remaining regular marshmallows in half from top to bottom (lengthwise) with sharp kitchen shears. Starting at the base of the cake and continuing in a circle, press the cut side of the marshmallows into the frosting to adhere to the igloo, packing the pieces as close as possible so almost no frosting shows through. Continue adding snipped marshmallows in rows until you reach the top. Add more snipped marshmallows to finish the doorway, quartering some lengthwise if necessary to make a tight fit. Cut 1 of the remaining whole regular marshmallows in half crosswise and put one piece on the very top of the igloo. Spread the granulated sugar around the cake on the tray to make drifts of snow.\n            \n\n              To make 3 polar bear heads: Snip a thin piece from one of the flat ends of 3 regular marshmallows to make them sticky. Flip the marshmallows over onto a plate so the untrimmed flat sides are face up. Snip a thin piece from the top and bottom of 3 mini marshmallows, then adhere a marshmallow to the center of each of the heads (these are the bases of the noses). Press a brown chocolate candy onto each mini marshmallow. To make eyes, use a toothpick to hollow out 2 sticky patches on each head, then apply a set of candy eyes to each. Cut 3 mini marshmallow in half crosswise and attach 2 pieces to the top of each head for ears. \n            \n\n              To make the floating polar bear: Clear a space in the sugar snow with your fingers for a pool. Add the rock candy. Place one of the polar bear heads on the rock candy so it looks like it is peeking out of the water. Snip 2 regular marshmallows in half diagonally to make 4 triangular pieces. Arrange the pieces in the pool for paws.\n            \n\n              To make the sitting polar bears: Snip a disc from both the top and bottom flat ends of the remaining 2 regular marshmallows, then cut each disc into half-moons. Arrange 4 of the half-moon pieces cut-side up in a square to form front and back paws; arrange the other 4 in another square. Snip the jumbo marshmallow in half diagonally, then place one piece on each set of paws cut-side up, with the round end at the front set of paws. Attach a polar bear head to the upper third of the round end of each jumbo marshmallow piece. Snip an end from the remaining 2 mini marshmallows and attach one to each jumbo marshmallow piece for a tail. Sit the polar bears on the sugar. \n            \n\n              For the campfire and fish: Sprinkle the chopped chocolate pieces in a circle to resemble dirt for a fire pit. Pile the red, orange, pink and yellow snipped gummy bears in the center to resemble a campfire and embers. \n            \n\n              To make a fish over the fire: Cut an 8-inch piece of black licorice lace. Cut a small slit near the tail of 1 fish with the tip of a paring knife, making sure not to cut all the way through the tail. Thread the licorice lace through the slit and tie a knot on one end. Slide the fish down so it is secured by the knot. Lay the fish down on a work surface and lay 3 of licorice twist pieces on top of the fish so the tail of the fish and the end of the twisted licorice candies line up (eat or discard the fourth piece of licorice twist). Wrap the black licorice lace around the top of the licorice twists to keep them in a bundle, then tuck in the lace so it stays put. Stand the bundle upright and separate the licorice twists to form a tripod. Place it over the fire with the fish hanging in the middle. \n            \n\n              For the fish on the line: Make a small slit near the tails of the 3 remaining fish with the tip of a paring knife, making sure not to cut all the way through the tails. Thread the remaining piece of black licorice lace through the slits. Tuck the ends of the licorice lace into the side of the igloo near the fire and arrange the fish so they hang down. Sprinkle the cake and bears with the confectioners' sugar for a snow effect, if desired.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 1}, {"food": "shortening cake mix", "quantity": 15.0}, {"food": "", "quantity": 7.0}, {"food": "rice cake", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 16.0}, {"food": "", "quantity": 10.0}, {"food": "sugar", "quantity": 4.0}, {"food": "", "quantity": 8.0}, {"food": "baking chocolate", "quantity": 3.0}, {"food": "", "quantity": 6.0}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "malt beverage", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 3.0}, {"food": "orange", "quantity": 2.0}, {"food": "silk light vanilla", "quantity": 2.0}, {"food": "yellow rice", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1.0}, {"food": "fish oil", "quantity": 4.0}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "sugar", "quantity": 1}], "title": "\nMarshmallow Igloo Cake with Polar Friends\n"}, {"directions": "\n\n              Snip the fish almost to the tail, open the \"leaves\" slightly, and put them on the cupcake. Snip the marshmallows in half diagonally, and press the cut sides into the sanding sugar. Press 3 marshmallow halves onto each fish, toward the tail end, using an extra dab of frosting to help them adhere if necessary.\n            \n", "ingredients": [{"food": "", "quantity": 3.0}, {"food": "frosting", "quantity": 1.0}, {"food": "", "quantity": 5.0}, {"food": "sugar", "quantity": 1}, {"food": "frosting", "quantity": 1}], "title": "\nMarshmallow Paper Whites\n"}, {"directions": "\n\n              Preheat the oven broiler. Line a rimmed baking sheet with aluminum foil. Lay the marshmallows on the foil, long side facing up (as opposed to standing up on the short end). Place under the broiler and cook until the marshmallows are golden brown and toasted, 10 to 15 seconds. Cool completely on the baking sheet. The marshmallows will firm up again in the center so you can skewer them.\n            \n\n              While the marshmallows cool, put the graham crackers in a resealable plastic bag and seal. Crush with a meat mallet, rolling pin or can until they are fine crumbs with a few small chunks.\n            \n\n              Heat the butter in a small skillet over medium heat. Add the crumbs and cook, stirring, until toasted and a few shades darker, 3 to 4 minutes. Remove from the heat, pour onto a plate and cool completely.\n            \n\n              Once the marshmallows have cooled, skewer them and set aside.\n            \n\n              Finely chop the chocolate and reserve one-quarter of the chocolate separately. Put the rest in a heatproof bowl and set over a small pot with 2 inches of simmering water, making sure the water does not touch the bottom of the bowl. Cook, stirring, until melted and smooth. Remove from the heat and stir in the reserved chopped chocolate until melted. This technique will help the chocolate set hard without having grey streaks, called bloom, on your pops.\n            \n\n              Drizzle the skewered marshmallows with some melted chocolate and sprinkle with crumbs. Set the sticks into the open grids in a wire rack, so they stay upright, until the chocolate is set. Repeat with the remaining marshmallows, chocolate and crumbs.\n            \n\n              Fill a few tall glasses with marshmallows and set the finished pops, stick-side down, into the glasses for serving.\n            \n", "ingredients": [{"food": "", "quantity": 18.0}, {"food": "crackers", "quantity": 3.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 4.0}, {"food": "barley flour or meal", "quantity": 18.0}], "title": "\nMarshmallow S'mores Pops\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Mix the tomato juice, mezcal, lime juice, orange juice, adobo and oregano in a small pitcher; set aside. Arrange the jalapeno poppers on a baking sheet. Bake until golden brown, turning halfway through, about 15 minutes.\n            \n\n              Meanwhile, place the tortilla chips in a resealable plastic bag and finely crush with a skillet or rolling pin. Mix with the chili powder, lime zest, orange zest and ? teaspoon salt in a small shallow bowl; set aside.\n            \n\n              Melt 1/2 tablespoon butter in a small nonstick skillet over medium-high heat. Add 1 tortilla, then cover with the cheese and the remaining tortilla. Cook until golden on the bottom, about 2 minutes. Flip, adding the remaining 1/2 tablespoon butter to the skillet, and cook until the tortilla is golden and the cheese is melted, 2 to 3 more minutes. Transfer to a cutting board and cut into 6 wedges.\n            \n\n              Thread the jalapeno poppers, quesadilla wedges and some pickled jalapeno slices onto the top half of two 12-inch wooden skewers. Moisten the rim of 2 pint glasses and press in the tortilla chip mixture. Fill the glasses with ice and the tomato juice mixture. Garnish with the skewers.\n            \n\n              Photograph by Ralph Smith\n            \n", "ingredients": [{"food": "tomato juice", "quantity": 2.0}, {"food": "", "quantity": 0.5}, {"food": "lime juice", "quantity": 0.25}, {"food": "orange juice", "quantity": 0.75}, {"food": "hearts of palm", "quantity": 2.0}, {"food": "", "quantity": 0.5}, {"food": "frozen yogurt", "quantity": 6.0}, {"food": "tortilla", "quantity": 0.25}, {"food": "chili powder", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 1.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 3.0}, {"food": "luncheon slices", "quantity": 1}], "title": "\nMary Poppers\n"}, {"directions": "\n\n              Fill a bowl with cold water. Slice the potatoes lengthwise into 1/4-inch-thick slices, then stack the slices and cut into 1/4-inch-wide sticks. Transfer the potato sticks to the water as you go. Drain the potatoes and rinse under cold running water until the water runs clear. Spin in a salad spinner to remove the excess water, then pat dry.\n            \n\n              Heat 3 to 4 inches peanut oil in a wide, deep pot over medium-high heat until a deep-fry thermometer registers 300 degrees F. Fry the potatoes in 2 batches until about halfway cooked, 3 to 4 minutes per batch. Remove with a slotted spoon and transfer to paper towel-lined baking sheets to drain.\n            \n\n              Increase the oil temperature to 365 degrees F. Fry the potatoes again in 3 or 4 batches, turning and stirring with tongs, until golden brown, about 3 minutes per batch. Transfer to fresh paper towels to drain and season with salt. Sprinkle with Old Bay and vinegar.\n            \n\n              Photograph by Jonathan Kantor\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "vinegar", "quantity": 1}], "title": "\nMaryland Boardwalk Fries\n"}, {"directions": "\n\n              See how to poach eggs\n            \n\n              Make the salsa: Combine the tomatoes, onion, jalapeno, cilantro and 1 teaspoon salt in a bowl.\n            \n\n              Preheat the oven to 200 degrees. Make the corn cakes: Warm the milk and butter in a small saucepan over low heat just until the butter melts. Combine the masa harina, 1 teaspoon salt, the sugar and queso fresco in a large bowl. Stir in the milk mixture to make a soft dough. Scoop the dough into 8 portions (about 1/4 cup each) and place on a parchment-lined baking sheet. Cover with another sheet of parchment; press a pan on top to flatten into disks.\n            \n\n              Heat 1 tablespoon olive oil in a large nonstick skillet over medium heat. Working in batches, fry the corn cakes until crisp and golden on the bottom, about 3 1/2 minutes; flip, press lightly with a spatula and cook until golden on the other side. Continue with the remaining cakes, adding more oil as needed. Season the cakes with salt; place on a baking sheet and keep warm in the oven while you poach the eggs.\n            \n\n              Bring a deep pan of water to a simmer over medium-low heat; add the vinegar. Poach the eggs.\n            \n\n              Divide the corn cakes among 4 plates; top each cake with a poached egg, salsa and cheese; serve with avocado.\n            \n\n              Photograph by Yunhee Kim\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.25}, {"food": "seeds", "quantity": 1.0}, {"food": "", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "whole milk", "quantity": 2.0}, {"food": "butter oil", "quantity": 3.0}, {"food": "corn flour", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "sugar", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 0.3333333333333333}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "eggs", "quantity": 8.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "avocado", "quantity": 1.0}], "title": "\nMasa Corn Cakes with Poached Eggs\n"}, {"directions": "\n\n              Preheat the oven to 500 degrees F. Place 6 medium russet potatoes directly on the oven rack and bake until soft, about 35 minutes. Split each potato in half and scoop out the flesh; transfer to a large bowl. Add 1½ cups warmed heavy cream, 1 stick cubed salted butter, 1 1/2 teaspoons kosher salt and a few grinds of pepper to the bowl and mash well. Top with more butter.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [], "title": "\nMashed Baked Potatoes\n"}, {"directions": "\n\n              Combine 3 chopped ripe plantains in a saucepan with 2 cinnamon sticks, 1/4 cup brown sugar, 4 tablespoons butter and 1 teaspon kosher salt. Cover with water and simmer until tender, 15 to 20 minutes. Drain, reserving the liquid. Mash the plantains. Brown 4 tablespoons butter in a skillet, 6 to 10 minutes. Mix into the plantains; add enough of the reserved liquid until creamy. Season with salt, pepper and ground cinnamon.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [], "title": "\nMashed Plantains\n"}, {"directions": "\n\n              Simmer 1 1/2 pounds cubed peeled Yukon Gold potatoes in salted water with 1 sprig rosemary and 2 crushed garlic cloves until tender, 15 minutes; drain and discard the rosemary. Mash with 1/2 cup low-fat milk, 2 tablespoons each olive oil and chopped parsley, and salt and pepper. Transfer to a baking dish; top with grated parmesan. Broil until golden.\n            \n", "ingredients": [], "title": "\nMashed Potato Gratin\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Line a baking sheet with foil.\n            \n\n              For the mashed potatoes: Poke each potato with a fork several times and microwave until soft, about 15 minutes (or use your microwave?s potato setting). Cool until you are able to handle them with a towel, about 2 minutes. Halve the potatoes and scoop out the flesh with a spoon and discard the skin. Mash the potatoes and butter in a medium bowl until smooth then fold in the sour cream, chives and 1 teaspoon salt until well combined. Set aside. \n            \n\n              For the meatloaf: Toast the bread crumbs in a dry skillet over medium heat until browned and fragrant, about 1 minute. Transfer to a large mixing bowl and set aside. Add the oil, onions, garlic, oregano, 1/2 teaspoon salt and 1/2 teaspoon pepper to the skillet and cook, stirring, until onions are tender, about 8 minutes. Let cool slightly. Add the onion mixture to the bread crumbs along with the meatloaf mix, Parmesan and Worcestershire sauce. Toss and mix gently. Add the eggs and mix it completely into the meat mixture.  \n            \n\n              Transfer 1/2 of the meatloaf mixture to the prepared baking sheet and gently press into a 12- by-3-inch rectangle. Gently create a well down the middle of the meatloaf mixture with a 1/2-inch wall on all four sides. Spoon the mashed potato mixture into the well. Working with a quarter of the remaining meatloaf mixture, gently flatten the mixture with the palms of your hands. Lay the meatloaf mixture over 1/2 of the mashed potatoes. Repeat with the remaining meatloaf mixture ensuring the potatoes are completely enclosed. \n            \n\n              For the glaze: Whisk together the ketchup, brown sugar and vinegar in a small bowl. Spoon the glaze evenly over the entire loaf. \n            \n\n              Bake until an instant read thermometer registers 160 degrees F in the center of the loaf, about 45 minutes. \n            \n\n              While the meatloaf is cooking, cook the peas according to package directions. Toss with the butter and season with salt and pepper. Keep warm. \n            \n\n              Slice and serve the meatloaf with butter, black pepper and the peas.\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 1.0}, {"food": "butter oil", "quantity": 0.5}, {"food": "sour cream", "quantity": 0.3333333333333333}, {"food": "chives", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "garlic powder", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "salami pork beef", "quantity": 2.5}, {"food": "", "quantity": 0.3333333333333333}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "eggs", "quantity": 2.0}, {"food": "", "quantity": 0.5}, {"food": "sugar", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "pigeon peas", "quantity": 1.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "butter oil", "quantity": 1}, {"food": "black bean mango", "quantity": 1}], "title": "\nMashed Potato-Stuffed Meatloaf\n"}, {"directions": "\n\n              In a large saucepan, combine the potatoes, 1 teaspoon salt, and enough cold water to cover. Bring to a boil over high heat. Lower the heat to maintain a simmer and cook until fork tender, about 10 minutes. Drain the potatoes and return to the pan. Shake the pan over medium heat for about a minute to dry the potatoes. Transfer the potatoes to a food mill, ricer, or bowl. \n            \n\n              Put the milk and butter in the saucepan, and heat over medium-high heat until the butter melts and the milk is hot. Remove pan from the heat. Mash the potatoes through the food mill, ricer, or by hand into the pan. Stir to combine with the milk and butter. Season with salt and pepper to taste and add nutmeg, if desired. Serve immediately.\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 2.0}, {"food": "salt", "quantity": 1.0}, {"food": "whole milk", "quantity": 0.75}, {"food": "butter oil", "quantity": 0.25}, {"food": "black bean mango", "quantity": 1}, {"food": "nutmeg", "quantity": 1}], "title": "\nMashed Potatoes\n"}, {"directions": "\n\n              Lightly scrub the potatoes. Put them in a large saucepan with cold water to cover by about 3 inches and season generously with salt. Bring to a boil over high heat. Lower the heat to maintain a gentle simmer and cook until the potatoes are fork tender, about 40 to 45 minutes.\n            \n\n              Drain the potatoes in a colander in the sink. Let the potatoes cool just until you can handle them--hot potatoes make better mashed. Meanwhile, melt the butter in the pan over low heat.\n            \n\n              Hold the potatoes in a towel or in a kitchen glove and gently peel the potato skins off with a knife or your fingers. Quarter the potatoes and put then in the pan.\n            \n\n              Heat the milk in a microwave-safe measuring cup or bowl until hot. Mash the potatoes with the butter with a fork or potato masher if you have one, until most of the lumps are gone and the potatoes are smooth and fluffy. Then stir in the milk, until the mashed potatoes are light and smooth, if there are still lumps paddle them smooth with a wooden spoon. Season with 1 1/2 teaspoons salt or to taste, and pepper, to taste. Serve immediately.\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 2.0}, {"food": "sweet potatoes", "quantity": 1.5}, {"food": "butter oil", "quantity": 4.0}, {"food": "whole milk", "quantity": 0.75}, {"food": "black bean mango", "quantity": 1}], "title": "\nMashed Potatoes\n"}, {"directions": "\n\n              In a large saucepan, combine the potatoes, 2 teaspoons salt, garlic and enough cold water to cover. Bring to a boil over high heat. Lower the heat to maintain a simmer and cook until fork tender, about 15 to 20 minutes. Drain the potatoes and garlic leaving just enough water in the pan to cover the bottom. Return the potatoes and garlic to the pan. Add the butter and mash until melted. In the microwave, heat the milk until just hot, but not boiling. Stir into the potatoes and season with salt and pepper, to taste. Serve immediately. \n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 2.0}, {"food": "salt", "quantity": 1.5}, {"food": "garlic powder", "quantity": 4.0}, {"food": "butter oil", "quantity": 0.25}, {"food": "whole milk", "quantity": 0.75}, {"food": "black bean mango", "quantity": 1}], "title": "\nMashed Potatoes\n"}, {"directions": "\n\n              1. In a large saucepan, combine potatoes, 1 teaspoon salt, and enough cold water to cover. Bring to a boil over high heat. Lower heat to maintain a simmer and cook until fork tender, about 45 minutes. Drain potatoes and return to pan. Shake pan over medium heat to dry potatoes, about 1 minute. \n            \n\n              2. Halve potatoes crosswise. Working in batches, press through a ricer, cut side down, into a bowl. Discard skins, and repeat with remaining potatoes. Immediately stir butter into warm potatoes. (Alternatively, peel and mash potatoes) \n            \n\n              3. Heat milk in saucepan over medium-high heat until hot but not boiling; stir into potatoes. Season with salt and pepper to taste, and nutmeg, if desired. Serve immediately. \n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 4.0}, {"food": "black bean mango", "quantity": 1}, {"food": "butter oil", "quantity": 0.25}, {"food": "whole milk", "quantity": 0.75}, {"food": "nutmeg", "quantity": 1}], "title": "\nMashed Potatoes\n"}, {"directions": "\n\n              In a large saucepan, combine the potatoes, 1 teaspoon salt, and enough cold water to cover. Bring to a boil over high heat. Do not cover. Lower the heat to maintain a simmer and cook until fork tender, about 45 minutes.\n            \n\n              Drain the potatoes and return them to the pan. Swirl the pan over medium heat until the skins are dry, about 1 minute. Halve the potatoes crosswise. Put the halves in a ricer cut-side down and press the potato through the ricer into a bowl. The flesh should easily pass through the holes and the skins remain in the ricer. Discard the skin, and repeat with the remaining potatoes. (Alternatively, peel the cooked potatoes and put through a food mill or mash with a hand-held potato masher.)\n            \n\n              Heat the butter and milk in the saucepan over medium-high heat until hot but not boiling. Add the nutmeg, if desired, stir into the potatoes. Season with salt and pepper, to taste. Serve immediately.\n            \n\n              Variations: Add: Prepared horseradish Blue cheese Roasted garlic Chopped fresh herbs Prepared pesto Real bits of bacon Use olive oil instead of butter Prepared wasabi\n            \n\n              Copyright 2003 Television Food Network, G.P. All rights reserved\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 2.0}, {"food": "salt", "quantity": 1.0}, {"food": "butter oil", "quantity": 0.25}, {"food": "whole milk", "quantity": 0.75}, {"food": "nutmeg", "quantity": 1}, {"food": "black bean mango", "quantity": 1}], "title": "\nMashed Potatoes\n"}, {"directions": "\n\n              In a large saucepan, cover the potatoes with cold water and add 1 teaspoon of the salt. Bring to a boil over high heat, then lower the heat to maintain a simmer. Cook until fork tender, about 30 to 60 minutes depending upon the size of the potatoes.\n            \n\n              Drain the potatoes and return them to the pan. Swirl the pan over medium heat until the skins are dry, about 1 minute. Halve the potatoes crosswise. Put the halves in a ricer cut-side down, and press the potato through the ricer into a bowl. The flesh should easily pass through the holes and the skins remain in the ricer. Discard the skin, and repeat with the remaining potatoes. (Alternatively, peel the cooked potatoes and put through a food mill or mash with a hand-held potato masher.) Immediately stir the butter into the warm potatoes, then add the buttermilk and combine well.\n            \n\n              Meanwhile, heat the milk in a small saucepan until steaming but not boiling. Slowly stir the milk into the potato mixture. Season with the remaining 1 teaspoon of salt and pepper, to taste. Transfer to a serving bowl, or keep warm in a covered bowl set over a pot of simmering water.\n            \n\n              For Garlic Mashed Potatoes: Preheat the oven to 375 degrees F. Slice the top off of 2 garlic heads, put in a small baking dish, and drizzle with olive oil. Cover with foil and roast until the cloves are very soft and tan, about 1 hour. When cool enough to handle, squeeze the garlic heads to pop out the cloves. Smash the cloves with a knife or put through the ricer, and add to the mashed potatoes.\n            \n", "ingredients": [{"food": "salt", "quantity": 2.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.3333333333333333}, {"food": "whole milk", "quantity": 0.3333333333333333}, {"food": "martha white foods", "quantity": 1}, {"food": "sweet potatoes", "quantity": 1.75}], "title": "\nMashed Potatoes - Slimmed\n"}, {"directions": "\n\n              Put the potatoes in a saucepan; cover with cold water and add 2 tablespoons kosher salt. Bring to a simmer over medium-low to medium heat and cook, uncovered, until tender, about 45 minutes. Drain the potatoes and let sit until just cool enough to handle, then peel and transfer to a bowl.\n            \n\n              Add the butter to the potatoes. Add the milk, 2 teaspoons kosher salt, and pepper to taste; mash with a potato masher or fork.\n            \n\n              Fold in the horseradish. Spoon the mashed potatoes into a serving dish and sprinkle with the scallions.\n            \n\n              Photograph by Yunhee Kim\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 1.5}, {"food": "milk", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "horseradish", "quantity": 2.0}, {"food": "", "quantity": 1.25}], "title": "\nMashed Potatoes With Horseradish and Scallions\n"}, {"directions": "\n\n              Cover the rutabaga and potatoes with cold, generously salted water in a large pot and bring to a boil over medium-high heat. Reduce the heat and simmer until the vegetables are fork-tender, about 30 minutes. \n            \n\n              Drain the vegetables and return to the pot over low heat. Stir in 8 tablespoons butter. Mash with a potato masher, ricer or food mill until smooth, adding the warm half-and-half and 2 teaspoons salt. Keep warm while preparing breadcrumbs. \n            \n\n              Melt the remaining 4 tablespoons butter with the olive oil in a large skillet over medium-high heat. Add the lemon zest and scallions. Add 1/2 teaspoon salt and cook, stirring, until fragrant, about 2 minutes. Add the parsley and breadcrumbs and cook over medium-low heat, stirring until evenly toasted, 3 to 4 more minutes. (If the breadcrumbs toast too quickly, reduce the heat.)\n            \n\n              Transfer the mashed vegetables to a large shallow platter and sprinkle with the breadcrumbs just before serving. Garnish with scallion slices. (To curl them, julienne whole scallions and place in ice water.) \n            \n\n              Photograph by Anita Calero\n            \n", "ingredients": [{"food": "turnip greens", "quantity": 2.0}, {"food": "sweet potatoes", "quantity": 2.0}, {"food": "butter oil", "quantity": 12.0}, {"food": "", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.5}, {"food": "whole milk", "quantity": 8.0}, {"food": "parsley", "quantity": 0.3333333333333333}, {"food": "", "quantity": 1.5}], "title": "\nMashed Potatoes and Rutabaga with Lemon\n"}, {"directions": "\n\n              In a large saucepan, combine the potatoes, 1 teaspoon salt, and enough cold water to cover. Bring to a boil over high heat. Lower the heat to maintain a simmer and cook until fork tender, about 10 minutes. Drain the potatoes and return to the pan. Shake the pan over medium heat for about a minute to dry the potatoes. Transfer the potatoes to a food mill, ricer, or bowl. \n            \n\n              Mash the potatoes through the food mill, ricer, or by hand into the pan. Stir in the low-fat milk, buttermilk, and dill warm over medium-low heat. Season with salt and pepper to taste and serve immediately. \n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 2.0}, {"food": "salt", "quantity": 1.0}, {"food": "milk", "quantity": 0.25}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.75}, {"food": "dill seed", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nMashed Potatoes with Buttermilk and Dill\n"}, {"directions": "\n\n              Place 2 pounds small red potatoes and 4 smashed garlic cloves in a pot; cover with salted water. Bring to a boil, then simmer until tender, 15 to 20 minutes. Reserve 1 cup cooking water; drain. Mash the potatoes with 1¿2 cup each cooking water and buttermilk, 3 tablespoons butter, 2 tablespoons chopped dill and 2 sliced scallions, adding the remaining cooking water as needed. Season with salt and pepper.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [], "title": "\nMashed Potatoes with Dill\n"}, {"directions": "\n\n              Put the potatoes in a large pot and cover with cold water by 1 1/2 inches. Add 2 teaspoons salt, the garlic and bay leaves and bring to a boil over high heat. Reduce the heat to medium to maintain a steady simmer and cook until the potatoes are tender but not falling apart, about 20 minutes. Drain well and return to the pot off the heat; discard the bay leaves.\n            \n\n              Add the half-and-half, 2 tablespoons butter and a few grinds of pepper to the pot. Mash the potatoes until very smooth. Add the mascarpone and mash until creamy, adding more half-and-half as needed to loosen. Season with salt and pepper. Transfer to a serving dish.\n            \n\n              Melt the remaining 2 tablespoons butter in a small skillet over medium heat; cook, swirling the pan occasionally, until the butter starts browning, 3 minutes. Add the sage leaves and cook until crisp, 30 seconds to 1 minute. Add a pinch of salt and swirl to dissolve; pour over the potatoes before serving.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "garlic powder", "quantity": 4.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "", "quantity": 0.25}, {"food": "butter oil", "quantity": 4.0}, {"food": "pepper", "quantity": 1}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "chrysanthemum leaves", "quantity": 12.0}], "title": "\nMashed Potatoes with Fried Sage\n"}, {"directions": "\n\n              Beat the butter in a small bowl with a rubber spatula until creamy. Add the parsley, 1/4 teaspoon salt and the nutmeg and mix to combine. Scrape the butter onto a piece of plastic wrap and form into a log. Wrap tightly and refrigerate until firm, at least 30 minutes, or freeze up to 1 week.\n            \n\n              Combine the milk, 1 teaspoon salt and the bay leaf in a large saucepan. Peel the potatoes and cut into 1-inch pieces, adding them to the pot as you go so they don't discolor. Bring to a gentle simmer over medium heat; cook, stirring to prevent the milk from scorching, until the potatoes are very tender, 15 to 20 minutes.\n            \n\n              Drain the potatoes, reserving the milk in a liquid measuring cup or bowl; discard the bay leaf. Return the potatoes to the saucepan and add all but about 1 tablespoon of the herb butter. Mash with a potato masher, gradually adding the reserved milk as needed, until creamy (you may have leftover milk). Season with salt. Transfer to a serving dish and top with the remaining 1 tablespoon herb butter just before serving.\n            \n\n              Photograph by Chris Court\n            \n", "ingredients": [{"food": "butter oil", "quantity": 6.0}, {"food": "parsley", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "nutmeg", "quantity": 0.125}, {"food": "milk", "quantity": 3.0}, {"food": "corier leaf", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 2.0}], "title": "\nMashed Potatoes with Herb Butter\n"}, {"directions": "\n\n              In a large saucepan, combine the potatoes, 1 teaspoon salt, and enough cold water to cover. Bring to a boil over high heat. Lower the heat to maintain a simmer and cook until fork tender, about 10 minutes. Drain the potatoes and return to the pan. Shake the pan over medium heat for about a minute to dry the potatoes. Transfer the potatoes to a food mill, ricer, or bowl. \n            \n\n              Put the milk and butter in the saucepan, and heat over medium-high heat until the butter melts and the milk is hot. Remove pan from the heat and add the horseradish. Mash the potatoes through the food mill, ricer, or by hand into the pan. Stir to combine with the milk and butter. Season with salt and pepper to taste. Serve immediately. \n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 2.0}, {"food": "salt", "quantity": 1.0}, {"food": "whole milk", "quantity": 0.75}, {"food": "butter oil", "quantity": 0.25}, {"food": "horseradish", "quantity": 4.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nMashed Potatoes with Horseradish\n"}, {"directions": "\n\n              Put the potatoes in a large saucepan and cover with cold water by 1 inch. Season generously with salt and bring to a boil. Reduce the heat to medium low and simmer until the potatoes are very tender but not falling apart, about 15 minutes.\n            \n\n              Meanwhile, melt 4 tablespoons butter in a large skillet over medium heat. Add the leeks, thyme and rosemary. Cook, stirring, until the leeks soften, 12 to 15 minutes; season with salt and pepper and set aside.\n            \n\n              Drain the potatoes and return to the pot over low heat; cook until any excess water evaporates, about 2 minutes. Add the remaining 1½ sticks butter, reserving 1 tablespoon for topping, and mash with a potato masher until smooth and the butter has melted. Gradually mash in ½ cup milk and ½ teaspoon salt until creamy, adding up to ¼ cup more milk as needed. Season with salt and pepper and stir in the cooked leeks.\n            \n\n              Transfer the potatoes to a bowl; top with the remaining butter before serving.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "", "quantity": 2.5}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 2.0}, {"food": "silk light vanilla", "quantity": 2.0}, {"food": "thyme", "quantity": 1.0}, {"food": "rosemary", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "milk", "quantity": 1.25}], "title": "\nMashed Potatoes with Leeks\n"}, {"directions": "\n\n              In a large saucepan, combine the potatoes, 1 teaspoon salt and cold water to cover. Bring to a boil over high heat. Lower the heat to maintain a simmer and cook until fork-tender, about 10 minutes. Drain the potatoes, reserving 1/2 cup of the cooking liquid. Return the potatoes to the pan. Shake the pan over medium heat for about a minute to dry the potatoes. Transfer the potatoes to a food mill, ricer or bowl.\n            \n\n              Add the oil and reserved cooking liquid to the saucepan and warm over medium heat. Remove the pan from the heat. Mash the potatoes through the food mill or ricer into the pan (or mash by hand in the bowl and transfer to the pan). Add the basil, parsley and tarragon and stir to combine. Season with salt and pepper. Serve immediately.\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 2.0}, {"food": "salt", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "basil", "quantity": 1.0}, {"food": "parsley", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nMashed Potatoes with Olive Oil and Herbs\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F.\n            \n\n              Place sweet potatoes on a baking sheet and roast until easily pierced with a fork, about 1 hour.\n            \n\n              Peel the sweet potatoes while still hot. Combine the potatoes, butter, salt, orange juice, maple syrup, and chicken broth in a large bowl. Mash with a potato masher until the potatoes are smooth. Serve immediately. (This can be prepared a day ahead and reheated).\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 3.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "salt", "quantity": 1.0}, {"food": "orange juice", "quantity": 0.25}, {"food": "syrup", "quantity": 2.0}, {"food": "diced chicken", "quantity": 2.0}], "title": "\nMashed Sweet Potatoes\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Pierce the sweet potatoes 2 or 3 times with a fork. Bake in a roasting pan for 45 to 60 minutes, until tender. Cut the potatoes in half, lengthwise. Hold the sweet potatoes with a potholder or towel and scoop out the potato flesh into a food mill or ricer.\n            \n\n              In a medium saucepan, heat the butter, syrup, zest, and vinegar over medium heat. Remove from the heat and mash the sweet potatoes in the pan. Stir to combine evenly. Season to taste with salt and pepper. Serve immediately.\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 2.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "syrup", "quantity": 2.0}, {"food": "orange", "quantity": 0.5}, {"food": "vinegar", "quantity": 0.5}, {"food": "salt", "quantity": 0.75}, {"food": "black bean mango", "quantity": 1}], "title": "\nMashed Sweet Potatoes\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Pierce the potatoes all over with a fork and place on a baking sheet. Bake until completely soft, about 45 minutes. Let cool slightly. Split the potatoes in half, scoop out the flesh into a medium bowl and set aside. Discard the skins.\n            \n\n              Cook the bacon in a large saucepan over medium heat, stirring, until crisp, 8 to 9 minutes. Remove with a slotted spoon to a paper towel¿lined plate. Add the bourbon or cider to the drippings in the saucepan and cook until mostly evaporated, about 30 seconds. Add the potatoes, heavy cream, butter, maple syrup and 1 1/2 teaspoons salt; mash with a potato masher until smooth and warmed through.\n            \n\n              Transfer the potatoes to a bowl; top with the bacon and drizzle with more maple syrup before serving.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 3.0}, {"food": "bacon", "quantity": 3.0}, {"food": "apple", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "butter oil", "quantity": 6.0}, {"food": "syrup", "quantity": 3.0}, {"food": "salt", "quantity": 1}], "title": "\nMashed Sweet Potatoes with Bacon\n"}, {"directions": "\n\n              Put all the potatoes in a large saucepan and cover with cold water by 1 inch. Season generously with salt and bring to a boil. Reduce the heat to medium and simmer until very tender, about 15 minutes.\n            \n\n              Drain the potatoes; return to the saucepan over low heat. Cook until any remaining water evaporates, about 2 minutes. Add the cayenne, 1/2 teaspoon salt and all but 2 tablespoons butter; mash with a potato masher until smooth. Gradually mash in the milk until creamy. Season with black pepper; transfer to a serving dish.\n            \n\n              Melt the remaining 2 tablespoons butter in a skillet over medium heat until just beginning to brown, 3 to 5 minutes. Stir in the pecans; cook until lightly toasted, 1 to 2 minutes, then remove from the heat. Stir in the brown sugar; pour over the mashed potatoes.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 1.25}, {"food": "sweet potatoes", "quantity": 1.25}, {"food": "salt", "quantity": 1}, {"food": "hearts of palm", "quantity": 1}, {"food": "butter oil", "quantity": 1.5}, {"food": "milk", "quantity": 0.75}, {"food": "black bean mango", "quantity": 1}, {"food": "pecans", "quantity": 0.3333333333333333}, {"food": "sugar", "quantity": 1.0}], "title": "\nMashed Sweet Potatoes with Pecans\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: a meat mallet; kitchen twine\n\n              For the flank steak: Prepare an outdoor grill for cooking over direct and indirect heat (if your grill has a thermometer, aim to keep the temperature at about 350 degrees F throughout grilling).\n            \n\n              Heat a medium skillet over medium heat. When the skillet is hot, add 1 tablespoon olive oil. Add the chorizo and cook, stirring and finely crumbling with a wooden spoon until cooked through, about 4 minutes. Drain on paper towels and let cool.\n            \n\n              Set the flank steak on a cutting board. Use a knife to score the steak down the middle against the grain, halfway through its thickness. Working from the center line, out toward the edges, cut thin flaps from the score to the edge, like a gatefold. Pound with the flat side of a meat mallet to an even thickness of about 1/2 inch. Sprinkle both sides of the steak with salt and pepper and brush with the remaining 2 tablespoons olive oil.\n            \n\n              Chop the cilantro, parsley, olives, pickled jalapenos and garlic together on a cutting board to make a chunky paste. Brush the steak with the mustard. Spread the herb paste over the steak, leaving empty a 1-inch border around the edges. Pat to adhere the paste to the meat. Starting a third of the way in from the right, make 4 equidistant lines of egg. Between the egg lines, mound lines of chorizo, then carrots and then peppers, covering all but that first third of the steak's surface. Roll the steak around the fillings like a jelly roll, from the filled to the empty side. Tie closed at 2-inch intervals around the circumference with kitchen twine. Tie 1 more piece of twine lengthwise around the meat.\n            \n\n              Lightly oil the grill grates. Grill the steak on the direct-heat side of the grill to brown all 4 sides, about 2 minutes per side. Move the steak to the indirect-heat side of the grill, cover and cook, turning occasionally and testing the temperature frequently, until the very center reads 115 degrees F on an instant-read thermometer, for a steak that is well-done on the outside and medium-rare in the center, 25 to 30 minutes more. Transfer the matambre to a cutting board to rest.\n            \n\n              For the chimichurri sauce: Finely chop the cilantro, parsley and garlic on a cutting board. Transfer to a small bowl and stir in the red pepper flakes, vinegar and 1/2 teaspoon salt. Stir in the olive oil.\n            \n\n              Untie and slice the flank steak into 6-thick slices on a slight bias. Serve with the chimichurri sauce for drizzling.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "little links", "quantity": 2.0}, {"food": "", "quantity": 1.5}, {"food": "black bean mango", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 1.5}, {"food": "chrysanthemum leaves", "quantity": 1.5}, {"food": "pasta with tomato sauce", "quantity": 0.3333333333333333}, {"food": "luncheon slices", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "eggs", "quantity": 3.0}, {"food": "turkey sticks", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.25}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "vinegar", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.5}], "title": "\nMatambre with Chimichurri Sauce\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Butter a 13-by-9-inch metal baking pan, then line the bottom and sides with parchment paper; butter the parchment paper. Dust the inside of the pan with flour and knock out the excess.\n            \n\n              In a large microwavable bowl, microwave the butter until it melts, about 1 1/2 minutes. Add two-thirds of the white chocolate, then shake the bowl so that the butter covers the chocolate; let stand for 1 minute. Starting from the center of the bowl, whisk the butter and white chocolate together slowly until smooth. Add the matcha powder and whisk until smooth.\n            \n\n              In another large bowl, vigorously whisk together both sugars, the vanilla, salt and eggs until smooth, lightened in color and foamy, about 30 seconds. Scrape the matcha mixture into the bowl and whisk until smooth. Add the flour and use a rubber spatula to fold it in until just incorporated.\n            \n\n              Scrape the batter into the prepared baking pan, spreading it evenly, and smooth the top. Bake until light brown on top and a toothpick inserted halfway between the center and edges comes out clean, about 35 minutes. \n            \n\n              Remove the baking pan from the oven and immediately sprinkle the remaining 4 ounces white chocolate evenly over the top of the \"matchies\"; let stand for 1 minute. Using a small butter knife or offset spatula, spread the chocolate evenly over the top, creating swirls and peaks. \n            \n\n              Let the \"matchies\" cool completely, then use the parchment paper to lift them from the pan to a cutting board. Slice them into 24 squares and serve. Store leftovers in a single layer in an airtight container for up to 5 days.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 2.5}, {"food": "potato flour", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 12.0}, {"food": "onion powder", "quantity": 0.3333333333333333}, {"food": "sugar", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "salt", "quantity": 1.0}, {"food": "eggs", "quantity": 4.0}], "title": "\nMatcha Blondies (\"Matchies\")\n"}, {"directions": "\n\n              Place the lemon half, sugar and matcha into a blender along with 1 cup water and 1 cup ice cubes. Blend until completely smooth and the ice has almost melted with only a little slush remaining, about 2 minutes. Strain the mixture into a liquid measuring cup to catch any seeds or pith.\n            \n\n              Pour into 2 collins glasses, add ice and serve with straws and slices of lemon.\n            \n", "ingredients": [{"food": "lemon peel", "quantity": 0.5}, {"food": "sugar", "quantity": 3.0}, {"food": "onion powder", "quantity": 1.0}], "title": "\nMatcha Lemonade\n"}, {"directions": "\nSpecial equipment: kitchen twine\n\n              Preheat the oven to 475 degrees F. Place the butter in a bowl and mash with a fork until smooth. Add the matcha and 1 teaspoon salt and stir until evenly combined.\n            \n\n              Slide your forefinger gently under the skin of the chicken and loosen it from the breasts and thighs. Using a spoon, stuff scoops of matcha butter underneath the skin of the breasts and thighs and press it so it spreads out evenly. Take any remaining matcha butter from the bowl (or that doesn't get underneath the skin), and rub it all over the outside of the chicken. Sprinkle the chicken generously with more salt and pepper.\n            \n\n              Peel off the outer layers of each leek until you have at least 8 inches of white and light green parts to each. Roughly chop enough tough green parts to make a handful, then trim off and discard the rest. Cut the white and light green leeks crosswise into 1-inch-thick rounds and rinse thoroughly to remove any dirt on them. Place the leek rounds and olive oil in a bowl, sprinkle with salt and pepper and toss gently to coat. Arrange the rounds on a rimmed baking sheet flat-side down so they form a \"bed\" for the chicken. Stuff the chopped greens inside the chicken along with the garlic. Tie the legs together with kitchen twine and place the chicken on the bed of leeks. \n            \n\n              Bake the chicken for 20 minutes, then reduce the oven temperature to 400 degrees F and continue baking until the chicken is golden brown, the skin is crisp and an instant-read thermometer inserted into the thigh reads 160 degrees F, about 1 hour.\n            \n\n              Remove the baking sheet from the oven and let the chicken rest for 10 minutes. Transfer the chicken to a cutting board and cut into serving pieces. Scrape the leeks and pan juices into a bowl and toss together until evenly coated. Transfer the leeks to a serving platter and arrange the chicken on top of the vegetables. Spoon any pan juices over the chicken and sprinkle with the parsley.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 6.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "diced chicken", "quantity": 3.0}, {"food": "leeks", "quantity": 4.25}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 6.0}, {"food": "parsley", "quantity": 2.0}], "title": "\nMatcha Roast Chicken with Leeks\n"}, {"directions": "\n\n              Melt the butter in a large saucepan over medium heat. Add the mushrooms, thyme and the white and light green parts of the scallions, then sprinkle with salt and pepper and cook, stirring, until the mushrooms caramelize and start sticking to the bottom of the pan, about 10 minutes. Scoop out about 1/2 cup mushrooms and transfer to paper towels to drain.\n            \n\n              Sprinkle the matcha over the mushrooms in the pan and cook, stirring, for 2 minutes. Pour in the wine and stir to scrape up any browned bits on the bottom of the pan. Pour in the chicken stock and spinach, bring to a simmer and cook, stirring occasionally, until reduced slightly, about 10 minutes.\n            \n\n              Remove the soup from the heat and, working in two batches, use a blender to puree the soup until very smooth, about 2 minutes for each batch. Return the pureed soup to the pot, stir in the cream and season with salt and pepper. \n            \n\n              Ladle the soup into serving bowls and garnish with the reserved mushrooms and scallion greens.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "thyme", "quantity": 4.0}, {"food": "silk light vanilla", "quantity": 6.0}, {"food": "onion powder", "quantity": 2.0}, {"food": "martha white foods", "quantity": 0.25}, {"food": "diced chicken", "quantity": 8.0}, {"food": "mustard spinach", "quantity": 10.0}, {"food": "ice cream swich", "quantity": 1.0}], "title": "\nMatcha and Mushroom Soup\n"}, {"directions": "\n\n              Combine the coconut, pistachios and matcha in a small bowl; set aside. Microwave the chocolate in a small microwave-safe bowl in 30-second intervals, stirring, until melted. Let cool slightly, then spoon into a small resealable plastic bag and snip off one corner.\n            \n\n              Make the strawberry ladybugs: Hull the strawberries, then cut a slice off one side of each so they lie flat. Set aside the strawberry trimmings. Pipe a line down the center of each strawberry with the melted chocolate and add dots on both sides of the line. Pipe some chocolate into the hulled center of each strawberry and attach a blueberry; let set.\n            \n\n              Puree the strawberry trimmings, frozen fruit blend, banana, coconut milk and honey in a blender until smooth. Divide between 2 bowls. Top with the coconut mixture and strawberry ladybugs.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "coconut water", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "strawberries", "quantity": 4.0}, {"food": "blueberries", "quantity": 4.0}, {"food": "fruit cocktail", "quantity": 2.0}, {"food": "banana", "quantity": 1.0}, {"food": "coconut milk", "quantity": 1.0}, {"food": "honey smoked ham", "quantity": 1.0}], "title": "\nMatcha-Do About Nuttin'\n"}, {"directions": "\nSpecial equipment: a pastry brush\n\n              Line a baking sheet with parchment paper and set aside. Combine the flour, sugar, matcha, baking powder and 1 teaspoon salt in a large bowl and whisk until evenly combined. Add the chilled butter and rub it into the flour with your fingers until it resembles a coarse meal. Combine the chives and tarragon in a small bowl, then scoop out and reserve 1 tablespoon of the herbs in another bowl. Sprinkle the remaining herbs in the flour mixture and toss until evenly incorporated.\n            \n\n              Form a well in the center of the flour mixture, then pour in the cream. Using a fork, stir until the dough just comes together (it will be wet and sticky). Transfer the dough to well-floured work surface and, using well-floured hands, pat into a 9-by-6-inch rectangle, about 3/4-inch thick. Using a large knife, halve the rectangle lengthwise, then cut crosswise into thirds, creating six 3-by-3-inch squares. Halve each square diagonally to create 12 triangles, then transfer all the triangles to the prepared baking sheet and space apart evenly. Freeze for 1 hour to firm up.\n            \n\n              Meanwhile, in a small bowl, add the room temperature butter, pepper and the remaining 1/4 teaspoon salt. Add the reserved herbs and stir to combine. Set aside. \n            \n\n              Preheat the oven to 400 degrees F.\n            \n\n              Using a pastry brush, dust off any excess flour attached to the scones, then brush the tops of the scones with cream. Bake the scones until puffed and golden brown on top, 20 to 25 minutes. Transfer the scones to a wire rack and let cool for 10 minutes, then serve warm with the herb butter on the side.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.25}, {"food": "sugar", "quantity": 2.0}, {"food": "onion powder", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 1.25}, {"food": "butter oil", "quantity": 10.25}, {"food": "chives", "quantity": 0.3333333333333333}, {"food": "", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1.25}, {"food": "pepper", "quantity": 0.25}], "title": "\nMatcha-Herb Scones\n"}, {"directions": "\nSpecial equipment: eight 4-ounce ramekins\n\n              Stir the gelatin and 2 tablespoons cold water together in a small bowl and let stand for 5 minutes.\n            \n\n              Meanwhile, whisk together the matcha powder and 1/2 cup sugar in a small saucepan until no large lumps remain. Pour in 1/4 cup of the half-and-half and whisk until it forms a smooth, thick paste. Pour in the vanilla and 1 more cup half-and-half and stir until smooth. Place the saucepan over medium heat and cook, stirring occasionally, until the cream just begins to simmer at the edges and the sugar dissolves, about 5 minutes.\n            \n\n              Remove the saucepan from the heat and immediately whisk the gelatin into the hot mixture until it dissolves. Pour the remaining half-and-half into the saucepan and stir until evenly combined.\n            \n\n              Using a ladle or liquid measuring cup, pour the matcha cream into eight 4-ounce ramekins. Refrigerate the ramekins until the cream is firm, about 3 hours.\n            \n\n              Meanwhile, place the strawberries in one small bowl and the kiwis in another. Evenly divide the remaining 2 teaspoons sugar between both bowls, toss to coat the fruit, then let stand for 15 minutes.\n            \n\n              To serve, briefly dip the bottom of each ramekin in a bowl of hot water for 10 to 15 seconds to loosen the panna cottas. Invert each panna cotta onto a small serving plate, spoon the strawberries and kiwis around the sides and sprinkle each lightly with the poppy seeds before serving.\n            \n", "ingredients": [{"food": "", "quantity": 2.25}, {"food": "onion powder", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 8.0}, {"food": "pineapple chunks", "quantity": 2.5}, {"food": "seeds", "quantity": 2.0}], "title": "\nMatcha-Poppy Seed Panna Cotta\n"}, {"directions": "\n\n              Place the chicken in a large pot so it fits snugly and fill the pot with enough water to cover the chicken by 1 inch. Bring to a boil over high heat, then reduce the heat to maintain a simmer. Cook for 15 minutes, using a ladle to skim the foam that rises to the surface. Add the garlic, bay leaves, peppercorns and 1 tablespoon plus 1 teaspoon salt and continue cooking for another 30 minutes. Skim any fat that rises to the surface and reserve. You should have about 1/4 cup¿if necessary, add vegetable oil to equal 1/4 cup and set aside to cool slightly. Add the celery, carrots, onion and parsley sprigs to the pot and continue to cook until the vegetables are soft and the chicken is tender but not falling apart, about 45 minutes.\n            \n\n              Meanwhile, whisk together the eggs and chicken fat in a medium bowl, then stir in the seltzer, chopped dill, matzo meal and 1 1/2 teaspoons salt until combined; cover and refrigerate. Chill until the mixture is firm, at least 30 minutes and up to 2 hours. \n            \n\n              When the chicken is cooked, carefully remove it from the broth with a slotted spoon and place on a rimmed baking sheet along with the vegetables; let cool. Return the broth to a simmer. Scoop heaping tablespoons of the matzo mixture, using your hands to gently roll them into balls (wet your hands to prevent sticking). Carefully drop the matzo balls into the simmering broth. Cover and simmer on low until the matzo balls are completely cooked through and fluffy, about 1 hour.\n            \n\n              While the matzo balls cook, pick the meat from the chicken and roughly chop it, discarding the skin and bones. Slice the celery and carrots into 1/4-inch-thick pieces and discard the onion and aromatics. \n            \n\n              When ready to serve, return the chicken, celery and carrots to the broth. Increase the heat to high to bring the soup to a simmer, then remove from the heat. Gently ladle the soup in to serving bowls, being careful not to break up the matzo balls. Top with fresh chopped dill and serve.\n            \n", "ingredients": [{"food": "whole milk", "quantity": 1.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "chrysanthemum leaves", "quantity": 3.0}, {"food": "black bean mango", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "celery seed", "quantity": 3.0}, {"food": "carrots", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "parsley", "quantity": 3.0}, {"food": "eggs", "quantity": 4.0}, {"food": "coconut water", "quantity": 0.3333333333333333}, {"food": "dill seed", "quantity": 2.0}, {"food": "soy meal", "quantity": 1.0}], "title": "\nMatzo Ball Soup\n"}]