[{"directions": "\n\n              SET UP: Preheat the oven to 350 degrees F.\n            \n\n              BROWN THE CHORIZO AND ONION: Cook the chorizo until browned in a large nonstick skillet over medium-high heat, about 8 minutes. Transfer to a 3-quart baking dish, leaving the fat in the skillet. Saute the onion in the pan drippings until golden, about 6 minutes. Stir in the beans, then transfer to the baking dish.\n            \n\n              ASSEMBLE AND BAKE: Beat the eggs, heavy cream, and sour cream with 3/4 teaspoon salt and a couple turns of pepper. Gently pour the eggs over the meat and beans. Press the chips into the mixture so they stand up. Sprinkle with the Cheddar and bake until the eggs are just set, about 45 minutes. Sprinkle with the cilantro and serve with salsa.\n            \n", "ingredients": [{"food": "sausage", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "fava beans", "quantity": 1.0}, {"food": "eggs", "quantity": 8.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "sour cream", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "tortilla", "quantity": 3.0}, {"food": "", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "", "quantity": 1}], "title": "\nNacho Bake\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Put the flour in a large bowl. Put the crushed chips in another large bowl and whisk the eggs in a third bowl. Toss the drumsticks in the flour. One at a time, dip each drumstick in the beaten egg and dredge in the crushed chips, turning to coat. Place on a baking sheet until ready to fry.\n            \n\n              Preheat the oven to 425 degrees F. Fill a large pot with 3 inches of vegetable oil and heat over medium-high heat until a deep-fry thermometer registers 350 degrees F. Working in batches, fry the drumsticks until golden and cooked through, about 15 minutes. Drain on paper towels and season with salt. (Let the oil return to 350 degrees F between batches.)\n            \n\n              Arrange the drumsticks on a large ovenproof platter and sprinkle with the cheese. Bake until the cheese melts, about 4 minutes. Top with salsa, guacamole and pickled jalapenos. \n            \n\n              Photograph by Johnny Miller\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.0}, {"food": "tortilla", "quantity": 1.0}, {"food": "eggs", "quantity": 4.0}, {"food": "diced chicken", "quantity": 12.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "cheddar cheese", "quantity": 1.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1}], "title": "\nNacho Chicken Drumsticks\n"}, {"directions": "\n\n              Cut the avocado in half, and remove the pit. Scoop out the flesh into a medium bowl, and mash with a potato masher until mostly smooth. Add the cilantro, lime juice and 1/4 teaspoon salt, and stir to combine. Refrigerate the guacamole, covered, until ready to use.\n            \n\n              Combine 1 1/2 cups of the Cheddar, sour cream and jalapenos in a medium bowl.\n            \n\n              Working on top of a long piece of parchment or wax paper (about 22 inches long), lay out 2 tortillas, overlapping in the center by 2 inches so the total width is about 16 inches. Spread 1/4 cup of the beans in a 2-inch strip across the bottom of the tortillas, then 3 tablespoons of the guacamole in a 2-inch strip above the beans, then 4 tablespoons of the Cheddar-jalapeno mixture in a strip above the avocado. Place a third of the crushed tortilla chips on top of the cheese layer. (You should be halfway up the tortilla.) Starting at the bottom, roll up the log as tightly as possible, using the parchment to help you roll and keep everything tight (but do not roll the parchment into the roll itself!). Spread a thin layer of beans to seal the end of the wrap. Wrap tightly in plastic and refrigerate until set, about 30 minutes or up to overnight. Repeat with the remaining ingredients for a total of 3 rolls.\n            \n\n              Position the oven rack 4 to 5 inches from the heating element, and preheat the broiler. Line a baking sheet with aluminum foil.\n            \n\n              Unwrap the rolls, and slice them into 1-inch-thick pieces (you should have about 18 per roll). Place the rolls cut-side down on the prepared baking sheet, and sprinkle the tops with just enough of the remaining 1/2 cup Cheddar to cover (about 1 teaspoon per piece). Broil until bubbly and browned, about 45 seconds. Serve while hot with salsa and any leftover guacamole.\n            \n", "ingredients": [{"food": "avocado", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 0.25}, {"food": "", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "yellow rice", "quantity": 2.0}, {"food": "sour cream", "quantity": 0.5}, {"food": "luncheon slices", "quantity": 0.3333333333333333}, {"food": "potato flour", "quantity": 12.0}, {"food": "refried beans", "quantity": 15.0}, {"food": "corn bran", "quantity": 1.0}, {"food": "", "quantity": 1}], "title": "\nNacho Roll-Ups\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. \n            \n\n              Spread half the chips out in a large shallow casserole dish or on an ovenproof platter. Top with half the beans, in small spoonfuls, and scatter with half the chiles. Repeat with the remaining chips, beans, and chiles. Sprinkle the top of the nachos with the cheese. Bake until heated through and the cheese melts, about 3 to 5 minutes. Top the nachos with dollops of the sour cream and serve.\n            \n\nTortilla Chips:\n\n\n              Pour the oil into a large heavy-bottomed pot to a depth of about 2 inches. Place a deep-frying thermometer in the pot. Heat the oil over medium heat to 360 degrees F. \n            \n\n              Meanwhile, stack the tortillas, and cut the pile into sixths to make chips. \n            \n\n              Raise the heat to high. Working in batches, fry the chips, turning them with a skimmer or slotted spoon, until golden brown, about 2 minutes. Using a slotted spoon, transfer the chips to a paper towel-lined pan to drain. (Return the oil to the proper temperature between batches.) Cool and season with salt. Serve. \n            \n\nBaked Tortilla Chips\n\n\n              Preheat the oven to 350 degrees F. \n            \n\n              Brush both sides of the tortillas with the oil. Stack the tortillas and cut the pile into sixths to make chips. Spread the chips out in a single layer on two large baking sheets and season with salt. Bake until golden brown and crisp, rotating the baking sheets once, about 12 to 15 minutes. Serve. \n            \n\nRefried Beans:\n\n\n              In a small bowl, mash two-thirds of the beans with a fork or potato masher. Reserve the whole beans separately. \n            \n\n              In a medium skillet, heat the oil over medium-high heat and add the onion. Cook until lightly browned, about 3 to 4 minutes. Add the garlic and cook, stirring for 1 to 2 minutes more. Add the spices and cook until fragrant, about 1 minute more. Add the mashed beans and half the broth and cook, stirring frequently until thickened, about 5 minutes. Add the whole beans and the remaining broth and simmer about 4 to 5 minutes more until thickened but not pasty. Season with the salt and pepper, and stir in the fresh coriander, if desired. Serve. \n            \n", "ingredients": [{"food": "fried chicken", "quantity": 8.0}, {"food": "refried beans", "quantity": 1.5}, {"food": "diced chicken", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "sour cream", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 1}, {"food": "corn bran", "quantity": 12.0}, {"food": "salt", "quantity": 1}, {"food": "corn bran", "quantity": 6.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "fava beans", "quantity": 15.5}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "garlic powder", "quantity": 4.0}, {"food": "ground turkey", "quantity": 1.0}, {"food": "cumin seed", "quantity": 0.5}, {"food": "diced chicken", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 1.0}], "title": "\nNachos\n"}, {"directions": "\n\n              Cook the bacon in a large nonstick skillet over medium-high heat until just starting to crisp but still pliable, about 5 minutes. Remove 1 slice to a paper towel-lined plate. Continue cooking the remaining bacon until browned and crisp, 2 to 3 more minutes; remove to the plate. Halve the slice of less-cooked bacon lengthwise. Finely chop the remaining bacon.\n            \n\n              Beat the cream cheese in a large bowl with a mixer on medium-high speed until smooth and creamy, about 2 minutes. Add the cheddar, scallions, Worcestershire sauce, hot sauce, a pinch of salt and the chopped bacon; beat until combined. Refrigerate until slightly firm, about 30 minutes.\n            \n\n              Form the cheese mixture into 3 balls (about 2 inches, 2 1/2 inches and 3 inches). Refrigerate until firm, at least 30 more minutes.\n            \n\n              Meanwhile, freeze the Monterey jack cheese 1 hour (this will make it less clumpy when grated). Grate the cheese on the small holes of a box grater. Gently press all over the cheese balls to coat completely. Put the 3-inch cheese ball on a small serving plate; insert a 4-inch wooden skewer into the middle. Stack the 2 1/2-inch and 2-inch balls on top, securing on the skewer.\n            \n\n              Press the currants into the top cheese ball for eyes; add a carrot nose. Use the halved bacon to make a scarf and add rosemary sprigs for arms. Place the pretzel crisp on top for a hat brim. Cut off about one-third of the olive so that it sits flat; place on top of the pretzel crisp for the hat. Serve with more pretzel crisps.\n            \n\n              Photograph by Cory Dawson\n            \n", "ingredients": [{"food": "bacon", "quantity": 4.0}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "cheddar cheese", "quantity": 1.0}, {"food": "silk light vanilla", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "currants", "quantity": 2.0}, {"food": "carrot juice", "quantity": 1.0}, {"food": "rosemary", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1.0}], "title": "\nName This Dish Cheese Ball\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Combine the cornichons and brine, radish, shallot, 1 tablespoon vinegar, 1/4 teaspoon salt and a few of grinds of pepper in a medium bowl; set aside. Whisk the remaining 2 tablespoons vinegar and the mustard in a separate bowl. Slowly whisk in the olive oil and season with salt and pepper; set aside.\n            \n\n              Wrap a slice of bacon around each hot dog in a spiral. Heat a large skillet over medium heat. Add the hot dogs and cook, giving them a quarter turn occasionally, until the bacon is crisp, 10 to 15 minutes.\n            \n\n              Split open the croissants, leaving the two halves attached at the hinge. Place opened up on a baking sheet and top with the cheese. Bake until the cheese is melted, about 5 minutes.\n            \n\n              Fill each croissant with a hot dog; top with some frisee and cornichon relish and drizzle generously with the vinaigrette. Serve with more mustard.\n            \n\n              Photograph by Ralph Smith\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 0.3333333333333333}, {"food": "diced chicken", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "vinegar", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "bacon", "quantity": 4.0}, {"food": "hot pockets ham cheese stuffed swich", "quantity": 4.0}, {"food": "croissants", "quantity": 4.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "dessert topping", "quantity": 1}], "title": "\nName This Dish Hot Dog\n"}, {"directions": "\n\n              Mix the ketchup, the juice of 1 lemon, 2 tablespoons vodka, the horseradish and hot sauce in a medium bowl; set aside.\n            \n\n              Preheat the broiler. Whisk the olive brine, olive oil, thyme, the juice of the remaining lemon and the remaining 2 tablespoons vodka in a medium bowl. Add the shrimp and toss to coat. Wrap each shrimp with 1/2 slice bacon and arrange on a baking sheet; pour the juices from the bowl over the shrimp. Broil until the shrimp is cooked through and the bacon is crisp, about 4 minutes per side. Let cool slightly.\n            \n\n              Skewer each shrimp with a cocktail pick, placing an olive inside the curve of the shrimp. Add a cube of lettuce to each skewer. Serve with the prepared cocktail sauce.\n            \n\n              Photograph by Ralph Smith\n            \n", "ingredients": [{"food": "", "quantity": 0.5}, {"food": "", "quantity": 2.0}, {"food": "barley flour or meal", "quantity": 0.25}, {"food": "horseradish", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 0.5}, {"food": "olives", "quantity": 12.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "thyme", "quantity": 0.5}, {"food": "shrimp", "quantity": 12.0}, {"food": "bacon", "quantity": 6.0}, {"food": "lettuce", "quantity": 0.5}], "title": "\nName This Dish: B-L-Sea\n"}, {"directions": "\n\n              Heat 1 inch of vegetable oil in a medium saucepan until a deep-fry thermometer registers 350 degrees F. Tear off four 24-inch-long sheets of foil; tightly roll each up from a short end to make 4 tubes, about 1/2- inch in diameter. Cut each tube in half with scissors. Loosely wrap a gyoza wrapper around each tube; dab with water to seal the overlapping edge.\n            \n\n              Working in two batches, fry the wrappers (on the foil tubes), turning once with tongs, until golden brown, about 1 minute. Transfer to a paper towel-lined plate to drain. Remove the foil tubes from the shells using tongs (the foil will be very hot). Let the shells cool completely.\n            \n\n              Mix the goat cheese and ricotta in a small bowl until smooth. Add the olives, fennel seeds, cayenne and a pinch of salt; mix to combine. Transfer the cheese mixture to a resealable plastic bag and snip off a corner. Pipe into the shells from both ends to fill completely. Sprinkle the exposed filling with more chopped olives and pistachios.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1}, {"food": "barley flour or meal", "quantity": 8.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "macaroni cheese", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1.0}, {"food": "fennel seed", "quantity": 0.5}, {"food": "hearts of palm", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "dessert topping", "quantity": 1}], "title": "\nName This Dish: Ricotta Be Kidding Me\n"}, {"directions": "\n\n              Toppings: Creamy mac and cheese\n            \n\n              How to Make Classic Potato Skins:\n            \n\n              Pierce 4 large russet potatoes with a fork. Bake directly on the oven rack at 350 degrees until tender, about 1 hour. Let cool, then quarter lengthwise and scoop out the flesh, leaving a 1/4-inch shell. Brush both sides with melted butter and season with salt and pepper. Bake, skin-side up, at 450 degrees until crisp, about 20 minutes. Add your favorite team toppings. (For cheesy skins, flip the baked shells over before topping, sprinkle with 1 cup grated cheddar cheese and bake an extra 5 minutes.)\n            \n\n              Photograph by Karl Juengel/Studio D\n            \n", "ingredients": [], "title": "\nNashville Side Potato Skins\n"}, {"directions": "\n\n              Place the beans in a large saucepan and cover with cold water by about 2 inches. Bring to a boil and lower the heat to a simmer. Cook for 5 minutes; remove from the heat, cover, and let sit for one hour. Drain and reserve. Tie the parsley, thyme, and bay leaf together with kitchen twine.\n            \n\n              In a large soup pot or Dutch oven combine the beans, herb bundle, hocks, onions, and garlic with the water. Bring to a boil, cover, and adjust the heat so the soup cooks at a gentle simmer. Cook until the beans and hock are completely tender, about 1 1/2 hours.\n            \n\n              Turn off the heat and remove the hocks. Cool slightly. Remove the meat from the hocks, discarding the bones, fat, and skin. Cut the meat into small cubes. Remove the herb bundle and discard.\n            \n\n              Puree about 3 cups of the beans with a some of the liquid in a blender. (For a smoother soup puree all the beans.) Stir the puree and diced meat into the soup. Heat the soup and adjust the seasoning as needed with salt and pepper.\n            \n\n              Pour into heated bowls, place a small pat of butter on top of each soup, and serve.\n            \n", "ingredients": [{"food": "fava beans", "quantity": 1.0}, {"food": "parsley", "quantity": 10.0}, {"food": "barley flour or meal", "quantity": 2.0}, {"food": "corier leaf", "quantity": 1.0}, {"food": "honey smoked ham", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 8.0}, {"food": "carrot juice", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 1}], "title": "\nNavy Bean Soup\n"}, {"directions": "\n\n              Place the beans in a large saucepan and cover with cold water by about 2 inches. Bring to a boil and lower the heat to a simmer. Cook for 5 minutes; remove from the heat, cover, and let sit for one hour. Drain and reserve. Tie the parsley, thyme, and bay leaf together with kitchen twine.\n            \n\n              In a large soup pot or Dutch oven combine the beans, herb bundle, hocks, carrots, onions, and garlic with 8 cups water. Bring to a boil, cover, and adjust the heat so the soup cooks at a gentle simmer. Cook until the beans and hock are completely tender, about 1-1/2 hours.\n            \n\n              Turn off the heat and remove the hocks. Cool slightly. Remove the meat from the hocks, discarding the bones, fat and skin. Cut the meat into small cubes. Remove the herb bundle and discard.\n            \n\n              Puree about 3 cups of the beans with a bit of the liquid in a blender. (For a smoother soup puree all the beans.) Stir the puree and diced meat into the soup. Heat the soup and adjust the seasoning as needed with salt and pepper. To serve divide the soup among heated bowls. Place a small pat of butter on top each soup and serve.\n            \n", "ingredients": [{"food": "fava beans", "quantity": 1.0}, {"food": "parsley", "quantity": 10.0}, {"food": "barley flour or meal", "quantity": 2.0}, {"food": "corier leaf", "quantity": 1.0}, {"food": "honey smoked ham", "quantity": 2.0}, {"food": "carrot juice", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 1}], "title": "\nNavy Bean Soup\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: An 8-by-5-inch loaf pan\n\n              For the vanilla banana ice cream: Cut each banana into 6 chunks and freeze until rock solid, preferably overnight.\n            \n\n              Put the banana chunks and vanilla bean seeds in a food processor and process. Hang on, your food processor may jolt in the very beginning! The bananas will look crumbly at first, then gooey and eventually light and creamy- just like ice cream. Stop the food processor frequently to scrape down the sides of the bowl and break up any clumps. Transfer to a bowl and put in the freezer.\n            \n\n              For the chocolate banana ice cream: Cut each banana into 6 chunks and freeze until rock solid, preferably overnight.\n            \n\n              Put the banana chunks, cocoa powder and coconut oil in a food processor and process. Stop the food processor frequently to scrape down the sides of the bowl and break up any clumps. Transfer to a bowl and put in the freezer.\n            \n\n              For the strawberry banana ice cream: Cut each banana into 6 chunks and freeze until rock solid, preferably overnight.\n            \n\n              Put the banana chunks and strawberries in a food processor and process. Stop the food processor frequently to scrape down the sides of the bowl and break up any clumps.\n            \n\n              To assemble the Neapolitan banana ice cream: Scrape the vanilla-banana ice cream into 1 end of an 8-by-5-inch loaf pan so it fills about 1/3 of the length of the pan. Use a rubber spatula to push it back a bit if you need to before adding the chocolate-banana ice cream next to it, filling the middle third of the pan (it's ok if they run together a bit). Scrape the strawberry-banana ice cream into the other end of the pan. Serve right away or freeze until ready to serve. To serve, run an ice cream scoop down the loaf pan to make 3-flavored scoops.\n            \n", "ingredients": [{"food": "bananas", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "bananas", "quantity": 3.0}, {"food": "onion powder", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "bananas", "quantity": 2.0}, {"food": "strawberries", "quantity": 1.0}], "title": "\nNeapolitan Banana Ice Cream\n"}, {"directions": "\n\n              Line a 9-by-5-inch loaf pan with heavy-duty foil, leaving an overhang on all sides. Arrange 5 ice cream sandwiches snugly in the bottom of the pan. Spread the strawberry ice cream on top in an even layer. Press the remaining 5 ice cream sandwiches on top, then spread the mint chip ice cream evenly over the sandwiches. Top with an even layer of crushed cookies, pressing gently.\n            \n\n              Cover the cake with plastic wrap and freeze until set, about 4 hours. Uncover, then lift the foil to remove the cake from the pan. Invert onto a platter, remove the foil and spread with the chocolate shell topping. Serve immediately or cover and freeze for up to 2 days.\n            \n\n              Photograph by Kana Okada\n            \n", "ingredients": [{"food": "ice cream swich", "quantity": 10.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "chocolate chip cookies", "quantity": 0.5}, {"food": "cream puff shell", "quantity": 1}], "title": "\nNeapolitan Ice Cream Sandwich Cake\n"}, {"directions": "\n\n              For each sandwich, spread a scoop of neapolitan ice cream on a thin slice of pound cake, then top with another slice of cake. Smooth the edges so the ice cream is flush with the cake. Place on a plate and pour 2 tablespoons melted dark chocolate on top, letting it drip down the sides. Freeze until hard. Top with whipped cream and chopped pistachios.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nNeapolitan Ice Cream Sandwiches\n"}, {"directions": "\n\n              Make the dough: Combine the warm water and yeast in a small bowl, stirring to dissolve the yeast. Combine the flour and salt in a medium bowl. Add the yeast mixture to the flour and stir to make a shaggy dough. (The dough should be tacky. If it feels too wet and sticky, add flour, 1 tablespoon at a time; if it's too stiff, add a little water.) Transfer to a lightly oiled surface and knead until smooth and elastic, about 3 minutes. Place an inverted bowl over the dough and let rise slightly, 30 minutes. Divide the dough into 4 pieces and form each into a ball; arrange 3 inches apart on a lightly oiled baking sheet. Rub the tops of the dough lightly with olive oil and cover the baking sheet with plastic wrap. Refrigerate overnight.\n            \n\n              Remove the dough from the refrigerator about 2 hours before baking; let sit, covered, until ready to use. One hour before baking, put a pizza stone or inverted baking sheet on the middle oven rack and preheat to 500 degrees F (or 550 degrees F if your oven goes that high).\n            \n\n              Make the sauce: Combine the tomatoes and their juices with 1 teaspoon salt in a blender; blend until smooth.\n            \n\n              Generously sprinkle a pizza peel or an inverted baking sheet with cornmeal. Place 1 ball of dough upside down on the cornmeal using floured hands. Gently pull the dough into an 8- to 10-inch circle, reflouring your hands as needed and being careful not to deflate the dough. Spread about 1/4 cup tomato sauce on the crust; top with one-quarter of the mozzarella. Drizzle with 1 to 2 teaspoons olive oil and season with salt.\n            \n\n              Slide the pizza onto the hot stone and bake until the crust is dark golden brown and the cheese is bubbling, 7 to 9 minutes. Transfer to a cutting board and sprinkle with basil. Let cool 2 minutes before slicing. Repeat to make 3 more pizzas.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "", "quantity": 1.5}, {"food": "yeast extract spread", "quantity": 0.75}, {"food": "potato flour", "quantity": 4.0}, {"food": "salt", "quantity": 2.5}, {"food": "vegetable oil", "quantity": 1}, {"food": "whole milk", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "basil", "quantity": 1}], "title": "\nNeapolitan Pizza\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Bring a large pot of salted water to a boil. Whisk together 1 cup of the tomato sauce with 2 tablespoons oil in a small bowl; set aside. Season the eggplant and zucchini generously with salt and let sit in a colander for 15 minutes. Rinse with cold water and pat dry with a paper towel.\n            \n\n              Heat the remaining 3 tablespoons oil with the red pepper flakes and garlic in a large skillet over medium-high heat until shimmering but not smoking. Add the vegetables and cook, tossing occasionally, until tender, golden and crisp, about 5 minutes. \n            \n\n              Cook the pasta according to the package directions; drain, reserving 1/2 cup pasta water. Return the pasta to the pot along with the pasta water and remaining tomato sauce. Toss to coat and divide among 6 bowls. Top with the vegetables, reserved tomato sauce mixture, ricotta and basil. \n            \n", "ingredients": [{"food": "black bean mango", "quantity": 1}, {"food": "Worcestershire sauce", "quantity": 24.0}, {"food": "vegetable oil", "quantity": 5.0}, {"food": "eggplant", "quantity": 1.5}, {"food": "", "quantity": 1.5}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "garlic powder", "quantity": 2.0}, {"food": "italian veg medley pasta", "quantity": 1.0}, {"food": "", "quantity": 1.5}, {"food": "chrysanthemum leaves", "quantity": 0.25}], "title": "\nNeapolitan Summer Vegetable Pasta\n"}, {"directions": "\nSpecial equipment: a deep-fat fry thermometer\n\n              For the dough: Whisk together the warm water, yeast and 1 teaspoon of the sugar in a small bowl. Set aside until the yeast activates and becomes foamy on top, about 10 minutes.\n            \n\n              Heat the milk and butter in a small saucepan until the butter melts. Allow to cool to less than 115 degrees F. \n            \n\n              Whisk the flour, salt and remaining sugar in the bowl of a stand mixer fitted with a dough hook. Add the foamy yeast mixture and cooled milk mixture. Turn on the mixer to knead the dough for about 5 minutes. The dough should be a smooth uniform ball that no longer sticks to the sides of the bowl. Cover the bowl with plastic wrap and put in a warm area until the dough doubles in size, about 1 1/2 hours. \n            \n\n              For the filling: In the meantime, heat 1 tablespoon oil in a large skillet over high heat. Add the beef and 1 1/2 teaspoons salt. Brown the beef, stirring and breaking it up into small pieces, about 5 minutes. Once browned, transfer to a bowl and add the remaining 2 tablespoons of oil to the skillet. Reduce the heat to medium, add the cabbage, onions and 1 teaspoon salt and cook, stirring occasionally, until soft, about 15 minutes. Add the browned beef back to the skillet, stir it together with the cabbage and onions for 5 minutes. Add the white pepper and additional salt if needed. Take off the heat and set aside to cool completely. \n            \n\n              Preheat the oven to 350 degrees F. Line 2 baking sheets with parchment. \n            \n\n              When the dough has doubled in size, punch it down and divide it into 10 equal-size balls, about 3 1/2 ounces each. Roll a ball into a rectangle, roughly 6- by 8- inches. Spread 1/2 cup of the cooled filling in the center of the rectangle. Bring the two long sides of dough together so the seam is facing up and pinch them together. Pinch the short ends shut as well. You should have a rectangular shape. Put the filled dough seam-side down on one of the prepared baking sheets. Repeat with the remaining 9 balls and the filling. There should be 5 pies per baking sheet. Cover the meat pies with a dish towel and allow them to rest for about 20 minutes. Bake in the oven until golden brown, 20 to 25 minutes. \n            \n\n              While the pies bake, melt the butter. As soon as the meat pies come out of the oven, brush the tops with the melted butter and serve with ketchup. \n            \n", "ingredients": [{"food": "", "quantity": 0.5}, {"food": "yeast extract spread", "quantity": 0.25}, {"food": "sugar", "quantity": 0.25}, {"food": "milk", "quantity": 0.75}, {"food": "butter oil", "quantity": 6.0}, {"food": "potato flour", "quantity": 4.25}, {"food": "salt", "quantity": 1.5}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "frankfurter beef", "quantity": 1.0}, {"food": "salt", "quantity": 2.5}, {"food": "swamp cabbage", "quantity": 3.5}, {"food": "onion powder", "quantity": 2.0}, {"food": "martha white foods", "quantity": 1.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "", "quantity": 1}], "title": "\nNebraska Handheld Meat Pies\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees Fand coat a 9-inch-square cake pan with cooking spray. Combine 3/4 cup sugar, 1/2 teaspoon fine salt and 1 1/2 tablespoons water in a medium saucepan and stir until the mixture looks like wet sand. Cook over medium-high heat, gently swirling the pan occasionally but not stirring, until light amber, about 5 minutes. Remove from the heat and immediately pour into the prepared cake pan (the caramel hardens quickly). Arrange the nectarines over the caramel in 4 rows; set the pan aside.\n            \n\n              Whisk the flour, baking powder, baking soda and the remaining 1/2 teaspoon fine salt in a bowl. Beat the butter and the remaining 1 cup sugar in a large bowl with a mixer on medium-high speed until light and fluffy, about 3 minutes. Add the eggs one at a time, beating after each addition, then beat in the vanilla. Reduce the mixer speed to low and add the flour mixture in 3 batches, alternating with the buttermilk, beginning and ending with the flour, and mix until just incorporated. Pour the batter over the nectarines and spread evenly.\n            \n\n              Transfer to the oven and bake until the cake is golden and a toothpick inserted into the center comes out clean, about 50 minutes. (Cover loosely with foil if the cake is browning too quickly.) Let sit 15 minutes, then invert onto a platter and let cool completely. Sprinkle with sea salt.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "sugar", "quantity": 1.75}, {"food": "salt", "quantity": 1.0}, {"food": "nectarines", "quantity": 4.5}, {"food": "potato flour", "quantity": 1.75}, {"food": "baking chocolate", "quantity": 1.5}, {"food": "butter oil", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 1.0}, {"food": "sea lion", "quantity": 1}], "title": "\nNectarine Upside-Down Cake with Salted Caramel\n"}, {"directions": "\nSpecial equipment: A large rimmed baking sheet and a pizza stone or 2 large rimmed baking sheets; a 1-inch star-shaped cookie cutter\n\n              For the dough: Combine the flour, granulated sugar and salt in a food processor and pulse until mixed. Add about one third of the chilled butter and process until thoroughly combined (the mixture will be slightly yellow). Add the remaining chilled butter and pulse until the mixture resembles a very coarse meal with pea-size bits of butter. Add the vinegar in a single pulse. Gradually add the ice water through the feed tube, pulsing just until evenly combined. Squeeze a handful of the dough together, it should just hold its shape and be a little crumbly. If still very powdery, pulse again, adding up to 2 tablespoons ice water.\n            \n\n              Turn the dough out onto a work surface and press it together by hand. Divide the dough in half; wrap each piece in a large piece of plastic wrap, pressing each firmly into a 1/2-inch-thick rectangle. Refrigerate until firm, at least 1 hour or up to 2 days.\n            \n\n              Adjust an oven rack to the bottom position of the oven and put a pizza stone or large baking sheet on it. Preheat the oven to 400 degrees F.\n            \n\n              For the filling: Toss together the nectarines, brown sugar, lemon juice, cornstarch, vanilla and salt in a large bowl until the cornstarch dissolves. Add the raspberries and gently toss to combine.\n            \n\n              To assemble the pie: Let the dough stand at room temperature for a few minutes until slightly softened to make rolling easier. Place one piece of dough between two large pieces of floured parchment. Roll into a rough 14-by-12 inch rectangle (if the dough gets too soft, pop it in the fridge to firm up, then continue rolling). Repeat rolling with the second piece of dough.\n            \n\n              Pile the nectarine-raspberry filling into the center of one piece of dough and spread evenly, leaving at least a 1-inch border. Dot the filling with the butter.\n            \n\n              With a 1-inch star-shaped cookie cutter, cut out 4 to 5 stars from the second piece of dough (reserve the cut-outs for decorating). To transport the dough to the pie, roll it up onto the rolling pin and then unroll it over the filling, lining up the edges with the bottom piece of dough as best you can. Pinch the edges together, then fold and crimp to create a tight seal. Brush the top and edges of the crust with the egg; decorate the top crust with the star cut-outs and brush them with egg too. Generously sprinkle the pie with granulated sugar. Using the bottom piece of parchment paper, slide the pie onto another rimmed baking sheet (trim the parchment if there's any overhang).\n            \n\n              Put the baking sheet with the pie directly on the preheated pizza stone or baking sheet (this helps make the bottom crust crisp and flaky). Bake the pie until the crust is deep golden brown and the filling is bubbly, 45 to 50 minutes. (If the crust browns too quickly during baking, cover the pie loosely with foil. Some of the filling may bubble from the vents onto the parchment paper; don't fret-just embrace the rustic charm.)\n            \n\n              Let cool. Slice into wedges and serve warm or at room temperature.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 3.5}, {"food": "sugar", "quantity": 2.0}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 3.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 0.3333333333333333}, {"food": "", "quantity": 1}, {"food": "nectarines", "quantity": 1.75}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "", "quantity": 1.0}, {"food": "cornstarch", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "salt", "quantity": 0.25}, {"food": "raspberries", "quantity": 1.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "egg substitute", "quantity": 1.0}], "title": "\nNectarine-Raspberry Slab Pie\n"}, {"directions": "\n\n              Make the crust: Pulse the flour, sugar and salt in a food processor. Add half of the butter and pulse until the mixture looks like coarse meal. Add the remaining butter and pulse into pea-size pieces. Add 1 egg, the lemon juice and 3 tablespoons ice water and pulse until the dough clumps together but has not yet formed a ball. Turn out the dough onto a piece of plastic wrap; press into a disk and wrap. Refrigerate until firm, at least 1 hour or overnight.\n            \n\n              Preheat the oven to 400 degrees F and line a baking sheet with parchment paper. Roll out the dough into a 12-inch round on a lightly floured surface. Transfer the dough to the prepared baking sheet and refrigerate, 10 minutes.\n            \n\n              Meanwhile, make the filling: Toss the nectarines with the honey, flour, vanilla and rosemary in a large bowl. Spoon the nectarine mixture onto the dough, leaving about a 3-inch border. Fold the edge of the dough over the fruit by about 2 inches, pleating as needed. Lightly beat the remaining egg with 1 teaspoon water. Brush the dough with the egg wash. Refrigerate until firm, about 20 minutes.\n            \n\n              Scatter the butter over the fruit. Bake until the crust is golden brown and the filling is bubbling, 40 to 45 minutes. Let cool on the baking sheet. Serve with ricotta and honey.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.5}, {"food": "sugar", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "peaches", "quantity": 3.0}, {"food": "honey smoked ham", "quantity": 2.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "rosemary", "quantity": 0.5}, {"food": "butter oil", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 1}], "title": "\nNectarine-Rosemary Galette with Ricotta and Honey\n"}, {"directions": "\n\n              Cut 1 pound each yellow beefsteak tomatoes and nectarines into wedges. Top with 2 ounces shaved ricotta salata and salt and pepper. Toast 2 tablespoons pine nuts with 2 tablespoons olive oil over low heat. Off the heat, swirl in 2 teaspoons white balsamic vinegar; drizzle over the salad.\n            \n\n              Photographs by Con Poulos\n            \n", "ingredients": [], "title": "\nNectarine-Tomato Salad\n"}, {"directions": "\n\n              Put the confectioners' sugar in a large heatproof bowl; make a deep well in the middle. Add the mashed potatoes, butter, vanilla and salt to the well. Place the bowl over a saucepan of barely simmering water. Starting in the center of the well, stir the ingredients, gradually incorporating the sugar, until the sugar dissolves and the mixture forms a smooth paste, about 5 minutes. Remove the bowl from the heat and stir in the coconut. Transfer to the freezer and chill until firm, about 20 minutes. Roll tablespoonfuls of the potato mixture into balls, then flatten each ball into a small square using your fingers (you should have about 40 squares). Put the squares on a large plate or baking sheet, cover with plastic wrap and freeze until firm, about 20 minutes.\n            \n\n              Line a baking sheet with foil, shiny-side up. Put the chocolate in a microwave-safe bowl and microwave in 30-second intervals, stirring, until the chocolate melts. Add the shortening and stir vigorously until glossy, about 2 minutes. Transfer half of the chocolate to a glass liquid measuring cup. One at a time, place each candy square on a fork and dip in the melted chocolate to coat; let the excess drip back into the cup. Transfer to the prepared baking sheet. Repeat with the remaining squares, refilling the cup with melted chocolate as needed. Let the candies harden at room temperature, about 1 hour. Photograph by Charles Masters\n            \n", "ingredients": [{"food": "sugar", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 0.5}, {"food": "butter oil", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "salt", "quantity": 0.25}, {"food": "coconut water", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 3.0}], "title": "\nNeedhams\n"}, {"directions": "\n\n              Mix equal parts gin, sweet vermouth and Campari in an ice-filled glass. Garnish with an orange twist.\n            \n\n              Photograph by Anna Williams\n            \n", "ingredients": [], "title": "\nNegroni\n"}, {"directions": "\n\n              Preheat the oven to 350°F. Sift the flour and salt into a medium bowl. Beat the butter and sugar with an electric mixer on medium speed in a large bowl until just combined; add the vanilla. With the mixer on low speed, add the flour mixture to the butter and sugar and mix just until the dough starts to come together.\n            \n\n              Put the egg wash and coconut in two separate medium bowls. Form 1¼-inch balls of dough (about 1 tablespoon each); dip each ball in egg wash, then roll in coconut. Place the balls about 2 inches apart on a cookie sheet; press a light indentation into the top of each with your finger. Bake until the coconut is golden, 18 to 20 minutes. Remove the cookies from the oven and press the back of a teaspoon in the center of each to re-form the indentations. Transfer to a rack to cool.\n            \n\n              Place the chocolate chips in a medium glass bowl. Bring the cream just to a boil in a small saucepan over medium-high heat, pour over the chocolate chips and let sit for 2 minutes, then stir until the cream is fully incorporated and the mixture is smooth.\n            \n\n              Spoon ½ teaspoon of chocolate into the center of each cookie and let set for 5 minutes. Top each cookie with 3 chocolate eggs.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.0}, {"food": "meat drippings ", "quantity": 1}, {"food": "butter oil", "quantity": 1.0}, {"food": "meat drippings ", "quantity": 1}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "coconut water", "quantity": 5.0}, {"food": "baking chocolate", "quantity": 3.0}, {"food": "ice cream swich", "quantity": 5.0}, {"food": "baking chocolate", "quantity": 54.0}], "title": "\nNest Cookies\n"}, {"directions": "\n\n              Butter the bread slices on both sides (use the whole stick), then cut them into 3/4-inch squares. (Leave the crust on.)\n            \n\n              Beat the eggs in a large bowl until foamy, then gradually whisk in the milk.\n            \n\n              Alternate layers of bread and Cheddar in a low 2-quart oval baking dish, starting with the bread and ending with Cheddar (4 layers total). Pour in the egg mixture, and press the bread and Cheddar down into the egg. Refrigerate overnight, covered, so the bread soaks up the liquid.\n            \n\n              About 1 1/2 hours before serving, position a rack in the center of the oven and preheat to 350 degrees F. Bake until puffed, golden and cooked through, about 1 hour. Serve hot or warm.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 8.0}, {"food": "garlic bread", "quantity": 0.25}, {"food": "eggs", "quantity": 6.0}, {"food": "whole milk", "quantity": 2.0}, {"food": "hearts of palm", "quantity": 1.0}], "title": "\nNever-Fail Cheese Souffle\n"}, {"directions": "\n\n              Check the beans for any stones or dirt and discard. Put the beans in a large bowl; cover with cold water by about 3 inches. Cover, and set aside in a cool spot or the refrigerator to soak for 6 hours or overnight.\n            \n\n              Drain the beans. Put the beans in a large saucepan with 5 cups of water and bring to a boil over high heat. Reduce the heat so the beans simmer and cook for 30 minutes. Drain, but reserve the cooking water.\n            \n\n              Preheat the oven to 250 degrees F.\n            \n\n              Put the beans in a 2 to 2 1/2-quart ceramic bean pot or covered casserole with the salt pork and the onion. In a medium bowl combine the molasses, mustard, and salt with 2 cups of the cooking liquid and pour over the beans. (If the beans are not covered by the liquid add more.) Cover the pot, and bake for 3 hours. Check the beans periodically to make sure they are covered with liquid and if needed add more of the reserved cooking liquid. Gently stir in the tomatoes and vinegar, taking care not to break up the beans, continue to bake for 3 more hours. Remove from the oven and stir in the rum, if desired. Serve.\n            \n", "ingredients": [{"food": "fava beans", "quantity": 0.75}, {"food": "pigeon peas", "quantity": 0.75}, {"food": "fava beans", "quantity": 0.75}, {"food": "pork skins", "quantity": 0.5}, {"food": "onion powder", "quantity": 1.0}, {"food": "molasses", "quantity": 0.3333333333333333}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "whole milk", "quantity": 0.5}, {"food": "vinegar", "quantity": 1.0}, {"food": "", "quantity": 1.0}], "title": "\nNew England Baked Beans\n"}, {"directions": "\n\n              Rinse the clams several times under cold running water. Transfer to a large pot and add 3 cups water. Bring to a simmer over medium-high heat, then cover and cook until the clams open, about 6 minutes. Strain through a fine-mesh sieve into a large bowl; reserve the broth. Transfer the clams to a bowl and cover with plastic wrap so they don't dry out.\n            \n\n              Cook the bacon in a large pot over medium heat until crisp, about 10 minutes; remove with a slotted spoon and drain on paper towels. Melt the butter in the same pot over medium heat. Add the celery, onion and thyme and cook, stirring occasionally, until soft, about 10 minutes. Add the flour and cook, stirring, 1 minute. Stir in the reserved clam broth, 1 1/2 cups water and the potato. Bring to a simmer and cook until the potato is tender and the soup thickens slightly, about 15 minutes.\n            \n\n              Meanwhile, remove the clams from their shells and roughly chop.\n            \n\n              Reduce the heat under the soup to medium low. Whisk in the half-and-half and warm through (do not boil). Remove from the heat. Stir in the chopped clams; season with salt and pepper. Ladle the soup into bowls and top with the reserved bacon and chives.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [{"food": "", "quantity": 30.0}, {"food": "bacon", "quantity": 4.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "celery seed", "quantity": 3.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "thyme", "quantity": 2.0}, {"food": "potato flour", "quantity": 0.3333333333333333}, {"food": "potato flour", "quantity": 1.5}, {"food": "", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "dessert topping", "quantity": 1}], "title": "\nNew England Clam Chowder\n"}, {"directions": "\n\n              Bring 2 1/2 cups water, 1/4 onion, 1 bay leaf, 1 quartered celery stalk and a few peppercorns to a boil in a large pot. Add 3 pounds scrubbed steamer clams; cover and cook until they open, about 10 minutes (discard any that do not open). Drain, then strain the liquid. To eat, remove the clams from their shells and rinse in the liquid. Dip in melted butter and serve with lemon wedges.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [], "title": "\nNew England Steamers\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Butter a 9-by-13-inch baking dish and set aside. Bring a large pot of salted water to a boil. Add the noodles and cook until softened but not cooked through, 3 to 4 minutes; drain and transfer to a large bowl.\n            \n\n              Meanwhile, whisk the eggs and egg whites in a medium bowl until well combined. One at a time, whisk in 3/4 teaspoon salt, the chiles, lemon juice and melted butter. Stir in half of the artichoke hearts and 2 cups grated cheese. Pour the egg mixture over the noodles and mix well with your hands.\n            \n\n              Transfer the noodle mixture to the prepared baking dish. Top with the remaining artichoke hearts and 1 cup grated cheese. Bake until golden brown, about 1 hour. Let cool at least 30 minutes before serving.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "egg substitute", "quantity": 12.0}, {"food": "eggs", "quantity": 2.0}, {"food": "barley flour or meal", "quantity": 12.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "artichoke hearts", "quantity": 2.0}, {"food": "cheddar cheese", "quantity": 3.0}], "title": "\nNew Mexicali Green Chile-Cheese Kugel\n"}, {"directions": "\n\n              Make the crust: Cut the lard into 1/2-inch cubes; transfer to a plate and freeze at least 1 hour. Combine the flour, granulated sugar, salt and baking powder in a large bowl. Cut in the lard with 2 knives until the mixture looks like coarse meal with pea-size bits of lard (do not overmix). A little at a time, stir in 1/2 to 1 cup ice water until the dough holds together when squeezed; the amount of water will vary depending on the humidity. (You can also make the dough in a stand mixer with the paddle attachment.) Divide the dough between 2 sheets of plastic wrap; use the plastic to help form each half into a disk. Wrap tightly and refrigerate until firm, at least 1 hour or overnight.\n            \n\n              Make the filling: Combine the apples, flour, turbinado sugar, cinnamon, ginger, nutmeg, lemon juice, green chiles and pine nuts in a large bowl and toss. Let sit 20 minutes. Meanwhile, preheat the oven to 375 degrees F.\n            \n\n              Roll out 1 disk of dough into a 12-inch round on a lightly floured surface. Ease into a 9-inch deep-dish pie plate, then spoon the filling into the crust. Roll out the remaining disk of dough into a 12-inch round; lay the dough over the filling. Press the 2 crusts together around the edge, then fold the overhanging dough under itself and crimp with your fingers. Cut a few slits in the top crust or prick with a fork to let steam escape. Whisk the egg with 1/4 cup water and brush over the top crust. Sprinkle with turbinado sugar.\n            \n\n              Bake, rotating the pie every 20 minutes, until golden brown, 1 to 1 1/2 hours. Transfer to a rack and let cool completely. Serve with ice cream.\n            \n\n              Photograph by Devon Jarvis\n            \n", "ingredients": [{"food": "lard", "quantity": 4.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "sugar", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 6.0}, {"food": "potato flour", "quantity": 0.5}, {"food": "sugar", "quantity": 0.5}, {"food": "cinnamon", "quantity": 2.0}, {"food": "ginger", "quantity": 0.5}, {"food": "nutmeg", "quantity": 0.5}, {"food": "lemon juice", "quantity": 0.25}, {"food": "frozen yogurt", "quantity": 0.25}, {"food": "pine nuts", "quantity": 0.25}, {"food": "egg substitute", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1}], "title": "\nNew Mexican Apple Pie\n"}, {"directions": "\nSpecial equipment: 5-cup broiler-safe casserole dish\n\n              Special equipment: 5-cup broiler-safe casserole dish\n            \n\n              Melt 4 tablespoons of the butter in a large skillet over medium heat. Whisk in the chili sauce, lemon juice, garlic, Worcestershire, cayenne, oregano, paprika and hot sauce. Bring to a low simmer and cook, stirring frequently, until slightly reduced, about 5 minutes. Add the shrimp and cook until they are pink and just cooked through, flipping once, 4 to 5 minutes. Remove from the heat and let cool.\n            \n\n              When cool, place the shimp mixture in a food processor and pulse until roughly chopped. (The shrimp mixture can be made up to a day in advance and refrigerated.)\n            \n\n              Combine the cream cheese and sour cream in a large bowl and stir vigorously with a rubber spatula until smooth. Add the shrimp mixture, scallion whites, parsley, 1 1/4 teaspoons salt and a few grinds of pepper and stir to combine. Place in a 5-cup broiler-safe casserole dish and spread evenly.\n            \n\n              Melt the remaining 4 tablespoons of butter and pour over the top of the shrimp dip, making sure to cover the entire surface with a thin layer of butter. Sprinkle with the scallion greens. Chill for at least 4 hours and up to overnight.\n            \n\n              Just before serving, position an oven rack in the top third of the oven and preheat the broiler. Broil the dip until the butter layer just begins to melt. Serve with the crackers and crunchy bread.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 8.0}, {"food": "Worcestershire sauce", "quantity": 0.25}, {"food": "lemon juice", "quantity": 0.25}, {"food": "garlic powder", "quantity": 5.0}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "paprika", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 0.5}, {"food": "shrimp", "quantity": 1.25}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "sour cream", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "black bean mango", "quantity": 1}, {"food": "garlic bread", "quantity": 1}], "title": "\nNew Orleans Barbecue Shrimp Dip\n"}, {"directions": "\n\n              1. Preheat oven to 350 degrees F. \n            \n\n              2. Heat olive oil, butter, garlic, bay leaves, and thyme in a large ovenproof skillet over medium heat until butter melts and garlic and herbs are fragrant, about 5 minutes. \n            \n\n              3. Toss shrimp, Worcestershire sauce, salt, paprika, and cayenne in a bowl. Add to skillet along with sherry and transfer to oven. Bake until shrimp curl and are pink, about 10 minutes. Transfer to a serving dish and serve with lemon wedges and bread.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.5}, {"food": "butter oil", "quantity": 8.0}, {"food": "garlic powder", "quantity": 12.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "thyme", "quantity": 4.0}, {"food": "cream puff shell", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 1.0}, {"food": "pepper", "quantity": 1.25}, {"food": "", "quantity": 2.0}, {"food": "lemons", "quantity": 3.0}, {"food": "garlic bread", "quantity": 1}], "title": "\nNew Orleans-Style BBQ Shrimp\n"}, {"directions": "\n\n              Peel the shrimp, leaving the tails on; reserve the shells. Devein the shrimp, then rinse in a colander; drain and pat dry. Sprinkle with the Creole seasoning.\n            \n\n              Heat 2 tablespoons butter in a large skillet over high heat. Add the shrimp shells and half of the scallions and cook until the shells turn pink, 1 to 2 minutes. Add the Worcestershire sauce and 1 1/2 cups water and cook until reduced by half, about 5 minutes. Strain the shrimp broth through a fine-mesh strainer into a bowl; discard the solids.\n            \n\n              Melt the remaining 4 tablespoons butter in the skillet over high heat. Add the shrimp and the remaining scallions and cook until the shrimp start to turn pink, about 1 minute. Add the reserved shrimp broth and simmer until cooked through, about 3 more minutes.\n            \n\n              Meanwhile, put the corn in a microwave-safe dish and microwave until hot, 2 to 3 minutes. Cut the tomato into chunks. Divide the corn and tomatoes among bowls. Add the shrimp and ladle in the broth. Serve with bread.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "pasta with sliced franks in tomato sauce", "quantity": 24.0}, {"food": "seasoning mix", "quantity": 1.0}, {"food": "butter oil", "quantity": 6.0}, {"food": "", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 0.25}, {"food": "sunflower seed kernels", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "garlic bread", "quantity": 1}], "title": "\nNew Orleans-Style Shrimp\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Toss the cereal, potato chips and melba together in a large bowl. Whisk the butter, mustard, Worcestershire, garlic powder, mustard powder, brown sugar, coriander, allspice and 1/2 teaspoon each salt and pepper in a separate bowl. Pour the sauce over the snack mix and toss to coat well. Spread out on a rimmed baking sheet and bake until the mix is toasted and almost completely dry, 16 to 18 minutes, tossing about halfway through.\n            \n\n              Remove from the oven and stir in the onions and jerky. Let cool completely, and then store in an airtight container for up to 3 days.\n            \n", "ingredients": [{"food": "corn bran", "quantity": 4.0}, {"food": "potato chips", "quantity": 4.0}, {"food": "french toast", "quantity": 2.0}, {"food": "butter oil", "quantity": 4.5}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "ground turkey", "quantity": 2.0}, {"food": "allspice", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "fried chicken", "quantity": 2.0}, {"food": "beef jerky", "quantity": 6.0}], "title": "\nNew York Deli Snack Mix\n"}, {"directions": "\n\n              Cover the noodles with hot tap water in a large bowl and soak, flipping once, for 7 minutes; they should pull apart without breaking. Drain in a strainer and shake to dry; pat with towels if needed. Return to the bowl and toss with 1 tablespoon olive oil and a pinch of salt.\n            \n\n              Add the chard and parsley to the bowl; toss, pulling apart the noodles. In a small bowl, beat the eggs with the parmesan cheese and salt and pepper to taste; add to the noodles and toss to coat.\n            \n\n              Heat the remaining 2 tablespoons oil in a 9-inch skillet with a lid over medium heat. Add the noodle mixture and press down with a spatula; cover and cook until the bottom is golden brown, about 8 minutes. Place a large plate over the pan; invert the cake onto the plate. Slide the cake back into the pan, cover and cook until golden on the other side, 5 to 10 minutes. Invert onto a plate, sprinkle with salt and cut into wedges.\n            \n\n              Photograph by Yunhee Kim\n            \n", "ingredients": [{"food": "seasoning mix", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "parsley", "quantity": 0.5}, {"food": "eggs", "quantity": 5.0}, {"food": "macaroni cheese", "quantity": 0.25}, {"food": "pepper", "quantity": 1}], "title": "\nNicoise Noodle Cake\n"}, {"directions": "\n\n              Mix 1 cup chopped mixed parsley, chives and tarragon, 1/2 cup chopped shallot, 1/3 cup white wine, 1/4 cup olive oil, 2 tablespoons each white wine vinegar and dijon mustard, and salt and pepper to taste. Toss with 2 pounds boiled halved fingerlings, adding 2 cups chopped green beans to the potatoes during the last 4 minutes of cooking. Add 1 drained can oil-packed tuna and 1/2 cup halved kalamata olives.\n            \n\n              Photograph by Kana Okada\n            \n", "ingredients": [], "title": "\nNicoise Potato Salad\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the broiler. Open the hamburger buns and arrange on a baking sheet. Brush the buns all over with 1 tablespoon of the mayonnaise. Toast until golden on both sides, 1 to 2 minutes per side. Cut into very small pieces and set aside.\n            \n\n              Combine the cheese, 1/2 cup mayonnaise and a pinch of salt in a food processor and process until very smooth. Transfer to a bowl, cover and refrigerate until ready to use.\n            \n\n              Whisk the remaining 1/2 cup mayonnaise, the ketchup and mustard in a bowl for the sauce, cover and refrigerate until ready for use.\n            \n\n              Arrange the bacon in a large nonstick skillet (do in batches if necessary) and heat over medium heat. Cook until golden brown and crispy, 4 to 5 minutes per side. Remove, let cool slightly and chop into small pieces.\n            \n\n              Wipe out the skillet. Heat the oil in the skillet over medium-high heat. Add one-third of the onion and cook, stirring frequently, until soft and just beginning to brown, about 4 minutes. Add the ground beef, 3/4 teaspoon salt and a few grinds of pepper. Cook, stirring and breaking up into smaller pieces, until browned and cooked through, about 4 minutes. Stir in a 1/3 cup of the prepared ketchup sauce and cool the beef mixture to room temperature. \n            \n\n              Let the cheese mixture soften at room temperature, about 30 minutes, before building the dip. Layer the dip in a medium, straight-sided 3-quart clear glass trifle bowl or your favorite serving dish. Spread out the cheese mixture and then top, in even layers, with the buns, tomatoes, beef, the remaining ketchup sauce, the pickles, the remaining onions and the bacon. \n            \n\n              Wrap and refrigerate until chilled, at least 1 hour and up to overnight. Top with the shredded lettuce right before serving. Serve with chips for dipping.\n            \n", "ingredients": [{"food": "watermelon seed krnls", "quantity": 2.0}, {"food": "mayonnaise dressing", "quantity": 1.0}, {"food": "yellow rice", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 0.5}, {"food": "mustard spinach", "quantity": 0.25}, {"food": "bacon", "quantity": 10.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "frankfurter beef", "quantity": 1.0}, {"food": "tomatoes", "quantity": 3.0}, {"food": "dill seed", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 2.0}, {"food": "potato chips", "quantity": 1}], "title": "\nNine-Layer Cheeseburger Dip\n"}, {"directions": "\n\n              1. Combine the dates, water, and lemon juice in a medium saucepan. Simmer over medium heat breaking up any large pieces of dates with a spoon, until the mixture resembles a thick paste, 15 to 20 minutes. Stir in the honey, peanut butter, cocoa powder, butter and salt until evenly combined. Stir in the graham crackers and oats. Remove from heat.\n            \n\n              2. Lightly mist a baking sheet with cooking spray. Drop level tablespoons of the cookie mixture onto the prepared pan. Refrigerate until just chilled and set, about 20 minutes.\n            \n\n              3. Put desired optional toppings in small bowls. Roll each cookie in desired topping and flatten slightly into a plump disk. Cover and refrigerate until firm. Serve chilled.\n            \n", "ingredients": [{"food": "", "quantity": 1.0}, {"food": "coconut water", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "syrup", "quantity": 2.0}, {"food": "peanut butter ", "quantity": 2.0}, {"food": "onion powder", "quantity": 2.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "salt", "quantity": 0.25}, {"food": "crackers", "quantity": 8.0}, {"food": "oats", "quantity": 0.5}, {"food": "", "quantity": 1}, {"food": "hearts of palm", "quantity": 0.5}], "title": "\nNo Bake Chewy Truffle Cookies\n"}, {"directions": "\n\n              Spray a 9-inch springform pan with cooking spray. Add the graham crackers and 1/4 cup of the sugar to a food processor and pulse to fine crumbs. Drizzle in the butter and pulse until the crumbs are completely coated and moistened. Firmly press the crumb mixture into the bottom of the prepared pan. Refrigerate while you make the filling. Clean out the food processor and return it to the stand.\n            \n\n              Add the cream cheese, avocados, lime zest and juice and remaining 3/4 cup sugar to the food processor and puree until completely smooth and almost no avocado lumps remain. Add the coconut cream and heavy cream and process until the mixture starts to thicken and becomes creamy, about 1 minute.\n            \n\n              Pour the mixture on top of the crust in the prepared pan. Spray a piece of plastic wrap with cooking spray and gently press it on top of the filling so no air can reach it. Refrigerate until completely set, 6 hours and up to overnight.\n            \n\n              Remove the plastic wrap and smooth out any bubbles with an offset spatula. Garnish with whipped cream around the edge and serve cold.\n            \n", "ingredients": [{"food": "pan dulce", "quantity": 1}, {"food": "crackers", "quantity": 9.0}, {"food": "sugar", "quantity": 1.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 12.0}, {"food": "avocados", "quantity": 3.0}, {"food": "grape juice", "quantity": 1.5}, {"food": "coconut cream", "quantity": 5.0}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "ice cream swich", "quantity": 1}], "title": "\nNo-Bake Avocado Cheesecake\n"}, {"directions": "\n\n              Put the cereal in a large bowl. Combine the brown sugar, corn syrup, heavy cream and butter in a small saucepan. Bring to a simmer over medium-high heat, then reduce the heat to medium and whisk until smooth. Continue cooking, whisking occasionally, until the mixture thickens and starts to pull away from the sides of the pan, 5 to 6 minutes (it should register 230 degrees F on a candy thermometer). Remove from the heat and whisk in the vanilla, nutmeg and salt.\n            \n\n              Immediately pour the caramel over the cereal and stir with a rubber spatula until evenly coated. Scoop heaping tablespoonfuls of the cereal mixture onto an ungreased baking sheet. Let cool slightly, then use your fingers to gently form each into a mound or pyramid shape; sprinkle with nonpareils. Let cool completely.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "cereal bar", "quantity": 3.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "silk light vanilla", "quantity": 0.25}, {"food": "ice cream swich", "quantity": 0.25}, {"food": "butter oil", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "nutmeg", "quantity": 0.5}, {"food": "hearts of palm", "quantity": 1}, {"food": "", "quantity": 1}], "title": "\nNo-Bake Cereal Haystacks\n"}, {"directions": "\n\n              Make the crust: Line a 9-inch-square baking dish with aluminum foil, leaving a 2-inch overhang on 2 sides. Put 1 stick butter, the granulated sugar and cocoa powder in a heatproof bowl and set over a saucepan of simmering water (do not let the bowl touch the water). Cook, stirring, until the butter melts and the sugar dissolves. Add the egg and continue to cook, whisking, until the mixture is thick like hot fudge sauce, 3 to 5 minutes. Remove from the heat and stir in the graham cracker crumbs, coconut and chopped walnuts. Spread in the prepared baking dish. Cover with plastic wrap and refrigerate until set, about 45 minutes.\n            \n\n              Make the filling: Beat the cream cheese, 4 tablespoons butter, the vanilla and salt in a bowl with a mixer on medium-high speed until creamy. Add the confectioners' sugar and beat until stiff, then beat in the heavy cream until fluffy. Spread over the crust, cover and refrigerate until firm, at least 30 minutes.\n            \n\n              Make the topping: Put the chocolate and the remaining 2 tablespoons butter in a microwave-safe bowl; microwave in 30-second intervals, stirring, until melted. Quickly spread the chocolate over the filling. Top with whole walnuts and refrigerate until set, 30 minutes. Remove from the pan and cut into squares. Store in the refrigerator for up to 1 week.\n            \n\n              Photograph by Johnny Miller\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 0.25}, {"food": "onion powder", "quantity": 0.25}, {"food": "egg substitute", "quantity": 1.0}, {"food": "cracker barrel", "quantity": 2.0}, {"food": "coconut water", "quantity": 0.75}, {"food": "mixed nuts", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "hearts of palm", "quantity": 1}, {"food": "sugar", "quantity": 1.5}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 4.0}], "title": "\nNo-Bake Cheesecake Squares\n"}, {"directions": "\n\n              Whip together 1 1/2 cups of the heavy cream, the confectioners' sugar and espresso powder in a large bowl with an electric mixer on medium-high speed until stiff peaks form, 2 to 3 minutes.\n            \n\n              Spread a heaping tablespoon of the whipped cream onto one side of 39 chocolate wafer cookies (wipe the spoon clean with a rubber spatula between dollops). Spread the whipped cream out on the cookies with a small offset spatula. Stack 5 cookies on top of each other. Repeat with the remaining cookies (including the one without whipped cream) so that you have 8 stacks total. One of the stacks will have a cookie on top with no whipped cream; this stack will be the top stack.\n            \n\n              To build the log: Lay out a piece of plastic wrap about 20 inches long on the countertop. Working across the entire length of the plastic wrap, lay one of the cookie stacks on its side. Gently press the remaining 7 cookies stacks together, end to end, finishing with the top stack, to make one long cookie log that's about 15 to 18 inches long. Wrap the log up in the plastic wrap and chill for at least 4 hours and up to overnight.\n            \n\n              While your stack is chilling, make the ganache: Put the chocolate in a medium bowl. Bring the remaining 1 1/2 cups heavy cream to a boil in a small saucepan and pour over the chocolate. Let sit for 10 minutes, then stir until completely melt. Pour the mixture into the bowl of an electric mixer and refrigerate until completely cool, about 30 minutes. Just before frosting, whip the ganache until it just begins to loosen up, turns lighter in color and is spreadable, 30 to 45 seconds. It's important not to overwhip or it will become grainy.\n            \n\n              Cut a 2- to 3- inch diagonal piece from the top end of the log and place it on top of the log at an angle; this will be the branch. Spread the ganache over the log to cover it completely. Heat a metal fork. Use the tines and the back of a the fork to draw a bark pattern in the ganache, running it along the surface in short strokes.\n            \n\n              To make the mushrooms: Shave the tops of 6 of the meringues with a rasp grater until they are smooth and round and resemble mushroom caps. Smooth the tops with a wet finger. Mix together 2 tablespoons confectioners' sugar with 1/4 teaspoon water in a small bowl to make a glue. Smear a little of the sugar glue on the bottom of each meringue and stick a marshmallow to it to make a stem. To make a shorter stem, simply cut the marshmallow in half with kitchen shears. Let the mushrooms sit for 30 minutes until the sugar water has hardened. Dust the tops with cocoa powder.\n            \n\n              Decorate the cake with the mushrooms, rosemary, mint and cranberries. Shave the remaining meringue over top of the cake to make snow. Slice the cake on a diagonal for serving.\n            \n", "ingredients": [{"food": "ice cream swich", "quantity": 3.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "onion powder", "quantity": 2.0}, {"food": "chocolate chip cookies", "quantity": 40.0}, {"food": "baking chocolate", "quantity": 12.0}, {"food": "chrysanthemum leaves", "quantity": 1}, {"food": "rosemary", "quantity": 1}, {"food": "cranberries", "quantity": 1}, {"food": "martha white foods", "quantity": 7.0}, {"food": "", "quantity": 6.0}, {"food": "onion powder", "quantity": 1}], "title": "\nNo-Bake Chocolate Mocha Yule Log\n"}, {"directions": "\nSpecial equipment: an instant-read thermometer and a piping bag, optional\n\n              Line a baking sheet with parchment. Microwave the flour in a small microwave-safe bowl for 1 minute. Stir well, then microwave again until the temperature reaches 180 degrees F, about 1 minute more (see Cook's Note). Sift into a medium bowl, then whisk in the salt; set aside.\n            \n\n              Beat the brown sugar, granulated sugar, butter, yogurt and vanilla in a large bowl with an electric mixer on medium-high speed until well combined, about 2 minutes. Add the flour mixture and mix on low speed until well incorporated. (If needed, turn off the mixer and use your hands to help combine.) Fold in 1/3 cup of the chocolate chips with a rubber spatula, or mix them in with your hands.\n            \n\n              Scoop fourteen 1-tablespoon portions of dough and roll into smooth balls; scoop fourteen 1-teaspoon portions of dough and repeat. Put the balls on the prepared baking sheet and freeze until chilled, about 20 minutes.\n            \n\n              To make the coating, microwave the melting wafers and 4 teaspoons of the coconut oil in a microwave-safe bowl in 30-second intervals, stirring between each, until melted. (Alternatively, melt in a double boiler.) \n            \n\n              One at a time, drop the chilled balls into the coating and roll around with a fork to fully coat. Remove each ball with the fork, letting any excess coating drip off, and return to the baking sheet. Fill in any holes with extra coating. \n            \n\n              To make the hats, put the nonpareils on a work surface white-side up. Dip the narrow end of the chocolate caramels into the coating and place one on each nonpareil. Put the hats on the baking sheet with the balls and refrigerate until the coating is set, about 5 minutes.\n            \n\n              Trim any excess coating around the balls with a paring knife. To make heads, dip the flat part of the small balls in the coating and stack one on top of each large ball. To make noses, dip the flat end of the jelly bean pieces in the coating and press one into the center of each head. Dip the bottoms of the hats in the remaining coating and attach one to each head. Refrigerate until the coating is set, about 5 minutes.\n            \n\n              Tie a sour belt strip around the neck of each snowman. Combine the remaining 2 tablespoons chocolate chips, 1/2 teaspoon coconut oil and the black food coloring in a small microwave-safe bowl. Microwave in 30-second intervals, stirring between each, until melted. Transfer to a piping bag or a resealable plastic bag and snip off the corner. Pipe 2 eyes on each head and 3 buttons down the front of each body. Refrigerate until completely set, about 10 minutes. \n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.0}, {"food": "salt", "quantity": 0.25}, {"food": "sugar", "quantity": 0.5}, {"food": "sugar", "quantity": 0.25}, {"food": "butter oil", "quantity": 4.0}, {"food": "silk plain soy yogurt", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.3333333333333333}, {"food": "martha white foods", "quantity": 2.5}, {"food": "vegetable oil", "quantity": 4.5}, {"food": "", "quantity": 14.0}, {"food": "", "quantity": 14.0}, {"food": "fava beans", "quantity": 7.0}, {"food": "ruby red grapefruit juice blend", "quantity": 7.0}, {"food": "black bean mango", "quantity": 0.25}], "title": "\nNo-Bake Cookie Dough Snowmen\n"}, {"directions": "\n\n              Toast the pecans in a medium skillet over medium heat, stirring, about 5 minutes. Transfer to a cutting board; let cool, then coarsely chop. \n            \n\n              Line 2 baking sheets with parchment paper. Toss the pecans and cornflakes in a large bowl. \n            \n\n              Make the caramel: Bring the butter, cane syrup, heavy cream and salt to a boil in a medium saucepan over medium heat and cook, stirring with a wooden spoon, until the mixture pulls away from the sides of the pan and comes together into a loose ball, about 5 minutes. Remove from the heat. Once the caramel stops bubbling, stir in the semisweet chocolate until melted.\n            \n\n              Pour the chocolate caramel over the cornflake mixture and toss to coat. Scoop heaping tablespoonfuls of the mixture onto the prepared baking sheets and pack into compact mounds with your fingers. Let set, about 1 hour.\n            \n\n              Put the white chocolate in a small microwave-safe bowl and microwave in 30-second intervals, stirring, until melted. Drizzle over the cookies and let set, about 1 more hour. \n            \n\n              Photograph by Johnny Miller\n            \n", "ingredients": [{"food": "pecans", "quantity": 0.5}, {"food": "", "quantity": 2.0}, {"food": "butter oil", "quantity": 6.0}, {"food": "syrup", "quantity": 0.25}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 1.0}], "title": "\nNo-Bake Cornflake-Chocolate Pralines\n"}, {"directions": "\n\n              Spray an 8-inch square baking pan and a wooden spoon with cooking spray.\n            \n\n              Melt the butter in a medium saucepan over medium heat. Add the marshmallows and salt and stir with the prepared spoon until the marshmallows have completely melted, about 2 minutes. Stir in the almond butter and vanilla.\n            \n\n              Add the rice cereal and strawberries and stir until the mixture is fully combined. Remove the pan from the heat and let the mixture cool slightly for a few minutes. Stir in the white chocolate chips. (They will melt slightly.)\n            \n\n              Transfer the mixture to the prepared pan and press into an even layer. Let stand at room temperature until firm, about 20 minutes. Cut into 9 bars. Store at room temperature in an airtight container up to 2 days.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "butter oil", "quantity": 3.0}, {"food": "", "quantity": 2.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "almond butter", "quantity": 0.25}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "crisped rice bar", "quantity": 4.0}, {"food": "strawberries", "quantity": 1.25}, {"food": "baking chocolate", "quantity": 0.5}], "title": "\nNo-Bake Healthy Strawberry-Almond Cereal Bars\n"}, {"directions": "\n\n              Make the crust: Line a 9-by-13-inch baking dish with foil, leaving an overhang. Put the butter and chocolate in a microwave-safe bowl; microwave in 30-second intervals, stirring, until melted and smooth. Pulse the cookies with the sugar in a food processor until finely ground. With the motor running, pour in the warm melted chocolate mixture and process until combined. Press the crumb mixture into the bottom of the prepared pan and refrigerate while you make the filling.\n            \n\n              Make the filling: Warm the lime juice in a small saucepan over low heat; whisk in the gelatin and sugar until completely dissolved, then remove from the heat and let cool slightly. Beat the cream cheese in a large bowl with a mixer on high speed until smooth and fluffy, about 4 minutes. Add the sweetened condensed milk and beat until smooth. Beat in the gelatin mixture and vanilla. Spread in the prepared crust and refrigerate until firm, at least 4 hours or overnight. Melt the chocolate in a microwave-safe bowl in 30-second intervals, stirring, until smooth. Drizzle over the cheesecake and refrigerate until ready to serve. Remove from the pan using the foil handles and slice into bars. Photograph by Johnny Miller\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "chocolate chip cookies", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "lime juice", "quantity": 0.5}, {"food": "onion powder", "quantity": 2.25}, {"food": "sugar", "quantity": 0.25}, {"food": "macaroni cheese", "quantity": 2.0}, {"food": "milk", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 2.0}], "title": "\nNo-Bake Key Lime Cheesecake Bars\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: 16 lollipop sticks and a piping bag, optional\n\n              Line a baking sheet with parchment paper.\n            \n\n              Process the cookies in a food processor to fine crumbs. Transfer to a medium bowl and add the cream cheese. Stir and work with a wooden spoon until smooth and completely combined.\n            \n\n              Roll about two-thirds of the mixture into 16 balls (about 1 tablespoon each) and put on the prepared baking sheet. Roll the remaining mixture into 16 smaller balls (about 1 teaspoon each). Freeze until just beginning to firm up, about 15 minutes.\n            \n\n              Press a small truffle onto each large truffle to make snowmen, then press a lollipop stick through the top of each snowman so that it sits up with the stick coming out of the head (it's ok if the truffles crack during this step; just form them back together with your fingers). Put the baking sheet in the freezer while you heat the melting wafers.\n            \n\n              Microwave the melting wafers and 1 teaspoon coconut oil in a microwave-safe bowl on 50 percent power in 30-second intervals, stirring between each, until melted. (Alternatively, melt in a double boiler.) Add another teaspoon of coconut oil if the mixture is too thick.\n            \n\n              Holding a snowman by the stick, dip it into the white coating mixture to coat completely, letting as much excess drip off as possible. Return to the baking sheet. While the coating is still wet, press an orange candy onto the head for a nose. Press 2 mini candy-coated chocolates onto the sides of the head for earmuffs. Repeat with the remaining snowmen. Refrigerate until the coating is set, about 5 minutes.\n            \n\n              Wrap a sour belt strip around the neck of each snowman, using a dot of the coating mixture as glue to secure it.\n            \n\n              Combine the chocolate chips, 1 teaspoon coconut oil and 1/2 teaspoon black food coloring in a small microwave-safe bowl. Microwave in 30-second intervals, stirring between each, until melted. Transfer to a piping bag or a resealable plastic bag and snip off the corner. Pipe on the eyes and a band connecting the earmuffs over the top of each head. Pipe 3 buttons down the front of each snowman's body. Refrigerate until completely set, about 10 minutes.\n            \n", "ingredients": [{"food": "chocolate chip cookies", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "martha white foods", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "orange", "quantity": 16.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 32.0}, {"food": "ruby red grapefruit juice blend", "quantity": 8.0}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "", "quantity": 1}], "title": "\nNo-Bake Oreo Truffle Snowmen\n"}, {"directions": "\n\n              Line a baking sheet with parchment paper. Pulse the graham crackers in a food processor until finely ground but not powdery. Transfer 1/3 cup of the crumbs to a large bowl. Add the cookie butter to the remaining crumbs in the food processor and pulse, scraping down the side of the processor if needed, until combined and the mixture starts forming a ball. Add to the bowl with the graham cracker crumbs and mix until combined.\n            \n\n              Roll tablespoonfuls of dough into 1-inch balls and arrange on the prepared baking sheet. Cover with plastic wrap and refrigerate until cold and firm, at least 1 hour or overnight.\n            \n\n              Combine the white chocolate chips and coconut oil in a large microwave-safe bowl. Microwave in 30-second intervals, stirring, until smooth. One at a time, gently drop each cookie into the melted chocolate, turning to coat completely. Remove with a fork, allowing the excess chocolate to drip off, then return to the baking sheet. (If the chocolate gets too thick, return to the microwave.) Decorate with nonpareils. Let set, 30 minutes.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "", "quantity": 1.0}, {"food": "margarine spread", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "", "quantity": 1}], "title": "\nNo-Bake Speculoos Truffle Cookies\n"}, {"directions": "\n\n              Combine the dried dates, figs and cranberries in a medium microwave-safe bowl; add 2 tablespoons rum and the butter. Microwave in 1-minute intervals, stirring, until the dried fruit is softened and the butter is melted, about 3 minutes. Set aside.\n            \n\n              Toast the pecans in a small dry skillet over medium heat, stirring occasionally, 3 to 4 minutes. Transfer to a cutting board and let cool, then coarsely chop.\n            \n\n              Combine the graham crackers, crystallized ginger, candied lemon peel, molasses, cinnamon, allspice and salt in a food processor. Add the remaining 1 tablespoon rum, the pecans and the dried-fruit mixture (with any liquid from the bowl). Pulse until the mixture is finely chopped and holds together when squeezed. (If the mixture is dry, add a little water just until it holds together.)\n            \n\n              Roll tablespoonfuls of the mixture into balls and arrange on a baking sheet. Refrigerate until firm, at least 2 hours or overnight.\n            \n\n              Put the sanding sugar on a plate. Roll the balls in the sugar to coat.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "dates", "quantity": 0.5}, {"food": "figs", "quantity": 0.5}, {"food": "cranberries", "quantity": 0.3333333333333333}, {"food": "barley flour or meal", "quantity": 3.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "pecans", "quantity": 0.5}, {"food": "crackers", "quantity": 1.5}, {"food": "ginger", "quantity": 2.0}, {"food": "orange peel", "quantity": 2.0}, {"food": "molasses", "quantity": 1.0}, {"food": "cinnamon", "quantity": 0.5}, {"food": "allspice", "quantity": 0.25}, {"food": "hearts of palm", "quantity": 1}, {"food": "sugar", "quantity": 1}], "title": "\nNo-Bake Spiced Fruitcake Balls\n"}, {"directions": "\n\n              Put the dates, brown sugar and butter in a microwave-safe medium bowl and cover. Microwave on high in 1-minute increments, stirring in between, until the butter has melted.\n            \n\n              Transfer the mixture to a food processor and pulse until smooth. Add the walnuts, orange zest, vanilla, salt and graham crackers and pulse until the mixture comes together into a stiff and slightly tacky ball. Scoop heaping teaspoonfuls of dough and roll them into balls. Refrigerate the balls until firm, about 1 hour.\n            \n\n              Roll the chilled balls in sanding sugar. The sticky toffee balls can be refrigerated for up to 3 days.\n            \n", "ingredients": [{"food": "dates", "quantity": 1.0}, {"food": "sugar", "quantity": 0.25}, {"food": "butter oil", "quantity": 2.0}, {"food": "walnuts", "quantity": 1.0}, {"food": "orange", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "crackers", "quantity": 4.0}, {"food": "sugar", "quantity": 1}], "title": "\nNo-Bake Sticky Toffee Balls\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: about 48 mini muffin liners\n\n              Combine the gelatin with 2 tablespoons water in a small microwave-safe bowl and set aside to soften, about 5 minutes.\n            \n\n              Pulse the confectioners' sugar and almond flour in a food processor into a fine powder. Add the cream cheese, lemon zest, vanilla and salt and pulse until smooth and creamy. Scrape out the mixture into a large bowl.  \n            \n\n              Microwave the gelatin until melted, stirring as needed, about 30 seconds. Add the gelatin to the cream cheese mixture and stir thoroughly to combine. Spread out the mixture in a 9-by-13-inch baking dish and refrigerate until set, about 1 hour.  \n            \n\n              Meanwhile, stem each strawberry and quarter lengthwise. Cut each quarter into 5 or 6 chunks.\n            \n\n              Put the graham cracker crumbs in a shallow bowl. Scoop level tablespoons of the cheesecake and roll into balls (dampen your hands with a little water to help). Coat the bottom half of each ball in crumbs, then press the top center in with your thumb to make an indentation. Put a piece of strawberry in each. Garnish each with a mint leaf if using. Store and serve the thumbprints in mini muffin liners. (These cookies can be refrigerated in an airtight container for up to 3 days.)\n            \n", "ingredients": [{"food": "", "quantity": 0.25}, {"food": "sugar", "quantity": 1.0}, {"food": "potato flour", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "lemon juice", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "strawberries", "quantity": 1.0}, {"food": "cracker barrel", "quantity": 0.25}, {"food": "chrysanthemum leaves", "quantity": 1}], "title": "\nNo-Bake Strawberry Cheesecake Thumbprints\n"}, {"directions": "\n\n              Make the cheesecake bites: Toss the graham cracker crumbs with the melted butter and 1 tablespoon sugar in a medium bowl. Divide between two 1 1/2-cup bowls or ramekins; press into the bottoms and up the sides. Put the cream cheese in the medium bowl (no need to wipe clean); stir with a spatula. Add the heavy cream, lemon juice, vanilla and remaining 2 tablespoons sugar; mix until smooth. Spoon into the prepared bowls, cover and freeze until firm, about 2 hours. Remove the bowls from the freezer and run a knife around the cheesecakes; turn out onto a cutting board and roughly chop. Cover and keep frozen until ready to use.\n            \n\n              Meanwhile, make the blueberry sauce: Combine the blueberries, sugar, cornstarch, lemon juice and 1 cup water in a medium saucepan; bring to a simmer, stirring occasionally. Cook, stirring occasionally, gently squashing the berries as they soften, until the mixture is thick and shiny, about 30 minutes. (You should have about 1 2/3 cups of sauce; cook slightly longer to reduce if necessary.) Transfer to a small bowl and refrigerate until cold.\n            \n\n              Make the ice cream: Put the heavy cream, cream cheese, sour cream, sugar, vanilla, lemon zest and salt in a food processor; process until very thick and fluffy. Layer the ice cream mixture, blueberry sauce and cheesecake bites in a shallow 2-quart baking dish. Cover with plastic wrap, pressing against the surface; freeze at least 3 hours. Let sit at room temperature 20 minutes before scooping.\n            \n\n              Photograph by Ryan Liebe\n            \n", "ingredients": [{"food": "cracker barrel", "quantity": 0.6666666666666666}, {"food": "butter oil", "quantity": 2.0}, {"food": "sugar", "quantity": 3.0}, {"food": "macaroni cheese", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "blueberries", "quantity": 3.0}, {"food": "sugar", "quantity": 0.5}, {"food": "cornstarch", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 6.0}, {"food": "sour cream", "quantity": 0.6666666666666666}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "lemon juice", "quantity": 0.5}, {"food": "hearts of palm", "quantity": 1}], "title": "\nNo-Churn Blueberry-Cheesecake Ice Cream\n"}, {"directions": "\nSpecial equipment: A 9-by-5-by-3-inch metal loaf pan, chilled\n\n              For the ice cream: Whisk together the condensed milk, cocoa powder, vanilla and salt in a large bowl. The mixture will become very thick; set aside.\n            \n\n              Whip the cream with a mixer on medium-high speed until firm peaks form, about 2 minutes. Fold about 1 cup of the whipped cream into the cocoa mixture with a rubber spatula until combined, then fold the lightened mixture into the whipped cream until well blended. Pour into a chilled 9-by-5-by-3-inch metal loaf pan, and freeze, covered, until thick and creamy, like soft-serve, about 2 hours. Swirl in any desired mix-ins with a spoon. Continue to freeze, covered, until solid and scoopable, about 3 hours more.\n            \n", "ingredients": [{"food": "milk", "quantity": 14.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "almonds", "quantity": 1.1666666666666665}, {"food": "baking chocolate", "quantity": 5.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}], "title": "\nNo-Churn Chocolate Ice Cream\n"}, {"directions": "\nSpecial equipment: a 9-by-5-by-3-inch metal loaf pan, chilled\n\n              Whisk together the condensed milk, matcha powder, vanilla and salt in a large bowl and set aside.\n            \n\n              Whip the cream with an electric mixer on medium-high speed until firm peaks form, about 2 minutes. Fold about 1/2 cup of the whipped cream into the condensed milk mixture with a rubber spatula until combined, then fold the lightened mixture into the whipped cream until well blended. Pour into a chilled 9-by-5-by-3-inch metal loaf pan, cover with plastic wrap and freeze until solid and scoopable, about 3 hours or up to overnight.\n            \n", "ingredients": [{"food": "milk", "quantity": 14.0}, {"food": "onion powder", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "ice cream swich", "quantity": 1.0}], "title": "\nNo-Churn Matcha Ice Cream\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Put a 9-by-5-by-3-inch metal loaf pan in the freezer to chill. Preheat the oven to 375 degrees F. Sprinkle the pie shell with the sugar and cinnamon and bake until the crust is golden brown, 12 to 14 minutes. Set aside to cool, then crumble.\n            \n\n              Meanwhile, whisk together the pumpkin pie filling, condensed milk and salt in a large bowl and set aside. \n            \n\n              Whip the cream with an electric mixer on medium-high until firm peaks form, about 2 minutes. Fold 1 cup of the whipped cream into the condensed milk mixture with a rubber spatula until combined, then fold the lightened mixture into the whipped cream until well blended. Pour half of the ice cream into the chilled loaf pan and layer all but 1 cup of the pie crust over it. Top with the remaining ice cream. Cover with plastic wrap and freeze until solid and scoopable, about 3 hours or up to overnight. Serve with a drizzle of caramel sauce and the reserved pie crust.\n            \n", "ingredients": [{"food": "pie fillings", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "cinnamon", "quantity": 0.25}, {"food": "pumpkin pie mix", "quantity": 15.0}, {"food": "milk", "quantity": 14.0}, {"food": "salt", "quantity": 1}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 1}], "title": "\nNo-Churn Pumpkin Pie Ice Cream\n"}, {"directions": "\n\n              For the cheesecake bites: Toss the graham cracker crumbs with the melted butter and 1 tablespoon sugar in a medium bowl. Divide between two 1 1/2-cup bowls or ramekins; press into the bottoms and up the sides. Put the cream cheese in the medium bowl (no need to wipe clean); stir with a spatula. Add the heavy cream, lemon juice, vanilla and remaining 3 tablespoons sugar; mix until smooth. Spoon into the prepared bowls, cover and freeze until firm, about 2 hours. Remove the bowls from the freezer and run a knife around the cheesecakes; turn out onto a cutting board and roughly chop. Transfer to a plate, then cover and keep frozen until ready to use.\n            \n\n              For the strawberry sauce: Meanwhile, toss the strawberries with the cornstarch and sugar in a medium saucepan, then add the lemon juice and 1 cup water. Bring to a simmer and cook, stirring occasionally, until the mixture is thick and shiny, about 30 minutes. (You should have about 1 2/3 cups sauce; cook slightly longer to reduce if necessary.) Transfer to a medium bowl and refrigerate until cold.\n            \n\n              For the ice cream: Put the cream cheese, heavy cream, sour cream, sugar, vanilla, lemon zest and juice and salt in a food processor; process until very thick and fluffy, 1 1/2 to 2 minutes. Layer the ice cream mixture, strawberry sauce and cheesecake bites in a shallow 2-quart baking dish, reserving 1/4 cup of the strawberry sauce for serving. Cover with plastic wrap pressed directly against the surface; freeze until firm, at least 3 hours. Let sit at room temperature 20 minutes before scooping. Scoop into bowls and top with the remaining strawberry sauce and additional graham crackers.\n            \n", "ingredients": [{"food": "crackers", "quantity": 0.6666666666666666}, {"food": "butter oil", "quantity": 2.0}, {"food": "sugar", "quantity": 4.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "ice cream swich", "quantity": 0.25}, {"food": "lemon juice", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "strawberries", "quantity": 1.0}, {"food": "cornstarch", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "lemon juice", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "ice cream swich", "quantity": 1.75}, {"food": "sour cream", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "lemon juice", "quantity": 0.5}, {"food": "hearts of palm", "quantity": 1}], "title": "\nNo-Churn Strawberry Cheesecake Ice Cream\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: A 9-by-5-by-3-inch metal loaf pan, chilled\n\n              For the ice cream: Pulse the strawberries in a food processor until you achieve pea-size chunks. Add the condensed milk, vanilla and salt. Pulse to combine; remove to a medium bowl and set aside.\n            \n\n              Whip the cream with a mixer on medium-high speed until firm peaks form, about 2 minutes. Fold about 1 cup of the whipped cream into the strawberry mixture with a rubber spatula until combined, then fold the lightened mixture into the whipped cream until well blended. Pour into a chilled 9-by-5-by-3-inch metal loaf pan, and freeze, covered, until thick and creamy, like soft-serve, about 2 hours. Swirl in any desired mix-ins with a spoon. Continue to freeze, covered, until solid and scoopable, about 3 hours more.\n            \n", "ingredients": [{"food": "strawberries", "quantity": 1.0}, {"food": "milk", "quantity": 14.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "pretzels", "quantity": 1.5}, {"food": "", "quantity": 3.0}, {"food": "vinegar", "quantity": 2.5}], "title": "\nNo-Churn Strawberry Ice Cream\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: a 9-by-5-by-3-inch loaf pan\n\n              Combine the corn kernels and cream in a medium saucepan over medium heat. Break the corn cobs into pieces and add them to the pot. Bring the mixture to a simmer, then reduce the heat to low. Gently simmer the mixture 15 minutes, stirring occasionally, then remove from the heat and let cool completely.\n            \n\n              Discard the corn cobs and pour the rest of the cream mixture into a blender. Blend on high until mostly smooth, about 1 minute. Strain into a bowl and refrigerate until cold, 1 to 2 hours.\n            \n\n              In a stand mixer fitted with the paddle attachment, whip the cream mixture on high speed until it forms soft peaks, 1 to 2 minutes. (Note that this will not whip to quite the volume of regular whipped cream because of the corn, but it will get to soft peaks.)\n            \n\n              Whisk together the sweetened condensed milk, vanilla and salt in a large bowl. Fold about half of the whipped cream mixture into the sweetened condensed milk mixture with a rubber spatula, then fold the lightened mixture into the whipped cream until well blended. Pour into a 9-by-5-by-3-inch loaf pan and cover with plastic wrap. Freeze until firm, about 4 hours.\n            \n\n              To serve, scoop into glasses or bowls and garnish with caramel coated popcorn, if desired.\n            \n", "ingredients": [{"food": "sunflower seed kernels", "quantity": 3.0}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "milk", "quantity": 14.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "popcorn", "quantity": 1}], "title": "\nNo-Churn Sweet Corn Ice Cream\n"}, {"directions": "\nSpecial equipment: a 9-by-5-by-3-inch metal loaf pan, chilled\n\n              For the ice cream: Whisk together the condensed milk, vanilla and salt in a large bowl; set aside.\n            \n\n              Whip the cream with a mixer on medium-high speed until firm peaks form, about 2 minutes. Fold about 1 cup of the whipped cream into the condensed milk mixture with a rubber spatula until combined, then fold the lightened mixture into the whipped cream until well blended. Pour into a chilled 9-by-5-by-3-inch metal loaf pan, and freeze, covered, until thick and creamy, like soft-serve, about 2 hours. Swirl in any desired mix-ins with a spoon. Continue to freeze, covered, until solid and scoopable, about 3 hours more.\n            \n", "ingredients": [{"food": "milk", "quantity": 14.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "chocolate chip cookies", "quantity": 12.0}, {"food": "cinnamon", "quantity": 1.5}, {"food": "chocolate chip cookies", "quantity": 0.5}], "title": "\nNo-Churn Vanilla Ice Cream\n"}, {"directions": "\nSpecial equipment: a 9-by-5-by-3-inch metal loaf pan, chilled\n\n              Whisk together the condensed milk, vanilla and salt in a large bowl; set aside.\n            \n\n              Whip the cream with a mixer on medium-high speed until firm peaks form, about 2 minutes. Fold about 1 cup of the whipped cream into the milk mixture with a rubber spatula until combined, then fold the lightened mixture into the whipped cream until well blended. Pour into a chilled 9-by-5-by-3-inch metal loaf pan, and freeze until thick and creamy, like soft-serve, about 2 hours. Swirl in the gingersnaps with a spoon. Continue to freeze until solid and scoopable, about 3 hours more.\n            \n", "ingredients": [{"food": "milk", "quantity": 14.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "", "quantity": 1.0}], "title": "\nNo-Churn Vanilla and Gingersnap Ice Cream\n"}, {"directions": "\n\n              Whisk 2 tablespoons orange juice, 2 teaspoons sherry vinegar and 1 teaspoon dijon mustard in a bowl; whisk in 2 tablespoons olive oil and season with salt and pepper. Thinly slice 1 1/2 pounds peeled chioggia or golden beets. Toss with the vinaigrette, segments from 2 oranges, 2 cups fresh parsley and 1/2 cup torn mint. Top with chopped marcona almonds and crumbled goat cheese.\n            \n\n              TIP:  Slice the beets on a mandoline for this no-cook salad-it'll come together in minutes!\n            \n\n              How to Peel and Juice a Beet\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [], "title": "\nNo-Cook Beet-Orange Salad\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: an 18-by-13-inch sheet pan\n\n              Preheat the oven to 450 degrees F.\n            \n\n              Put 2 tablespoons olive oil and the garlic in a large skillet and place over medium heat. When the garlic sizzles and its edges start to brown, add the tomatoes, red pepper flakes and 3/4 teaspoon salt. Bring to a simmer and continue to cook, stirring occasionally, until the sauce thickens, about 8 minutes. Remove from heat and stir in the chopped basil.\n            \n\n              Heat an 18-by-13-inch sheet pan in the oven for at least 10 minutes while you bread the eggplant. Line up 3 shallow dishes; fill one with the flour, one with the beaten eggs, and one with the breadcrumbs. Sprinkle both sides of the eggplant slices with salt. Dredge an eggplant slice in the flour (tapping off excess), then dip in the egg, and finally dredge it in the breadcrumbs. Repeat with the remaining eggplant.\n            \n\n              When all the eggplant slices are breaded, carefully remove the heated sheet pan from the oven and brush it with 2 tablespoons olive oil. Place the eggplant on the sheet pan in a single layer. Bake until the undersides are crisp and browned, 8 to 10 minutes, then flip the slices and continue baking until they are golden on the second side, 8 to 10 minutes more.  \n            \n\n              Top the baked eggplant with the tomato sauce, mozzarella and Parmesan. Return the pan to the oven and bake, rotating halfway through, until the cheese melts and browns and the sauce is bubbly, 20 to 25 minutes. Top with torn basil before serving.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 4.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "tomatoes", "quantity": 28.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 0.3333333333333333}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "potato flour", "quantity": 0.3333333333333333}, {"food": "eggs", "quantity": 2.0}, {"food": "", "quantity": 0.75}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "", "quantity": 0.25}], "title": "\nNo-Fry Sheet-Pan Eggplant Parmesan\n"}, {"directions": "\n\n              Stir together the water, oil, sugar and salt in a liquid measuring cup until the sugar dissolves. Whisk the flour and yeast in a large bowl, make a well in the center, and add the liquid mixture. With a wooden spoon or your hand, gradually stir the flour into the liquid to make a rough dough. Pull the dough together into a ball. Turn onto a work surface dusted with flour. Knead until the dough is smooth and elastic, about 10 minutes, using a little flour if necessary to keep it from sticking.\n            \n\n              Shape the dough into a ball. Put it in a large, lightly oiled bowl and turn it to coat with the oil. Cover the bowl with plastic wrap and let rise until double in size, about 1 hour. Punch the dough down, knead briefly, shape it into a ball, cover, and let rise until soft and puffy, about 45 minutes more.\n            \n", "ingredients": [{"food": "coconut water", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "sugar", "quantity": 2.0}, {"food": "salt", "quantity": 1.5}, {"food": "potato flour", "quantity": 3.0}, {"food": "", "quantity": 2.5}], "title": "\nNo-Fuss Pizza Dough\n"}, {"directions": "\n\n              Combine the bread flour, whole-wheat flour, yeast and salt in a large bowl. Add 11/2 cups lukewarm water (about 100 degrees F) and mix with your hands or a spoon until the dough comes together (it will be wet and sticky). Cover the dough tightly with plastic wrap. If you have extra time, refrigerate 12 to 24 hours; this is not necessary but will improve the flavor of the bread.\n            \n\n              Let the dough rise, covered, at room temperature for about 18 hours; this rise is necessary whether you refrigerate the dough first or not. The surface will be bubbly after rising.\n            \n\n              Generously dust a work surface with all-purpose flour. Turn the dough out onto the flour, then sprinkle flour on top. Fold the top and bottom of the dough into the center, then fold in the sides to make a free-form square. Use a dough scraper or a spatula to turn the dough over, then tuck the corners under to form a ball.\n            \n\n              Line a baking sheet with parchment paper and generously dust with flour. Transfer the dough to the baking sheet, seam-side down, and sprinkle with more flour. Cover with a cotton kitchen towel (do not use terry cloth) and let rise at room temperature until doubled in size, 2 to 3 hours.\n            \n\n              Position a rack in the bottom of the oven and place a 2- or 4-quart cast-iron or enameled Dutch oven (without the lid) on the rack. Preheat the oven to 450 degrees F for at least 30 minutes. When the dough has doubled, carefully transfer the hot pot to a heatproof surface. Uncover the dough, lift up the parchment and quickly invert the dough into the pot (shake the pot to center the dough, if necessary). Cover with the lid and bake 30 minutes, then uncover and bake until brown and crusty, 15 to 30 more minutes. Turn out onto a rack to cool.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.5}, {"food": "potato flour", "quantity": 0.5}, {"food": "yeast extract spread", "quantity": 0.5}, {"food": "salt", "quantity": 1.5}, {"food": "potato flour", "quantity": 1}], "title": "\nNo-Knead Peasant Bread\n"}, {"directions": "\n\n              Saute chopped mushrooms in butter and olive oil. Add minced shallots and a drizzle of truffle oil; season with salt and pepper. Spoon onto white tortilla chips; top with a slice of taleggio cheese and a dollop of ricotta. Bake at 375 degrees until the cheese melts, about 5 minutes.\n            \n\n              Photograph by Jonathan Kantor\n            \n", "ingredients": [], "title": "\nNominee Nachos\n"}, {"directions": "\nSpecial equipment: a candy thermometer\n\n              Whisk together the eggs, egg yolks, sugar and a pinch of salt in a medium bowl.\n            \n\n              Heat the milk and 3/4 cup of the cream in a medium saucepan over medium heat until the liquid starts to steam; remove from the heat.\n            \n\n              Whisk about 1 cup of the hot milk mixture into the egg mixture, then pour the milk-egg mixture back into the saucepan. Return the saucepan to medium heat, and cook, stirring constantly with a wooden spoon, until the mixture is thick enough to coat the back of the spoon and a thermometer reads 165 degrees F, about 5 minutes.\n            \n\n              Remove the saucepan from the heat, and stir in the vanilla and nutmeg. Strain the liquid through a fine mesh strainer into a medium bowl, and let it cool at room temperature until it is no longer hot, about 1 hour. Refrigerate until cold, about 2 hours up to 3 days.\n            \n\n              When ready to serve, whip the remaining 3/4 cup cream with an electric mixer in a large bowl to medium peaks. Then, while whisking, slowly pour in the cold milk-egg mixture. The eggnog should be creamy and thicker than heavy cream. Serve with a light sprinkle of nutmeg and lemon zest if using.\n            \n", "ingredients": [{"food": "egg substitute", "quantity": 3.0}, {"food": "sugar", "quantity": 0.75}, {"food": "salt", "quantity": 1}, {"food": "whole milk", "quantity": 3.5}, {"food": "ice cream swich", "quantity": 1.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "nutmeg", "quantity": 0.25}, {"food": "lemon juice", "quantity": 1}], "title": "\nNonalcoholic Eggnog\n"}, {"directions": "\n\n              Pipe 3 thin lines of chocolate across the cupcake with stem ends touching. Arrange the nonpareils on the stems. Cut the fish into 2 leaves, and arrange at the base of the stems.\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 1}, {"food": "frosting", "quantity": 1.0}, {"food": "black bean mango", "quantity": 6.0}, {"food": "barley flour or meal", "quantity": 1.0}], "title": "\nNonpareil Flowers\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Butter a 3-quart baking dish. Melt 6 tablespoons butter in a large skillet over medium heat. Add the onion and 1/4 teaspoon sugar and cook until soft and golden brown, 8 to 10 minutes. Transfer to a large bowl, reserving the skillet.\n            \n\n              Meanwhile, bring a large pot of salted water to a boil; add the noodles and cook until al dente, about 6 minutes. Drain the noodles and add to the bowl with the onion mixture; season with salt and pepper.\n            \n\n              Pulse the eggs, cottage cheese, sour cream, milk, cinnamon, orange zest, the remaining 1 tablespoon sugar and 1 teaspoon salt in a food processor until smooth. Add to the noodles and toss, then transfer the mixture to the prepared dish. Melt the remaining 2 tablespoons butter in the skillet over medium heat, add the cornflakes and toss. Sprinkle over the pasta and bake until just set, 35 to 40 minutes. Let rest 10 minutes before serving.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "sugar", "quantity": 1.25}, {"food": "salt", "quantity": 1}, {"food": "egg substitute", "quantity": 12.0}, {"food": "pepper", "quantity": 1}, {"food": "eggs", "quantity": 3.0}, {"food": "macaroni cheese", "quantity": 2.0}, {"food": "sour cream", "quantity": 2.0}, {"food": "whole milk", "quantity": 2.0}, {"food": "cinnamon", "quantity": 1}, {"food": "orange", "quantity": 0.5}, {"food": "", "quantity": 3.0}], "title": "\nNoodle Kugel\n"}, {"directions": "\n\n              Toast 8 ounces fideo or broken spaghetti in a skillet with olive oil over low heat, 4 minutes. Stir in 1 cup chopped scallions and 2 teaspoons ground cumin. Add 1 1/2 cups chicken broth and one 14-ounce can diced tomatoes with chiles. Simmer, stirring, until the noodles are tender, 12 minutes. Season with salt. Top with chopped cilantro and crumbled Cotija cheese.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [], "title": "\nNoodles with Spicy Tomato Sauce\n"}, {"directions": "\n\n              For the barley porridge: Gently bring the milk and barley flakes to a boil over medium heat in a medium saucepan. Reduce the heat to a simmer, then cover and cook until the milk is almost absorbed and the barley is super soft and still a bit creamy, about 15 minutes. Stir in the sugar, butter and 1/2 teaspoon salt.\n            \n\n              For the toppings: Meanwhile, roughly smash the raspberries with the sugar in a small bowl with a fork.\n            \n\n              Divide the porridge among 4 bowls. Working around the edges of the bowls, make neat piles of the toppings, placing a quarter of the crushed raspberries, apple sticks, pistachios and chia seeds in each bowl. Drizzle each with 1 tablespoon milk and sprinkle with some cinnamon to finish.\n            \n", "ingredients": [{"food": "whole milk", "quantity": 2.5}, {"food": "barley", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "raspberries", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "apple", "quantity": 0.5}, {"food": "", "quantity": 2.0}, {"food": "chia seeds", "quantity": 4.0}, {"food": "whole milk", "quantity": 0.25}, {"food": "cinnamon", "quantity": 1}], "title": "\nNordic Breakfast Porridge\n"}, {"directions": "\nSpecial equipment: 2 plastic deli container lids, optional\n\n              Bring a medium saucepan of water to a boil. Add the coriander, 2 dill sprigs, half of the lemon zest and 1 teaspoon each salt and pepper. Let boil for 1 minute, remove the saucepan from the heat, add the shrimp and cover the pot. Let the shrimp sit, covered, until cooked through, about 2 minutes. Drain the shrimp and chill in ice water. Once chilled, remove and blot dry. Refrigerate until ready to use.\n            \n\n              Chop 2 tablespoons dill fronds and add it to a small bowl along with the juice of half the lemon and the remaining zest. Add the cream cheese and yogurt to the bowl and stir to combine. Spread each slice of toast with the cream cheese mixture.\n            \n\n              Lay as many shrimp as will fit flat between 2 plastic deli container lids; the tops of the lids should be facing each other. Making a fist, press down on the top lid to keep the shrimp in place. Position a sharp knife between the narrow opening of the lids and use a sawing motion to slice the shrimp in half at one time. Repeat with the remaining shrimp. Alternatively, slice on a cutting board.\n            \n\n              Arrange the shrimp (cut-side down), cucumber and radish slices in overlapping decorative rows -- think fish scales -- to cover each toast. Sprinkle each with the remaining dill fronds.\n            \n", "ingredients": [{"food": "watermelon seed krnls", "quantity": 1.0}, {"food": "dill seed", "quantity": 0.25}, {"food": "lemon juice", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "shrimp", "quantity": 8.0}, {"food": "macaroni cheese", "quantity": 0.5}, {"food": "silk banana-strawberry soy yogurt", "quantity": 0.5}, {"food": "garlic bread", "quantity": 4.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}], "title": "\nNordic Shrimp Toast\n"}, {"directions": "\n\n              Position a rack in the top third of the oven and preheat to 450 degrees F. Line a rimmed baking sheet with parchment paper.\n            \n\n              Lay the lemon slices in an even layer on one side of the baking sheet. Place the chicken thighs skin-side up on top of the lemon slices and brush with 1 tablespoon olive oil. Sprinkle the chicken thighs with berbere, chili powder, ground cumin, and some salt and pepper. Place the carrots in the center of the baking sheet (leaving an empty space on the other side) and drizzle with 1 tablespoon olive oil, the za'atar and some salt. Toss to coat and top with the whole cinnamon stick.\n            \n\n              Roast until the carrots are almost completely tender and the chicken thighs are crispy on top and almost cooked through, 40 minutes. Remove the baking sheet from the oven and add the chickpeas to empty space, tossing with the remaining 1 tablespoon olive oil and some salt and pepper; spread into an even layer. \n            \n\n              Roast until the chicken has brown, crisp skin and reads an internal temperature of 160 degrees F, the carrots are completely tender and browned in spots, and the chickpeas are warmed through, about 5 minutes more. Discard cinnamon stick. Divide the chicken and vegetables between two plates and serve with the pan juices drizzled over.\n            \n", "ingredients": [{"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "rice bowl with chicken", "quantity": 4.0}, {"food": "", "quantity": 0.25}, {"food": "chili powder", "quantity": 0.25}, {"food": "cumin seed", "quantity": 0.25}, {"food": "black bean mango", "quantity": 1}, {"food": "chickpeas", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "", "quantity": 0.5}, {"food": "cinnamon", "quantity": 1.0}], "title": "\nNorth African Chicken and Chickpeas Sheet Pan Dinner\n"}, {"directions": "\n\n              Make small holes all over the pork shoulder with a thin sharp knife and stuff in garlic cloves. Rub the meat all over with the Memphis Shake; cover and refrigerate overnight.\n            \n\n              Prepare an outdoor grill with an indirect medium-hot fire with a mix of briquettes and hardwood charcoal in half of the grill. Set grate over coals. Place pork, skin side up, in an aluminum pan with about 1 1/2 cups water on the cooler side of the grate. Toss 1 cup of the soaked and drained wood chips onto the coals and cover the grill, making sure the lid's vents are directly over pork.\n            \n\n              When the coals cool to medium-low heat, preheat a chimney-full of hot briquettes and hardwood charcoal. Whenever smoke stops coming out of the vents, about every hour, add more hot coals and 1 cup of soaked and drained wood chips to the fire. The goal is to maintain a medium-heat, smoky fire (but don't worry if it is hotter when the coals are added and cooler while preheating the coals). Rotate the pork when you add coals so it cooks evenly. Cook the meat until an instant-read thermometer inserted into the thickest part of the pork registers 180 degrees F, about 6 hours.\n            \n\n              Set aside 1 quart of the North Carolina-Style Vinegar BBQ Sauce. Once the pork reaches 180 degrees F, begin mopping the entire surface of the meat every 20 minutes with some of the remaining sauce and the pan drippings. Continue to cook the pork, covering the grill between mopping, until an instant-read thermometer registers 200 degrees F, about 1 to 2 hours more.\n            \n\n              Transfer the pork to a cutting board and let rest for at least 15 minutes. Remove the outer skin and discard. Cut large chunks from the bone and shred, using 2 forks or your fingers, (when cool enough to touch) or chop. Toss with about 1 cup of the reserved barbecue sauce for every 3 cups of meat. Tuck the pork into the soft rolls and serve with pickles.\n            \n\nMemphis Shake:\n\n\n              Whisk paprika, brown sugar, oregano, garlic, ancho powder, salt, and celery salt in a small bowl. Store in an airtight container in a cool, dry place for up to 2 months.\n            \n\nNorth Carolina-Style Vinegar BBQ Sauce:\n\n\n              Heat the vinegar and sugar in a medium saucepan over medium heat until the sugar dissolves. Off the heat, stir in the ketchup, honey, salt, red pepper, and black pepper.\n            \n", "ingredients": [{"food": "pork skins", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "", "quantity": 0.75}, {"food": "apple", "quantity": 5.0}, {"food": "", "quantity": 2.0}, {"food": "pizza rolls", "quantity": 8.0}, {"food": "pickles", "quantity": 1}, {"food": "sweet potatoes", "quantity": 0.25}, {"food": "sugar", "quantity": 3.0}, {"food": "", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "chili powder", "quantity": 1.0}, {"food": "salt", "quantity": 2.0}, {"food": "celery seed", "quantity": 1.0}, {"food": "vinegar", "quantity": 3.0}, {"food": "sugar", "quantity": 0.75}, {"food": "", "quantity": 0.3333333333333333}, {"food": "honey smoked ham", "quantity": 0.25}, {"food": "salt", "quantity": 0.25}, {"food": "ruby red grapefruit juice blend", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1.5}], "title": "\nNorth Carolina-Style BBQ Pulled-Pork Sandwiches\n"}, {"directions": "\nSpecial equipment: 4 cups wood chips, such as hickory or mesquite, soaked in water for 30 minutes and drained\n\n              1. For the brine: In a large stockpot, bring 6 quarts water, 1 1/2 cups salt, brown sugar, coriander, ginger, and bay leaves to a boil. Lower the heat and simmer 10 minutes, stirring occasionally to make sure the salt and sugar are dissolved. While the brine is simmering, fill a bucket (or pot) big enough to hold a turkey with the ice. Pour the brine over the ice. When the brine has cooled, add the turkey. Place a heavy object like a plate or lid on top of the turkey to keep it submerged in the liquid. Brine in the refrigerator for up to 8 hours.\n            \n\n              2. For the sauce: Heat the vinegar and granulated sugar in a medium saucepan over medium heat until the sugar dissolves. Off the heat, stir in the ketchup, honey, 1/4 cup salt, red pepper, and black pepper. Reserve 1 1/2 cups for passing at the table.\n            \n\n              3. For the turkey: Prepare an outdoor grill with a medium-high fire for both direct and indirect grilling. Position a drip pan under the grate on the indirect side of the grill. Sprinkle the cavity of the turkey with salt and stuff with the celery, lemons, onions, and parsley, then tie the legs. Place the turkey breast-side up over the drip pan. Toss 1 cup of the soaked wood chips onto the coals. Cover the grill and rotate the lid so that the vent holes are directly over the meat. To maintain a medium-low smoky fire, add about a dozen pieces of charcoal and another cup of wood chips to the fire whenever the fire dies down. Rotate the turkey about every 45 minutes to prevent the side closest to the coals from overcooking.\n            \n\n              4. After 1 hour, begin basting the turkey every 20 to 30 minutes with the remaining 2 1/2 cups of sauce. (Keep the grill covered between basting.) Cook until an instant-read thermometer inserted in the thigh, not touching the bone, registers 165 degrees F, 2 1/2 to 3 hours. Transfer to a cutting board and let rest 15 minutes before carving.\n            \n\n              Serves: 8-10 (analysis done for 10)\n            \n\n              Nutrition Information (per serving):\n            \n\n              *Sauce for passing included\n            \n\n              Calories: 1109\n            \n\n              Total Fat: 50 grams\n            \n\n              Saturated Fat: 14 grams\n            \n\n              Total Carbohydrates: 23 grams\n            \n\n              Protein: 132 grams\n            \n\n              Sodium: 2009 milligrams\n            \n\n              Cholesterol: 503 milligrams\n            \n\n              Fiber: 0.5 grams\n            \n\n              Serves: 32\n            \n\n              Nutrition Information (per 2 tablespoons):\n            \n\n              Calories: 28\n            \n\n              Total Fat: 0 grams\n            \n\n              Saturated Fat: 0 grams\n            \n\n              Total Carbohydrates: 7 grams\n            \n\n              Protein: 0 grams\n            \n\n              Sodium: 56 milligrams\n            \n\n              Cholesterol: 0 milligrams\n            \n\n              Fiber: 0 grams\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "sugar", "quantity": 0.75}, {"food": "seeds", "quantity": 0.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "smoked turkey roll", "quantity": 1.0}, {"food": "vinegar", "quantity": 3.0}, {"food": "sugar", "quantity": 0.75}, {"food": "", "quantity": 0.3333333333333333}, {"food": "honey smoked ham", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "ruby red grapefruit juice blend", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "celery seed", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "parsley", "quantity": 4.0}], "title": "\nNorth Carolina-Style BBQ Turkey\n"}, {"directions": "\n\n              Combine the bacon, beef stock, cider vinegar, white vinegar, brown sugar, ketchup, red pepper flakes, chile powder and 1 tablespoon salt in a medium saucepan. Bring to a boil, then reduce the heat to medium low and simmer until the bacon renders its fat, about 15 minutes. Remove from the heat; set aside to let the flavors develop, 20 minutes. Remove the bacon. Reheat the sauce before serving. \n            \n\n              Photograph by Andrew Purcell\n            \n", "ingredients": [{"food": "bacon", "quantity": 4.0}, {"food": "frankfurter beef", "quantity": 0.75}, {"food": "vinegar", "quantity": 1.5}, {"food": "vinegar", "quantity": 0.5}, {"food": "sugar", "quantity": 0.25}, {"food": "", "quantity": 0.25}, {"food": "ruby red grapefruit juice blend", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}], "title": "\nNorth Carolina-Style Vinegar Barbecue Sauce\n"}, {"directions": "\n\n              Lightly butter and flour a 9 by 5-inch loaf pan. Put a rack in the middle of the oven. Preheat the oven to 350 degrees F. \n            \n\n              Put the dates in a medium bowl and cover with hot water. Soak for 15 minutes and drain. \n            \n\n              In a medium bowl, whisk together both of the flours, baking powder, and salt. Set aside. \n            \n\n              In a standing mixer fitted with the paddle attachment, or with an electric hand-held mixer, combine half the dates, butter, and brown sugar and mix on low speed until just incorporated. Raise the speed to high and mix until light and fluffy, about 10 minutes. (Occasionally turn the mixer off, and scrape down the sides of the bowl with a rubber spatula.) \n            \n\n              Add the eggs one at time, mixing well after each addition. \n            \n\n              Mixing on low speed, add the flour in 3 parts to the butter mixture, alternating with the milk in 2 parts, until just combined. Raise the speed to medium and mix briefly until a smooth batter is formed. Add the remaining dates and walnuts and mix until just incorporated. \n            \n\n              Scrape the batter into the prepared pan. Bake, turning the pan halfway through, until golden brown and a toothpick inserted in the center comes out clean, about 1 1/2 hours. \n            \n\n              Remove from the oven and cool slightly. Remove the bread from the pan and cool on a rack completely before serving. \n            \n", "ingredients": [{"food": "dates", "quantity": 1.5}, {"food": "potato flour", "quantity": 2.5}, {"food": "wheat flour", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "eggs", "quantity": 4.0}, {"food": "whole milk", "quantity": 0.75}, {"food": "", "quantity": 1.0}], "title": "\nNot-So-Heavy Date-Nut Bread\n"}, {"directions": "\n\n              Put the nuts, sugar, butter, corn syrup, and honey in a saucepan over medium-high heat. Stir constantly with a wooden spoon until it becomes a nice walnut color and thickens, about 10 to 12 minutes. Quickly pour onto a silpat or foil lined baking sheet and spread the brittle to an even thickness of about 1/3-inch with the back of the spoon.\n            \n\n              Cool for 3 or 4 minutes then score the brittle with a sharp knife into about 24 (2-inch) squares. Once the brittle has cooled completely, snap along scored marks.\n            \n", "ingredients": [{"food": "peanuts", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "pineapple chunks", "quantity": 1.0}, {"food": "silk light vanilla", "quantity": 0.3333333333333333}, {"food": "honey smoked ham", "quantity": 2.0}], "title": "\nNut Brittle\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Put the sugar, 3/4 cup red wine vinegar, 1/4 cup water and 1 tablespoon salt into a small saucepan over medium-high heat. Once the sugar and salt have dissolved and the mixture is just about to boil, turn off the heat and add the sliced red onion. Allow the mixture to sit in the pot for 15 minutes, then transfer to a bowl, cover and refrigerate for at least 45 minutes, or up to overnight.\n            \n\n              In the bowl of a food processor, pulse the almonds, walnuts, sundried tomatoes, soy sauce, chili powder, paprika, cumin, oregano, garlic and the remaining tablespoon red wine vinegar until the mixture is crumbled, about 30 pulses. (It should resemble the texture of ground beef.)\n            \n\n              Place a medium skillet over medium-low heat and add the olive oil. Transfer the taco mixture to the skillet and cook until it is warmed through, about 2 minutes.\n            \n\n              Warm the tortillas according to the package instructions. Top each tortilla with 1/4 cup of the taco mixture. Garnish with the pickled red onion, cotija cheese, cilantro and lime wedges.\n            \n", "ingredients": [{"food": "sugar", "quantity": 2.0}, {"food": "vinegar", "quantity": 0.75}, {"food": "salt", "quantity": 1}, {"food": "onion powder", "quantity": 0.5}, {"food": "almonds", "quantity": 1.0}, {"food": "walnuts", "quantity": 1.0}, {"food": "tomatoes", "quantity": 0.3333333333333333}, {"food": "soy sauce", "quantity": 2.0}, {"food": "chili powder", "quantity": 1.0}, {"food": "smoked turkey roll", "quantity": 1.0}, {"food": "cumin seed", "quantity": 0.5}, {"food": "", "quantity": 0.5}, {"food": "garlic powder", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "corn bran", "quantity": 8.0}, {"food": "macaroni cheese", "quantity": 0.25}, {"food": "chrysanthemum leaves", "quantity": 0.25}, {"food": "lime", "quantity": 1.0}], "title": "\nNut Meat Tacos with Pickled Red Onions\n"}, {"directions": "\n\n              Combine the buttermilk powder, garlic powder, onion powder, 2 teaspoons salt and the cayenne in a small bowl. Toss together the cereal, peas, bagel chips and pretzels in a large microwave-safe bowl.\n            \n\n              Microwave the butter, lemon zest, chives and parsley in a microwave-safe small bowl on high for 30 seconds; stir, then microwave until the butter is melted, about 15 seconds more. Stir in the vinegar. Pour the mixture over the cereal mixture, and toss well to coat. Sprinkle the buttermilk powder mixture on top, and toss well to coat.\n            \n\n              Microwave the snack mix on high for 2 minutes; stir, then microwave for 3 minutes more, stirring well every 45 seconds or so. Spread the mixture on a large rimmed baking sheet, and let cool and dry for 10 minutes before packing into airtight containers. The mix will keep for 2 days at room temperature.\n            \n", "ingredients": [{"food": "onion powder", "quantity": 6.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "pepper", "quantity": 0.375}, {"food": "crisped rice bar", "quantity": 4.0}, {"food": "pigeon peas", "quantity": 2.0}, {"food": "potato chips", "quantity": 1.5}, {"food": "pretzels", "quantity": 1.5}, {"food": "butter oil", "quantity": 4.0}, {"food": "", "quantity": 3.0}, {"food": "chives", "quantity": 2.0}, {"food": "parsley", "quantity": 2.0}, {"food": "vinegar", "quantity": 2.0}], "title": "\nNut-Free Ranch-Flavored Crispy Cereal Snack Mix\n"}, {"directions": "\n\n              Position an oven rack at the bottom of the oven, and preheat to 325 degrees F.\n            \n\n              Whisk the maple syrup and oil together in a large bowl. Add the almonds, pecans, coconut, sunflower seeds, sesame seeds, flaxseed and salt, and toss to coat.\n            \n\n              Spread the mixture out on a baking sheet, and bake for 20 minutes. Remove it from the oven, and scrape and toss the mixture around. Continue to bake until golden and still slightly sticky, 10 to 12 minutes more. Or, for a deeper, toasted version, bake until deeply golden (you may start to smell the toasted nuts), 13 to 15 minutes more. Let cool. (The granola can be stored in an airtight container at room temperature for up to 5 days.)\n            \n", "ingredients": [{"food": "syrup", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "pecans", "quantity": 0.5}, {"food": "coconut water", "quantity": 0.25}, {"food": "sunflower seed kernels", "quantity": 3.0}, {"food": "sesame seeds", "quantity": 1.0}, {"food": "ground turkey", "quantity": 1.0}, {"food": "salt", "quantity": 0.25}], "title": "\nNut-and-Seed Granola\n"}, {"directions": "\n\n              Combine the ingredients in a large bowl. Store in an airtight container.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "hazelnuts or filberts", "quantity": 1.0}, {"food": "pecans", "quantity": 1.0}, {"food": "almonds", "quantity": 1.0}, {"food": "walnuts", "quantity": 1.0}, {"food": "coconut water", "quantity": 0.25}, {"food": "papaya nectar", "quantity": 0.5}, {"food": "dates", "quantity": 0.5}, {"food": "pumpkin flowers", "quantity": 0.5}, {"food": "sunflower seed kernels", "quantity": 0.5}, {"food": "raisins", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}], "title": "\nNut-and-Seed Mix With Papaya\n"}, {"directions": "\n\n              Mix 2 tablespoons room-temperature Nutella and 3/4 cup milk in a glass. Quickly stir, then pour in 1/2 cup seltzer.\n            \n", "ingredients": [], "title": "\nNutella Egg Cream\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Whisk together the flour, salt, baking powder and baking soda in a large bowl.\n            \n\n              Beat together the brown sugar and butter in another large bowl with an electric mixer on medium-high speed until light and fluffy, about 4 minutes. Add the eggs 1 at time, beating after each addition to incorporate. Beat in the vanilla. Reduce the speed to medium, add the flour mixture and beat until just incorporated. \n            \n\n              Divide the dough into 18 equal mounds, each about 2 tablespoons, and flatten slightly with wet hands. Put 2 teaspoons of the chilled chocolate-hazelnut spread in the center of each piece of dough, then press and pinch the cookie dough around the spread to form round and sealed balls. Chill for 30 minutes. \n            \n\n              Meanwhile, position oven racks in the top and bottom thirds of the oven and preheat to 300 degrees F. Line 2 baking sheets with parchment.\n            \n\n              Put 6 chilled dough balls onto each prepared baking sheet, spacing them about 2 inches apart. Bake, rotating the baking sheets halfway through, until the cookies are golden around the edges, about 20 minutes. Let the cookies cool for a few minutes on the baking sheets, then transfer to a rack or plate and serve warm if you'd like. When the baking sheets have cooled completely, bake the remaining 6 dough balls on one of the sheets, then let cool slightly. \n            \n\n              Store the cookies in a tightly sealed container at room temperature for up to 5 days.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.25}, {"food": "salt", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "sugar", "quantity": 1.5}, {"food": "butter oil", "quantity": 1.5}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "meat drippings ", "quantity": 0.75}], "title": "\nNutella-Stuffed Cookies\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Line a baking sheet with parchment and drop 12 separate teaspoonful mounds of chocolate-hazelnut spread onto it. Tap the baking sheet on a counter to flatten the dollops and freeze until solid, about 15 minutes.\n            \n\n              Meanwhile, preheat a griddle over low heat and brush lightly with oil.\n            \n\n              Whisk together the flour, buttermilk, oil, granulated sugar, baking powder, baking soda, egg and a pinch of salt in a large bowl until smooth.\n            \n\n              Pour eight 2-tablespoon pools of batter on the hot griddle and cook until bubbles just begin to form on the surface of the pancakes and the bottoms are golden, 1 to 2 minutes. Place a disc of frozen chocolate-hazelnut spread on 4 of the pancakes and overturn the 4 remaining pancakes on top of those, so the wet batter envelopes the discs. Put the remaining discs back in the freezer. Continue to cook the pancakes, flipping halfway, until the edges are set, about 1 minute. Repeat with the remaining batter and discs, lightly oiling the griddle in between batches.\n            \n\n              Dust the pancakes with confectioners' sugar and serve warm with syrup.\n            \n", "ingredients": [{"food": "meat drippings ", "quantity": 12.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "potato flour", "quantity": 1.25}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 1.25}, {"food": "sugar", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "sugar", "quantity": 1}, {"food": "syrup", "quantity": 1}], "title": "\nNutella-Stuffed Pancakes\n"}, {"directions": "\n\n              Empty a 12-ounce bag of fresh or frozen cranberries into a saucepan and transfer 1/2 cup to a small bowl. Add 1 cup sugar, 1 strip orange or lemon zest and 2 tablespoons water to the pan and cook over low heat, stirring occasionally, until the sugar dissolves and the cranberries are soft, about 10 minutes. Increase the heat to medium and cook until the cranberries burst, about 12 minutes. Reduce the heat to low and stir in the reserved cranberries. Add sugar, salt and pepper to taste. Quarter 1 each unpeeled orange and tart apple; remove seeds. Roughly chop the fruit with 1/2 cup sugar in a food processor. Fold into cranberry sauce along with 1/2 cup chopped toasted pecans. Let cool to room temperature before serving.\n            \n\n              Photograph by Jonathan Kantor\n            \n", "ingredients": [], "title": "\nNutty Cranberry Relish\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Toss the figs with the olive oil and a pinch of salt in a baking dish. Roast until soft, about 10 minutes.\n            \n\n              Meanwhile, puree the nuts and peanut oil in a food processor until smooth and creamy, about 2 minutes. Scrape down the sides of the bowl. Add the ricotta, honey and cinnamon and pulse until combined, about 1 minute.\n            \n\n              Spread the ricotta mixture on the bread and top with the roasted figs. Drizzle with honey and top with chopped nuts.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [{"food": "figs", "quantity": 8.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "mixed nuts", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 0.75}, {"food": "honey smoked ham", "quantity": 2.0}, {"food": "cinnamon", "quantity": 0.5}, {"food": "garlic bread", "quantity": 1}], "title": "\nNutty Fig Toasts\n"}, {"directions": "\n\n              Scrunch up pieces of aluminum foil to make twelve 1/2-inch by about 1-inch cone-like molds for forming the ghosts. Set aside. Line a baking sheet with parchment paper.\n            \n\n              Mix the apple, nuts, 1/3 cup of the chocolate chips, and caramels together in a bowl.\n            \n\n              Preheat the oven to 400 degrees F.\n            \n\n              Remove phyllo from the package, unroll, and cover with a damp towel. (Take care to keep the phyllo covered while you form the ghosts.)\n            \n\n              Lay 1 sheet of phyllo on a clean work surface, brush lightly with the butter. Fold the sheet in half, brush the surface again with butter. Fold phyllo 1 more time to make a square. Place a heaping tablespoon of the apple filling in the center of the square. Gather the corners of the phyllo up around the filling, then pinch the dough around the filling. (It should look like a Halloween sheet ghost, with a small head and a drape of phyllo.) Place the foil cones inside the open part of the phyllo. Lay the ghost flat on the prepared pan, reshaping the phyllo if needed. Repeat with the remaining filling and phyllo.\n            \n\n              Bake until the phyllo is light brown and crisp, about 15 minutes. Cool.\n            \n\n              When ready to serve, melt the remaining 2 tablespoons chocolate chips in a small bowl in the microwave. Generously sift confectioners' sugar over the ghosts. To make the ghost eyes, lightly touch 2 spots on the head of each ghost with a moist finger to remove some of the sugar. Then dab or pipe the melted chocolate in the 2 spots to make eyes. Cool, remove the foil molds and serve standing on a platter.\n            \n\n              Copyright 2005 Television Food Network, G.P. All rights reserved.\n            \n", "ingredients": [{"food": "apple", "quantity": 1.0}, {"food": "mixed nuts", "quantity": 0.3333333333333333}, {"food": "baking chocolate", "quantity": 0.3333333333333333}, {"food": "", "quantity": 12.0}, {"food": "phyllo dough", "quantity": 1.0}, {"food": "butter oil", "quantity": 8.0}, {"food": "sugar", "quantity": 1}], "title": "\nNutty Phyllo Ghosts\n"}, {"directions": "\n\n              Spread some peanut butter on the top few inches of pretzel rods. Roll in chopped peanuts and/or dried fruit.\n            \n", "ingredients": [], "title": "\nNutty Pretzel Wands\n"}, {"directions": "\n\n              Preheat the oven to 325 degrees F. Line 2 baking sheets with parchment. Pulse the nuts, confectioners' sugar and granulated sugar in a food processor until finely ground. Add the flour, cinnamon and salt and pulse until combined. Add the butter and pulse to form a soft dough. \n            \n\n              Roll heaping teaspoonfuls of dough into balls and arrange 1 1/2 inches apart on the prepared baking sheets. Lightly flatten the balls with your fingers. Sprinkle with coarse, raw, sanding or brown sugar. Press a whole nut into the top of some of the cookies or sprinkle with chopped nuts. \n            \n\n              Bake the cookies until lightly golden, about 15 minutes. Let cool 3 minutes on the baking sheets, then transfer to racks to cool completely. Spread your choice of filling on the flat side of a cookie; sandwich with another cookie. Repeat with the remaining cookies. \n            \n\n              Photograph by Steve Giralt\n            \n", "ingredients": [{"food": "sugar", "quantity": 0.5}, {"food": "sugar", "quantity": 0.25}, {"food": "potato flour", "quantity": 1.0}, {"food": "cinnamon", "quantity": 0.5}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 1}, {"food": "hazelnuts or filberts", "quantity": 0.75}, {"food": "chocolate hazelnut spread", "quantity": 1}], "title": "\nNutty Sandwich Cookies\n"}]