[{"directions": "\n\n              Preheat the oven to 425 degrees F. Cut the cauliflower into 1/2-inch pieces and toss with 2 tablespoons of the oil, 1 teaspoon salt and 1/2 teaspoon pepper. Spread on a baking sheet and roast until golden, about 45 minutes.\n            \n\n              Combine the broth and 1 cup water in a saucepan and bring to a bare simmer.\n            \n\n              Heat the remaining 3 tablespoons oil in a medium, heavy pot over medium-high heat until hot. Add the garlic, onions, 1 teaspoon salt and 1/2 teaspoon pepper, and cook until softened, about 8 minutes. Stir in the oats and wine, and boil until the liquid is reduced by half, about 2 minutes.\n            \n\n              Stir in the simmering broth 1 cup at a time, adding more after half of the liquid has evaporated. Continue stirring until the oats are tender, 35 to 40 minutes. Use all of the broth. Stir in the butter, cheese and parsley and season with salt and pepper.\n            \n\n              Serve immediately, topped with the roasted cauliflower and parsley.\n            \n", "ingredients": [{"food": "cauliflower", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 5.0}, {"food": "black bean mango", "quantity": 1}, {"food": "diced chicken", "quantity": 5.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "oats", "quantity": 1.0}, {"food": "martha white foods", "quantity": 0.5}, {"food": "butter oil", "quantity": 2.0}, {"food": "", "quantity": 0.5}, {"food": "parsley", "quantity": 2.0}], "title": "\nOat Risotto with Roasted Cauliflower\n"}, {"directions": "\n\n              The night before: Combine the oats, chia seeds and 1 cup of the milk in a medium bowl. Cover with plastic wrap and refrigerate overnight. Combine the kiwis, mango and pineapple in another bowl, drizzle with honey and 1/4 teaspoon salt and toss to combine. Cover with plastic wrap and refrigerate overnight.\n            \n\n              In the morning: Preheat the oven to 200 degrees F. Line a baking sheet with two kitchen towels stacked on top of each other and place in the oven. This will keep your cooked pancakes warm. Heat a large nonstick skillet over medium-high heat. Add the coconut and cook, stirring occasionally, until golden brown and toasted, about 3 minutes. Transfer to a bowl. \n            \n\n              Whisk the flour, cornstarch, confectioners' sugar, baking powder, baking soda and remaining 1/4 teaspoon salt together in a large bowl. Stir the oat-chia mixture well, then whisk in the remaining 1 cup milk, coconut oil, eggs and vanilla, breaking up any lumps of coconut oil. Add the milk mixture to the flour mixture and stir until ingredients are just incorporated (it's okay if there are some lumps). Let the batter rest for 5 minutes. Uncover the fruit and let stand at room temperature while you cook the pancakes.\n            \n\n              Wipe the skillet clean and place over medium heat. Ladle 1/4 cup of the batter into the skillet, spreading into a 4 1/2-inch round; repeat to make a second pancake. Cook, until pancakes are golden on the bottom and bubbly on top, about 1 minute. Flip the pancakes and cook until undersides are golden and batter is cooked through, about 45 seconds more. Transfer the pancakes to the baking sheet in the oven, tucking them between the kitchen towels. Repeat with the remaining batter to make more pancakes. \n            \n\n              When ready to serve, place 3 pancakes on each plate. Stir the fruit salad and divide it evenly among the pancakes, drizzle with accumulated juices and top with toasted coconut.\n            \n", "ingredients": [{"food": "oats", "quantity": 0.75}, {"food": "chia seeds", "quantity": 2.0}, {"food": "milk", "quantity": 2.0}, {"food": "luncheon slices", "quantity": 2.25}, {"food": "black bean mango", "quantity": 1.5}, {"food": "pineapple chunks", "quantity": 1.0}, {"food": "honey smoked ham", "quantity": 2.0}, {"food": "salt", "quantity": 0.5}, {"food": "coconut water", "quantity": 0.25}, {"food": "potato flour", "quantity": 1.5}, {"food": "cornstarch", "quantity": 0.25}, {"food": "sugar", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 0.5}], "title": "\nOat and Chia Seed Pancakes with Mango, Pineapple and Kiwi\n"}, {"directions": "\n\n              Make Classic Shortbread dough with just 1 cup flour. Add 1 cup ground oats and 3/4 cup finely ground walnuts with the flour. Divide between two 8-inch square pans, score and bake about 1 hour at 300 degrees. Cool and slice; drizzle with melted bittersweet chocolate.\n            \n", "ingredients": [], "title": "\nOat-Walnut Thins\n"}, {"directions": "\n\n              Whisk 1 1/4 cups brown sugar, 1 egg and 2 egg whites in a bowl. Whisk in 1/4 cup vegetable oil; stir in 1 1/2 cup rolled oats, 1 cup whole-wheat flour, 1/2 cup wheat germ and 1 teaspoon each baking soda and salt. Add 1/2 cup chocolate chunks and 1/4 cup each raisins and walnuts. Drop large spoonfuls onto lined baking sheets and gently flatten; bake at 350 degrees F, 12 to 15 minutes.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nOatmeal Cookies\n"}, {"directions": "\n\n              Position the racks in the top and lower third of the oven and preheat to 350 degrees F. \n            \n\n              In a large bowl, whisk together the flour, baking soda, salt, allspice, cinnamon, and mace. \n            \n\n              In another large bowl, combine the butter and sugar and, with a hand-held electric mixer, mix on low speed until just incorporated. Raise the speed to high and mix until light and fluffy. (Occasionally turn the mixer off, and scrape the sides of the bowl down with a rubber spatula.) \n            \n\n              Add the brown sugar and mix until incorporated. Add the eggs to the butter mixture, one at time, waiting for the first one to be fully incorporated before adding the last. Mix in the vanilla. \n            \n\n              Reduce the mixer's speed to low. Add the flour mixture, little by little, until a smooth dough is formed (scrape the bowl down occasionally). Turn off the machine, stir in the oats, raisins, and pecans with a rubber spatula. \n            \n\n              Line 2 baking sheets with parchment paper. Using a spoon, drop heaping tablespoons of the dough onto the sheets, spaced about 2 inches apart. \n            \n\n              Bake the cookies in batches, turning the pans once, until golden brown, but still soft and spongy, about 15 minutes per batch. Let the cookies cool slightly on the baking sheets, and then transfer to racks to cool completely. Store in a sealed container. \n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "salt", "quantity": 0.5}, {"food": "allspice", "quantity": 0.5}, {"food": "cinnamon", "quantity": 0.5}, {"food": "mace", "quantity": 0.125}, {"food": "butter oil", "quantity": 0.75}, {"food": "sugar", "quantity": 0.5}, {"food": "sugar", "quantity": 0.75}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "oats", "quantity": 2.75}, {"food": "raisins", "quantity": 0.75}, {"food": "pecans", "quantity": 0.75}], "title": "\nOatmeal Cookies\n"}, {"directions": "\n\n              Beat the butter, granulated sugar and brown sugar in a bowl with a mixer on medium speed until fluffy. Add the egg and vanilla; beat. Whisk the flour, rolled oats, baking soda, cinnamon and salt in a bowl. Add to the butter mixture and beat until just combined. Stir in the white chocolate chips and raisins. \n            \n\n              Preheat the oven to 350 degrees F. Scoop rounded tablespoons of dough and roll into balls. Arrange on parchment-lined baking sheets about 2 inches apart. Refrigerate 30 minutes, then bake until the cookies are golden on the bottom, 12 to 15 minutes. Cool on the baking sheets, 10 minutes, then transfer to racks to finish cooling. \n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "oats", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "cinnamon", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "raisins", "quantity": 0.5}], "title": "\nOatmeal Cookies With White Chocolate Chips and Raisins\n"}, {"directions": "\n\n              Position racks in the upper and lower thirds of the oven and preheat to 350 degrees F. Line 2 baking sheets with parchment paper.\n            \n\n              Melt the butter with the sugar in a saucepan over low heat, stirring, until the mixture thickens and the sugar is almost dissolved, about 5 minutes. Transfer to a large bowl and stir in the oats, flour, vanilla and salt. Let cool 10 minutes, then stir in the egg white.\n            \n\n              Drop 6 rounded tablespoonfuls of batter onto each prepared baking sheet, about 3 1/2 inches apart. Spread each mound into a 3-inch circle. Bake, switching the position of the pans halfway through, until golden brown, 12 to 15 minutes. Let cool on the baking sheets until firm, about 3 minutes, then carefully remove using a thin metal spatula and transfer to a rack to cool completely.\n            \n\n              Put the chocolate in a small microwave-safe bowl and microwave in 30-second intervals, stirring, until melted. Drizzle on the cookies and let set, about 30 minutes.\n            \n\n              Photograph by Johnny Miller\n            \n", "ingredients": [{"food": "sugar", "quantity": 0.6666666666666666}, {"food": "butter oil", "quantity": 1.0}, {"food": "oats", "quantity": 1.0}, {"food": "potato flour", "quantity": 0.25}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 2.0}], "title": "\nOatmeal Lace Cookies\n"}, {"directions": "\n\n              Line a baking sheet with parchment paper. Soak the raisins in hot water for 5 minutes, then strain.\n            \n\n              Microwave the flour in a small microwave-safe bowl for 1 minute. Remove and stir well. Microwave for an additional minute or until the temperature reaches 180 degrees F. Sift into a medium bowl, then whisk in the oats, cinnamon, baking powder and salt (see Cook's Note).\n            \n\n              Beat the brown sugar, granulated sugar, butter, yogurt and vanilla with an electric mixer on medium-high speed in a large bowl until well combined, about 2 minutes. Add the flour mixture, and mix on low speed until well incorporated. (Turn off the mixer and use your hands to help combine if needed.) Fold in the raisins with a rubber spatula, or mix them in with your hands.\n            \n\n              Scoop tablespoonfuls of the dough, and roll them into smooth balls. Put them on the prepared baking sheet, and refrigerate until chilled, about 1 hour.\n            \n\n              Melt the butterscotch chips and shortening in a medium microwave-safe bowl in the microwave in 30-second increments, stirring in between, until the coating is smooth and thin. Drop the chilled balls into the coating, and roll them around with a fork to fully coat. Remove each truffle with the fork, letting any excess coating drip off, and return to the baking sheet. (If the coating begins to harden, microwave it for a few seconds to warm it up and thin it out.) Refrigerate the truffles until the coating is completely set, about 1 hour. (The truffles can be refrigerated in an airtight container for up to 5 days.)\n            \n", "ingredients": [{"food": "raisins", "quantity": 0.3333333333333333}, {"food": "potato flour", "quantity": 0.5}, {"food": "oats", "quantity": 0.5}, {"food": "cinnamon", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 0.25}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "sugar", "quantity": 0.25}, {"food": "butter oil", "quantity": 4.0}, {"food": "silk banana-strawberry soy yogurt", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "potato chips", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}], "title": "\nOatmeal Raisin Cookie Dough Truffles\n"}, {"directions": "\n\n              Position an oven rack in the center of the oven, and preheat to 325 degrees F. Whisk together the butter, brown sugar, maple syrup, vanilla, cinnamon, salt and nutmeg in a large bowl. Add the oats, and toss until evenly coated. Spread out on a rimmed baking sheet.\n            \n\n              Bake the oat mixture until golden and toasted, 30 to 35 minutes, stirring about halfway through. Let cool completely on the baking sheet. Stir in both kinds of raisins. (The granola can be stored in an airtight container at room temperature for up to 5 days.)\n            \n", "ingredients": [{"food": "oats", "quantity": 1.75}, {"food": "raisins", "quantity": 0.5}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.5}, {"food": "cinnamon", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "nutmeg", "quantity": 0.25}, {"food": "butter oil", "quantity": 4.0}, {"food": "sugar", "quantity": 3.0}, {"food": "syrup", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 1.0}], "title": "\nOatmeal Raisin Cookie Granola\n"}, {"directions": "\n\n              Adjust an oven rack to the middle position and preheat to 350 degrees F. Roll the dough into a 12-inch round on a lightly floured surface (or between two pieces of floured parchment paper). Ease the dought into a 9-inch glass pie plate and flute the edge as desired. Chill 30 minutes.\n            \n\n              Line the pie dough with foil and pie weights and bake until the edge just starts to turn golden, about 15 minutes. Remove the foil and weights and continue to bake until the bottom is lightly golden, about 10 minutes more. Cool completely on a rack, about 15 minutes.\n            \n\n              Combine the sugar, butter, egg, flour, vanilla, cinnamon, nutmeg and 1/4 teaspoon salt in a food processor. Process until smooth and combined. Add the oats and raisins and pulse a few times until roughly chopped.\n            \n\n              Scrape the filling into the par-baked pie shell and spread evenly. Bake until the top is golden brown and a knife inserted in the center comes out clean, 35 to 40 minutes. Let cool on a rack for at least 1 hour if serving warm, or let cool completely and serve at room temperature. Top with ice cream or a dollop of whipped cream.\n            \n", "ingredients": [{"food": "pie crust", "quantity": 9.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "sugar", "quantity": 0.75}, {"food": "butter oil", "quantity": 10.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "nutmeg", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "oats", "quantity": 1.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.75}, {"food": "ice cream swich", "quantity": 1}], "title": "\nOatmeal Raisin Cookie Pie\n"}, {"directions": "\n\n              Position a rack in the center of the oven and preheat to 350 degrees F. Grease the bottom and sides of a 10-inch cast iron skillet with 1 tablespoon of the butter.\n            \n\n              Whisk the flour, baking soda, salt and apple pie spice together in a large bowl. Beat the remaining butter and granulated sugar together in a large bowl with an electric mixer on low speed until just incorporated. Increase speed to high and mix until light and fluffy, scraping down the sides of the bowl with a rubber spatula as needed. Add the brown sugar and beat until incorporated, then add the eggs one at a time, beating in between additions, then mix in the vanilla. Reduce the speed to low and gradually add the flour mixture, mixing until a smooth dough forms, scraping down the sides of the bowl as needed. Stir in the oats and raisins. \n            \n\n              Use a rubber spatula to scrape the batter into the prepared skillet, gently spreading it to the edges and smoothing the top. Bake until the top is golden, the sides are beginning to brown and the center is still soft, about 40 minutes. Cool in the pan on a wire rack for 15 minutes. \n            \n\n              Meanwhile, beat the heavy cream in a medium mixing bowl until soft peaks form. Add the sour cream and honey and continue beating to form medium peaks. Keep the whipped cream refrigerated until ready to use. Slice the cookie into wedges and serve warm or at room temperature with the honeyed whipped cream.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "pumpkin pie spice", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "sugar", "quantity": 0.5}, {"food": "sugar", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "oats", "quantity": 2.75}, {"food": "raisins", "quantity": 0.75}, {"food": "ice cream swich", "quantity": 0.6666666666666666}, {"food": "sour cream", "quantity": 0.3333333333333333}, {"food": "honey smoked ham", "quantity": 1.0}], "title": "\nOatmeal Raisin Skillet Cookie with Honey Cream\n"}, {"directions": "\n\n              Make the bark: Preheat the oven to 350. Combine the flour, oatmeal, walnuts, sugar and a pinch of salt in a bowl. Melt the butter in a pot over medium heat and cook until light brown, 6 minutes. Stir into the dry ingredients. Press the dough into the bottom of a 9-inch springform pan. Bake until golden brown, 30 minutes.\n            \n\n              Remove the crust from the oven and sprinkle with the chocolate; let stand until soft, then spread with the back of a spoon. Refrigerate the bark until firm, 30 minutes. Break into pieces.\n            \n\n              Make the oatmeal cream: Fill a large bowl with ice. Microwave 3/4 cup cream until simmering, 45 seconds. Puree with the oatmeal, sugar, a pinch of salt, vanilla and nutmeg in a blender. Transfer to a bowl and place over the ice; whisk until cool and thick. In another bowl, whisk the remaining 3/4 cup cream until soft peaks form; fold in the oatmeal puree.\n            \n\n              Layer the oatmeal cream, bananas and crushed bark in 4 parfait glasses\n            \n\n              Photograph by Kate Mathis\n            \n", "ingredients": [{"food": "potato flour", "quantity": 0.75}, {"food": "silk plain soy yogurt", "quantity": 2.0}, {"food": "walnuts", "quantity": 0.3333333333333333}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "", "quantity": 1}, {"food": "butter oil", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 1.5}, {"food": "silk plain soy yogurt", "quantity": 1.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "", "quantity": 1}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "nutmeg", "quantity": 0.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}], "title": "\nOatmeal-Banana Parfaits\n"}, {"directions": "\n\n              Preheat the oven to 300 degrees F. Coarsely grind the oatmeal in a food processor. Transfer to a shallow dish and season with salt and pepper. Beat the egg and milk in another shallow dish.\n            \n\n              Cook the bacon in a large skillet over medium heat until crisp, about 8 minutes. Transfer to a paper-towel-lined plate. Remove and reserve all but about 2 tablespoons drippings from the skillet. Add the leeks and garlic to the skillet and cook until tender, about 5 minutes. Add the parsley, bacon, and salt and pepper to taste; keep warm.\n            \n\n              Line a baking sheet with a double layer of paper towels. Dredge the trout in the oats, dip in the milk mixture and then in the oats again, turning to coat. Heat the reserved bacon drippings with the olive oil in another large skillet over medium-high heat. Fry the trout in batches until golden on one side, about 3 minutes, then flip and fry until cooked through, about 2 more minutes. Transfer to the prepared baking sheet and keep warm in the oven. Add the vinegar to the skillet and bring to a boil. Serve the trout with the leeks and drizzle with the vinegar dressing\n            \n\n              Photograph by Kate Mathis\n            \n", "ingredients": [{"food": "silk plain soy yogurt", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "egg substitute", "quantity": 1.0}, {"food": "milk", "quantity": 0.75}, {"food": "bacon", "quantity": 4.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "parsley", "quantity": 0.25}, {"food": "vegetarian fillets", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "vinegar", "quantity": 0.25}], "title": "\nOatmeal-Crusted Trout\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Line 2 baking sheets with parchment paper. \n            \n\n              Whisk the flour, oats, flaxseed, baking soda, salt and cinnamon in a bowl. \n            \n\n              Beat the butter, granulated sugar and brown sugar in a large bowl with a mixer on medium-high speed until fluffy, about 4 minutes. Beat in the eggs one at a time, beating well after each addition. Beat in the vanilla. Reduce the mixer speed to low; add the flour mixture and beat until just combined, scraping down the bowl as needed. Stir in the chocolate chips. \n            \n\n              Drop heaping tablespoonfuls of dough onto the prepared baking sheets, about 2 inches apart. Bake until golden brown, 10 to 12 minutes. Let the cookies cool 3 minutes on the baking sheets, then transfer to racks to cool completely.  \n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.5}, {"food": "oats", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "cinnamon", "quantity": 0.5}, {"food": "butter oil", "quantity": 12.0}, {"food": "sugar", "quantity": 1.0}, {"food": "sugar", "quantity": 0.75}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 1.0}], "title": "\nOatmeal-Flax Chocolate Chip Cookies\n"}, {"directions": "\n\n              Position the oven racks in the upper and lower thirds of the oven and preheat to 350 degrees F. Line three baking sheets with parchment paper and lightly coat with cooking spray. Combine the oats, flour, cinnamon and salt in a food processor and pulse until the oats are finely chopped.\n            \n\n              Combine the oil, sugar and maple syrup in a medium saucepan over medium-low heat and cook, stirring, until the sugar dissolves, 2 to 3 minutes. Remove from the heat and stir in the oat mixture, raisins and vanilla. Let the mixture cool slightly. Stir in the egg white.\n            \n\n              Drop teaspoonfuls of batter about 2 inches apart on the prepared baking sheets. Sprinkle with the turbinado sugar if using. Bake until golden brown (the edges of the cookies will be a deeper golden brown), rotating the sheets about halfway through, 10 to 12 minutes. Let cool on the baking sheets for a few minutes, and then transfer to a rack to cool completely.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "oats", "quantity": 1.0}, {"food": "wheat flour", "quantity": 0.25}, {"food": "cinnamon", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "syrup", "quantity": 0.25}, {"food": "raisins", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "sugar", "quantity": 1}], "title": "\nOatmeal-Raisin Cookie Thins\n"}, {"directions": "\n\n              Saute 4 smashed garlic cloves in 3 tablespoons olive oil over medium heat until golden. Add 4 cups okra (halved lengthwise) and 1 small onion (cut into wedges); season with salt and pepper and cook until the okra is tender and bright, 10 to 12 minutes. Add 1 pint halved cherry tomatoes; cook until just bursting, 3 minutes. Finish with a splash of cider vinegar.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nOkra with Tomatoes\n"}, {"directions": "\n\n              Mix 3/4 cup mayonnaise, the zest and juice of 1 lemon, 1 teaspoon Old Bay Seasoning, 1 minced scallion and a few drops of hot sauce.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [], "title": "\nOld Bay Mayo\n"}, {"directions": "\n\n              Muddle the mint leaves with the rum, lime juice, Simple Syrup, and bitters in a cocktail shaker. Add ice, cover, and shake vigorously, or stir, until combined and chilled, about 30 seconds. (In general, the drink is ready when the shaker mists up.) Pour the muddled liquid into a chilled champagne flute, holding back the ice, but letting some of the mint leaves fall into the glass. Add enough Champagne to almost fill the glass to the top. Garnish with a sprig of mint. Drink.;\n            \n\nSimple Syrup:\n\n\n              1 cup sugar\n            \n\n              1 cup water\n            \n\n              Put the sugar and water in a small saucepan. Cook over low heat, stirring, until the sugar dissolves. (Alternatively, heat in the microwave.) Store in a sealed container in the refrigerator.\n            \n\n              Yield: about 1 1/2 cups\n            \n", "ingredients": [{"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "", "quantity": 1.5}, {"food": "lime", "quantity": 0.5}, {"food": "sugar", "quantity": 1.0}, {"food": "", "quantity": 2.0}, {"food": "", "quantity": 1}, {"food": "barley flour or meal", "quantity": 1.5}], "title": "\nOld Cuban\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Muddle together the sugar, bitters and orange zest in the bottom of an old fashioned glass. Pour over the whiskey and add the cherry, if using. Top with some Orange Swirl Ice Cubes.\n            \n", "ingredients": [{"food": "sugar", "quantity": 0.5}, {"food": "", "quantity": 2.0}, {"food": "orange", "quantity": 1.0}, {"food": "whiskey sour mix", "quantity": 2.0}, {"food": "silk black cherry soy yogurt", "quantity": 1.0}, {"food": "", "quantity": 1}], "title": "\nOld Fashioned\n"}, {"directions": "\n\n              Fill a cocktail shaker with ice. Add the bourbon, sugar and bitters and shake well. Strain into 4 rocks glasses and top each with half a bottle of ale. Rub the rim of the glass with the orange peel and then add it to the drink along with a cherry if using.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "", "quantity": 0.5}, {"food": "sugar", "quantity": 1.0}, {"food": "orange", "quantity": 0.5}, {"food": "", "quantity": 12.0}, {"food": "orange peel", "quantity": 4.0}, {"food": "maraschino cherries", "quantity": 4.0}], "title": "\nOld Fashioned Amber\n"}, {"directions": "\n\n              For the crust: Pulse the flour, shortening, granulated sugar, vinegar and salt in a food processor until it looks like fine meal. Add the butter, and pulse until it is in pea-size pieces. Sprinkle in 2 tablespoons of the ice water, and pulse until the dough begins to come together. Pinch the dough with your fingers; if it doesn't hold together, add up to 2 teaspoons more ice water, 1 teaspoon at a time, pulsing and checking the dough after each addition. Wrap the dough tightly, and refrigerate until firm, at least 1 hour or preferably overnight.\n            \n\n              Position a rack in the center of the oven, and preheat to 375 degrees F. Roll the dough into a disc 11 to 12 inches wide on a lightly floured surface. Sandwich the dough between pieces of parchment or wax paper on a baking sheet, and refrigerate for at least 10 minutes. Lay the dough in an 8-inch pie pan so it extends about 1/2 inch beyond the edge of the pan. Fold the outer edge of the dough up under itself, and crimp decoratively between your index finger and forefinger. Poke the dough all over with a fork, and refrigerate for 10 minutes more. Line the pie crust with parchment or foil, fill with pie weights or beans and bake until the dough appears dry to the touch, about 20 minutes. Remove the foil and weights, and continue cooking the crust until it's light brown and cooked through, 5 to 7 minutes more. Let the crust cool completely on a wire rack.\n            \n\n              For the filling: Reduce the oven temperature to 350 degrees F. Whisk the heavy cream, granulated sugar, yolks, egg, bourbon, zest, cherry juice and salt in a medium bowl until smooth. Place the cooled crust on a rimmed baking sheet, and pour the custard into the crust. To avoid overbrowning, cut 2 strips of aluminum foil to wrap over the crust edges. Carefully transfer the pie to the oven, and bake until the custard is set but still has a slight jiggle, 50 to 60 minutes. Let the pie cool completely on a wire rack, about 4 hours. If serving the next day, let cool completely, then wrap and refrigerate overnight.\n            \n\n              For the bourbon whipped cream: Beat the confectioners' sugar and bourbon in a large bowl with an electric mixer on low speed. Add the heavy cream, increase the speed to medium-high and beat until firm peaks form, about 1 minute.\n            \n\n              Put six 2-tablespoon dollops of the whipped cream around the pie, and top each with a cherry. Twist the orange slices, and place them in between the whipped cream dollops. Serve the pie with the remaining whipped cream.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.25}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "sugar", "quantity": 1.0}, {"food": "vinegar", "quantity": 0.5}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 6.75}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 1.5}, {"food": "sugar", "quantity": 0.5}, {"food": "egg substitute", "quantity": 3.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "", "quantity": 3.0}, {"food": "orange", "quantity": 2.0}, {"food": "grape juice", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "sugar", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "orange", "quantity": 6.0}, {"food": "maraschino cherries", "quantity": 6.0}], "title": "\nOld Fashioned Pie\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F. Toss the cherries, whiskey and bitters in a bowl and let sit at room temperature, stirring occasionally, about 30 minutes. Drain the cherries and reserve the liquid. Butter a 10-inch pie plate and arrange the cherries in the plate in a single layer.\n            \n\n              Whisk the half-and-half, reserved cherry liquid, eggs, flour, sugar, lemon zest, orange zest and salt in a large bowl. Pour over the cherries and bake until the edges start pulling away from the sides of the pan and the top is lightly golden, about 45 minutes. Remove from the oven and sprinkle with the coarse sugar. Switch the oven to the broiler setting and broil the clafoutis until golden brown and bubbling, 1 to 3 minutes. Let cool at least 10 minutes.\n            \n\n              Photograph by Andrew Purcell\n            \n", "ingredients": [{"food": "whole milk", "quantity": 3.0}, {"food": "whiskey sour mix", "quantity": 2.0}, {"food": "", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 1}, {"food": "", "quantity": 1.5}, {"food": "eggs", "quantity": 4.0}, {"food": "potato flour", "quantity": 0.5}, {"food": "sugar", "quantity": 0.5}, {"food": "lemon juice", "quantity": 0.5}, {"food": "orange", "quantity": 0.5}, {"food": "salt", "quantity": 0.25}, {"food": "sugar", "quantity": 1.0}], "title": "\nOld-Fashioned Cherry Clafoutis\n"}, {"directions": "\n\n              Pulse 1/4 cup pitted kalamata olives, 1/2 stick soft butter and 2 tablespoons each parsley and cilantro in a food processor. Dollop the olive butter on Classic Mash.\n            \n\n              Classic Mash\n            \n\n              Cover 2 pounds whole russet or Yukon gold potatoes with cold salted water; simmer 45 minutes. Drain, peel and mash with 1/2 to 1 stick butter. Add 1 cup hot milk, and salt and pepper; mash until smooth and fluffy.\n            \n\n              Photograph by Kana Okada\n            \n", "ingredients": [], "title": "\nOlive Butter Mashed Potatoes\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Line a 9-by-13-inch baking pan with foil, leaving a 2-inch overhang on at least 2 sides. Oil the foil (not including the overhang).\n            \n\n              Whisk together the flour, cocoa powder and salt in a medium bowl. Melt the chocolate with the oil in a medium saucepan over medium heat, stirring frequently. Let cool slightly. Stir in the sugar and eggs. Add the flour mixture, and stir to combine. Pour the batter into the prepared pan, and bake until a toothpick comes out with just a few crumbs, 30 to 35 minutes.\n            \n\n              Let the brownies cool completely in the pan on a cooling rack. Use the foil overhang to help lift them out of the pan. Cut into 16 squares. Store in an airtight container at room temperature for up to 3 days.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.75}, {"food": "potato flour", "quantity": 1.5}, {"food": "onion powder", "quantity": 0.3333333333333333}, {"food": "salt", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 4.0}, {"food": "sugar", "quantity": 2.0}, {"food": "eggs", "quantity": 4.0}], "title": "\nOlive Oil Brownies\n"}, {"directions": "\n\n              Cook 2 chopped onions in a skillet with 2 tablespoons olive oil and 1/2 teaspoon salt over low heat, covered, 10 minutes. Uncover and cook until golden, 30 more minutes. Add 1 minced garlic clove, 1 tablespoon tomato paste, 1/2 cup pitted kalamata olives and 1/4 cup white wine; cook 10 more minutes.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [], "title": "\nOlive Relish\n"}, {"directions": "\n\n              Mix 3/4 cup mayonnaise, 1/2 cup chopped pitted kalamata olives, 4 chopped anchovies, 1 tablespoon chopped parsley and 2 teaspoons dijon mustard.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [], "title": "\nOlive-Anchovy Mayo\n"}, {"directions": "\n\n              Mix 1 cup chopped olives and 3 tablespoons chopped parsley. Drizzle the inside of a split loaf of focaccia with olive oil; fill with the olive mixture and sliced provolone. Cut into squares.\n            \n", "ingredients": [], "title": "\nOlive-Focaccia Tea Sandwich\n"}, {"directions": "\n\n              Puree the garlic, paprika, coriander, cumin, 1 tablespoon salt and 1/2 teaspoon pepper into a paste in a mini food processor. Add the olives, parsley, cilantro and lemon juice; pulse to chop. Add the butter and pulse to incorporate all the ingredients.\n            \n\n              Cut the lamb along a natural seam into 2 equal pieces. Rub the olive-spice mixture evenly all over the lamb; cover and refrigerate for 2 to 6 hours.\n            \n\n              Bring the lamb to room temperature about 30 minutes before cooking. Preheat the broiler and line a broiler pan with foil. Place the lamb smooth-side down on the pan. Broil just until charred, about 15 minutes. Remove the pan from the oven; carefully turn the lamb, using tongs. Return to the oven; broil until a thermometer inserted into the thickest part of the meat reads 125 to 130 degrees, about 10 more minutes.\n            \n\n              Transfer the lamb to a cutting board, cover loosely with foil and let rest for 10 minutes. Slice across the grain and arrange on a platter.\n            \n\n              Photography by Con Poulos\n            \n", "ingredients": [{"food": "garlic powder", "quantity": 3.0}, {"food": "paprika", "quantity": 2.0}, {"food": "seeds", "quantity": 2.0}, {"food": "seeds", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "mixed nuts", "quantity": 0.5}, {"food": "parsley", "quantity": 0.5}, {"food": "", "quantity": 0.25}, {"food": "", "quantity": 1.0}, {"food": "butter oil", "quantity": 6.0}, {"food": "hearts of palm", "quantity": 1.0}], "title": "\nOlive-and-Spice-Rubbed Leg of Lamb\n"}, {"directions": "\n\n              Put the olive oil, garlic, coriander seed, herbs, orange zest, and pepper flakes in a medium skillet. Heat over medium-high heat swirling the pan until the mixture is fragrant, about 3 minutes. Add the olives and cook, stirring occasionally, until the garlic is golden and the zest begins to curl, about 2 minutes more. Serve warm or at room temperature.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "watermelon seed krnls", "quantity": 1.0}, {"food": "rosemary", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}, {"food": "ruby red grapefruit juice blend", "quantity": 1}, {"food": "mixed nuts", "quantity": 12.0}], "title": "\nOlives with Orange and Rosemary\n"}, {"directions": "\n\n              Prepare one bagel half in each color of the Olympic rings and arrange on a platter. Put out halved bagels, cream cheese (plain and scallion) and bowls of toppings so guests can assemble their own.\n            \n\n              Blue: Slice small blue potatoes 1/4 inch thick. Toss with olive oil, season with salt and roast at 400 degrees F until tender, about 20 minutes. Spread bagels with cream cheese; top with the potatoes.\n            \n\n              Black: Spread bagels with cream cheese; top with sliced pitted black olives.\n            \n\n              Red: Spread bagels with cream cheese; top with smoked salmon and sliced plum tomatoes. Drizzle with lemon juice.\n            \n\n              Yellow: Spread bagels with cream cheese; top with sliced yellow grape or cherry tomatoes; season with salt.\n            \n\n              Green: Mash 1 avocado with the juice of 1 lemon; season with salt and pepper. Spread on bagels; top with sliced Persian cucumbers and season with more salt and pepper.\n            \n\n              Photograph by Ryan Liebe\n            \n", "ingredients": [], "title": "\nOlympic Rings Bagel Bar\n"}, {"directions": "\n\n              Put the potatoes in a large pot filled with cold water. Bring to a boil, reduce the heat to medium and cook until fork-tender, 35 to 40 minutes. Let the potatoes cool for 45 minutes; they will still be warm but will hold their shape when sliced into 1/4-inch-thick rounds.\n            \n\n              Heat 1 tablespoon of the oil in a large saute pan over medium heat. Add the bacon and cook until crisp, stirring occasionally, about 10 minutes. With a slotted spoon, remove the bacon to a paper-towel-lined plate; set aside. Remove the drippings from the pan; return 3 tablespoonfuls and discard the rest.\n            \n\n              Add the onions to the pan and sweat over medium heat until soft, about 6 minutes. Add the vinegar, mustard, sugar, 2 1/2 teaspoons salt and 1 teaspoon pepper and cook until fragrant, 1 minute more.\n            \n\n              Add the cooled potatoes, half the cooked bacon, half the scallions, half the parsley and the remaining 2 tablespoons olive oil to the pan. Stir to combine and season with salt and pepper. Serve garnished with the remaining bacon, scallions and parsley.\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "bacon", "quantity": 8.5}, {"food": "onion powder", "quantity": 1.0}, {"food": "vinegar", "quantity": 3.0}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "sugar", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 4.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}], "title": "\nOma's German Potato Salad\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              For the toast and eggs: Neatly remove the centers of the bread slices, leaving a 1/2-inch rim inside the crust (reserve the bread centers for another use). Lightly beat the eggs in a medium bowl with 1/2 teaspoon salt and a pinch of black pepper.\n            \n\n              Melt the butter in a large nonstick skillet over medium heat. \n            \n\n              For the Denver omelet: Add the ham and bell pepper to the skillet and cook, stirring occasionally, until the ham is slightly browned and the pepper is softened, 3 to 4 minutes. Transfer to a bowl. \n            \n\n              Reduce the heat to low. Fit the bread crusts into the skillet. While holding down the bread to create a seal and barrier, pour about a quarter of the egg mixture into the center of each crust. Split the ham and vegetable mixture between the crusts. Top each with 1/4 cup cheese, then top with the remaining egg mixture. Cover with a lid or foil and cook for 5 minutes. Flip the toasts and cook until the egg is set, another 3 minutes. Transfer each to a separate plate cheese-side up and sprinkle with the chives. \n            \n\n              For the spinach omelet: Add the spinach and red bell pepper to the skillet and cook, stirring occasionally, until the spinach is wilted and the bell pepper is softened, 3 to 4 minutes. Transfer to a bowl. \n            \n\n              Reduce the heat to low. Fit the bread crusts into the skillet. While holding down the bread to create a seal and barrier, pour about a quarter of the egg mixture into the center of each crust. Split the spinach mixture between the crusts. Top each with 1/4 cup cheese, then top with the remaining egg mixture. Cook as above, then garnish with the basil instead of the chives. \n            \n\n              For the sausage and mushroom omelet: Add the mushrooms and sausage to the skillet and cook, stirring occasionally, until the sausage is completely browned and the mushrooms are softened, 3 to 4 minutes. Transfer to a bowl. \n            \n\n              Reduce the heat to low. Fit the bread crusts into the skillet. While holding down the bread to create a seal and barrier, pour about a quarter of the egg mixture into the center of each crust. Split the sausage mixture between the crusts. Top each with 1/4 cup cheese, then top with the remaining egg mixture. Cook as above, then garnish with the parsley instead of the chives. \n            \n", "ingredients": [{"food": "luncheon slices", "quantity": 1.0}, {"food": "eggs", "quantity": 3.0}, {"food": "black bean mango", "quantity": 1}, {"food": "butter oil", "quantity": 2.0}, {"food": "diced chicken", "quantity": 0.25}, {"food": "diced chicken", "quantity": 0.5}, {"food": "yellow rice", "quantity": 0.5}, {"food": "chives", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "diced chicken", "quantity": 0.25}, {"food": "", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "breakfast tart", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 0.5}, {"food": "parsley", "quantity": 1.0}], "title": "\nOmelet-in-a-Hole 3 Ways\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Line a 9-by-13-inch baking pan with aluminum foil and spray with nonstick cooking spray.\n            \n\n              Stir together the sugar, butter, vanilla and eggs in a medium bowl. Add the flour, cocoa powder, salt and baking powder all at once and stir until just combined. Stir in half of the semisweet chocolate chips and spread the mixture in the prepared pan. \n            \n\n              Bake until the brownies begin to pull away from the edge of the pan and set in the center, 30 to 35 minutes. Immediately sprinkle with the remaining semisweet chocolate chips and let stand until the chips are melted, about 5 minutes. Spread the melted chips evenly over the top of the brownies with a spatula. Let the chocolate cool for about 10 minutes and then sprinkle with whatever combination of toppings you choose, pressing the toppings gently into the chocolate to adhere. Lift the brownies out of the pan with the foil and cool completely on a rack. Cut into 16 squares and serve.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "sugar", "quantity": 1.5}, {"food": "butter oil", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "eggs", "quantity": 3.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "salt", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 12.0}], "title": "\nOne Bowl Cocoa Brownies\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Toss the grapes with the oil on a rimmed baking sheet. Bake, tossing once, until the grapes burst and are very soft, 25 to 30 minutes.\n            \n\n              Meanwhile, spread the pecans out on a second rimmed baking sheet, and bake until very golden brown, 10 to 12 minutes. Let cool, then finely chop.\n            \n\n              Transfer the grapes to a small shallow bowl with a slotted spoon, leaving the oil behind. Stir in the lemon juice and zest and a pinch of salt; set aside to cool completely, then stir in the toasted pecans. (The compote can be made up to a day ahead and refrigerated. Bring to room temperature before serving.)\n            \n\n              Cut off just the very edges of the Brie wheel to make a rough square (it is OK if some rind remains at the corners), then cut into 30 cubes. Put a cube in each phyllo cup, and put the cups on a rimmed baking sheet. Bake until the cheese is melted, about 5 minutes.\n            \n\n              Top each cup with some of the compote, and garnish with a dusting of pepper. Serve warm.\n            \n", "ingredients": [{"food": "ruby red grapefruit juice blend", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "pecans", "quantity": 0.25}, {"food": "lemon juice", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 8.0}, {"food": "tostada shells", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nOne-Bite Baked Brie with Grape-Pecan Compote\n"}, {"directions": "\n\n              Heat the olive oil in a 4-quart saucepan over medium-high heat. Add the onion, garlic, thyme, carrots, celery, and 1/2 teaspoon salt. Cook, stirring occasionally, until softened, 5 to 7 minutes. Add the tomato paste and cook 1 minute, stirring to coat the vegetables. Add the beef, 1 teaspoon salt, and 1/4 teaspoon pepper. Cook, breaking up the meat with a spoon, until browned, about 5 minutes.\n            \n\n              Add the canned tomatoes, bucatini, 3 cups water and 1 teaspoon salt. Stir to ensure the pasta is submerged in liquid. Bring to a boil and continue to cook, stirring frequently to keep the pasta from sticking to the bottom of the pot, until the pasta is al dente and the sauce has thickened, 10 to 12 minutes. Remove the thyme sprigs. Stir in the Parmesan and parsley and season with salt to taste. Divide among 4 bowls and serve with additional parsley and Parmesan.\n            \n\n              Cook's Note: The success of this recipe is dependent upon the specific pasta shape suggested, so we don't recommend substitutions.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "thyme", "quantity": 3.0}, {"food": "carrots", "quantity": 2.0}, {"food": "celery seed", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "pasta with tomato sauce", "quantity": 2.0}, {"food": "frankfurter beef", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "diced chicken", "quantity": 28.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 12.0}, {"food": "", "quantity": 0.25}, {"food": "parsley", "quantity": 0.25}], "title": "\nOne-Pot Bucatini Bolognese\n"}, {"directions": "\n\n              Put the spaghetti, olive oil, 1 teaspoon salt and 5 1/2 cups of water together in a high-sided medium skillet. Bring to a boil over medium-high heat. Continue to cook, stirring the spaghetti frequently to keep it from clumping, until it is al dente, about 8 minutes. Remove from the heat and stir in the lemon juice. Gradually sprinkle in the Pecorino and stir until completely melted, then add the butter. Sprinkle in the Parmesan, pepper and 1/2 teaspoon salt and stir until melted and smooth-the cheese will clump at first but will melt into the sauce and thicken it up after about 4 minutes. Divide the spaghetti among 4 bowls and garnish with additional Pecorino and pepper.\n            \n", "ingredients": [{"food": "pasta with sliced franks in tomato sauce", "quantity": 12.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "lemon juice", "quantity": 2.0}, {"food": "", "quantity": 0.5}, {"food": "butter oil", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "black bean mango", "quantity": 2.0}], "title": "\nOne-Pot Cacio e Pepe\n"}, {"directions": "\n\n              Heat the olive oil in a 4-quart saucepan over medium heat. Add the garlic and cook, stirring until softened, about 1 minute. Add the pasta, 1 teaspoon salt and 3 cups water and bring to a boil over medium-high heat. Continue to cook, stirring occasionally so the pasta doesn't clump together, 4 minutes. Stir in the asparagus and broccoli and cook, stirring, until bright green and almost crisp-tender, about 3 minutes. Add the peas and cook 2 minutes longer, stirring. Reduce the heat to low and stir in the cream cheese, cream, basil, lemon zest and 1 1/2 teaspoons salt until the cream cheese is completely melted. Divide among 4 bowls. Serve with additional basil.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "italian veg medley pasta", "quantity": 8.0}, {"food": "salt", "quantity": 1}, {"food": "asparagus", "quantity": 0.3333333333333333}, {"food": "broccoli raab", "quantity": 7.0}, {"food": "pigeon peas", "quantity": 0.6666666666666666}, {"food": "macaroni cheese", "quantity": 3.0}, {"food": "ice cream swich", "quantity": 0.3333333333333333}, {"food": "basil", "quantity": 2.0}, {"food": "lemon juice", "quantity": 0.5}], "title": "\nOne-Pot Farfalle Primavera\n"}, {"directions": "\n\n              Put the linguine, olive oil, 1 teaspoon salt and 4 1/2 cups water in a 4-quart saucepan and bring to a boil over medium-high heat. Continue to cook, stirring occasionally so the pasta doesn't clump together, until al dente, about 10 minutes. Add the tomatoes and pesto and stir until the tomatoes begin to soften and the pesto is combined. Add up to 1/4 cup additional warm water if the sauce is too thick. Remove from the heat. Add the mozzarella and soppressata. Divide among 4 bowls and serve.\n            \n", "ingredients": [{"food": "pasta with sliced franks in tomato sauce", "quantity": 12.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "grape juice", "quantity": 1.0}, {"food": "pesto pasta primavera", "quantity": 0.5}, {"food": "melon balls", "quantity": 4.75}, {"food": "", "quantity": 3.5}], "title": "\nOne-Pot Linguine with Pesto\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Put the milk and macaroni in a medium saucepan. Bring the milk to a boil over medium heat, stirring frequently to keep the macaroni from clumping, then cook, stirring frequently, until the macaroni is tender and the milk has thickened to the consistency of heavy cream, 4 to 5 minutes. Remove the saucepan from the heat, add the Cheddar, mozzarella, cream cheese, butter, mustard, cayenne, nutmeg and 1 1/2 teaspoons salt, and stir until smooth, thick and creamy. Serve hot. (The dish will thicken as it cools; thin it out with a little hot water if desired.)\n            \n", "ingredients": [{"food": "whole milk", "quantity": 4.0}, {"food": "macaroni cheese", "quantity": 0.75}, {"food": "", "quantity": 8.0}, {"food": "", "quantity": 3.0}, {"food": "macaroni cheese", "quantity": 2.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "nutmeg", "quantity": 1}, {"food": "salt", "quantity": 1}], "title": "\nOne-Pot Mac 'n' Cheese\n"}, {"directions": "\n\n              Heat the olive oil in a 4-quart saucepan over medium heat. Add the onions and cook, stirring occasionally, until softened, about 6 minutes. Add the tomato paste and red pepper flakes and cook, stirring to coat the onions, about 1 minute. Add the canned tomatoes, penne, vodka, 1 teaspoon salt and 3 1/2 cups water and bring to a boil over medium-high heat. Continue to cook, stirring frequently, until the pasta is al dente and the sauce has reduced by about half and thickened, about 12 minutes. Remove from the heat. Stir in the heavy cream, half the Parmesan and 1/2 teaspoon salt. Divide the penne among 4 bowls and garnish with the remaining Parmesan and torn basil leaves.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1}, {"food": "diced chicken", "quantity": 15.0}, {"food": "", "quantity": 12.0}, {"food": "", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "ice cream swich", "quantity": 0.3333333333333333}, {"food": "", "quantity": 0.25}, {"food": "chrysanthemum leaves", "quantity": 1}], "title": "\nOne-Pot Penne alla Vodka\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Put the milk and macaroni in a medium saucepan. Bring the milk to a boil over medium heat, stirring frequently to keep the macaroni from clumping. Continue to boil, stirring frequently, until the macaroni is tender and the milk has thickened to the consistency of heavy cream, 4 to 5 minutes.\n            \n\n              Remove the saucepan from the heat, add the Monterey Jack cheese, mozzarella, cream cheese, sour cream, butter, cayenne and 1 1/2 teaspoons salt and stir until smooth, thick and creamy. Fold in the dill and chives. Serve hot. (The dish will thicken as it cools; thin it out with a little hot water if desired.)\n            \n", "ingredients": [{"food": "whole milk", "quantity": 4.0}, {"food": "macaroni cheese", "quantity": 12.0}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "", "quantity": 3.0}, {"food": "macaroni cheese", "quantity": 2.0}, {"food": "sour cream", "quantity": 0.75}, {"food": "butter oil", "quantity": 2.0}, {"food": "pepper", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "dill seed", "quantity": 0.25}, {"food": "chives", "quantity": 0.25}], "title": "\nOne-Pot Ranch Mac and Cheese\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Put the spaghetti, oil, tomato paste, garlic, tomatoes, basil, red pepper flakes and 1 teaspoon salt in a high-sided medium skillet. Add 5 cups water, and bring to a boil over medium-high heat. Continue to cook, stirring the spaghetti frequently to keep it from clumping, until it is al dente and the sauce has reduced and thickened, 6 to 8 minutes. Stir in the Parmesan (the sauce will thicken more), and season with salt if needed. Divide the spaghetti among 4 bowls, and garnish with more Parmesan and torn basil leaves.\n            \n", "ingredients": [{"food": "pasta with sliced franks in tomato sauce", "quantity": 12.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "tomatoes", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 1}, {"food": "ruby red grapefruit juice blend", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 0.5}], "title": "\nOne-Pot Spaghetti with Fresh Tomato Sauce\n"}, {"directions": "\n\n              Heat 1 tablespoon olive oil in a large wide pot over medium-high heat. Add the sausage and cook, breaking up the meat into small pieces with a wooden spoon, until lightly browned and no longer pink, about 5 minutes. Pour off the fat from the meat.\n            \n\n              Add the remaining 1 tablespoon olive oil and the onion to the skillet; cook, stirring occasionally, until the onion softens, about 5 minutes. Stir in the carrot, garlic and tomato paste and cook until the garlic softens, 1 to 2 minutes.\n            \n\n              Add 4 1/2 cups water, the spaghetti, cherry tomatoes, 1/2 teaspoon salt and a few grinds of pepper to the pot. Increase the heat to high and bring to a boil, then reduce the heat to a simmer; cook, stirring occasionally, until the pasta is tender and the sauce thickens, 10 to 12 minutes. Remove from the heat and add the parsley; season with salt and pepper and toss.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "sweet potatoes", "quantity": 8.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "carrot juice", "quantity": 1.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 10.0}, {"food": "silk black cherry soy yogurt", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "parsley", "quantity": 2.0}], "title": "\nOne-Pot Spaghetti with Sausage\n"}, {"directions": "\n\n              Preheat the broiler. Heat the olive oil in a large nonstick ovenproof skillet over medium-high heat. Add the polenta and fry until golden, about 3 minutes per side. Transfer to a plate.\n            \n\n              Add the sausage to the skillet and cook, stirring and breaking it up with a wooden spoon, until just browned, about 3 minutes. Add the mushrooms and cook, stirring occasionally, until they soften, about 3 minutes. Add the garlic and cook 1 minute. Stir in the tomatoes, 1 teaspoon salt and 1/2 teaspoon pepper and bring to a boil. Reduce the heat to medium low and simmer until slightly thickened, about 5 minutes. Stir in the parsley.\n            \n\n              Arrange the polenta rounds in the skillet on top of the sauce. Place the mozzarella slices over the polenta and sprinkle with the parmesan. Broil until the cheese is browned and bubbling, about 3 minutes. Top with more parsley and pepper to taste.\n            \n\n              Photograph by Andrew Purcell\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 8.0}, {"food": "diced chicken", "quantity": 6.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "plum", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "parsley", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "parmesan cheese", "quantity": 2.0}], "title": "\nOne-Skillet Sausage and Polenta Parmesan\n"}, {"directions": "\n\n              In a large soup pot or Dutch oven, melt the butter over medium heat. Add the onions, stir to combine with the butter, cover, and cook for 30 minutes, stirring occasionally. Remove the cover; increase the heat to medium-high and cook, until the onions are brown and caramelized, about 30 minutes. (Stir the onions frequently toward the end of this stage in the cooking, so they do not scorch or burn.) Add the thyme and garlic, saute for 2 to 3 minutes more. Pour in the wine and scrape up the browned bits from the bottom of the pan with a wooden spoon; simmer until the wine is reduced by about half. Stir in the broth and salt and bring to a gentle simmer. Cover, and cook for 30 minutes. Add the Cognac, if using, and season with pepper to taste. (The soup can be made to this point a day ahead and refrigerated.) When ready to serve preheat the broiler. Heat the soup and divide it evenly among 6 heatproof crocks or bowls. Top each soup with a slice of the bread and about 1/2 cup of the cheese. Place the bowls on a sheet pan and broil until the cheese is bubbly and brown. Carefully transfer each crock to an under-lining plate. Serve immediately. \n            \n", "ingredients": [{"food": "butter oil", "quantity": 3.0}, {"food": "onion powder", "quantity": 3.5}, {"food": "thyme", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "martha white foods", "quantity": 1.0}, {"food": "diced chicken", "quantity": 6.0}, {"food": "salt", "quantity": 1.0}, {"food": "barley flour or meal", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "garlic bread", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 12.0}], "title": "\nOnion Soup\n"}, {"directions": "\n\n              Position a rack in the upper third of the oven and preheat to 400 degrees F. Melt the butter in a medium pot over medium-high heat. Add the onion and cook, stirring, until softened, about 5 minutes. Add the brandy and cook until evaporated, about 2 minutes. Add the farro, Worcestershire sauce, 1/2 teaspoon salt and a few grinds of pepper; cook, stirring, until the farro is coated, 2 minutes. Stir in the chicken broth, 1 1/2 cups water, the bay leaf and the parmesan rind. Bring to a boil, then stir in the grated parmesan.\n            \n\n              Transfer the mixture to a 1 1/2-quart baking dish, cover with foil and bake until most of the liquid is absorbed and the farro is tender, about 40 minutes. Remove from the oven; discard the bay leaf and parmesan rind. Continue baking, uncovered, until all of the liquid is absorbed, about 5 more minutes. Sprinkle with the grated gruyere; turn on the broiler and broil until melted and golden brown in spots, about 1 minute. Top with the parsley.\n            \n\n              Photograph by Linda Pug\n            \n", "ingredients": [{"food": "barley flour or meal", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 1.5}, {"food": "corier leaf", "quantity": 1.0}, {"food": "parmesan cheese", "quantity": 0.25}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "parsley", "quantity": 2.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}], "title": "\nOnion Soup-Style Farro\n"}, {"directions": "\n\n              Slice the plantains 3/4 inch thick on the diagonal. Heat 1 1/2 tablespoons each butter and vegetable oil in a nonstick skillet over medium-high heat. Working in batches, cook the plantains until golden, about 5 minutes per side. Drain on paper towels, reserving the skillet.\n            \n\n              Put the flour in a shallow dish. Whisk the milk, egg, allspice and cayenne in another dish. Lightly crush the fried onions into a third dish. Dredge the plantains in the flour, dip in the milk mixture, then press into the fried onions, turning to coat.\n            \n\n              Heat the remaining 1 1/2 tablespoons each butter and vegetable oil in the reserved skillet over medium heat. Working in batches, fry the plantains until golden and crisp, about 1 minute per side. Drain on paper towels. Serve with the hot sauce.\n            \n\n              Photograph by Andrew Mccaul\n            \n", "ingredients": [{"food": "plantains", "quantity": 2.0}, {"food": "butter oil", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "potato flour", "quantity": 0.75}, {"food": "milk", "quantity": 0.75}, {"food": "egg substitute", "quantity": 1.0}, {"food": "allspice", "quantity": 0.25}, {"food": "pepper", "quantity": 0.125}, {"food": "fried chicken", "quantity": 3.5}, {"food": "Worcestershire sauce", "quantity": 1}], "title": "\nOnion-Crusted Plantains\n"}, {"directions": "\n\n              On a floured surface, roll out 1 pound refrigerated pizza dough into a 10-by-15-inch rectangle; press into an oiled rimmed baking sheet. Mix 1/4 cup olive oil, 2 tablespoons chopped rosemary and/or oregano, 1/2 teaspoon red pepper flakes and a big pinch of sea salt. Brush half of the herb oil over the dough, then set aside until puffy, about 1 hour. Make dimples in the dough with your fingers and top with thin onion slices and shaved parmesan. Bake at 400 until golden, about 20 minutes. Brush with the remaining herb oil.\n            \n\n              Photograph by Marcus Nilsson\n            \n", "ingredients": [], "title": "\nOnion-Herb Focaccia\n"}, {"directions": "\n\n              Whisk the eggs, 1 tablespoon paprika, 1 teaspoon cayenne and 4 teaspoons salt in a large glass bowl. Add the milk, parsley, sage and garlic.\n            \n\n              Slice the onions into 1/8-inch-thick rings with a mandoline or knife. Separate the rings and add to the milk mixture. Add the chicken, turning to distribute the ingredients. Cover and refrigerate for 4 to 8 hours.\n            \n\n              In a shallow baking dish, mix the flour, the remaining 1 tablespoon paprika and 1/2 teaspoon cayenne, 2 teaspoons salt and 1 teaspoon black pepper. Place a rack on a baking sheet. Lift each piece of chicken from the milk mixture, roll in the flour mixture and place on the rack. Once all the pieces are floured, re-dip in the milk mixture and press some of the onions and herbs onto the chicken. Then, pressing the onions onto the chicken to hold them in place, roll the chicken in the flour again, pressing firmly so the onions become part of the breading. (You can re-dip a third time to add more onion, if you like.) Set the onion-coated chicken pieces on the rack.\n            \n\n              Heat about 3/4 inch of vegetable oil in a deep-fryer or large deep skillet over medium-high heat until a deep-fry thermometer registers 375 degrees. Add the chicken and fry, adjusting the heat as needed, until golden brown on one side, 8 to 10 minutes. Turn with tongs and cook until the chicken is golden all over and a thermometer inserted into the thickest part registers 160 degrees, about 8 more minutes. Drain on a paper-towel-lined plate. Season with salt.\n            \n\n              Photograph by Yunhee Kim\n            \n", "ingredients": [{"food": "eggs", "quantity": 2.0}, {"food": "paprika", "quantity": 2.0}, {"food": "pepper", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "milk", "quantity": 3.0}, {"food": "parsley", "quantity": 1.0}, {"food": "sage", "quantity": 0.5}, {"food": "garlic powder", "quantity": 1.0}, {"food": "onions", "quantity": 2.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "potato flour", "quantity": 3.0}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 1}], "title": "\nOnion-Ringed Fried Chicken\n"}, {"directions": "\n\n              Dust the pork chops on both sides with the flour; season with salt and pepper. Heat 2 tablespoons olive oil in a large skillet over high heat. Add the pork chops and cook until golden brown, 4 minutes. Flip; cook until lightly golden on the other side, 2 more minutes. Remove to a plate.\n            \n\n              Reduce the heat to medium high; heat the remaining 1 tablespoon olive oil in the skillet. Add the bell peppers, onion, chopped garlic, pepperoncini, 1/2 teaspoon salt and a few grinds of pepper. Cook, stirring occasionally, until the vegetables are softened, 10 minutes. Stir in the pepperoncini brine and chicken broth. Return the pork to the skillet. Reduce the heat to medium low; cook, flipping the pork halfway through, until cooked through and the liquid is reduced, 5 minutes.\n            \n\n              Meanwhile, preheat the broiler. Combine the butter, grated garlic and 1/4 teaspoon salt; spread on the bread. Transfer to a baking sheet and broil until toasted, 1 minute. Slice the bread and sprinkle with the parsley. Serve with the pork chops and vegetables.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "pork skins", "quantity": 4.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "cloves", "quantity": 4.0}, {"food": "hearts of palm", "quantity": 2.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "barbecue loaf", "quantity": 1.0}, {"food": "parsley", "quantity": 2.0}], "title": "\nOnion-and-Pepper Pork Chops\n"}, {"directions": "\n\n              For the crust: Preheat the oven to 350 degrees F. Spray a 9-by-13-inch glass baking dish with cooking spray.\n            \n\n              Combine the cake mix, nutmeg, vanilla and eggs in the bowl of an electric mixer fitted with the paddle attachment. Beat on medium speed until smooth, about 1 minute. Add the melted butter and mix just until combined. Spread the mixture evenly in the prepared baking dish.\n            \n\n              For the filling: Beat the cream cheese in a clean mixer bowl with the paddle on medium speed until light and smooth, scraping the sides occasionally, 1 to 2 minutes. Add the vanilla bean paste and eggs and beat until smooth. Add the melted butter and beat until smooth. Add the confectioners' sugar and beat on low speed to incorporate, and then beat on medium until light and smooth, about 1 minute. Pour over the cake layer and smooth the top with a spatula.\n            \n\n              Bake until the edges are puffed and golden brown and the center is just set, 35 to 40 minutes. Let cool before cutting into squares to serve.\n            \n", "ingredients": [{"food": "pan dulce", "quantity": 1}, {"food": "shortening cake mix", "quantity": 15.0}, {"food": "nutmeg", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "eggs", "quantity": 2.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "sugar", "quantity": 3.0}], "title": "\nOoey Gooey Butter Cake\n"}, {"directions": "\n\n              Stir the honey, orange juice and zest, and vanilla into the cream cheese until smooth.\n            \n\n              Toast the bread slices. Peel and slice or dice the bananas. Spread a heaping tablespoon of the cream cheese mixture on each toast, lay the banana slices on top, and sprinkle with some nuts and chocolate, if desired. Serve. Save extra cream cheese for spreading on bagels or more toasts.\n            \n", "ingredients": [{"food": "honey smoked ham", "quantity": 2.0}, {"food": "orange juice", "quantity": 1.0}, {"food": "orange", "quantity": 0.25}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "garlic bread", "quantity": 8.0}, {"food": "bananas", "quantity": 2.0}, {"food": "mixed nuts", "quantity": 3.0}, {"food": "baking chocolate", "quantity": 0.5}], "title": "\nOpen Faced Banana Cinnamon Toasts\n"}, {"directions": "\n\n              Heat 2 teaspoons olive oil in a large nonstick skillet over medium-high heat. Add the Canadian bacon and cook, stirring occasionally, until it starts browning, about 2 minutes. Add the onion, half of the tomatoes, and the thyme; cook until the onion softens, about 5 minutes. Add the collards and season with 1/4 teaspoon salt and a few grinds of pepper; continue to cook, stirring occasionally, until the collards are tender, about 10 minutes.\n            \n\n              Meanwhile, combine the remaining tomatoes, the avocado, hot sauce and 1 tablespoon olive oil in a medium bowl; season with salt and gently toss. Set aside.\n            \n\n              Heat the remaining 1 teaspoon olive oil in a separate large nonstick skillet over medium-high heat. Crack the eggs into the skillet and cook until the whites are almost set, about 3 minutes. Cover and cook until the whites are set but the yolks are still slightly runny, about 2 more minutes; season with salt and pepper.\n            \n\n              Meanwhile, toast the rolls. Top each half with 2 slices cheese, some collards and a fried egg. Serve with the avocado salad.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "grape juice", "quantity": 1.5}, {"food": "thyme", "quantity": 1.0}, {"food": "turnip greens", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "eggs", "quantity": 4.0}, {"food": "multigrain cutlets", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 8.0}], "title": "\nOpen-Face Egg and Collards Sandwiches\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Soak the red onion, carrots and radishes in ice water for 5 minutes, then drain. Split each roll in half lengthwise to make 4 pieces. Transfer to the oven to toast. \n            \n\n              Whisk 1/4 cup mayonnaise, the lime juice, honey, cornichons and brine, and 1/2 teaspoon salt in a large bowl. Add the chicken, onion, carrots, radishes and chopped cilantro and toss. Mix the chile sauce and the remaining 1/4 cup mayonnaise in a small bowl. \n            \n\n              Spread each piece of bread with some chile mayonnaise, then top with the chicken salad and cilantro leaves.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "onion powder", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "pizza rolls", "quantity": 2.0}, {"food": "mayonnaise dressing", "quantity": 0.5}, {"food": "lime juice", "quantity": 0.25}, {"food": "honey smoked ham", "quantity": 2.0}, {"food": "barley flour or meal", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 3.0}, {"food": "chrysanthemum leaves", "quantity": 0.3333333333333333}, {"food": "Worcestershire sauce", "quantity": 1.0}], "title": "\nOpen-Face Vietnamese Chicken Sandwiches\n"}, {"directions": "\n\n              Preheat oven to 400 degrees F.\n            \n\n              Slice the baguette into 1/4-inch thick rounds, drizzle with oil, and season with salt and pepper. Spread on a baking sheet, and bake until crisp and lightly golden, about 6 minutes. Transfer to a rack and cool in a single layer.\n            \n\n              Heat 2 tablespoons oil in a large skillet over medium heat. Add onions and peppers and cook, stirring often, until onions are golden brown and peppers are tender.\n            \n\n              Season steak with salt and pepper. In another large skillet, heat remaining 2 tablespoons oil over medium-high heat. Add steak and cook about 6 minutes per side, or until an instant-read meat thermometer registers 120 degrees F. Set aside to cool. Slice the steak \"paper thin\" (a slicer is great for this). Keep warm until ready to assemble.\n            \n\n              To assemble:\n            \n\n              Lay a slice of meat on each slice of baguette toast and top with 1 teaspoon of caramelized onions and peppers and a drizzle of the cheese sauce. Serve.\n            \n\n              Copyright 2005 Television Food Network, G.P. All rights reserved.\n            \n\n              Cheese Sauce:\n            \n\n              3 tablespoons unsalted butter\n            \n\n              3 tablespoons all-purpose flour\n            \n\n              2 cups whole milk\n            \n\n              1 tablespoon Dijon mustard\n            \n\n              1 tablespoon drained prepared horseradish\n            \n\n              1 teaspoon kosher salt\n            \n\n              1/2 teaspoon sweet paprika\n            \n\n              1/4 teaspoon cayenne pepper\n            \n\n              Freshly ground white pepper\n            \n\n              Pinch freshly ground nutmeg\n            \n\n              1 cup grated yellow Cheddar\n            \n\n              1 tablespoon grated Parmigiano-Reggiano\n            \n\n              Melt the butter in a medium saucepan over medium heat. Stir in the flour with a wooden spoon and cook stirring constantly in a figure 8, until pale yellow, about 1 minute. Slowly whisk in the milk and bring to a boil. Add the Dijon, horseradish, salt, paprika, cayenne, white pepper, and nutmeg. Reduce the heat to maintain a simmer and cook, stirring constantly, until thickened, about 6 to 8 minutes. Remove from the heat and whisk in the cheeses. Set aside and keep warm.\n            \n\n              Yield: about 2 cups\n            \n", "ingredients": [{"food": "", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "black bean mango", "quantity": 1}, {"food": "onion powder", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 1}], "title": "\nOpen-Faced NY Strip \"Philly Cheese Steaks\"\n"}, {"directions": "\n\n              Whisk 2 tablespoons olive oil, the vinegar, 1/4 teaspoon salt, and pepper to taste in a medium bowl. Add the arugula, olives and roasted red peppers but don't toss yet (you don't want the arugula to wilt). Set aside while you prepare the omelets.\n            \n\n              Whisk the eggs, milk and a pinch of salt in a bowl. Heat a medium nonstick skillet over medium heat. Add about 1 teaspoon olive oil, then pour in 1/2 cup of the egg mixture and stir gently with a rubber spatula to distribute the egg in the bottom of the pan. Cook until the eggs are just set but the underside is not brown, about 4 minutes, then slide the omelet onto a plate. Repeat to make 3 more omelets, adding about 1 more teaspoon oil to the skillet between each.\n            \n\n              Toss the arugula salad, then pile on top of the omelets. Scatter the feta and prosciutto on top.\n            \n\n              Photographs by Antonis Achilleos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "arugula", "quantity": 5.0}, {"food": "olives", "quantity": 0.25}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "eggs", "quantity": 8.0}, {"food": "milk", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}], "title": "\nOpen-Faced Omelet With Arugula Salad\n"}, {"directions": "\n\n              Preheat the oven to 250 degrees F. Arrange the tomatoes cut-side up on a baking sheet; sprinkle with 1/2 teaspoon salt, and pepper to taste. Drizzle with olive oil. Roast until slightly dry on the surface, about 3 hours, 30 minutes; let cool. (The tomatoes can be roasted up to one day ahead; refrigerate in an airtight container.)\n            \n\n              Whisk the mayonnaise, horseradish, and pepper to taste; cover and refrigerate.\n            \n\n              Toss the cabbage, red onion, a splash of water and 1/2 teaspoon salt in a colander set over a bowl; let drain until the cabbage softens, about 20 minutes. Rinse well with cold water, squeeze out the excess liquid and pat dry.\n            \n\n              Meanwhile, cook the bacon in a large skillet over medium-high heat until crisp; reserve the drippings.\n            \n\n              Toast the bread. Toss the cabbage mixture with the dill, 1 teaspoon of the bacon drippings, the vinegar, and pepper to taste in a bowl. Top each piece of toast with some of the horseradish mayonnaise, 2 slices of bacon, 2 roasted tomato halves and some of the cabbage mixture. Drizzle with more drippings.\n            \n\n              Photograph by Jonathan Kantor\n            \n", "ingredients": [{"food": "plum", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1}, {"food": "mayonnaise dressing", "quantity": 0.3333333333333333}, {"food": "horseradish", "quantity": 1.0}, {"food": "swamp cabbage", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.25}, {"food": "bacon", "quantity": 8.0}, {"food": "garlic bread", "quantity": 4.0}, {"food": "dill seed", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}], "title": "\nOpen-Faced Roasted Tomato BLTs\n"}, {"directions": "\n\n              Preheat a grill to medium high. Combine the olive oil, oregano, red pepper flakes and a pinch of salt in a small bowl. Brush the cut sides of the baguette with some of the flavored oil. Grill cut-side down until toasted, about 4 minutes.\n            \n\n              Rub the grilled sides of the baguette with the garlic. Top with the tomato slices, season with salt and cover with the provolone. Grill, covered, until the cheese melts, 3 to 5 minutes. Drizzle with the remaining flavored oil and season with salt. Cut into pieces.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 0.5}, {"food": "garlic powder", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 1.25}, {"food": "macaroni cheese", "quantity": 0.25}], "title": "\nOpen-Faced Tomato Grilled Cheese\n"}, {"directions": "\n\n              Put the chicken in a saucepan along with the water and salt. Bring just to a boil then reduce to a gentle simmer. Cook, covered, just the chicken is just firm, about 15 minutes. Set chicken aside off the heat, to cool and finish cooking in the liquid. When cool, pull apart by hand into shredded bite-size pieces.\n            \n\n              Whisk yogurt, mayonnaise, lime juice, curry, grated ginger and parsley in a bowl. Add chicken, almonds, and pineapple, and fold to coat evenly. Make open faced sandwiches with the salad and watercress on the bread or muffins. Serve.\n            \n", "ingredients": [{"food": "fat free chicken breast ", "quantity": 2.0}, {"food": "coconut water", "quantity": 4.0}, {"food": "salt", "quantity": 2.0}, {"food": "silk banana-strawberry soy yogurt", "quantity": 0.25}, {"food": "mayonnaise dressing", "quantity": 0.25}, {"food": "lime juice", "quantity": 1.0}, {"food": "curry powder", "quantity": 1.5}, {"food": "ginger", "quantity": 1.0}, {"food": "parsley", "quantity": 0.3333333333333333}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "diced chicken", "quantity": 0.25}, {"food": "watercress", "quantity": 1.0}, {"food": "wheat flour", "quantity": 4.0}], "title": "\nOpen-faced Curried Chicken Salad Sandwich\n"}, {"directions": "\n\n              Mix the crabmeat with the mayonnaise, mustard, paprika, cayenne, lemon juice, scallion and a pinch of salt in a bowl. Set aside.\n            \n\n              Preheat the broiler. Brush both sides of the Texas toast with half of the melted butter. Place on a baking sheet and broil until golden brown on top, about 3 minutes. Remove from the oven and flip the bread; top with the crab mixture, spreading it almost to the edges. Sprinkle with the grated cheese.\n            \n\n              Toss the asparagus with the remaining melted butter in a medium bowl and season with salt and black pepper. Arrange side by side on the toast, then arrange the cheese slices across the middle of the asparagus.\n            \n\n              Return to the broiler until the asparagus is tender and the cheese melts, about 4 more minutes.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [{"food": "", "quantity": 0.5}, {"food": "mayonnaise dressing", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "paprika", "quantity": 0.25}, {"food": "pepper", "quantity": 0.25}, {"food": "lemon juice", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "french toast", "quantity": 4.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "macaroni cheese", "quantity": 3.0}, {"food": "asparagus", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nOpenly Crabby\n"}, {"directions": "\n\n              Mix the honey with 1 tablespoon warm water to dissolve. Stir the honey and orange liqueur together in a tall pilsner glass. Add the bitters. Then top with the beer, allowing a small head to form. Garnish with the orange wedge.\n            \n\n              Copyright 2013 Television Food Network, G.P. All rights reserved\n            \n\n              From Food Network Kitchens\n            \n", "ingredients": [{"food": "orange", "quantity": 2.0}, {"food": "orange", "quantity": 1.5}, {"food": "", "quantity": 3.0}, {"food": "wheat flour", "quantity": 12.0}, {"food": "orange", "quantity": 1.0}], "title": "\nOrange Bee Sting\n"}, {"directions": "\n\n              Combine the tequila, lime juice, honey syrup and orange-flavored liqueur in a cocktail shaker filled with ice. Cover the shaker, and shake well to combine and chill the ingredients.\n            \n\n              Spread the salt in a flat dish. Dampen a paper towel with some orange flower water and run it along the rim of a margarita glass. Press the rim into the salt to coat. Strain the margarita into the glass. Cut an \"X\" into the bottom of the orange almost all the way through, leaving the stem end intact. Slide the orange onto the side of the glass as garnish, and serve.\n            \n\nHoney Syrup:\n\n\n              Cook the honey and water in a small saucepan over medium heat, stirring occasionally, until the honey is melted, about 2 minutes. Let cool completely. (The honey syrup can be refrigerated for up to a month.)\n            \n", "ingredients": [{"food": "", "quantity": 2.0}, {"food": "lime juice", "quantity": 1.5}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "hearts of palm", "quantity": 1}, {"food": "coconut water", "quantity": 0.5}, {"food": "orange", "quantity": 1}, {"food": "honey smoked ham", "quantity": 0.6666666666666666}, {"food": "coconut water", "quantity": 0.3333333333333333}], "title": "\nOrange Blossom Margarita\n"}, {"directions": "\n\n              Insert lollipop sticks one-third of the way into each apple. Line a baking sheet with parchment paper and coat the parchment with cooking spray.\n            \n\n              Combine the sugar, corn syrup and 1/4 cup water in a small saucepan; bring to a boil. Reduce the heat to medium and add the orange food coloring. Continue cooking, swirling the pan but not stirring, until a candy thermometer registers 290 degrees F, about 10 minutes; remove from the heat. Working one at a time, dip the apples into the candy, then twirl over the pan to let the excess drip off, keeping your fingers out of the way of the hot candy coating. Transfer to the prepared baking sheet and let stand until set, about 5 minutes.\n            \n\n              Put the chocolate in a large microwave-safe bowl and microwave in 30-second intervals, stirring, until smooth. One at a time, hold each apple over the bowl and use a fork to drizzle with chocolate, turning to coat around the base of the apple. Return to the baking sheet; let set, about 5 more minutes.\n            \n\n              Photograph by Kate Mathis\n            \n", "ingredients": [{"food": "apples", "quantity": 4.0}, {"food": "", "quantity": 1}, {"food": "sugar", "quantity": 1.25}, {"food": "silk light vanilla", "quantity": 0.25}, {"food": "orange", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 2.0}], "title": "\nOrange Candy Apples\n"}, {"directions": "\n\n              Make the salad: In a large bowl whisk the vinegar and honey until combined and then whisk in the sesame oil. Add the snow peas and carrots and toss well to coat. Set aside for the flavors to blend while the chicken and sauce cook.\n            \n\n              Preheat the oven to 425 degrees F. Place a wire rack on a baking sheet and lightly mist with nonstick cooking spray.\n            \n\n              Put the sesame seeds in a small nonstick skillet set over medium heat. Cook, stirring often, until golden brown and fragrant, about 5 minutes. Set aside to cool.\n            \n\n              Put the cereal in a plastic storage bag and crush with a rolling pin or heavy can until coarsely crushed. In a shallow bowl combine the toasted sesame seeds, crushed cereal and orange zest and lightly season with salt and pepper.\n            \n\n              In a second shallow dish, beat the egg whites with the teriyaki sauce. Dip each chicken tender in the egg mixture and then the cereal mixture, pressing to coat well. Place on the rack and mist the chicken with nonstick cooking spray. Bake until the crust is golden and the chicken is cooked through, 18 to 20 minutes.\n            \n\n              Meanwhile, in a small saucepot heat the marmalade, teriyaki and ginger over medium heat until melted and well combined. Remove from heat and stir in the lemon juice. Serve the chicken with some of the sauce for dipping and the salad.\n            \n", "ingredients": [{"food": "vinegar", "quantity": 2.0}, {"food": "honey smoked ham", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 8.0}, {"food": "carrots", "quantity": 3.0}, {"food": "", "quantity": 1}, {"food": "sesame seeds", "quantity": 1.0}, {"food": "crisped rice bar", "quantity": 4.0}, {"food": "orange", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "egg substitute", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "fat free chicken breast ", "quantity": 1.5}, {"food": "orange", "quantity": 0.5}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "ginger", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}], "title": "\nOrange Chicken Fingers\n"}, {"directions": "\n\n              Wash and dry orange. Cut orange, with peel, into small wedges and place in a food processor. Add cranberries, pear, sugar, and salt. Pulse until coarsely chopped. Transfer to a bowl, cover, and refrigerate for 2 hours or up to 2 days. Just before serving, stir in the pecans.\n            \n", "ingredients": [{"food": "orange", "quantity": 1.0}, {"food": "frozen yogurt", "quantity": 1.0}, {"food": "pineapple chunks", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "pecans", "quantity": 3.0}], "title": "\nOrange Cranberry Pear Relish\n"}, {"directions": "\n\n              Make the cupcakes: Preheat the oven to 350 degrees F and line a muffin pan with 12 cupcake liners. Whisk the flour, baking powder and salt in a medium bowl.\n            \n\n              Beat the eggs and granulated sugar in a large bowl with a mixer on medium-high speed until pale and fluffy, about 2 minutes. Reduce the speed to medium low; slowly beat in the melted butter, then add the orange zest and vanilla.\n            \n\n              Beat in the flour mixture in 2 additions, alternating with the milk, beginning and ending with the flour mixture; beat until just combined (do not overmix).\n            \n\n              Divide the batter evenly among the muffin cups, filling each about two-thirds of the way. Bake until a toothpick inserted into the centers comes out clean, about 18 minutes. Let cool 5 minutes, then remove the cupcakes to a rack to cool completely.\n            \n\n              Meanwhile, make the frosting: Bring the orange juice to a boil in a saucepan; reduce the heat to medium and simmer until reduced to1 1/2 tablespoons, about 8 minutes. Let cool.\n            \n\n              Beat the cream cheese in a large bowl with a mixer on medium-high speed until smooth and fluffy. Beat in the butter, a little at a time, until smooth. Reduce the mixer speed to low; sift the confectioners' sugar into the bowl and beat until smooth. Add the vanilla, the cooled orange syrup, orange zest and food coloring and beat on medium speed until combined. Refrigerate until spreadable, about 15 minutes. Spread the frosting on the cupcakes; top with candied orange zest.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 1.5}, {"food": "salt", "quantity": 0.25}, {"food": "eggs", "quantity": 2.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "butter oil", "quantity": 12.0}, {"food": "orange", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "milk", "quantity": 0.5}, {"food": "orange juice", "quantity": 0.75}, {"food": "oranges", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "butter oil", "quantity": 10.0}, {"food": "sugar", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "orange", "quantity": 2.0}, {"food": "yellow rice", "quantity": 3.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "orange", "quantity": 1}], "title": "\nOrange Cream Cupcakes\n"}, {"directions": "\n\n              Drop the ice cream scoop into a chilled soda glass. Pour the mescal over the ice cream, and then the orange soda. Serve.\n            \n", "ingredients": [{"food": "ice cream swich", "quantity": 4.666666666666667}, {"food": "", "quantity": 1.0}, {"food": "orange", "quantity": 6.0}], "title": "\nOrange Creamezcal\n"}, {"directions": "\nSpecial equipment: a pastry bag fitted with a plain round tip (about 3/8 inch)\n\n              For the cupcakes: Preheat the oven to 350 degrees F. Line a 12-cup muffin pan with paper liners. Whisk together the flour, baking powder and salt in a medium bowl; set aside. Beat the butter, granulated sugar and vanilla bean seeds together with an electric mixer on medium-high speed until light and fluffy, about 3 minutes. Beat in the eggs one at a time until blended, then beat in the vanilla extract. Reduce the mixer speed to low and beat in half the flour mixture, followed by the milk and then the remaining flour mixture until smooth.\n            \n\n              Divide the batter among the prepared muffin cups and bake until the tops are lightly browned and spring back when pressed, about 25 minutes. Cool in the pans for a few minutes, then transfer to a wire rack to cool completely. \n            \n\n              For the frosting: Beat the butter and confectioners' sugar together in a large bowl using an electric mixer on medium speed until smooth. Increase the speed to medium-high and beat until fluffy, 2 to 3 minutes more. Beat in the milk and vanilla extract until smooth and creamy. Transfer to a piping bag with a plain round tip (about 3/8-inch).\n            \n\n              Frost each cupcake evenly and top with a circle of overlapping mandarin segments that touch in the middle and curve in the same direction. Place a raspberry in each center. Combine the jelly with 1 tablespoon water in a microwave-safe bowl and heat in the microwave until warm but not hot, about 30 seconds. Using a pastry brush, lightly coat the mandarin and raspberries with the jelly.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.3333333333333333}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "milk", "quantity": 0.5}, {"food": "butter oil", "quantity": 1.5}, {"food": "sugar", "quantity": 3.0}, {"food": "milk", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "", "quantity": 6.0}, {"food": "raspberries", "quantity": 12.0}, {"food": "apricot nectar", "quantity": 0.25}], "title": "\nOrange Flower Cupcakes\n"}, {"directions": "\n\n              Put the oranges, limes, sugar, and mint in a large rocks glass. Muddle the leaves and citrus by pressing them with a pestle or a wooden spoon until juicy and fragrant. Add the rum and ice. Cover with a cocktail shaker and shake vigorously, or stir, until combined and chilled, about 30 seconds. (In general, by the time the shaker mists up the drink is ready.) Serve.\n            \n", "ingredients": [{"food": "orange", "quantity": 0.5}, {"food": "lime", "quantity": 0.5}, {"food": "sugar", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "martha white foods", "quantity": 2.5}, {"food": "ice cream swich", "quantity": 1.0}], "title": "\nOrange Mojito\n"}, {"directions": "\nSpecial equipment: A 9-inch springform pan\n\n              Position an oven rack to the bottom third of the oven and preheat the oven to 325 degrees F.\n            \n\n              Spread the pistachios out on a baking sheet and bake until golden and toasted, 10 to 12 minutes. Transfer to a heat-safe plate to cool, then pulse them in a food processor until very finely ground. Transfer the ground pistachios to a small bowl and set aside.\n            \n\n              Set a 9-inch springform pan on top of a piece of parchment paper and trace a circle around it. Cut out the circle and set aside. Generously grease the bottom and sides of the pan with the room temperature butter, then press the parchment circle into the bottom of the pan.\n            \n\n              Put the ricotta and 2/3 cup sugar in the bowl of food processor and process until the mixture is smooth, about 30 seconds. Transfer the ricotta mixture to a large bowl and whisk in the eggs yolks, orange zest and juice and the vanilla.\n            \n\n              In another large bowl, add the egg whites and whip using an electric mixer on medium-high speed until the eggs become foamy. Sprinkle in the remaining 2 tablespoons of sugar and continue to whip the egg whites until medium peaks form, about 2 minutes. Use a rubber spatula to fold 1/3 of the beaten whites into the ricotta mixture until just incorporated and a few white streaks remain. Gently fold in the remaining whipped egg whites, folding until there are no white streaks remaining.\n            \n\n              Pour the mixture into the prepared springform pan and set it on a baking sheet. Bake until the cheesecake is light golden brown and the sides begin to pull away from the pan, 55 minutes to about 1 hour and 5 minutes. Transfer the cheesecake to a cooling rack and let it cool completely, about 1 hour. Cover the pan with plastic wrap and refrigerate at least 2 hours and up to 2 days before serving.\n            \n\n              To serve, run a thin knife or spatula around the cake to release it from the sides, then unclasp the latch of the pan. Dust the top of the cake with confectioners' sugar and sprinkle with the finely ground pistachios. Set the cheesecake on a cake platter, slice and serve.\n            \n", "ingredients": [{"food": "", "quantity": 2.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "whole milk", "quantity": 1.5}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "eggs", "quantity": 5.0}, {"food": "orange", "quantity": 1.5}, {"food": "orange juice", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "sugar", "quantity": 1}], "title": "\nOrange Ricotta Cheesecake\n"}, {"directions": "\n\n              Place a rimmed baking sheet in the upper third of the oven and preheat to 500 degrees F. Whisk the orange juice, honey, mustard, olive oil, 1 teaspoon salt and a few grinds of pepper in a large bowl. Add the chicken, sliced oranges, sliced fennel, red onion, potatoes, thyme and fennel seeds; toss to coat.\n            \n\n              Remove the hot baking sheet from the oven and add the vegetables in a single layer. Arrange the chicken skin-side up on top of the vegetables; season with salt and pepper. Return to the oven and roast until the chicken is golden and cooked through and the vegetables are tender, about 30 minutes. Top with fennel fronds.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "honey smoked ham", "quantity": 3.0}, {"food": "mustard spinach", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 8.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 1.0}, {"food": "thyme", "quantity": 8.0}, {"food": "fennel seed", "quantity": 1.0}], "title": "\nOrange Roasted Chicken Thighs\n"}, {"directions": "\n\n              Cut 2 oranges in half; scoop out the flesh (reserve for another use). Fill the orange cups with scoops of orange sherbet and top with blackberries. Freeze until set.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [], "title": "\nOrange Sherbet Cups With Blackberries\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: A 10-inch nonstick Bundt pan\n\n              Position a rack in the lower third of the oven and preheat to 350 degrees F. Put the butter in a medium bowl. Brush the Bundt pan with some of the butter to lightly coat.\n            \n\n              Cut the biscuits into quarters. Combine the sugar, cinnamon and orange zest in a large bowl and stir together.\n            \n\n              Working in batches, toss one-third of the biscuits in the melted butter, roll them in the sugar mixture to lightly coat and add them to the Bundt pan so they are nestled together in an even layer; sprinkle with one-third of the pecans. Repeat to make two more layers of biscuits rolled in sugar and the pecans. Sprinkle the top with any leftover sugar mixture and drizzle with any leftover butter.\n            \n\n              Cover the pan with foil and bake for 35 minutes. Remove the foil and bake until puffed and golden brown, 10 to 15 minutes more. Loosen the bread from the sides of the pan with a knife or offset spatula. Carefully invert the pan onto a serving plate, remove the pan and serve hot.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.5}, {"food": "biscuit", "quantity": 16.0}, {"food": "sugar", "quantity": 2.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "pecans", "quantity": 1.0}], "title": "\nOrange Sticky Bun Monkey Bread\n"}, {"directions": "\n\n              Make the orange wine: Remove the orange zest in wide strips with a paring knife and place in a large sterilized container with a lid. Juice the oranges into the container. Split the vanilla bean lengthwise and scrape the seeds into the container, then add the pod. Stir in the wine, vodka and sugar. You can use the wine for poaching the shrimp right away or, ideally, cover with the lid and set aside in a cool, dark place, stirring once a week, for 2 to 4 weeks. (The wine will keep for up to 2 months.)\n            \n\n              Prepare the shrimp: Combine 1 1/2 cups orange wine with the olive oil, thyme, red pepper flakes, a generous pinch of salt and 1/2 cup water in a large skillet. Bring to a simmer over medium-low heat, then add the shrimp, cover and poach 2 to 3 minutes. Turn the shrimp, cover and cook until pink, 2 to 3 more minutes.\n            \n\n              Transfer the shrimp to a serving dish. Boil the poaching liquid for 10 minutes, drizzle some over the shrimp and serve the rest on the side.\n            \n\n              Photograph by Ngoc Minh Ngo\n            \n", "ingredients": [{"food": "oranges", "quantity": 4.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "martha white foods", "quantity": 1.0}, {"food": "", "quantity": 3.0}, {"food": "sugar", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "thyme", "quantity": 2.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "shrimp", "quantity": 1.0}], "title": "\nOrange Wine Shrimp Cocktail\n"}, {"directions": "\n\n              Make the orange wine: Remove the orange zest in wide strips with a paring knife and place in a large sterilized container with a lid. Juice the oranges into the container. Split the vanilla bean lengthwise and scrape the seeds into the container, then add the pod. Stir in the wine, vodka and sugar. You can use the wine for poaching the shrimp right away or, ideally, cover with the lid and set aside in a cool, dark place, stirring once a week, for 2 to 4 weeks. (The wine will keep for up to 2 months.)\n            \n\n              Prepare the shrimp: Combine 1 1/2 cups orange wine with the olive oil, thyme, red pepper flakes, a generous pinch of salt and 1/2 cup water in a large skillet. Bring to a simmer over medium-low heat, then add the shrimp, cover and poach 2 to 3 minutes. Turn the shrimp, cover and cook until pink, 2 to 3 more minutes.\n            \n\n              Transfer the shrimp to a serving dish. Boil the poaching liquid for 10 minutes, drizzle some over the shrimp and serve the rest on the side.\n            \n\n              Photograph by Ngoc Minh Ngo\n            \n", "ingredients": [{"food": "oranges", "quantity": 4.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "martha white foods", "quantity": 1.0}, {"food": "", "quantity": 3.0}, {"food": "sugar", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "thyme", "quantity": 2.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "shrimp", "quantity": 1.0}], "title": "\nOrange Wine Shrimp Cocktail\n"}, {"directions": "\n\n              Juice the carrots, then the orange, following your juicer's specific settings for each. Combine the juices with the orange liqueur and bitters in a cocktail shaker filled with ice. Shake vigorously for 8 to 10 seconds. Strain into a tall glass filled with ice. Garnish with a maraschino cherry.\n            \n", "ingredients": [{"food": "carrots", "quantity": 2.0}, {"food": "orange peel", "quantity": 1.0}, {"food": "orange", "quantity": 2.0}, {"food": "healthy request microwavable bowl", "quantity": 1}, {"food": "silk black cherry soy yogurt", "quantity": 1}], "title": "\nOrange You Glad\n"}, {"directions": "\n\n              Add the Aperol and rosemary to a 3-quart pitcher, and bruise the rosemary with a wooden spoon for 1 minute. Add the wine, juice, liqueur and soda water, and stir to combine. Add the oranges, and cover the pitcher with plastic wrap. Refrigerate the sangria for at least 4 hours and up to overnight.\n            \n\n              To serve, fill 8 glasses halfway with ice, then pour the sangria, oranges and herbs into each glass.\n            \n", "ingredients": [{"food": "orange", "quantity": 1.0}, {"food": "coconut water", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "chrysanthemum leaves", "quantity": 0.3333333333333333}, {"food": "barley flour or meal", "quantity": 750.0}, {"food": "orange juice", "quantity": 1.5}, {"food": "luncheon slices", "quantity": 2.25}], "title": "\nOrange, Aperol and Rosemary Sangria\n"}, {"directions": "\n\n              Make Classic Shortbread dough, beating the seeds from 1 vanilla bean and 1/2 teaspoon crushed toasted anise seeds with the butter. Whisk 2 cups confectioners' sugar and 2 1/2 tablespoons orange juice; spread over the finished shortbread and slice. Top with candied orange slices.\n            \n", "ingredients": [], "title": "\nOrange-Anise Squares\n"}, {"directions": "\n\n              Heat the milk, 1 cup sugar and 1/2 cup orange juice concentrate in a saucepan over medium-low heat until the sugar dissolves, stirring. Cool slightly. (It's OK if the mixture curdles slightly.)\n            \n\n              Whisk the milk mixture, 2 tablespoons bourbon and the whole eggs and yolks in a large bowl; fold in the bread. Cover and refrigerate until the liquid is absorbed, about 1 hour 30 minutes.\n            \n\n              Preheat the oven to 350 degrees F. Butter a 9-by-13-inch baking dish. Fold the chocolate chunks into the bread mixture. Spread evenly in the baking dish and sprinkle with sugar. Bake until a knife inserted into the center comes out clean, about 1 hour 20 minutes.\n            \n\n              Meanwhile, make the sauce: Melt 4 tablespoons butter in a small saucepan over medium heat. Add the remaining 1/2 cup sugar and cook, stirring, until lightly caramelized, 5 to 6 minutes. Whisk in the remaining 1 cup orange juice concentrate, 3/4 cup bourbon and the salt. Cook until thick, 10 to 15 minutes. Stir in the cream and simmer until the sauce coats a spoon, about 10 more minutes. Slice the bread pudding and drizzle with the sauce.\n            \n\n              Photograph by Kana Okada\n            \n", "ingredients": [{"food": "whole milk", "quantity": 4.0}, {"food": "sugar", "quantity": 1.5}, {"food": "orange juice", "quantity": 1.0}, {"food": "", "quantity": 0.75}, {"food": "eggs", "quantity": 2.0}, {"food": "garlic bread", "quantity": 12.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "hearts of palm", "quantity": 1}, {"food": "ice cream swich", "quantity": 0.75}], "title": "\nOrange-Chocolate Bread Pudding\n"}, {"directions": "\n\n              Combine the orange peel, 2 cups water, the butter and a pinch of salt in a saucepan and bring to a boil. Add the rice and return to a boil, then reduce the heat to low and cook, shaking the pan occasionally, until the liquid is absorbed, about 15 minutes.\n            \n\n              Bring the milk, granulated sugar, cinnamon sticks and vanilla to a low boil in another saucepan. Add the rice and simmer over medium-low heat, stirring, until the liquid is mostly absorbed, about 15 minutes. Stir in the grated orange zest and 1/4 cup mascarpone.\n            \n\n              Transfer the rice pudding to a large bowl and let cool, then cover with plastic wrap and refrigerate until cold and set, about 2 hours.\n            \n\n              Beat the remaining 1/4 cup mascarpone and the confectioners' sugar in a bowl. Remove the cinnamon sticks and orange peel from the pudding. Serve topped with the mascarpone and cinnamon.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "orange peel", "quantity": 1.5}, {"food": "butter oil", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "crisped rice bar", "quantity": 1.0}, {"food": "whole milk", "quantity": 4.0}, {"food": "sugar", "quantity": 0.75}, {"food": "cinnamon", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 0.5}, {"food": "sugar", "quantity": 3.0}, {"food": "cinnamon", "quantity": 1}], "title": "\nOrange-Cinnamon Rice Pudding\n"}, {"directions": "\n\n              Heat the sugar in a medium saucepan over medium heat until it begins to melt. Cook, swirling the pan but not stirring, until deep amber, about 10 minutes. Stir in the orange zest and cook 30 seconds. Pour into a 9-inch-round cake pan; tilt to coat. Let harden, about 10 minutes.\n            \n\n              Preheat the oven to 350 degrees F. Dissolve the espresso powder in 1 tablespoon warm water in a large bowl. Whisk in the eggs. Add the sweetened condensed milk, half-and-half, vanilla, cinnamon and 1/8 teaspoon salt; whisk until smooth. Pour the mixture through a fine-mesh sieve into the cake pan.\n            \n\n              Loosely cover the cake pan with foil (do not let the foil touch the custard). Line a roasting pan with a kitchen towel and set the cake pan on top. Transfer to the oven and fill the roasting pan with hot water, about halfway up the side of the cake pan. Bake until the flan is set but still wobbly in the center, 1 hour, 30 minutes to 1 hour, 45 minutes. Remove from the oven and let cool in the water bath, about 1 hour. Remove from the water, cover with plastic wrap and chill at least 8 hours.\n            \n\n              Run a knife around the edge of the pan to loosen the flan; let sit 20 minutes. Invert the flan onto a rimmed plate and unmold, letting the caramel drip out. Cut into wedges.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "sugar", "quantity": 0.75}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "onion powder", "quantity": 4.0}, {"food": "eggs", "quantity": 5.0}, {"food": "milk", "quantity": 1.0}, {"food": "", "quantity": 3.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "cinnamon", "quantity": 0.25}, {"food": "salt", "quantity": 1}], "title": "\nOrange-Coffee Flan\n"}, {"directions": "\n\n              Position racks in the upper and lower thirds of the oven and preheat to 475 degrees F. Cut the hens in half with kitchen shears, removing the backbone and cutting through the middle of the breastbone. Divide the onion, oranges and rosemary sprigs between 2 rimmed baking sheets. Arrange the hens skin-side up on the baking sheets and season all over with salt and pepper. Set aside at room temperature, 30 minutes.\n            \n\n              Meanwhile, combine the orange juice, cranberries, maple syrup, 1 teaspoon coriander, the chile powder and 1/4 teaspoon salt in a medium saucepan. Bring to a boil, then reduce the heat to a simmer. Cook, mashing the cranberries as they start to burst, until the mixture is thickened and reduced to about 3/4 cup, 20 to 25 minutes. Stir in the vinegar and season with salt. Set aside.\n            \n\n              Melt the butter in a small saucepan over medium heat. Reduce the heat to low and add the chopped rosemary, garlic and the remaining 2 teaspoons coriander. Cook 30 seconds, then remove from the heat.\n            \n\n              Pat the hens dry with paper towels, then brush with the flavored butter. Roast the hens until the skin is browned and a thermometer inserted into the thigh registers 165 degrees F, 25 to 30 minutes. Remove from the oven and switch to the broiler setting. Brush the hens with the orange-cranberry sauce, then broil, one baking sheet at a time, until glazed and dark brown in spots, 2 to 3 minutes.\n            \n\n              Photograph by Ryan Liebe\n            \n", "ingredients": [{"food": "game meat bison", "quantity": 4.0}, {"food": "onion rings", "quantity": 1.0}, {"food": "orange juice", "quantity": 2.0}, {"food": "rosemary", "quantity": 8.0}, {"food": "salt", "quantity": 1}, {"food": "frozen yogurt", "quantity": 0.5}, {"food": "syrup", "quantity": 0.5}, {"food": "seeds", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "vinegar", "quantity": 2.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "garlic powder", "quantity": 3.0}], "title": "\nOrange-Cranberry Glazed Cornish Hens\n"}, {"directions": "\n\n              Wash and dry the orange. Cut the orange into small wedges, including the peel, and put in a food processor. Add the cranberries, pear, sugar, and salt. Pulse until coarsely chopped. Transfer to a bowl, cover, and refrigerate for at least 2 hours and up to 2 days. Just before serving, stir in the pecans.\n            \n", "ingredients": [{"food": "orange", "quantity": 1.0}, {"food": "frozen yogurt", "quantity": 1.0}, {"food": "pineapple chunks", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "pecans", "quantity": 3.0}], "title": "\nOrange-Cranberry-Pear Relish\n"}, {"directions": "\n\n              Thinly slice a baguette; arrange in a single layer on a baking sheet. Brush with softened butter and sprinkle with salt and sugar. Bake at 425 degrees F until lightly golden, about 7 minutes. Let cool slightly.\n            \n\n              Segment a blood orange over a bowl; reserve the juice. Toss the segments with 1 tablespoon superfine sugar. Simmer the juice and 1 tablespoon superfine sugar in a saucepan until syrupy. Spread whipped cream on the toast rounds; top with an orange segment and shaved chocolate. Drizzle with the orange syrup.\n            \n\n              Photograph by Andrew McCaul\n            \n", "ingredients": [], "title": "\nOrange-Cream Bruschetta\n"}, {"directions": "\n\n              Heat 1/2 cup olive oil with the grated zest of 1/2 orange, 1 tablespoon fennel seeds and 1/2 teaspoon pepper flakes. Drizzle over Classic Mash or Pepper-Swirl Mash.\n            \n\n              Classic Mashed Potatoes Cover 2 pounds whole russet or Yukon gold potatoes with cold salted water; simmer 45 minutes. Drain, peel and mash with 1/2 to 1 stick butter. Add 1 cup hot milk, and salt and pepper; mash until smooth and fluffy.\n            \n\n              Pepper-Swirl Mashed Potatoes Saute 2 chopped red bell peppers and 1 teaspoon thyme leaves in olive oil, covered, until tender. Puree; swirl into Classic Mash.\n            \n\n              See all 50 easy mashed potato recipes\n            \n\n              Photograph by Kana Okada\n            \n", "ingredients": [], "title": "\nOrange-Fennel Mashed Potatoes\n"}, {"directions": "\n\n              Place 1 thinly sliced orange and the coarsely chopped stalks and fronds from 1 bulb fennel in a pitcher. For still infused water, add 2 quarts of water. For sparkling water, add 1 quart of seltzer during prep and a second quart just before serving. Refrigerate 2 to 4 hours to allow the ingredients to infuse. Stir well and strain, discarding the solids. For serving, add fresh fennel, fronds and orange slices for garnish and plenty of ice. The infused water will keep refrigerated for up to 2 days.\n            \n", "ingredients": [], "title": "\nOrange-Fennel Water\n"}, {"directions": "\n\n              Position racks in the upper and lower thirds of the oven; preheat to 350 degrees F. Line 2 baking sheets with parchment paper. Combine the orange juice, figs and raisins in a small microwave-safe bowl and microwave until hot, about 1 minute. Let sit until the dried fruit is soft, about 10 minutes.\n            \n\n              Transfer 1 tablespoon of the juice to a food processor, then drain the dried fruit and add to the processor. Add the honey, orange zest, lemon zest and cinnamon and pulse to make a paste.\n            \n\n              Roll out 1 piece of dough into a 10-inch round on a lightly floured surface. Cut out circles using a 2 1/2-inch cookie cutter. Drop 1 teaspoon of the dried fruit paste in the center of each circle; fold the dough over to form a half-moon shape, pinching the edges together to seal. Crimp the edges with a fork, then poke a few small holes in the top of each. Repeat with the remaining dough and filling.\n            \n\n              Transfer the turnovers to the prepared baking sheets; bake, switching the pans halfway through, until golden brown, 15 to 20 minutes. Let cool 5 minutes on the baking sheets, then transfer to racks to cool completely. Dust with confectioners' sugar.\n            \n\n              Photograph by Andrew Purcell\n            \n", "ingredients": [{"food": "orange juice", "quantity": 0.5}, {"food": "figs", "quantity": 0.5}, {"food": "raisins", "quantity": 2.0}, {"food": "honey smoked ham", "quantity": 2.0}, {"food": "orange", "quantity": 0.25}, {"food": "lemon juice", "quantity": 0.25}, {"food": "cinnamon", "quantity": 0.25}, {"food": "pie fillings", "quantity": 1.0}, {"food": "potato flour", "quantity": 1}, {"food": "sugar", "quantity": 1}], "title": "\nOrange-Fig Turnovers\n"}, {"directions": "\n\n              Cut off about 1 inch from both ends of all 4 oranges; reserve the ends. Stand 1 orange cut-side down on a cutting board. Working from top to bottom, cut away the peel and pith. Cut the orange into 3 rounds, each about 3/4-inch-thick, transferring the rounds to a medium bowl as you work. Repeat with the remaining oranges. Refrigerate the slices until needed.\n            \n\n              Squeeze the juice from the reserved orange ends into a small saucepan. Add the orange zest, honey and any remaining juice from your cutting board, and bring to a boil over medium-high heat. Boil, swirling the pot occasionally, until syrupy, about 6 minutes. Toward the end, the surface will be covered with big brownish bubbles. You should have about 1/4 cup of syrup. Let cool to room temperature, about 25 minutes.\n            \n\n              Meanwhile, heat a small skillet over medium heat, add the pistachios and cook, tossing frequently until fragrant and toasted, about 4 minutes. Let cool, then chop.\n            \n\n              Whisk together the yogurt, half the syrup and the orange-blossom water in a medium bowl.\n            \n\n              In each of 4 shallow bowls, layer 3 orange slices with 1 tablespoon of the yogurt mixture, beginning with an orange slice and ending with yogurt. Drizzle the remaining orange syrup over the tops, sprinkle with pistachios and serve.\n            \n", "ingredients": [{"food": "", "quantity": 4.0}, {"food": "honey smoked ham", "quantity": 2.0}, {"food": "silk banana-strawberry soy yogurt", "quantity": 1.0}, {"food": "coconut water", "quantity": 1.0}, {"food": "", "quantity": 0.25}], "title": "\nOrange-Fool Napoleons\n"}, {"directions": "\n\n              Whisk the orange juice, soy sauce, honey, ginger, garlic and red pepper flakes in a shallow dish. Add the pork and let marinate, turning occasionally, 10 minutes.\n            \n\n              Preheat the broiler. Place the pork chops on a foil-lined baking sheet. Transfer the marinade to a small saucepan and bring to a simmer over medium-high heat. Cook until reduced by about half, 8 to 10 minutes. Meanwhile, broil the pork until slightly charred and just cooked through, 5 to 7 minutes. Set aside to rest.\n            \n\n              Heat the vegetable oil in a large nonstick skillet over medium-high heat. Add the dumplings, flat-side down, and cook, undisturbed, until slightly browned, about 3 minutes. Add 1/4 cup water; cover and cook until the water has evaporated and the dumplings are crisp on the bottom, about 3 minutes. Uncover and add the greens; stir until just wilted, 1 minute. Serve with the pork chops and orange sauce.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "orange juice", "quantity": 0.5}, {"food": "soy sauce", "quantity": 0.25}, {"food": "honey smoked ham", "quantity": 0.25}, {"food": "ginger", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "pork skins", "quantity": 4.5}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "mixed nuts", "quantity": 1.0}], "title": "\nOrange-Ginger Pork Chops with Dumplings\n"}, {"directions": "\n\n              Cut a 1-inch chunk off one end of a carrot at an angle. Roll the carrot a quarter turn and cut another 1-inch chunk at an angle. Continue rolling and cutting all of the carrots into 1-inch chunks. Combine the carrots and orange juice in a large saucepan. Add enough water to just cover the carrots. Add the butter and 1/4 teaspoon each salt and pepper. \n            \n\n              Bring to a boil, and then reduce the heat to maintain a steady simmer. Cook, stirring occasionally, until the carrots are tender and the liquid has reduced to a glaze, about 20 minutes. Top with the dill and serve.\n            \n", "ingredients": [{"food": "carrots", "quantity": 1.0}, {"food": "orange juice", "quantity": 1.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 1.0}], "title": "\nOrange-Glazed Carrots\n"}, {"directions": "\n\n              Cut the bulbous bottom of the squash off from the long top. Split the bottom in half through the root end and scoop out the seeds with a spoon. Cut the long part in half lengthwise. Peel or cut off the rind, then cut the flesh into 1-inch pieces.\n            \n\n              Add the squash to a 4-quart pot, add enough water to cover, bring to a boil, and cook, covered, over high heat, about 18 minutes. Add 1 tablespoon salt and cover. Lower the heat to medium and cook until the squash is tender when pierced with a fork, 10 to 12 minutes more. (There should be no resistance, but the squash should not fall apart. Be attentive: It can overcook very quickly and absorb too much water, making your mash soupy.)\n            \n\n              Meanwhile, toast the coriander in a small dry skillet over medium-high heat, stirring often, until aromatic, 1 to 1 1/2 minutes. Transfer to a small bowl.\n            \n\n              Strain the squash in a colander. Return it to the pot, add the butter and mash with a potato masher until smooth. Add the zest, 1 tablespoon of the maple syrup, 1 1/2 teaspoons of the toasted coriander and salt to taste and stir to combine. When serving, drizzle the remaining 1 tablespoon syrup over the top and dust with the remaining 1/2 teaspoon coriander.\n            \n", "ingredients": [{"food": "", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "ground turkey", "quantity": 2.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "orange", "quantity": 1.0}, {"food": "syrup", "quantity": 2.0}], "title": "\nOrange-Maple Butternut Squash Mash\n"}, {"directions": "\n\n              Position racks in the upper and lower thirds of the oven; preheat to 400 degrees F. Whisk the flour, cream of tartar, baking soda, baking powder and salt in a medium bowl. Beat the butter and 3/4 cup granulated sugar in a large bowl with a mixer on medium-high speed until fluffy, about 3 minutes. Beat in the egg, then the molasses and orange zest. Reduce the mixer speed to low; beat in the flour mixture until just combined.\n            \n\n              Combine the cinnamon and the remaining 3 tablespoons granulated sugar in a small bowl. Roll heaping tablespoonfuls of dough into balls, then roll in the cinnamon sugar to coat. Arrange 2 inches apart on 2 ungreased baking sheets. Sprinkle with coarse sugar.\n            \n\n              Bake, switching the pans halfway through, until the cookies are just set around the edges but the centers are still soft, 11 to 13 minutes. Let cool 3 minutes on the baking sheets, then transfer to racks to cool completely.\n            \n\n              Photograph by Ryan Dausch\n            \n\n              Position racks in the upper and lower thirds of the oven; preheat to 400 degrees F. Whisk the flour, cream of tartar, baking soda, baking powder and salt in a medium bowl. Beat the butter and 3/4 cup granulated sugar in a large bowl with a mixer on medium-high speed until fluffy, about 3 minutes. Beat in the egg, then the molasses and orange zest. Reduce the mixer speed to low; beat in the flour mixture until just combined.\n            \n\n              Combine the cinnamon and the remaining 3 tablespoons granulated sugar in a small bowl. Roll heaping tablespoonfuls of dough into balls, then roll in the cinnamon sugar to coat. Arrange 2 inches apart on 2 ungreased baking sheets. Sprinkle with coarse sugar.\n            \n\n              Bake, switching the pans halfway through, until the cookies are just set around the edges but the centers are still soft, 11 to 13 minutes. Let cool 3 minutes on the baking sheets, then transfer to racks to cool completely.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 0.75}, {"food": "egg substitute", "quantity": 1.0}, {"food": "molasses", "quantity": 2.0}, {"food": "orange", "quantity": 0.5}, {"food": "cinnamon", "quantity": 1.5}, {"food": "sugar", "quantity": 1}, {"food": "potato flour", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 0.75}, {"food": "egg substitute", "quantity": 1.0}, {"food": "molasses", "quantity": 2.0}, {"food": "orange", "quantity": 0.5}, {"food": "cinnamon", "quantity": 1.5}, {"food": "sugar", "quantity": 1}], "title": "\nOrange-Molasses Snickerdoodles\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Butter the bottom and sides of a 9-inch square baking dish. Combine the almond paste, whole eggs, egg yolks, melted butter and 1/4 cup sugar in a food processor. Pulse until combined with a few small lumps of almond paste. Add 1 tablespoon orange blossom water, the baking powder, salt and vanilla; pulse to combine. Add the phyllo pieces and pulse until finely chopped. Spread the mixture evenly in the prepared pan. Bake until golden brown and firm on top, 25 to 30 minutes.\n            \n\n              Meanwhile, make the syrup: Heat the orange juice, honey, lemon juice, the remaining 3/4 cup sugar and the remaining 1 tablespoon orange blossom water in a small saucepan over medium heat, stirring, until dissolved, about 5 minutes. Remove from the heat and cover to keep warm.\n            \n\n              Remove the baking dish from the oven and immediately pour half of the syrup over the cake; let soak in, 15 minutes. Add the pistachios to the remaining syrup and pour over the cake, spreading the pistachios with a rubber spatula. Transfer to a rack and let cool completely in the pan, about 3 hours, tipping the pan occasionally to distribute the syrup. Cut diagonally into small diamonds.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.5}, {"food": "almond paste", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "sugar", "quantity": 1.0}, {"food": "coconut water", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.25}, {"food": "vanilla extract", "quantity": 0.25}, {"food": "frozen yogurt", "quantity": 8.0}, {"food": "orange juice", "quantity": 0.75}, {"food": "honey smoked ham", "quantity": 0.25}, {"food": "lemon juice", "quantity": 1.0}, {"food": "", "quantity": 0.25}], "title": "\nOrange-Pistachio Phyllo Diamonds\n"}, {"directions": "\n\n              Combine the orange zest, granulated sugar, confectioners' sugar, rosemary and salt in a food processor and process, scraping the bowl occasionally, until the mixture is sandy and turns orange, about 1 minute. Add the butter and process until creamy, 1 to 2 minutes. Add the egg yolks and process, scraping the bowl occasionally, until combined, about 1 minute. Add the flour and process until smooth, about 1 minute. (The dough will be very soft.)\n            \n\n              Divide the dough between 2 sheets of plastic wrap. Using the plastic to help you, shape each into a 10-inch-long log. Wrap and refrigerate until firm but not hard, 1 hour.\n            \n\n              Unwrap and reshape each into a smooth, even cylinder. Wrap again tightly and refrigerate until very hard, at least 2 hours or overnight.\n            \n\n              Position racks in the upper and lower thirds of the oven; preheat to 350 degrees F. Line 2 baking sheets with parchment paper. Lightly beat the egg white in a small bowl. Unwrap 1 log and brush all over with some of the egg white, then sprinkle with 1 tablespoon sanding sugar. Using a sharp knife, slice into 1/4- to 1/2-inch-thick rounds. Arrange 2 inches apart on one of the prepared pans. Repeat with the second log of dough.\n            \n\n              Bake, switching the pans halfway through, until the cookies are golden around the edges, 20 to 24 minutes. Let cool 5 minutes on the pans, then transfer to racks to cool completely.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "", "quantity": 1.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "sugar", "quantity": 0.25}, {"food": "rosemary", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 2.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "sugar", "quantity": 2.0}], "title": "\nOrange-Rosemary Icebox Cookies\n"}, {"directions": "\n\n              Sift 1 cup confectioners' sugar, 1/4 teaspoon ground cardamom and 1/2 cup cocoa powder into a bowl. Bring 6 cups milk to a simmer over medium heat. Whisk in the cocoa mixture until smooth. Fold 1/2 teaspoon orange zest into 1 cup whipped cream. Divide the cocoa among 6 mugs. Top with the whipped cream.\n            \n\n              Photograph by Anna Williams\n            \n", "ingredients": [], "title": "\nOrange-Spice Cocoa\n"}, {"directions": "\n\n              Unwrap the turkey and remove the neck and giblets (reserve for gravy). Rinse the turkey under cold water and pat dry. Fill a large pot with 2 quarts water; add the orange zest, orange juice, 2 cups kosher salt, the sugar, black tea bags, bay leaves, cloves, peppercorns and bourbon. Bring to a boil, then simmer 10 minutes. Add 4 quarts cold water and let cool. Submerge the turkey in the brine, adding water to cover, if necessary. Refrigerate at least 8 hours or overnight.\n            \n\n              Remove the turkey from the brine; rinse and pat dry. Mix the butter, honey, dijon mustard and spicy brown mustard until combined. Reserve 4 tablespoons of the butter, then rub the rest under the turkey skin on the breasts and legs. Rub 2 tablespoons of the reserved butter on the skin; chill and save the rest for your gravy. Let the turkey stand 30 minutes at room temperature before roasting.\n            \n\n              Put the oven rack in the lowest position; preheat the oven to 350 degrees F. Put the turkey breast-side up on a rack in a large roasting pan, tucking the wing tips under. Tie the drumsticks together with twine. Roast until the skin is golden brown and a thermometer inserted into the thigh registers 165 degrees F, about 15 minutes per pound. Transfer to a cutting board and let rest 30 minutes before carving. Whisk the reserved 2 tablespoons flavored butter into your gravy just before serving, if desired.\n            \n\n              Photograph by Yunhee Kim\n            \n", "ingredients": [{"food": "frozen yogurt", "quantity": 1.0}, {"food": "grape juice", "quantity": 5.0}, {"food": "salt", "quantity": 1}, {"food": "sugar", "quantity": 1.0}, {"food": "black bean mango", "quantity": 12.0}, {"food": "chrysanthemum leaves", "quantity": 4.0}, {"food": "cloves", "quantity": 6.0}, {"food": "", "quantity": 12.0}, {"food": "", "quantity": 1.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "honey smoked ham", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 3.0}, {"food": "spicy black bean enchilada", "quantity": 3.0}], "title": "\nOrange-Tea-Bourbon Brined Turkey With Honey Mustard Butter\n"}, {"directions": "\n\n              Whisk the cornstarch and 1/2 cup milk in a small bowl until smooth. Whisk the eggs, sugar and salt in a medium saucepan; whisk in the cornstarch mixture and the remaining 1 cup milk until smooth.\n            \n\n              Cook the mixture over low heat, stirring, until thick enough to coat a spoon, 7 to 8 minutes (do not boil). Pour through a fine-mesh sieve into a bowl, then set the bowl in a larger bowl of ice water. Add the cream and stir until cool. Remove from the ice bath; stir in the vanilla, orange juice concentrate and orange zest. Cover and chill until cold.\n            \n\n              Freeze the custard in an ice cream maker according to the manufacturer's directions. Scrape into a pastry bag fitted with a large star tip and pipe into cups.\n            \n\n              Photograph by Jonathan Kantor\n            \n", "ingredients": [{"food": "cornstarch", "quantity": 1.0}, {"food": "whole milk", "quantity": 1.5}, {"food": "eggs", "quantity": 3.0}, {"food": "sugar", "quantity": 1.0}, {"food": "salt", "quantity": 0.25}, {"food": "ice cream swich", "quantity": 1.5}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "orange juice", "quantity": 0.6666666666666666}, {"food": "orange", "quantity": 4.0}], "title": "\nOrange-Vanilla Frozen Custard\n"}, {"directions": "\n\n              In a blender, combine 2 cups orange juice and 1/4 cup instant oatmeal; let sit 10 minutes. Add 2 cups ice, 1 cup vanilla yogurt and 1/2 teaspoon vanilla extract; puree until smooth.\n            \n", "ingredients": [], "title": "\nOrange-Vanilla Smoothies\n"}, {"directions": "\n\n              Zest one of the oranges and set the zest aside. Working with one orange at a time, cut a 1/4 inch off of the bottom and top of an orange. Stand the fruit cut-side down on a cutting board, and working from top to bottom, cut away the peel and pith. Working over a bowl, cradle the orange in one hand and cut along both sides of each membrane through to the center, releasing the segments into the bowl. (If you can't get whole segments, that's okay.) Squeeze the remaining membrane over a second bowl to release any juices; add the juices that have collected with the orange segments. Repeat with the remaining oranges.\n            \n\n              Melt the butter over medium heat in a medium skillet. Stir in the cinnamon stick and a pinch of cayenne and cook until aromatic, about 1 minute. Add the orange juice, zest and honey and bring to a simmer. Cook, uncovered, swirling occasionally, until the liquid thickens to a glaze, about 7 minutes more. Add the orange segments and cook until just warmed. Remove from the heat and discard the cinnamon stick. Spoon over toasted waffles, pancakes or French toast.\n            \n", "ingredients": [{"food": "oranges", "quantity": 4.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "honey smoked ham", "quantity": 3.0}, {"food": "pancakes", "quantity": 1}], "title": "\nOranges in Spiced Honey\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the pasta and cook as the label directs; drain but don't rinse. Meanwhile, combine the bocconcini, artichokes, marinated peppers and mint in a serving bowl. Add the olive oil, lemon zest and juice, and salt and pepper to taste and toss. Add the pasta and toss again. Just before serving, stir in the arugula and roast beef. Season the salad with pepper. \n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "italian veg medley pasta", "quantity": 8.0}, {"food": "melon balls", "quantity": 1.0}, {"food": "artichoke hearts", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 8.0}, {"food": "barley flour or meal", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "pepper", "quantity": 1}, {"food": "arugula", "quantity": 4.0}, {"food": "roast beef", "quantity": 6.0}], "title": "\nOrecchiette Salad with Roast Beef\n"}, {"directions": "\n\n              Bring a pot of salted water to a boil. Add the pasta and cook as the label directs. Meanwhile, heat the olive oil in a large skillet over medium heat. Add the sausage and cook, breaking it up with a wooden spoon, until it begins to brown, about 3 minutes. Add the spring onions and cook until softened, about 3 more minutes. Add the garlic, mushrooms, 1/2 teaspoon salt, and pepper to taste; cook, stirring occasionally, until the mushrooms start to brown, about 3 minutes. Add the cherry tomatoes and cook until they soften slightly, about 3 more minutes.\n            \n\n              Reserve 1 cup of the pasta cooking water, then drain the pasta. Add the broth to the skillet and cook, stirring, 1 minute. Stir in the pasta and cheese, adding some of the reserved cooking water to loosen, if necessary. Season with salt and pepper. Divide among bowls, drizzle with olive oil and top with more cheese and spring onions.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "italian veg medley pasta", "quantity": 12.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "sausage", "quantity": 8.0}, {"food": "silk light vanilla", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 8.0}, {"food": "pepper", "quantity": 1}, {"food": "silk black cherry soy yogurt", "quantity": 2.0}, {"food": "diced chicken", "quantity": 0.5}, {"food": "parmesan cheese", "quantity": 0.5}], "title": "\nOrecchiette With Spicy Sausage\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the pasta and cook as the label directs. Reserve 3/4 cup cooking water, then drain.\n            \n\n              Meanwhile, heat 2 tablespoons olive oil in a large nonstick skillet over medium-high heat. Add the artichokes and season with salt. Cook, turning halfway through, until browned, about 5 minutes. Transfer to a plate.\n            \n\n              Add the remaining 2 tablespoons olive oil, the garlic and beans to the skillet. Cook, stirring occasionally, until the garlic is golden, about 2 minutes. Stir in the cherry tomatoes, red pepper flakes and 1/2 teaspoon salt. Bring to a simmer; cook, stirring occasionally, until slightly thickened, about 3 minutes.\n            \n\n              Add the pasta and the reserved cooking water to the skillet. Cook, stirring, until the pasta is coated, about 1 minute. Stir in the parsley, parmesan and artichokes; season with salt and pepper. Drizzle each serving with olive oil and top with more parmesan.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "italian veg medley pasta", "quantity": 12.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "artichoke hearts", "quantity": 1.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "fava beans", "quantity": 1.0}, {"food": "silk black cherry soy yogurt", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "parsley", "quantity": 0.75}, {"food": "parmesan cheese", "quantity": 0.25}, {"food": "pepper", "quantity": 1}], "title": "\nOrecchiette with Artichokes\n"}, {"directions": "\n\n              1. Heat oil in a large skillet over medium heat. Add sausage, and cook, turning occasionally until browned, about 10 minutes. Remove sausage to a plate and reserve pan and sausage drippings. \n            \n\n              2. Meanwhile, bring a large pot of cold water to a boil over high heat. Add a large pinch of salt and broccoli rabe and cook, uncovered, until broccoli rabe is bright green and tender but still slightly crisp, about 5 minutes. Immediately transfer broccoli rabe using tongs to a colander (reserve boiling water) and rinse under cold running water. Chop into bite-sized pieces and set aside. \n            \n\n              3. Add pasta to reserved boiling water and cook, stirring occasionally, until al dente (tender but not mushy), about 12 minutes. Meanwhile, heat reserved pan and drippings over medium heat. Add garlic and cook, stirring frequently, until it is golden brown, about 5 minutes. Add broccoli rabe, pepper flakes, and 1 1/2 teaspoons of salt; increase heat to medium-high, and cook, continually stirring, until broccoli rabe is hot and tender, about 5 minutes. Slice sausage into 1/4-inch thick coins and add to pan and mix well cook until sausage is warmed through, about 5 more minutes. \n            \n\n              4. Drain pasta in a colander in sink, reserving 1/4 cup of cooking liquid. Toss pasta and liquid with broccoli rabe mixture. Transfer pasta to a serving dish or individual bowls, garnish with Parmesean and serve.\n            \n", "ingredients": [{"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "", "quantity": 1}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "sweet potatoes", "quantity": 1.0}, {"food": "salt", "quantity": 1.5}, {"food": "broccoli raab", "quantity": 2.0}, {"food": "italian veg medley pasta", "quantity": 1.0}, {"food": "garlic powder", "quantity": 4.0}], "title": "\nOrecchiette with Broccoli Rabe and Sausage\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the pasta and cook as the label directs, adding the grated broccoli during the last 30 seconds of cooking. Reserve 1 cup cooking water, then drain.\n            \n\n              Meanwhile, combine the breadcrumbs and 2 teaspoons olive oil in a small nonstick skillet over medium heat. Season with salt and cook, stirring occasionally, until golden brown, about 5 minutes; remove to a bowl.\n            \n\n              Heat the remaining 3 tablespoons olive oil with the garlic in a separate pot over medium-high heat. Cook until the garlic is just golden, about 3 minutes. Add the red pepper flakes, clams and wine. Cover and cook until the clams open, 5 to 7 minutes; remove the clams to a bowl using a slotted spoon (discard any unopened clams). Add the butter, pasta, broccoli and 1/2 cup of the reserved cooking water to the pot; cook, stirring, until the pasta is well coated, about 1 minute. Gradually add the remaining 1/2 cup cooking water if the pasta seems dry.\n            \n\n              Stir the clams and any juices into the pasta. Drizzle each serving with olive oil and sprinkle with the breadcrumbs.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "", "quantity": 12.0}, {"food": "hearts of palm", "quantity": 2.0}, {"food": "", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "", "quantity": 24.0}, {"food": "martha white foods", "quantity": 0.25}, {"food": "butter oil", "quantity": 2.0}], "title": "\nOrecchiette with Clams and Broccoli\n"}, {"directions": "\n\n              Make the dough: Whisk the semolina and all-purpose flour in a large bowl. Mound on a work surface and make a well in the center. Pour 1/2 cup cold water into the well. Using a fork and working your way around the well, gradually mix the flour into the water. Continue mixing until the dough is crumbly. If the dough is too dry to come together, add up to 1/4 cup more water, a little at a time.\n            \n\n              Knead the dough until smooth and elastic, about 6 minutes. Wrap in plastic wrap and let rest at room temperature,30 minutes. (The dough can be made a day ahead and refrigerated; bring it to room temperature before rolling.)\n            \n\n              Divide the dough into 4 pieces. Working with 1 piece at a time (and keeping the other pieces wrapped), roll the dough on the counter with your hands into a 1/2-inch-thick log. With a knife or bench scraper, cut the log into 1/2-inch pieces; roll each piece into a small ball. With floured hands, press your thumb into a dough ball and drag it toward you to form a bowl shape; put the dough on the tip of your index finger and turn it inside out. Repeat to form the remaining orecchiette; transfer to a floured baking sheet as you go.\n            \n\n              Bring a large pot of salted water to a boil. Meanwhile, melt the butter with the olive oil in a large skillet over medium heat. Add the leeks and cook, stirring occasionally, until softened but not browned, 7 to 8 minutes. Add the ham and cook until heated through, about 3 minutes. Stir in the garlic and thyme and cook1 minute. Add the peas and broth and bring to a simmer. Stir in the heavy cream and lemon juice, season with salt and pepper and simmer until the peas are tender, about 5 minutes for frozen, 10 minutes for fresh.\n            \n\n              Transfer the orecchiette to a colander and shake over the baking sheet to remove the excess flour. Add the orecchiette to the boiling water and cook until al dente, about 8 minutes. Remove with a strainer or slotted spoon and add directly to the skillet with the ham and peas. Toss, adding spoonfuls of the pasta cooking water to loosen, if necessary. Remove from the heat and stir in the parmesan.\n            \n\n              Photograph by David Malosh\n            \n", "ingredients": [{"food": "potato flour", "quantity": 0.75}, {"food": "potato flour", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "silk light vanilla", "quantity": 2.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "thyme", "quantity": 1.0}, {"food": "pigeon peas", "quantity": 1.0}, {"food": "diced chicken", "quantity": 0.5}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "", "quantity": 0.5}, {"food": "pepper", "quantity": 1}, {"food": "parmesan cheese", "quantity": 0.5}], "title": "\nOrecchiette with Ham and Leeks\n"}, {"directions": "\n\n              Prepare a large bowl of salted ice water. Bring a large pot of salted water to a boil. Add the asparagus and garlic and cook until the asparagus is crisp-tender, about 2 minutes. Transfer the asparagus and garlic to the ice water using a slotted spoon (reserve the pot of water). Let the asparagus and garlic cool, then drain and pat dry. Chop off the asparagus tips and set aside; roughly chop the stems.\n            \n\n              Make the pesto: Toast the hazelnuts in a large dry skillet over medium-high heat, about 5 minutes. Transfer to a food processor and let cool, then pulse until roughly chopped. Add the asparagus stems and garlic to the food processor; pulse until smooth. Add the basil and chervil. With the motor running, slowly add the olive oil and puree until smooth. Add the truffle pecorino, parmesan, lemon zest and juice, 1 teaspoon salt and a few grinds of pepper, pulsing until combined.\n            \n\n              Return the pot of water to a boil. Add the pasta and cook as the label directs. Reserve 3/4 cup cooking water, then drain the pasta and return to the pot. Add the pesto, butter and the reserved asparagus tips. Cook over low heat, tossing and adding the reserved cooking water as needed to loosen, until coated. Season with salt and pepper. Drizzle each serving with olive oil and top with more truffle pecorino.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "asparagus", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "hazelnuts or filberts", "quantity": 0.25}, {"food": "basil", "quantity": 0.5}, {"food": "chervil", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 0.3333333333333333}, {"food": "parmesan cheese", "quantity": 0.25}, {"food": "grape juice", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "italian veg medley pasta", "quantity": 1.0}, {"food": "butter oil", "quantity": 2.0}], "title": "\nOrecchiette with Truffle-Asparagus Pesto\n"}, {"directions": "\nSpecial equipment: an 18-by-13-inch rimmed baking sheet\n\n              Preheat the oven to 375 degrees F. Line an 18-by-13-inch rimmed baking sheet with foil, leaving a 2-inch overhang on at least two sides. Coat with cooking spray.\n            \n\n              Arrange the chocolate sandwich cookies on half of the baking sheet in 6 rows, with 4 cookies per row. Cover the chocolate sandwich cookies with the cookie dough: pressing and spreading the dough into and over the cookies to make one giant chocolate chip cookie that covers half of the baking sheet.   \n            \n\n              Prepare the brownie batter according to package directions. Pour the batter into the empty half of the pan. Arrange the vanilla sandwich cookies on top of the brownie batter in 6 rows, with 4 cookies per row Press the cookies into the batter. \n            \n\n              Bake until a toothpick inserted in the center of the chocolate chip cookie portion and brownie portion comes out with just a few crumbs, 20 to 23 minutes. Let cool completely in the pan on a cooling rack, about 2 hours. Freeze to firm up, about 30 minutes. \n            \n\n              Use the foil overhang as handles and lift the giant cookie out of the baking sheet and carefully flip it over onto a cutting board, making sure it does not bend or crack. Peel away the foil from the bottom. Line the baking sheet with plastic wrap. \n            \n\n              Using a warm serrated knife, trim the rough edges of the giant cookie so it is an even rectangle (about 12-by-16-inches). Cut it in half crosswise so you have one brownie half and one chocolate chip cookie half (each 8-by-12-inches). Lay the chocolate chip cookie piece on the prepared baking sheet so the chocolate sandwich cookies are facing up. Working quickly, spread the ice cream across the cookie all the way to the edges. Smooth out the top and sides. Place the brownie half, with the chocolate cookies facing down, on top of the ice cream and gently press to adhere. Fold the plastic wrap around the assembled ice cream sandwich to help hold its shape and freeze until hardened, at least 6 hours and up to overnight. Use a warm serrated knife to cut into 24 ice cream sandwiches.  \n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 1}, {"food": "chocolate chip cookies", "quantity": 24.0}, {"food": "chocolate chip cookies", "quantity": 16.0}, {"food": "cheesecake mix", "quantity": 18.0}, {"food": "vanilla extract", "quantity": 24.0}, {"food": "ice cream swich", "quantity": 4.0}], "title": "\nOreo-Stuffed Ice Cream Sandwiches\n"}, {"directions": "\n\n              Preheat the broiler. Bring a large pot of salted water to a boil. Add the pasta and cook until al dente (about 2 minutes less than the label directs). Drain and rinse under cool water; shake off the excess. Transfer to a large bowl and set aside while you make the shrimp, stirring occasionally to prevent clumping.\n            \n\n              Toss the shrimp on a baking sheet with 1 tablespoon olive oil, the garlic, and salt and pepper to taste; arrange in a single layer. Broil the shrimp, turning once, until opaque and just cooked through, 2 to 3 minutes.\n            \n\n              Add the shrimp, lemon zest and juice, scallions, mint, dill, cucumber, feta, olives and the remaining 1/3 cup olive oil to the bowl with the pasta; toss. Serve immediately or refrigerate, covered, up to 6 hours. (Bring to room temperature before serving.)\n            \n\n              Photograph by Yunhee Kim\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "italian veg medley pasta", "quantity": 8.0}, {"food": "shrimp", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "garlic powder", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "lemon juice", "quantity": 2.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "", "quantity": 0.5}, {"food": "dill seed", "quantity": 0.5}, {"food": "diced chicken", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "olives", "quantity": 3.0}], "title": "\nOrzo Salad With Shrimp and Feta\n"}, {"directions": "\n\n              Cook 2 cups orzo in salted boiling water until al dente, about 8 minutes; drain. Chop 6 scallions; cook just the white parts in a skillet with olive oil until tender, about 2 minutes. Stir in the orzo, 2 cups chicken broth, the scallion greens and a handful each of chopped parsley and dill; season with salt and pepper. Simmer until slightly thickened, about 3 minutes. Stir in 1/4 cup grated parmesan.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [], "title": "\nOrzo with Herbs\n"}, {"directions": "\n\n              Cook 1 cup orzo as the label directs. Drain, reserving 1/4 cup cooking water. Toss the orzo and cooking water with 2 cups baby arugula, 1/4 cup each chopped sun-dried tomatoes (not oil-packed) and parmesan, 2 tablespoons butter and 1 teaspoon lemon zest; season with salt and pepper.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [], "title": "\nOrzo with Sun-Dried Tomatoes\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: deep-frying thermometer\n\n              Whisk the buttermilk with the thyme, oregano, hot sauce, garlic and 1/4 cup salt in a large nonreactive bowl (see Cook's Note). Add the chicken pieces, turn to coat, cover the bowl and refrigerate overnight.\n            \n\n              When ready to fry, shake the flour, paprika and 1 tablespoon black pepper in a large, clean plastic or paper bag. Set a large rack over a baking sheet. Drain the chicken in a colander. Shake 2 or 3 pieces at a time in the flour mixture, then shake off any excess and transfer to the rack.\n            \n\n              Place a large Dutch oven over medium-high heat and add enough shortening to come halfway up the sides. Heat until a deep-frying thermometer inserted in the oil registers 350 degrees F.\n            \n\n              Working in 2 batches, carefully add the chicken pieces to the Dutch oven. The oil temperature will drop precipitously to about 250 degrees F as you slip in the chicken. Adjust the heat as needed to keep the temperature right around 250 degrees F. The oil should be bubbling gently around all of the chicken. Fry the chicken until it is a deep golden brown, about 20 minutes for white meat and 25 minutes for dark meat. Transfer the chicken to a paper towel-lined platter. Serve immediately or at room temperature.\n            \n\n              5.5qt Enameled Cast Iron Dutch Oven available Kohl's\n            \n", "ingredients": [{"food": "pillsbury golden layer buttermilk biscuits", "quantity": 4.0}, {"food": "thyme", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "diced chicken", "quantity": 3.5}, {"food": "potato flour", "quantity": 4.0}, {"food": "sweet potatoes", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1}], "title": "\nOur Favorite Fried Chicken\n"}, {"directions": "\n\n              1. Finely grate 1 teaspoon of zest from the lemon; set aside. Squeeze the juice of the lemon into a medium bowl. Whisk in the milk, sugar, and cayenne until the sugar and cayenne are dissolved. Add the sprigs of rosemary and garlic. Pierce each chicken piece several times with a fork, add to the milk mixture, turning to coat well. Cover, and marinate in the refrigerator for 2 hours.\n            \n\n              2. Meanwhile, preheat the oven to 300 degrees F. Lay the bread on a baking sheet in a single layer. Bake, turning a few times, until the bread is crisp and dry, 45 minutes to 1 hour. Cool completely. Break into large pieces and pulse in the bowl of a food processor until it forms coarse crumbs.\n            \n\n              3. Increase the oven temperature to 375 degrees F. In a shallow dish combine the bread crumbs with the corn meal, Parmesan (if using), chopped rosemary, reserved 1 teaspoon zest, and season with salt and pepper. Line a baking sheet with aluminum foil and top with a wire rack. Coat the rack well with nonstick cooking spray.\n            \n\n              4. Working with one piece at a time, remove the chicken from the marinade, allowing the excess to drip off. Press into the bread crumb mixture until the chicken is well coated and place on the prepared baking sheet. Repeat with the remaining chicken and crumbs. Mist the chicken with nonstick cooking spray.\n            \n\n              5. Bake until the chicken is crisp and a thermometer inserted into the thickest part registers 160 degrees F, about 50 to 55 minutes. Serve warm or at room temperature.\n            \n\n              Nutritional analysis of 1/2 of total recipe for breading mixture\n            \n\n              Calories 181; Total Fat 3.5g (Sat Fat 1g, Mono Fat 1g, Poly Fat 0.5g) ; Protein 9g; Carb 29g; Fiber 4g; Cholesterol 1mg; Sodium 506mg\n            \n\n              Nutritional analysis per serving of chicken\n            \n\n              Calories 328; Total Fat 10g (Sat Fat 3g, Mono Fat 3g, Poly Fat 2g) ; Protein 48g;\n            \n\n              Carb 10 g; Fiber 1g; Cholesterol 186mg; Sodium 330mg\n            \n", "ingredients": [{"food": "lemon juice", "quantity": 1.0}, {"food": "milk", "quantity": 0.5}, {"food": "sugar", "quantity": 0.5}, {"food": "pepper", "quantity": 0.25}, {"food": "rosemary", "quantity": 2.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "luncheon slices", "quantity": 2.0}, {"food": "yellow rice", "quantity": 0.25}, {"food": "macaroni cheese", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nOven Fried Chicken\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 400 degrees F. Set a rack on a foil-lined baking sheet. Spray the rack generously with cooking spray.\n            \n\n              Finely grind the bagel chips and cereal together in a food processor. Transfer the crumbs to a gallon-size plastic bag. Add the oil, salt, cayenne, paprika and ground pepper and toss to mix thoroughly. Whisk the light mayonnaise and Dijon mustard together in a medium shallow bowl.\n            \n\n              Add the chicken to the mayonnaise mixture and turn to coat all the pieces evenly. Drop the chicken into the plastic bag, seal and shake until each piece is evenly coated. Place the coated pieces on the prepared rack. Spray the chicken pieces evenly with cooking spray.\n            \n\n              Bake until the coating crisps and browns and an instant-read thermometer inserted in the thickest part of the pieces registers 160 degrees F, 35 to 40 minutes.\n            \n\n              Transfer to a platter and serve hot or at room temperature.\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 1}, {"food": "french toast", "quantity": 2.25}, {"food": "cereal bar", "quantity": 1.3333333333333333}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "salt", "quantity": 2.0}, {"food": "pepper", "quantity": 0.5}, {"food": "sweet potatoes", "quantity": 0.5}, {"food": "black bean mango", "quantity": 0.5}, {"food": "silk light vanilla", "quantity": 0.5}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "diced chicken", "quantity": 4.0}], "title": "\nOven Fried Chicken\n"}, {"directions": "\n\n              1. Preheat oven to 375 degrees F. Line a baking sheet with aluminum foil and set aside. \n            \n\n              2. Butter one side of each piece of bread. Place 4 slices, buttered-side down, on prepared baking sheet. Layer half of cheese slices on bread followed by bacon and scallions. Place remaining cheese slices on top. Cover each sandwich with remaining 4 slices of bread, buttered side up. \n            \n\n              3. Bake sandwiches until bottoms are a toasted golden brown, about 10 minutes. Flip and continue to bake until cheese melts and other side is toasted, 8 to 10 more minutes. Serve immediately.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 6.0}, {"food": "potato flour", "quantity": 8.0}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "bacon", "quantity": 8.0}, {"food": "", "quantity": 4.0}], "title": "\nOven Grilled Bacon Cheddar Sandwiches\n"}, {"directions": "\n\n              Halve 2 pounds plum tomatoes lengthwise. Place cut-side up on a baking sheet, season with salt and let stand 20 minutes. Roast in a 250 degrees F oven until slightly dry but still juicy, about 4 hours. Drizzle with olive oil and sprinkle with thyme.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [], "title": "\nOven-Dried Tomatoes\n"}, {"directions": "\n\n              Preheat oven to 250 degrees F. Lay the tomatoes in a single layer on a sheet pan and sprinkle with the salt. Cook the tomatoes for 5 to 6 hours or until dried and slightly shriveled, but still plump. \n            \n\n              If not using immediately, store tomatoes in a sealed container in the refrigerator, for 3 to 4 days; or layered in a container with herbs and covered with olive oil. Store, covered in the refrigerator for up to 2 weeks.\n            \n", "ingredients": [{"food": "plum", "quantity": 2.0}, {"food": "salt", "quantity": 1.5}, {"food": "vegetable oil", "quantity": 1}, {"food": "barley flour or meal", "quantity": 4.0}], "title": "\nOven-Dried Tomatoes\n"}, {"directions": "\n\n              Preheat the oven to 475 degrees F. Set a rack on a foil-lined baking sheet and generously coat the rack with cooking spray.\n            \n\n              Finely grind the cereal and bagel chips in a food processor and transfer to a large resealable plastic bag. Add 3 teaspoons olive oil, the paprika, 2 teaspoons salt, and pepper to taste and toss.\n            \n\n              Whisk 1/2 cup yogurt and the mustard in a shallow bowl. Add the chicken and turn to coat, then transfer to the bag; seal and shake to coat. Place the chicken on the rack and mist with cooking spray.\n            \n\n              Toss the scallions with the remaining 2 teaspoons olive oil and place alongside the chicken. Bake until the chicken is crisp and a thermometer inserted into the thickest part registers 160 degrees F, about 30 minutes.\n            \n\n              Make the dipping sauce: Mix the remaining 1 cup yogurt and harissa to taste in a bowl. Serve the chicken and scallions with the sauce.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "crisped rice bar", "quantity": 1.3333333333333333}, {"food": "potato chips", "quantity": 2.25}, {"food": "vegetable oil", "quantity": 5.0}, {"food": "hot pockets ham cheese stuffed swich", "quantity": 0.75}, {"food": "salt", "quantity": 1}, {"food": "silk plain soy yogurt", "quantity": 1.5}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 1}], "title": "\nOven-Fried Chicken\n"}, {"directions": "\n\n              1. Preheat the oven to 400 degrees F. Set a rack on a foil-lined baking sheet. Coat the rack generously with cooking spray. \n            \n\n              2. Finely grind the cereal and toasts together in a food processor. Transfer crumbs to a large gallon resealable plastic bag. Add the oil, 2 teaspoons salt, 1/2 teaspoon pepper, cayenne, and paprika and toss to mix thoroughly. \n            \n\n              3. Whisk the light mayonnaise and Dijon mustard together in a medium shallow bowl. Add the chicken to the mayonnaise and turn to coat all the pieces evenly. Drop the chicken into the plastic bag, seal and shake until each piece is evenly coated. Place coated pieces on the prepared rack. \n            \n\n              4. Mist the chicken pieces evenly with cooking spray. Bake until the coating crisps and browns and an instant-read thermometer inserted in the thickest part of the pieces registers 160 degrees F, 35 to 40 minutes. Transfer to a platter and serve hot or at room temperature.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "cereal bar", "quantity": 1.3333333333333333}, {"food": "french toast", "quantity": 2.25}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "pepper", "quantity": 0.5}, {"food": "sweet potatoes", "quantity": 0.5}, {"food": "silk light vanilla", "quantity": 0.5}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "diced chicken", "quantity": 4.0}], "title": "\nOven-Fried Chicken\n"}, {"directions": "\n\n              Position racks in the upper and lower thirds of the oven; preheat to 425 degrees F. Line a baking sheet with foil and coat with cooking spray. Combine the cornflakes, 1 tablespoon olive oil and the paprika in a medium bowl; season with salt and pepper. Combine the yogurt, lemon juice, 1 tablespoon water, 1/4 teaspoon salt and a few grinds of pepper in a large bowl; add the chicken and toss to coat.\n            \n\n              Dredge the chicken in the cornflake mixture, pressing to help it adhere. Transfer to the prepared baking sheet; mist with cooking spray. Bake on the upper oven rack until lightly browned, about 15 minutes. Flip the chicken and bake until cooked through, 7 to 10 more minutes.\n            \n\n              Meanwhile, toss the green beans, garlic, scallion whites and the remaining 1 tablespoon olive oil in a bowl; season with salt and pepper. Spread on another baking sheet; bake on the lower oven rack, stirring occasionally, until tender, about 20 minutes. Toss with the lemon zest and scallion greens. Serve with the chicken and honey mustard.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "paprika", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "silk plain soy yogurt", "quantity": 0.5}, {"food": "lemon juice", "quantity": 1.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "fava beans", "quantity": 1.5}, {"food": "garlic powder", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "mustard spinach", "quantity": 1}], "title": "\nOven-Fried Chicken with Green Beans\n"}, {"directions": "\n\n              Preheat the oven to 450 degrees F. Put the potatoes in a saucepan and cover with cold water by 1 inch; season with salt. Bring to a boil; reduce the heat to medium low and simmer until tender, 10 minutes. Drain.\n            \n\n              Combine the buttermilk, mayonnaise and relish in a large bowl. Add the potatoes, sliced celery, scallions, 1/4 teaspoon salt, and pepper to taste; toss. Refrigerate until ready to serve.\n            \n\n              Whisk the egg whites in a large bowl. Put the breadcrumbs in another bowl. Season the fish with the paprika, 1 teaspoon salt and a few grinds of pepper. Dip each piece in the egg whites, then dredge in the breadcrumbs, pressing to coat. Transfer to a rack set over a baking sheet.\n            \n\n              Coat the fish on both sides with cooking spray. Bake until golden brown and just cooked through, about 12 minutes. Top the potato salad with celery leaves. Serve with the fish and lemon wedges.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 3.0}, {"food": "mayonnaise dressing", "quantity": 3.0}, {"food": "pickle relish", "quantity": 4.0}, {"food": "celery seed", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "pepper", "quantity": 1}, {"food": "egg substitute", "quantity": 3.0}, {"food": "", "quantity": 1.5}, {"food": "cod", "quantity": 1.25}, {"food": "paprika", "quantity": 1.0}, {"food": "", "quantity": 1}, {"food": "", "quantity": 1}], "title": "\nOven-Fried Fish with Potato Salad\n"}, {"directions": "\n\n              Preheat the oven to 450 degrees F. Mist a baking sheet with the cooking spray. \n            \n\n              Peel the potatoes and then grate on the large holes of a box grater. Transfer to a fine-mesh sieve and squeeze out as much liquid as possible into a bowl. Let the liquid settle for about 10 minutes, and then pour off the watery liquid, reserving the potato starch. \n            \n\n              Beat the egg white in a large bowl until it holds a soft peak. Gently fold in the potatoes, scallions, reserved potato starch, 1/2 teaspoon salt and 1/4 teaspoon pepper. \n            \n\n              Drop the mixture by tablespoons on the prepared baking sheet, spacing the latkes about 2 inches apart. Gently spread and flatten into 2 1/2-inch rounds. Roast until the bottoms are browned, 8 to 10 minutes. Flip and roast until the potatoes are cooked through and the bottoms are spotted brown, 4 to 6 minutes. \n            \n\n              Serve with the applesauce and sour cream.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1}, {"food": "sweet potatoes", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "", "quantity": 0.25}, {"food": "black bean mango", "quantity": 1}, {"food": "applesauce", "quantity": 0.5}, {"food": "sour cream", "quantity": 0.25}], "title": "\nOven-Fried Latkes\n"}, {"directions": "\n\n              Preheat the oven to 450 degrees F.\n            \n\n              Leaving peel on, cut the potatoes into 6 lengthwise to make long wedges, about 3/4-inch to 1-inch wide. Combine the potatoes, oil, salt and cayenne on the baking sheet and toss to combine. (1 less bowl to wash) Arrange the potatoes on a baking sheet in a single layer, so a cut side is in contact with the pan, but evenly spaced so the potatoes aren't touching each other. Bake until golden brown and cooked through, about 30 minutes. Slip a spatula under the potatoes to turn them over and cook for 5 minutes more.\n            \n\n              Transfer potatoes to a serving dish and serve immediately.\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "salt", "quantity": 2.0}, {"food": "", "quantity": 1}], "title": "\nOven-Fried Potatoes\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Whisk the buttermilk, mayonnaise, half of the thyme, 1 teaspoon paprika, the onion and garlic powders, cayenne and 1 teaspoon salt in a large bowl. Add the chicken and toss to coat; cover and refrigerate at least 3 hours or overnight. \n            \n\n              Position racks in the upper and lower thirds of the oven and preheat the oven to 400 degrees F. Line 2 baking sheets with aluminum foil and set a wire rack on each; coat the racks with cooking spray. Combine the breadcrumbs, chives, the remaining thyme and 1/2 teaspoon paprika, 1 teaspoon salt and 1/2 teaspoon black pepper in a shallow bowl. \n            \n\n              Remove the chicken from the marinade and dredge in the breadcrumb mixture, pressing to adhere. Put the white meat on one wire rack and the dark meat on the other rack, skin-side up. Coat the chicken with cooking spray. Transfer to the oven, placing the dark meat on the bottom oven rack; bake until the crust is golden and a thermometer inserted into the thickest part of the meat registers 165 degrees F, 50 to 55 minutes. Let cool slightly on the wire racks, 10 minutes. Season with salt.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "pillsbury golden layer buttermilk biscuits", "quantity": 1.0}, {"food": "mayonnaise dressing", "quantity": 0.5}, {"food": "chrysanthemum leaves", "quantity": 4.0}, {"food": "paprika", "quantity": 1.5}, {"food": "onion powder", "quantity": 0.75}, {"food": "garlic powder", "quantity": 0.75}, {"food": "pepper", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 2.0}, {"food": "", "quantity": 1}, {"food": "", "quantity": 3.5}, {"food": "chives", "quantity": 0.3333333333333333}, {"food": "black bean mango", "quantity": 1}], "title": "\nOven-Fried Ranch Chicken\n"}, {"directions": "\n\n              Place 2 baking sheets in the oven and preheat to 425 degrees F.\n            \n\n              Cut all the vegetables into 1 1/2-inch pieces. Cut the onions through the base core to keep some of the layers in chunky pieces. Toss all the vegetables with garlic, olive oil and salt in large bowl. Season generously with pepper.\n            \n\n              Carefully remove the heated baking sheets from the oven, brush or drizzle with olive oil. Divide the vegetables evenly between the 2 pans, spreading them out to assure they don't steam while roasting. Roast the vegetables until tender and golden brown, stirring occasionally, about 45 minutes to 1 hour.\n            \n", "ingredients": [{"food": "", "quantity": 1.0}, {"food": "", "quantity": 3.0}, {"food": "beets", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "parsnips", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "salt", "quantity": 1.5}, {"food": "black bean mango", "quantity": 1}], "title": "\nOven-Roasted Root Vegetables\n"}, {"directions": "\n\n              In a large bowl, mix together the oil, chili powder, paprika, sage, mustard, ginger, and cayenne until a paste is formed.\n            \n\n              Add the chicken pieces and rub the spice paste all over, including under the skin. Cover with plastic wrap and refrigerate for 2 hours.\n            \n\n              Preheat the broiler. Place a rack about 9 inches from the broiler element. Place the chicken on a foil-lined baking sheet or broiler pan. Season the chicken all over with salt and pepper and arrange skin-side down. Broil for 10 minutes, turning the pan occasionally so the meat cooks evenly. Remove the pan from the oven and baste the meat all over with the sauce, turn the chicken pieces skin side-up and broil, basting and turning the pan occasionally, until cooked through and crispy and the sauce has browned lightly, about 10 minutes more. Transfer to a serving platter and serve immediately.\n            \n\nQUICK BARBEQUE SAUCE\n\n\n              Heat the oil in a medium saucepan over medium-high heat. Add the onion and cook, stirring, until lightly browned, about 4 minutes. Add the garlic and crushed pepper and cook, stirring frequently, until fragrant, about 45 seconds. Add the tomato paste and cook, stirring, until lightly browned, about 1 minute more.\n            \n\n              Add the tomatoes, vinegar, sugar, and salt and bring to a boil. Lower the heat, and simmer, uncovered, stirring occasionally, until deep red in color and reduced to about 4 cups, about 25 minutes. Season with pepper. Use now, or store, covered in the refrigerator for up to 3 days or freeze for up to 1 month.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "chili powder", "quantity": 1.0}, {"food": "paprika", "quantity": 0.75}, {"food": "sage", "quantity": 0.75}, {"food": "mustard spinach", "quantity": 0.5}, {"food": "ginger", "quantity": 0.5}, {"food": "hearts of palm", "quantity": 1}, {"food": "fat free chicken breast ", "quantity": 3.5}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "garlic powder", "quantity": 6.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "salt", "quantity": 1.5}, {"food": "black bean mango", "quantity": 1}], "title": "\nOven-Style Barbequed Chicken\n"}, {"directions": "\n\n              Preheat the oven to 300 degrees F. In large bowl, mix together the pork butt and sauce. Transfer the pork mixture to an 8- by 8- by 2 -inch pan. Cover tightly with foil and bake until very hot, about 1 hour. Divide the mixture on the hamburger buns and serve immediately.\n            \n\nSLOW-ROASTED PORK SHOULDER\n\n\n              Preheat the oven to 275 degrees F.\n            \n\n              In a food processor, combine the peppercorns, garlic, and cloves and puree. While the motor is running, drizzle in the oil until a paste is formed. Using a rubber spatula, scrap the garlic paste into a small bowl.\n            \n\n              Place the pork butt on a work surface and season all over generously with salt. Rub all over with the garlic paste. Place in an oven-safe roasting bag and close with a twist tie. Place in a large roasting pan, and cook until tender, about 5 hours.\n            \n\n              Remove roast from the oven. Slip the oven-roasting bag off the meat and discard. Transfer the cooking liquid to a medium saucepan. Skim the fat from the cooking liquid with a ladle or de-greaser. Bring to a boil, lower the heat, and simmer to thicken the juices slightly.\n            \n\n              Raise the oven to 400 degrees F. Return the pork, in the roasting pan, to the oven. Continue roasting, basting frequently with the simmering cooking liquid, until well-browned, about 30 minutes. If there is any cooking liquid left, pour it over the pork.\n            \n\n              Remove pork from the oven and let it rest at room temperature for 10 minutes. With the pork drippings you may make a vinegar sauce using this formula: for every 1/2 cup of drippings, whisk with 3 tablespoons vinegar and 1/4 teaspoon salt. Either carve the pork into thin slices, or, using 2 forks, pull into small pieces. Serve with the vinegar sauce on the side.\n            \n\nQUICK BARBEQUE SAUCE\n\n\n              Heat the oil in a medium saucepan over medium-high heat. Add the onion and cook, stirring, until lightly browned, about 4 minutes. Add the garlic and crushed pepper and cook, stirring frequently, until fragrant, about 45 seconds. Add the tomato paste and cook, stirring, until lightly browned, about 1 minute more.\n            \n\n              Add the tomatoes, vinegar, sugar, and salt and bring to a boil. Lower the heat, and simmer, uncovered, stirring occasionally, until deep red in color and reduced to about 4 cups, about 25 minutes. Season with pepper to taste. Use now, or store, covered in the refrigerator for up to 3 days or freeze for up to 1 month.\n            \n", "ingredients": [{"food": "", "quantity": 6.0}, {"food": "", "quantity": 2.25}, {"food": "salt", "quantity": 1}, {"food": "cinnamon buns", "quantity": 6.0}, {"food": "black bean mango", "quantity": 2.0}, {"food": "garlic powder", "quantity": 25.0}, {"food": "cloves", "quantity": 10.0}, {"food": "vegetable oil", "quantity": 0.75}, {"food": "pork skins", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "vinegar", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "garlic powder", "quantity": 6.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "salt", "quantity": 1.5}, {"food": "black bean mango", "quantity": 1}], "title": "\nOven-Style Pulled Pork Sandwich\n"}, {"directions": "\n\n              Preheat the oven to 250 degrees F.\n            \n\n              Toss the tomatoes in bowl with the olive oil. Arrange the tomatoes, cut side up, in a single layer on a parchment or foil-lined baking sheet. Sprinkle with the salt and the crab boil seasoning or celery salt. Bake until slightly shriveled but still plump, 5 to 6 hours.\n            \n\n              If not using immediately, refrigerate the dried tomatoes in a sealed container for up to 4 days.\n            \n", "ingredients": [{"food": "plum", "quantity": 12.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "salt", "quantity": 1.5}, {"food": "salt", "quantity": 1}], "title": "\nOven-dried Tomato Snacks\n"}, {"directions": "\n\n              Beat 1 1/4 cups granulated sugar and 1 stick butter until fluffy, then beat in 1 egg and 1 teaspoon vanilla. Whisk 1 1/2 cups flour, 1/2 cup Dutch-process cocoa powder, 3/4 teaspoon salt and 1/4 teaspoon baking powder; stir into the butter mixture. Chill 30 minutes, then roll out to 1/8 inch thick and cut into moon shapes. Bake 8 to 12 minutes at 350 degrees. Beat 1 cup creamy peanut butter, 6 tablespoons butter and 3/4 cup confectioners' sugar until smooth, then sandwich between cooled cookies.\n            \n", "ingredients": [], "title": "\nOver the Moons\n"}, {"directions": "\nSpecial equipment: a 9-inch springform pan and a wooden skewer\n\n              Position a rack in the middle of the oven and preheat to 325 degrees F.\n            \n\n              For the crust: Pulse the cookies and sugar in a food processor to fine crumbs. Add the butter and pulse until the mixture holds together when squeezed. Firmly press the crumb mixture into the bottom and 1 inch up the side of a 9-inch springform pan. Bake until crisp and set, 10 to 12 minutes. Let cool completely, about 30 minutes. Cover the crust with the peanut butter cups. Wrap the bottom and sides of the pan with a large piece of foil and put it in a large roasting pan.\n            \n\n              For the filling: Beat the cream cheese and sugar with an electric mixer on medium speed in a large bowl for 1 minute. Add the sour cream and beat until just combined. Mix in the eggs by hand, one at time. Mix in the vanilla by hand until just combined. (Take care not to overmix, or the cheesecake will puff up and crack.)\n            \n\n              Put the chocolate chips and peanut butter in 2 separate large microwave-safe bowls. Microwave each in 30 second intervals, stirring between each, until the chips and peanut butter are smooth and pourable, about 2 minutes.\n            \n\n              Ladle 2 cups of the cheesecake batter into the bowl with the chocolate and fold until combined. Fold the remaining cheesecake batter into the bowl with the peanut butter until combined.\n            \n\n              Use an ice cream scoop or large spoon and drop alternating scoopfuls of the batter onto the crust. Drag a long wooden skewer through the batter, making sure the skewer reaches the bottom, to marble the colors in a tie-dye effect. Add enough hot water to the roasting pan to come about halfway up the side of the springform pan.\n            \n\n              Bake until the outside of the cake is set, but the center is still slightly loose, about 1 hour 20 minutes. Turn the oven off and leave the cheesecake in the oven for another hour. Remove the cheesecake from the roasting pan to a cooling rack. Run a knife around the edge and cool to room temperature. Cover and refrigerate at least 8 hours.\n            \n\n              Run a knife around the edge of the pan once more, unmold the cheesecake and transfer to a serving plate or cake stand. Smooth the edges with the knife. Drizzle the hot fudge sauce around the edge of the cake, letting it drip slightly over the sides. Make a decorative ring around the edge of the cheesecake with the miniature peanut butter cups, overlapping them slightly. Make another ring on the inside of the peanut butter cups with the Reese's Pieces. Slice and serve cold with whipped cream and more hot fudge sauce.\n            \n", "ingredients": [{"food": "chocolate chip cookies", "quantity": 9.0}, {"food": "sugar", "quantity": 0.25}, {"food": "butter oil", "quantity": 1.0}, {"food": "meat drippings ", "quantity": 14.0}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "sugar", "quantity": 1.0}, {"food": "sour cream", "quantity": 1.0}, {"food": "eggs", "quantity": 4.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 4.0}, {"food": "peanut butter ", "quantity": 0.5}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "meat drippings ", "quantity": 15.0}, {"food": "meat drippings ", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1}], "title": "\nOver-the-Top Reese's Cheesecake\n"}, {"directions": "\n\n              The night before, combine the milk, oats, blueberries, brown sugar, lemon zest, vanilla, almond extract and a pinch of salt in a glass pint jar or other container with a lid. Secure the lid and shake. Refrigerate at least 6 hours up to overnight. In the morning, top with the almonds and drizzle with honey.\n            \n", "ingredients": [{"food": "milk", "quantity": 0.75}, {"food": "oats", "quantity": 0.5}, {"food": "blueberries", "quantity": 0.3333333333333333}, {"food": "sugar", "quantity": 1.0}, {"food": "lemon juice", "quantity": 0.25}, {"food": "vanilla extract", "quantity": 0.125}, {"food": "vanilla extract", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "tamarind nectar", "quantity": 2.0}], "title": "\nOvernight Oats: No-Cook Blueberry-Almond Oatmeal\n"}, {"directions": "\n\n              For the eyes: Place the malt balls cut side up on the work surface. Attach a white sprinkle to each ball using a skewer dipped in the buttercream to adhere. Add a mini chocolate chip as a pupil to each white sprinkle using more buttercream. Set aside.\n            \n\n              For the ears: Unwrap the caramels and press with fingers to flatten. Warm the candies in the microwave for 5 to 10 seconds if they are too hard to flatten at room temperature. Cut each caramel into 2 little triangles with scissors. Coat each triangle with frosting on one side and cover with chocolate sprinkles. Set aside.\n            \n\n              For the beaks: Place the small yellow gumdrops on the work surface standing upright. Snip each gumdrop with scissors straight down three-quarters of the way through the candy to make the open mouth. Snip to narrow the overall size and shape into a tapered beak.\n            \n\n              To assemble: Frost each cupcake with about 2 tablespoons buttercream. Place the chocolate sprinkles in a small bowl. Invert each cupcake into the sprinkles and press gently to adhere. Attach the eyes and beak by applying small dollops of additional frosting and pressing gently. Push the ears into the edges of the cupcake. Repeat steps for all cupcakes.\n            \n", "ingredients": [{"food": "malt beverage", "quantity": 12.0}, {"food": "martha white foods", "quantity": 24.0}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 24.0}, {"food": "", "quantity": 12.0}, {"food": "baking chocolate", "quantity": 34.0}, {"food": "yellow rice", "quantity": 12.0}, {"food": "baking chocolate", "quantity": 12.0}], "title": "\nOwl Cupcakes\n"}, {"directions": "\n\n              1. Sprinkle the oxtails with salt and pepper. In a Dutch oven over medium-high heat, brown the oxtails on both sides, 4 minutes each side. Remove the oxtails to a plate and reserve. \n            \n\n              2. Cook the onions and garlic in the Dutch oven for 2 minutes. Add the tomato paste, juniper, and allspice and cook 2 minutes more. Put the oxtails back into the pan and add the stock and enough water to cover. Bring to a boil, then reduce to a simmer and cook for 1 hour, occasionally skimming the fat from the surface. \n            \n\n              3. Add the potatoes and celery root and continue to cook until the meat is tender, another 1 1/2 hours. Skim the fat from the surface.\n            \n", "ingredients": [{"food": "", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "pasta with tomato sauce", "quantity": 3.0}, {"food": "goji berries", "quantity": 20.0}, {"food": "allspice", "quantity": 20.0}, {"food": "frankfurter beef", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 2.0}, {"food": "lotus root", "quantity": 1.0}], "title": "\nOxtail Stew\n"}, {"directions": "\n\n              Put the oysters in a strainer over a medium bowl to catch their liquor. Reserve 3/4 cup of the oyster liquor. In a large bowl, combine the crumbled cornbread and oysters.\n            \n\n              Bring a small saucepan of water to a boil. Add the bacon and cook for 1 minute. Drain and pat dry with a paper towel.\n            \n\n              Melt 1/2 cup of the butter in a large skillet over medium-high heat. When the foaming subsides, add the bacon, shallot, celery, salt, and season with pepper, to taste. Cook, stirring, until soft, about 10 minutes. Add the parsley, thyme, reserved oyster liquor, and vermouth and bring to a boil. Transfer the shallot-herb mixture to the cornbread and oysters and stir to combine. Set aside for 10 minutes. Preheat the oven to 400 degrees F.\n            \n\n              Transfer the cornbread mixture to a buttered 1-quart gratin dish, dot with the remaining butter, and bake until browned and crusty, about 1 hour.\n            \n\n              Remove from the oven and serve immediately.\n            \n\nCornbread for Stuffing:\n\n\n              Butter a 3 1/4 x 5 3/4 x 2-inch loaf pan. Preheat the oven to 400 degrees F. In a large bowl, whisk together the cornmeal, flour, baking powder, sugar, and salt.\n            \n\n              In a medium bowl, whisk the egg and combine with the milk. Pour the milk mixture into the cornmeal mixture and mix lightly with a rubber spatula until a thick batter is formed. Stir in the melted butter until just incorporated.\n            \n\n              Spoon the batter into the prepared pan. Bake until lightly browned and a toothpick inserted in the center comes out clean, about 30 minutes. Let cool.\n            \n\n              Yield: 1 small loaf of cornbread\n            \n", "ingredients": [{"food": "", "quantity": 20.0}, {"food": "", "quantity": 3.0}, {"food": "bacon", "quantity": 3.25}, {"food": "butter oil", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "salt", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "parsley", "quantity": 3.0}, {"food": "thyme", "quantity": 1.0}, {"food": "martha white foods", "quantity": 2.0}, {"food": "cornmeal", "quantity": 1.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.5}, {"food": "sugar", "quantity": 1.0}, {"food": "salt", "quantity": 0.25}, {"food": "egg substitute", "quantity": 1.0}, {"food": "whole milk", "quantity": 0.5}, {"food": "butter oil", "quantity": 2.0}], "title": "\nOyster Stuffing\n"}]