[{"directions": "\n\n              Position racks in the upper and lower thirds of the oven; preheat to 350 degrees F. Spread the oats on a baking sheet and bake on the top rack, stirring occasionally, until lightly browned and toasted, 8 to 10 minutes; let cool completely.\n            \n\n              Whisk the flour, baking soda and salt in a small bowl. Beat the butter, brown sugar and granulated sugar in a large bowl with a mixer on medium-high speed until light and fluffy, about 3 minutes. Beat in the peanut butter until smooth, then beat in the eggs and vanilla. Reduce the mixer speed to low and beat in the flour mixture until incorporated. Stir in the oats and 1 1/2 cups chocolate chips with a rubber spatula until combined.\n            \n\n              Line 2 baking sheets with parchment paper. Drop mounds of dough (about 2 tablespoons each) about 1 1/2 inches apart onto the prepared baking sheets. Flatten to about 1/2 inch thick with your fingers. Bake, switching the pans halfway through, until the edges of the cookies are set but the centers are still soft, about 18 minutes. Let cool 5 minutes on the baking sheets, then transfer to racks to cool completely.\n            \n\n              Put the remaining 1/2 cup chocolate chips in a microwave-save bowl. Microwave in 30-second intervals, stirring, until smooth. Drizzle on the cookies. Let set, 15 minutes.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "oats", "quantity": 1.0}, {"food": "potato flour", "quantity": 1.25}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "sugar", "quantity": 0.5}, {"food": "peanut butter ", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 2.0}], "title": "\nPB Oatmeal-Chocolate Chip Cookies\n"}, {"directions": "\n\n              tBeat the peanut butter, cream cheese, confectioners' sugar, vanilla and 1/2 cup cream in a large bowl with a mixer on medium speed until smooth and fluffy, 3 to 4 minutes. Add the remaining 1/2 cup cream and beat until creamy, about 2 more minutes. (Do not overbeat.)\n            \n\n              Whisk the jam, framboise and 1/3 cup water in a bowl until smooth. Spread about 3 tablespoons of the jam mixture in a 9-by-5-inch glass loaf pan. Cover with half of the ladyfingers, arranging them lengthwise. Brush with half of the remaining jam mixture. (Don't worry if it looks like a lot of liquid; the ladyfingers will absorb it as the tiramisu sits.)\n            \n\n              Spread half of the peanut butter cream over the ladyfingers. Top with 2 cups raspberries and the remaining ladyfingers. Brush the ladyfingers with the remaining jam mixture and spread the remaining peanut butter cream on top. Cover with plastic wrap and refrigerate at least 8 hours.\n            \n\n              Uncover the tiramisu and top with the remaining 2 cups raspberries and shaved chocolate. Dust with confectioners' sugar.\n            \n\n              Photograph by Kana Okada\n            \n", "ingredients": [{"food": "peanut butter ", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "sugar", "quantity": 1.25}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "silk raspberry soy yogurt", "quantity": 0.5}, {"food": "silk raspberry soy yogurt", "quantity": 0.3333333333333333}, {"food": "", "quantity": 14.0}, {"food": "raspberries", "quantity": 4.0}, {"food": "baking chocolate", "quantity": 1}], "title": "\nPB&J Tiramisu\n"}, {"directions": "\n\n              Break graham crackers into squares. Spread half of the squares with peanut butter and the other half with raspberry jam. Sandwich with black raspberry ice cream.\n            \n\n              Photograph by Jonathan Kantor\n            \n", "ingredients": [], "title": "\nPBandJ'S\n"}, {"directions": "\n\n              Toppings: Flaked grilled salmon, sauteed wild mushrooms, and chopped parsley and chives\n            \n\n              How to Make Classic Potato Skins:\n            \n\n              Pierce 4 large russet potatoes with a fork. Bake directly on the oven rack at 350 degrees until tender, about 1 hour. Let cool, then quarter lengthwise and scoop out the flesh, leaving a 1/4-inch shell. Brush both sides with melted butter and season with salt and pepper. Bake, skin-side up, at 450 degrees until crisp, about 15 minutes. Add your favorite team toppings. (For cheesy skins, flip the baked shells over before topping, sprinkle with 1 cup grated cheddar cheese and bake an extra 5 minutes.)\n            \n\n              Photograph by Karl Juengel/Studio D\n            \n", "ingredients": [], "title": "\nPacific Salmon Potato Skins\n"}, {"directions": "\n\n              Bake the sweet potato fries as the label directs. \n            \n\n              Meanwhile, cook the bacon in a skillet over medium heat until crisp, about 8 minutes; remove with a slotted spoon and drain on paper towels. Remove the skillet from the heat and add the brown sugar, fish sauce, chile sauce, lime juice and lime zest to the drippings. Stir until the sugar dissolves. \n            \n\n              Transfer the fries to a serving dish. Drizzle with the chile sauce mixture, then sprinkle with the bacon, cilantro and fried onions. \n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [{"food": "sweet potato puffs", "quantity": 1.0}, {"food": "bacon", "quantity": 3.0}, {"food": "sugar", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "lime juice", "quantity": 1.5}, {"food": "lime", "quantity": 0.5}, {"food": "", "quantity": 2.0}, {"food": "fried chicken", "quantity": 1}], "title": "\nPad Fry\n"}, {"directions": "\n\n              Soak the rice noodles in a bowl of warm water until pliable but not too soft, about 30 minutes. Drain.\n            \n\n              Run a vegetable peeler along the length of the carrot and zucchini to create noodle-like ribbons. Keep the two separate and set aside.\n            \n\n              Mix together the fish sauce, lime juice, sugar, oyster sauce and Sriracha in a small bowl. Remove 1 teaspoon of the sauce and toss with the shrimp, let sit at room temperature.\n            \n\n              Heat 1 teaspoon of the oil in a large nonstick skillet over medium-high heat. Scatter the shrimp in one layer in the skillet. Sear for 1 minute, then remove to a plate.\n            \n\n              Add the remaining tablespoon of oil to the skillet over medium-high heat. Add the garlic, red pepper slices, carrot ribbons and soaked noodles; stir-fry for 30 seconds. Add the sauce and 1/2 cup water; stir until the noodles have softened, 1 to 2 minutes. Add the zucchini ribbons, bean sprouts, scallions and reserved shrimp. Stir-fry for another minute. If the noodles look too dry, add a little more water.\n            \n\n              Divide evenly among four plates. Sprinkle with peanuts. Serve with lime wedges, Sriracha and fish sauce on the side.\n            \n", "ingredients": [{"food": "rice noodles", "quantity": 8.0}, {"food": "carrot juice", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "lime juice", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 1.5}, {"food": "", "quantity": 0.5}, {"food": "shrimp", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "brussels sprouts", "quantity": 2.0}, {"food": "", "quantity": 3.0}, {"food": "peanuts", "quantity": 2.0}], "title": "\nPad Thai\n"}, {"directions": "\nSpecial equipment: cheesecloth\n\n              Make paneer: Line a colander with a triple-layer of dampened cheesecloth, leaving a 2- to 3-inch overhang. Place the colander in the sink. Heat the milk in a large non-reactive saucepan over medium heat, stirring frequently to make sure the milk doesn't scorch on the bottom, until the milk comes to a simmer. Turn off the heat and gently stir in 3 tablespoons lemon juice. The milk should start separating into solid curds and a yellowish watery whey. If it doesn't, add a little more lemon juice. Let sit for about 5 minutes in the pot to continue separating, then gently pour into the cheesecloth-lined colander. (If the curds are still very small after 5 minutes then reheat the milk mixture over medium heat and simmer to increase the curd separation).\n            \n\n              Rinse briefly with cold water to remove any lemon flavor. Gather up the sides of the cheesecloth, twist into a ball, and squeeze to wring out as much liquid as possible. Open up the cheesecloth, and mix 1/4 teaspoon salt evenly into the cheese curds. Squeeze into a ball again and wring out any remaining moisture. Flatten the cheesecloth ball into a 3/4-inch thick disc and place on a plate. Weigh down with another plate topped with a heavy item such as a large can. Refrigerate for at least 1 hour and up to overnight, then carefully cut the paneer into 3/4-inch cubes.\n            \n\n              Meanwhile, bring a large pot of generously salted water to a boil. Have a large bowl of ice water nearby. In batches, blanch the spinach for about 1 minute in the boiling water and quickly transfer with a spider or slotted spoon to the ice water. Drain the cooked spinach. Place all of it in a blender and puree until mostly but not completely smooth. Reserve.\n            \n\n              Rinse the blender carafe and puree the tomatoes; reserve. Rinse the carafe again and puree the garlic and ginger with 1/4 cup water; reserve.\n            \n\n              Line a plate with paper towels. Heat 2 tablespoons ghee in a large nonstick skillet over medium to medium-high heat. Add the paneer cubes and brown well on 2 to 3 sides, about 5 minutes total. Remove to the lined plate and reserve.\n            \n\n              Add another 2 tablespoons ghee to the skillet over medium-high heat. Add the cumin seeds and stir until the seeds start to darken and smell toasted, 10 to 30 seconds. Add the serrano chile, onion, and 1/2 teaspoon salt. Cook until the onion is dark brown and soft, about 10 minutes. Turn down the heat if the onion starts to burn.\n            \n\n              Add the ginger-garlic paste, turmeric, cayenne, and half the garam masala. Stir for about 2 minutes, then add the tomato puree, stirring continuously, until the mixture starts to look dry, about 6 minutes. Add the spinach puree, sugar, 1/4 cup water, 1 1/2 teaspoons salt and the remaining garam masala. (The mixture will be quite thick.) Simmer for 8 minutes, then stir in the heavy cream and remaining 2 tablespoons ghee. Fold in the browned paneer cubes and simmer to warm the paneer through and to thicken the heavy cream, an additional 4 minutes.\n            \n\n              Serve with steamed basmati rice or Indian flatbread and lemon wedges on the side.\n            \n", "ingredients": [{"food": "whole milk", "quantity": 8.0}, {"food": "lemon juice", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "garlic powder", "quantity": 6.0}, {"food": "ginger", "quantity": 2.0}, {"food": "", "quantity": 6.0}, {"food": "seeds", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "turmeric", "quantity": 0.5}, {"food": "", "quantity": 0.25}, {"food": "", "quantity": 2.0}, {"food": "sugar", "quantity": 0.5}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "", "quantity": 1}, {"food": "crisped rice bar", "quantity": 1}], "title": "\nPalak Paneer\n"}, {"directions": "\n\n              Heat the sugar, ginger and 1/2 cup water in a small sauce pan over medium-high heat. Bring to a boil, and stir to melt the sugar. Remove from the heat and allow to steep and cool for 15 minutes, then strain (should make about 3/4 cup). Reserve the unused ginger syrup for another use. \n            \n\n              Mix 1/4 cup of the syrup with the lemon juice in a large liquid measuring cup. Add the club soda. Divide between two chilled beer chalices. Pour half of the beer into each glass. Garnish each with a lemon slice and serve.\n            \n\n              Copyright 2013 Television Food Network, G.P. All rights reserved\n            \n\n              From Food Network Kitchens\n            \n", "ingredients": [{"food": "sugar", "quantity": 0.5}, {"food": "ginger", "quantity": 2.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "", "quantity": 4.0}, {"food": "", "quantity": 12.0}, {"food": "luncheon slices", "quantity": 2.0}], "title": "\nPale Ginger Shandy\n"}, {"directions": "\n\n              Fill 4 tall glasses three-quarters of the way with ice. Pour 1/2 teaspoon grenadine into each glass. Combine 1 cup tequila, 1 cup grapefruit juice, 1/4 cup fresh lime juice, 2 teaspoons superfine sugar and a pinch of salt in a cocktail shaker. Shake well, then pour into the glasses. Top each drink with 1/4 cup grapefruit soda.\n            \n", "ingredients": [{"food": "", "quantity": 1}], "title": "\nPaloma Margaritas\n"}, {"directions": "\n\n              1. Bring salmon to room temperature 10 minutes before cooking. Toast sesame seeds in a small, dry skillet over medium heat, stirring and tossing, until fragrant and golden, about 4 minutes. Pour into a small bowl and cool. \n            \n\n              2. Place cucumber, radishes, and jalapeno in a medium bowl. Finely grate ginger into bowl. Add 1 tablespoon oil, toasted sesame seeds, vinegar, sugar, 1 teaspoon salt, and sesame oil. Toss and set aside. \n            \n\n              3. Heat a large skillet over medium-low heat. Season salmon with salt and pepper. Add remaining 1 tablespoon vegetable oil to pan; Increase heat to medium high. Place salmon, skin side up, in pan. Cook, without moving, until golden brown, about 4 minutes. Turn fillets over using a metal spatula and cook until firm to touch, about 3 more minutes. Transfer to plates or a platter and serve warm with cucumber salad.\n            \n", "ingredients": [{"food": "pasta with tomato sauce", "quantity": 4.0}, {"food": "sesame seeds", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "", "quantity": 0.5}, {"food": "ginger", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "sugar", "quantity": 1}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.25}], "title": "\nPan Fried Salmon with Cucumber Radish Salad\n"}, {"directions": "\n\n              Sprinkle the chicken liberally with salt and pepper. Heat the canola oil in a large, ovenproof high-sided skillet over medium-high heat until it shimmers. Sear the chicken, skin-side down, until golden brown, 3 to 4 minutes. Then flip and brown the other side, 3 to 4 minutes. You may need to do this in two batches to avoid crowding the skillet. Transfer the browned chicken and any juices to a baking sheet or large plate.\n            \n\n              Lower the heat to medium and add the garlic, 1 cup of the grapes, the olives, capers, oregano, wine and 1/2 cup water. Stir to combine and cook until the liquid has reduced by half, 6 to 8 minutes. Stir in the butter. Add the chicken and any juices back to the skillet, skin-side-up. Sprinkle the remaining grapes around the chicken. Continue cooking over medium heat until the internal temperature reaches 160 degrees F, 6 to 8 minutes.\n            \n\n              Set the oven to broil with a rack set about 4 inches from the broiler.\n            \n\n              Place the skillet underneath the broiler to crisp the chicken skin, about 2 minutes. Watch carefully to avoid burning.\n            \n\n              To serve, divide the warm couscous among 4 plates and top each plate with 2 of the chicken thighs and a large spoonful of the sauce.\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 8.0}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "ruby red grapefruit juice blend", "quantity": 2.0}, {"food": "olives", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "martha white foods", "quantity": 1.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "couscous", "quantity": 2.0}], "title": "\nPan Roasted Chicken Thighs with Grapes and Olives\n"}, {"directions": "\n\n              Preheat the oven to 450 degrees F. A half-hour before cooking, remove steak from refrigerator. \n            \n\n              Heat a large skillet over high heat. Pat steak dry and season generously with salt and pepper. Add oil to hot skillet and when it begins to smoke add steak. Reduce heat slightly and cook steak until browned, about 4 minutes on each side. Transfer skillet to the oven. Roast until an instant-read thermometer inserted sideways into the steak registers 120 degrees F for medium-rare, about 6 to 8 minutes. Transfer steak to a cutting board and let it rest for 10 minutes. Cut steak from the bone and carve meat across the grain. \n            \n", "ingredients": [{"food": "", "quantity": 1.5}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}], "title": "\nPan Seared T-Bone Steak\n"}, {"directions": "\n\n              Prepare the slaw: Whisk the mayonnaise, vinegar, mustard, sugar, caraway seeds, 1 1/2 teaspoons salt, and pepper to taste in a large bowl. Toss in the cabbage, carrot, apple and scallions; cover and refrigerate.\n            \n\n              Prepare the fish: Whisk the egg and milk in a medium bowl; add the cod and set aside to soak. Mix the flour, cracker meal, cayenne pepper and a pinch of salt on a plate.\n            \n\n              Heat 1 inch of oil in a heavy-bottomed skillet over medium-high heat. Remove the fish from the milk mixture and dredge in the flour mixture, turning to coat. Fry in the hot oil until golden, 2 to 4 minutes per side. Transfer to a paper-towel-lined plate to drain; season with salt and pepper. Serve with the slaw and extra mustard.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "mayonnaise dressing", "quantity": 0.5}, {"food": "vinegar", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "celery seed", "quantity": 0.75}, {"food": "salt", "quantity": 1}, {"food": "swamp cabbage", "quantity": 0.5}, {"food": "carrot juice", "quantity": 1.0}, {"food": "apple", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "milk", "quantity": 0.5}, {"food": "fish oil", "quantity": 4.0}, {"food": "potato flour", "quantity": 0.3333333333333333}, {"food": "barley flour or meal", "quantity": 0.3333333333333333}, {"food": "pepper", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1}], "title": "\nPan-Fried Cod with Slaw\n"}, {"directions": "\n\n              Put the potatoes in a medium saucepan and cover with water by 1 inch; season with salt. Bring to a boil, then reduce the heat and simmer until tender, about 5 minutes. Drain.\n            \n\n              Whisk the sour cream, milk, chives, dill and vinegar in a large bowl. Add the potatoes and cucumber; gently fold to coat. Season with salt and pepper. Set aside.\n            \n\n              Mix the flour, 1/2 teaspoon salt and 1/4 teaspoon pepper in a medium bowl. Gently whisk the eggs in another medium bowl. Heat the olive oil in a large nonstick skillet over medium-high heat. Dredge the fish in the flour, shaking off the excess, then dip in the eggs. Add to the skillet and cook until golden and cooked through, about 4 minutes per side. Serve with the potato salad.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "sour cream", "quantity": 0.5}, {"food": "milk", "quantity": 0.25}, {"food": "chives", "quantity": 3.0}, {"food": "dill seed", "quantity": 3.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "potato flour", "quantity": 0.25}, {"food": "eggs", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "barley flour or meal", "quantity": 4.0}], "title": "\nPan-Fried Hake with Dill Potato Salad\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Bring the salmon to room temperature 10 minutes before cooking. \n            \n\n              Warm a large nonstick skillet with oil over medium-low heat. Season the fish with salt and pepper. Raise the heat to medium-high. Place the salmon, skin-side up in the pan. Cook until golden brown on 1 side, about 4 minutes. Turn the fish over with a spatula, and cook until it feels firm to the touch and the skin is crisp if desired, about 3 minutes more. \n            \n\n              The skin can be served or removed easily with a knife or spoon. \n            \n\n              Transfer to a plate and serve as desired.\n            \n", "ingredients": [{"food": "barley flour or meal", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nPan-Fried Salmon\n"}, {"directions": "\n\n              About 1/2 hour before cooking the steak, bring it to room temperature.\n            \n\n              Preheat a large cast iron skillet over medium heat. Lightly brush the steak all over with oil and season generously with salt and pepper. Raise the heat to high, add the steak and cook, turning once, until well browned, about 7 minutes for the first side, and 4 minutes on the second side, for medium-rare. Hold the steak with tongs and sear the edges. (An instant-read thermometer inserted perpendicularly into the steak registers 125 degrees F for medium rare.)\n            \n\n              Transfer the steak to cutting board and cover loosely with foil. Let rest for 5 minutes.\n            \n\n              Cut the tenderloin and strip from the bone, and slice against the grain. Transfer to a serving platter and serve au natural, with mustard, compound butter, or horseradish sauce.\n            \n", "ingredients": [{"food": "", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "", "quantity": 1}], "title": "\nPan-Fried T-Bone Steak\n"}, {"directions": "\n\n              Heat a grill pan over medium-high heat. Remove the tenderloins from the chicken breast and set aside for another use. Brush the chicken lightly with oil, then season the skin with salt and pepper. Place the chicken on the grill skin-side down, and cook until the edges turn opaque, about 6 minutes. (To get nifty cross-hatch grill marks, about half way through cooking reposition the breast about 45 degrees from their original position.) Season with salt and pepper, and turn chicken over, and cook until firm to the touch, about 6 more minutes.\n            \n\n              While the chicken cooks, make the gremolata: Chop the garlic, add the salt, and continue chopping to make a paste. In a small bowl, stir the garlic together with the lemon zest, parsley and olive oil Season with pepper, to taste.\n            \n\n              Slice the breasts, against the grain and serve with the gremolata.\n            \n", "ingredients": [{"food": "fat free chicken breast ", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "black bean mango", "quantity": 1}, {"food": "garlic powder", "quantity": 1.0}, {"food": "salt", "quantity": 0.25}, {"food": "lemon juice", "quantity": 1.0}, {"food": "parsley", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "pepper", "quantity": 1}], "title": "\nPan-Grilled Chicken with Gremolata\n"}, {"directions": "\n\n              To make the marinade: whisk the lemon juice, mustard, rosemary, garlic, and 1 teaspoon of the salt together in a medium bowl. Gradually whisk in the oil and season with pepper.\n            \n\n              Transfer the marinade to a large sealable plastic bag. Put the lamb chops in the bag, seal, and shake vigorously to evenly coat the meat. Marinate at room temperature for 1 hour or in the refrigerator for at least 4 hours and up to 12.\n            \n\n              Remove the chops from the marinade and transfer them to a plate. Discard the marinade. Using a spoon, lightly scrape the remaining marinade off the chops and pat them dry.\n            \n\n              Preheat a large cast-iron grill pan over medium heat for 3 to 5 minutes. Raise the heat to medium-high. Season the chops with salt. Place 2 chops on the grill pan, and cook until the chops have distinctive grill marks, about 3 minutes. To make crosshatched grill marks, re-position the chops, moving them about 45 degrees on the ridged pan, and continue to cook about 3 minutes more. (The chops will have only cooked on one side at this point.) Set the chops aside and repeat with the remaining 2 chops. Return the first set of chops to the pan to cook them on the other side. Reduce the heat to medium low, and cook the chops until medium-rare, about 2 minutes. Repeat with the other chops. Let the chops rest for about 5 minutes and serve.\n            \n", "ingredients": [{"food": "lemon juice", "quantity": 0.5}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "rosemary", "quantity": 1.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "salt", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "lamb", "quantity": 8.0}], "title": "\nPan-Grilled Lamb Shoulder Chops\n"}, {"directions": "\n\n              Place the carrots, broth and 1 teaspoon of the oil in a large skillet and bring to a boil over medium-high heat. Cover, reduce the heat to medium and continue to cook until the carrots are tender, 12 to 14 minutes. Uncover and cook, stirring, until the liquid has evaporated and the carrots are lightly browned, another 2 to 3 minutes. Season with 1/4 teaspoon salt and 1/4 teaspoon pepper. \n            \n\n              Meanwhile, combine the mint, parsley, juice, zest and remaining 3 teaspoons oil in a small dish. Sprinkle with salt and pepper. Toss the warm carrots with the herb mixture. \n            \n", "ingredients": [{"food": "carrots", "quantity": 1.5}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 4.0}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 0.25}, {"food": "parsley", "quantity": 0.25}, {"food": "lemon juice", "quantity": 2.0}, {"food": "lemon juice", "quantity": 0.5}], "title": "\nPan-Roasted Carrots with Mint and Parsley Gremolata\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Put the bacon in a large heavy-bottomed ovenproof skillet and cook over medium-high heat until some of the fat renders, about 5 minutes. Push the bacon to the side of the pan. Season the chicken with salt and pepper, then add it to the pan and cook, turning, until it starts to brown, about 5 minutes. Stir in the garlic and leeks, then arrange the chicken on top of the bacon-leek mixture. Transfer to the oven and roast until the chicken is golden and a thermometer inserted into the thickest part registers 160 degrees F, 25 to 30 minutes. Transfer the chicken to a platter.\n            \n\n              Carefully return the skillet to the stovetop over medium-high heat. Sprinkle in the flour and cook, stirring, 1 minute. Add the broth and half-and-half and cook, stirring, 2 minutes. Bring to a boil and cook until slightly reduced, about 5 minutes. Stir in the parsley and a squeeze of lemon juice. Spoon the leek mixture over the chicken. Serve with the remaining lemon wedges.\n            \n\n              Per serving: Calories 418; Fat 24 g (Saturated 8 g); Cholesterol 147 mg; Sodium 322 mg; Carbohydrate 14 g; Fiber 1 g; Protein 34 g\n            \n\n              Photograph by Andrew Purcell\n            \n", "ingredients": [{"food": "bacon", "quantity": 3.5}, {"food": "diced chicken", "quantity": 8.0}, {"food": "salt", "quantity": 1}, {"food": "garlic powder", "quantity": 3.0}, {"food": "silk light vanilla", "quantity": 1.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "parsley", "quantity": 2.0}, {"food": "", "quantity": 1}], "title": "\nPan-Roasted Chicken With Leeks\n"}, {"directions": "\n\n              Mince the anchovies, capers, garlic and red pepper flakes together on a cutting board, then sprinkle with 1 teaspoon salt and mash into a paste using the flat side of a chef's knife. Transfer to a food processor along with the parsley, mint and marjoram. With the motor running, drizzle in the olive oil and process until smooth; transfer to a medium bowl.\n            \n\n              Toast the fennel seeds in a skillet over medium heat, 3 to 4 minutes. Transfer to a cutting board and crush with the bottom of a small skillet. Combine with 1/4 cup of the herb mixture and the herbes de Provence in a small bowl. Put the fish fillets in a shallow dish and brush with the fennel seed-herb mixture. Cover and refrigerate 2 to 4 hours.\n            \n\n              Meanwhile, add the lemon juice, bell pepper and cucumbers to the remaining herb mixture. Cover and refrigerate until ready to serve.\n            \n\n              Heat 2 large nonstick skillets over medium-high heat. Brush the excess marinade off the fish. Working in batches, add the fish to the skillets, skin-side up, and cook until browned on the bottom, about 4 minutes. Flip the fillets, pressing with a spatula to sear the skin, and cook 2 more minutes. Serve with the herb salsa and lemon wedges.\n            \n\n              Photograph by Kana Okada\n            \n", "ingredients": [{"food": "anchovy", "quantity": 4.0}, {"food": "capers", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "parsley", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "barley flour or meal", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.6666666666666666}, {"food": "fennel seed", "quantity": 2.0}, {"food": "dulce de leche", "quantity": 2.0}, {"food": "", "quantity": 12.0}, {"food": "", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "diced chicken", "quantity": 2.0}], "title": "\nPan-Seared Branzino With Herb Salsa\n"}, {"directions": "\n\n              Heat a large skillet, over medium-low heat, cook the bacon in the olive oil until lightly crisp and most of the bacon fat renders, about 5 minutes. Drain all but a thin layer of the reserved fat from the pan, and reserve for cooking the fish. Add the onion to the pan, and cook, stirring until wilted, about 3 minutes. Stir in the cabbage and cook until wilted, about 2 minutes. Add the water, mustard, vermouth, thyme, and allspice, and season with 1/2 teaspoon salt and pepper, to taste. Cover and cook until soft and fragrant, about 8 minutes more. (This can be done up to 1 hour ahead and reheated, covered.)\n            \n\n              Pat the fish dry. Heat a large nonstick skillet over high heat. Add the reserved fat to the pan, and season the fish with remaining 1/2 teaspoon salt and pepper, to taste. Lay the fish, skin-side up in the pan, and cook until golden brown, about 6 minutes. Turn the fish over and continue to cook over medium to medium-high heat until the fish is opaque but not flaking, about 4 minutes more.\n            \n\n              Divide the cabbage among 4 plates, place the fish browned side up on top and drizzle any juices over the fish. Serve.\n            \n", "ingredients": [{"food": "bacon", "quantity": 3.25}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "swamp cabbage", "quantity": 0.5}, {"food": "coconut water", "quantity": 1.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "martha white foods", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 3.75}, {"food": "allspice", "quantity": 1}, {"food": "salt", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "barley flour or meal", "quantity": 4.0}], "title": "\nPan-Seared Cod with Cabbage\n"}, {"directions": "\n\n              Heat the olive oil in a large high-sided saute pan over medium-high heat. Add the soppressata and cook until lightly browned around the edges, 3 to 5 minutes. Use a slotted spoon to transfer the soppressata to a paper-towel-lined plate. Add the fennel to the pan and cook until just softened and lightly browned, 4 to 6 minutes. Add the browned soppressata, tomatoes, jalapeno juice, pickled jalapenos and 2 cups water. Cook until the liquid has reduced by almost half and the tomatoes just start to soften, about 5 minutes. Stir in the butter. Turn off the heat and cover with a lid.\n            \n\n              Heat 2 tablespoons of the vegetable oil in a large nonstick saute pan over medium-high to high heat. Sprinkle the halibut liberally with salt and pepper. When the oil just starts to smoke, gently place 2 of the fillets in the pan and sear until browned on both sides, about 5 minutes total. Transfer to a large plate. Sear the remaining fillets, using the remaining vegetable oil if needed.\n            \n\n              To serve, divide the soppressata mixture and broth evenly among 4 shallow bowls. Top with the halibut, a drizzle of olive oil and garnish with the reserved fennel fronds. Serve with crusty bread if desired.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "", "quantity": 4.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "grape juice", "quantity": 1.0}, {"food": "grape juice", "quantity": 0.25}, {"food": "", "quantity": 2.0}, {"food": "butter oil", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "halibut", "quantity": 6.0}, {"food": "black bean mango", "quantity": 1}, {"food": "garlic bread", "quantity": 1}], "title": "\nPan-Seared Halibut with Soppressata and Fennel\n"}, {"directions": "\n\n              Combine the spelt with 1 1/2 cups of water in a medium saucepan. Bring to a boil, reduce heat to medium low, cover and simmer until most of the water is absorbed and the grains are tender but still chewy, about 30 minutes. Remove from the heat and let sit, covered, for 10 minutes. Let cool completely. (The spelt can be cooked up to 1 day ahead and refrigerated.)\n            \n\n              Heat 2 tablespoons of the oil in a large nonstick skillet over medium-high heat. Add the bell pepper, scallion whites, celery and Canadian bacon and cook, stirring frequently, until the vegetables are crisp-tender and the ham is lightly browned, about 4 minutes. Add the garlic and 1/2 teaspoon of the Cajun seasoning and cook, stirring, for 1 minute. Add the spelt, tomatoes, scallion greens, parsley and salt to taste. Cook, stirring, until the spelt and tomatoes are warmed through, about 2 minutes. Remove from the heat, transfer to a medium bowl and cover to keep warm. Wipe out the skillet.\n            \n\n              Sprinkle the pork chops all over with the remaining 1 teaspoon Cajun seasoning and 1 teaspoon salt. Heat the remaining 1 tablespoon oil in the empty skillet over medium-high heat. Nestle the pork chops in the skillet snuggly. Cook until nicely browned on both sides and an instant-read thermometer inserted into the center of each registers 140 degrees F, about 4 minutes per side.\n            \n\n              Divide the pork chops among four plates. Serve with the warm grain salad, and with wedges of lemon and hot sauce on the side if using.\n            \n", "ingredients": [{"food": "spelt", "quantity": 0.75}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "pepper", "quantity": 1.0}, {"food": "martha white foods", "quantity": 4.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "bacon", "quantity": 2.5}, {"food": "garlic powder", "quantity": 2.0}, {"food": "seasoning mix", "quantity": 1.5}, {"food": "silk black cherry soy yogurt", "quantity": 1.0}, {"food": "parsley", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "pork skins", "quantity": 4.75}, {"food": "Worcestershire sauce", "quantity": 1}], "title": "\nPan-Seared Pork Chops with Warm Cajun Grain Salad\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Bring the salmon to room temperature 10 minutes before cooking.\n            \n\n              Meanwhile, whisk together the lemon juice, 2 tablespoons of the olive oil and 1/4 teaspoon salt in a large bowl. Add the kale, toss to coat and let stand 10 minutes.\n            \n\n              While the kale stands, cut the dates into thin slivers and the apple into matchsticks. Add the dates, apples, cheese and almonds to the kale. Season with pepper, toss well and set aside.\n            \n\n              Sprinkle the salmon all over with 1/2 teaspoon salt and some pepper. Heat the remaining 1 tablespoon oil in a large nonstick skillet over medium-low heat. Raise the heat to medium-high. Place the salmon, skin-side up in the pan. Cook until golden brown on one side, about 4 minutes. Turn the fish over with a spatula, and cook until it feels firm to the touch, about 3 minutes more.\n            \n\n              Divide the salmon, salad and rolls evenly among four plates.\n            \n", "ingredients": [{"food": "vegetarian fillets", "quantity": 5.0}, {"food": "lemon juice", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "dates", "quantity": 0.25}, {"food": "apple", "quantity": 1.0}, {"food": "", "quantity": 0.25}, {"food": "almonds", "quantity": 3.0}, {"food": "black bean mango", "quantity": 1}, {"food": "pizza rolls", "quantity": 4.0}], "title": "\nPan-Seared Salmon with Kale and Apple Salad\n"}, {"directions": "\n\n              1. Whisk the peanut butter, coconut milk, lime juice, honey, ginger, and water together in a medium bowl.\n            \n\n              2. Heat the oil in a medium skillet over medium-high heat and brown the tempeh on all sides, about 8 minutes.\n            \n\n              3. Add the peanut sauce to the skillet and heat until bubbling. Season to taste.\n            \n\n              4. Serve the tempeh hot over a bed of mesclun, topped with the sauce and a small handful of bean sprouts.\n            \n", "ingredients": [{"food": "peanut butter ", "quantity": 0.6666666666666666}, {"food": "coconut milk", "quantity": 0.5}, {"food": "lime juice", "quantity": 0.25}, {"food": "honey smoked ham", "quantity": 2.0}, {"food": "ginger", "quantity": 1.0}, {"food": "coconut water", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "tempeh", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "turnip greens", "quantity": 4.0}, {"food": "brussels sprouts", "quantity": 2.0}], "title": "\nPan-Seared Tempeh with Peanut Sauce\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Bring the salmon to room temperature 10 minutes before cooking. \n            \n\n              Warm a large nonstick skillet with oil over medium-low heat. Season the fish with salt and pepper. Raise the heat to medium-high. Place the salmon, skin-side up in the pan. Cook until golden brown on 1 side, about 4 minutes. Turn the fish over with a spatula, and cook until it feels firm to the touch and the skin is crisp if desired, about 3 minutes more. \n            \n\n              The skin can be served or removed easily with a knife or spoon. \n            \n\n              Transfer to a plate and serve as desired.\n            \n", "ingredients": [{"food": "barley flour or meal", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nPan-Fried Salmon\n"}, {"directions": "\n\n              About 1/2 hour before cooking the steak, bring it to room temperature.\n            \n\n              Preheat a large cast iron skillet over medium heat. Lightly brush the steak all over with oil and season generously with salt and pepper. Raise the heat to high, add the steak and cook, turning once, until well browned, about 7 minutes for the first side, and 4 minutes on the second side, for medium-rare. Hold the steak with tongs and sear the edges. (An instant-read thermometer inserted perpendicularly into the steak registers 125 degrees F for medium rare.)\n            \n\n              Transfer the steak to cutting board and cover loosely with foil. Let rest for 5 minutes.\n            \n\n              Cut the tenderloin and strip from the bone, and slice against the grain. Transfer to a serving platter and serve au natural, with mustard, compound butter, or horseradish sauce.\n            \n\n              Copyright 2003 Television Food Network, G.P. All rights reserved\n            \n\n              Serving Suggestions: Compound Butter .\n            \n", "ingredients": [{"food": "", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}], "title": "\nPan-fried T-Bone Steak\n"}, {"directions": "\n\n              Butter an 8-inch square baking dish; set aside. Put 3 tablespoons of the butter in a microwave-safe small bowl or liquid measure; microwave for 30 seconds to 1 minute to melt the butter.\n            \n\n              Whisk together the flour, baking powder, baking soda, 3 tablespoons of the sugar and 1/2 teaspoon salt in a large bowl. In a separate small bowl, whisk together the buttermilk, 2 of the eggs and the melted butter. Add the wet ingredients to the dry ingredients, and stir until just combined.\n            \n\n              Heat a large nonstick skillet or griddle over medium heat. Melt a little of the remaining butter in the pan. For each pancake, spoon 1/4 cup of batter into the skillet and cook until the bottom is golden brown and small bubbles appear on the top, 2 to 3 minutes. Flip and cook until golden brown on the other side, about 2 minutes. If the pancakes brown too quickly, reduce the heat to medium-low. Transfer the pancakes to a plate as finished. Repeat until all the batter is used, adding more butter to the pan as necessary. (You should have at least 12 pancakes.)\n            \n\n              Whisk together the half-and-half, vanilla, the remaining 5 eggs and 3 tablespoons sugar, and 1/4 teaspoon salt in a large bowl.\n            \n\n              Shingle the pancakes in the prepared baking dish. Pour the egg mixture evenly over the pancakes. Cover the dish with plastic wrap and refrigerate for at least 8 hours up to overnight to allow the pancakes to soak in the custard.\n            \n\n              Preheat the oven to 350 degrees F. Remove the plastic wrap, and bake the casserole until it feels firm yet springy to the touch in the center and the custard is set, 50 to 60 minutes. Let cool 15 minutes before serving. Serve warm with maple syrup, blueberries and pats of butter.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 4.0}, {"food": "potato flour", "quantity": 1.75}, {"food": "baking chocolate", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "sugar", "quantity": 6.0}, {"food": "salt", "quantity": 1}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 1.75}, {"food": "eggs", "quantity": 7.0}, {"food": "", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "syrup", "quantity": 1}, {"food": "", "quantity": 1}], "title": "\nPancake Breakfast Casserole\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              In a large bowl, whisk together the flour, sugar, baking powder, salt, and nutmeg.\n            \n\n              In another bowl, beat the eggs and then whisk in the milk and vanilla.\n            \n\n              Melt the butter in a large cast iron skillet or griddle over medium heat.\n            \n\n              Whisk the butter into the milk mixture. Add the wet ingredients to the flour mixture, and whisk until a thick batter is just formed.\n            \n\n              Keeping the skillet at medium heat, ladle about 1/4 cup of the batter onto the skillet, to make a pancake. Make 1 or 2 more pancakes, taking care to keep them evenly spaced apart. Cook, until bubbles break the surface of the pancakes, and the undersides are golden brown, about 2 minutes. Flip with a spatula and cook about 1 minute more on the second side. Serve immediately or transfer to a platter and cover loosely with foil to keep warm. Repeat with the remaining batter, adding more butter to the skillet as needed.\n            \n\n              Procedure for adding fruit to pancakes: Once the bubbles break the surface of the pancakes, scatter the surface with sliced or diced fruit, or chocolate chips, nuts, etc. Flip with a spatula and cook for 1 minute more, being careful not to burn toppings.\n            \n\n              Copyright 2003 Television Food Network, G.P. All rights reserved\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.5}, {"food": "sugar", "quantity": 3.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 0.25}, {"food": "nutmeg", "quantity": 0.125}, {"food": "eggs", "quantity": 2.0}, {"food": "milk", "quantity": 1.25}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "butter oil", "quantity": 3.0}], "title": "\nPancakes\n"}, {"directions": "\n\n              1. Preheat oven to 200 degrees F.\n            \n\n              2. Whisk together flour, sugar, baking powder, salt, and nutmeg, if using, in a large bowl. Beat eggs in a medium bowl. Whisk in about half of milk and vanilla.\n            \n\n              3. In a small saucepan over low heat, melt the butter with the remaining milk, stirring occasionally. Remove from heat. Whisk into the egg mixture.\n            \n\n              3. Pour wet ingredients into dry ingredients and stir, using a whisk, just until a thick, slightly lumpy batter forms; set aside to sit for 10 minutes.\n            \n\n              4. Heat a cast-iron, or nonstick skillet, or a griddle over medium to medium-low heat. Brush with canola oil. Pour batter (1/4 cup for small or 1/3 cup for large pancakes) into pan, about 2 to 3 pancakes per batch depending on pan size. Cook until bubbles break on surface of pancakes and undersides are golden brown, about 2 minutes. Flip and cook about 1 minute more. Repeat with remaining batter.\n            \n\n              5. Serve immediately topped with butter and maple syrup. Serve with bacon and fresh fruit. If desired, transfer pancakes to a platter and keep warm in oven.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.5}, {"food": "sugar", "quantity": 3.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "nutmeg", "quantity": 1}, {"food": "eggs", "quantity": 2.0}, {"food": "milk", "quantity": 1.25}, {"food": "vanilla extract", "quantity": 0.25}, {"food": "", "quantity": 4.5}, {"food": "vegetable oil", "quantity": 1}, {"food": "syrup", "quantity": 1}, {"food": "fruit cocktail", "quantity": 1}], "title": "\nPancakes\n"}, {"directions": "\n\n              1. Put a pizza stone on the bottom rack in the oven and preheat to 500 degrees F for at least 30 minutes. Heat a small skillet over medium heat, add the pancetta or bacon, cook until the fat renders but is short of being crisp, about 5 minutes. Transfer with a slotted spoon to a paper towel-lined plate to drain.\n            \n\n              2. Divide the dough into 2 equal portions; form each into a ball. Roll a portion into a 12-inch disk on a floured surface (cover the other piece with a kitchen towel). Lightly dust a pizza peel with flour and put the dough on the peel, drizzle lightly with oil and sprinkle with salt. Slip the dough onto the preheated stone and cook until just set, about 4 minutes. \n            \n\n              3. Using the peel, remove the dough from the oven and top with about half the sauce and toppings - bacon, mozzarella, leek, and garlic. Drizzle with a little olive oil. Return the pizza to the stone and cook until the crust is golden and the cheese melts, about 5 to 7 minutes more. Remove the pizza, top with half the grated Parmesan and scatter with some basil leaves and pepper flakes, if desired. Serve. Repeat with the remaining dough and toppings. \n            \n\n              Nutrition Information (per serving-analysis done for 8): Calories: 370 Total Fat: 16 grams Saturated Fat: 6 grams Total Carbohydrates: 41 grams Protein: 14 grams Sodium: 1022 milligrams Cholesterol: 30.5 milligrams Fiber: 2 grams\n            \n\nPizza Dough\n\n\n              1. Whisk water and sugar in a bowl and scatter the yeast over the top. Set aside until foamy, about 10 minutes. Stir in olive oil.\n            \n\n              2. Whisk the flour and salt in a large bowl. Make a well in the center and pour in the yeast mixture. Gradually stir the dry ingredients into the liquid to make a rough, shaggy dough. Turn out onto a lightly-floured work surface and knead until smooth and elastic, about 5 minutes. If the dough seems wet, add just enough flour to prevent sticking. \n            \n\n              3. Brush a large bowl with olive oil. Form the dough into a ball, rotate it around the bowl to coat and place it seam-side down in the bowl. Cover the bowl tightly with plastic wrap. Set aside at room temperature, until doubled, about 1 1/2 hours. Or cover and refrigerate overnight. If refrigerating bring to room temperature about 30 minutes before forming. Yield: Makes 1 1/2 pounds of dough, enough for 2 (12 inch) pies\n            \n\nTomato Sauce\n\n\n              1. Heat the olive oil in a medium saucepan over medium-high heat. Add the garlic and cook until golden but not dark brown, about 20 seconds. Using your hands, crush the tomatoes and add them to the pot along with 1/2 cup water, basil, and season with salt. Bring to a boil, reduce heat to medium-low and simmer until the sauce thickens, about 15 minutes. Serve. Yield: Makes about 3 cups\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 5.0}, {"food": "pizza rolls", "quantity": 1.5}, {"food": "potato flour", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1}, {"food": "pasta with tomato sauce", "quantity": 1.25}, {"food": "", "quantity": 1.5}, {"food": "martha white foods", "quantity": 0.5}, {"food": "garlic powder", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 0.5}, {"food": "chrysanthemum leaves", "quantity": 12.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1}, {"food": "coconut water", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "yeast extract spread", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "potato flour", "quantity": 3.0}, {"food": "salt", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "tomatoes", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 4.0}, {"food": "salt", "quantity": 1}], "title": "\nPancetta and Onion Pizza\n"}, {"directions": "\n\n              Put a pizza stone on the bottom rack in the oven and preheat to 500 degrees F for at least 30 minutes. Heat a small skillet over medium heat, add the pancetta or bacon, cook until the fat renders but is short of being crisp, about 5 minutes. Transfer with a slotted spoon to a paper towel-lined plate to drain. Divide the dough into 2 equal portions; form each into a ball. Roll a portion into a 12-inch disk on a floured surface (cover the other piece with a kitchen towel). Lightly dust a pizza peel with flour and put the dough on the peel, drizzle lightly with oil and sprinkle with salt. Slip the dough onto the preheated stone and cook until just set, about 4 minutes. Using the peel, remove the dough from the oven and top with about half the sauce and toppings - pancetta, mozzarella, onion and garlic. Drizzle with a little olive oil. Return the pizza to the stone and cook until the crust is golden and the cheese melts, about 5 to 7 minutes more. Remove the pizza, top with half the grated Parmesan and scatter with some basil leaves and pepper flakes, if desired. Serve. Repeat with the remaining dough and toppings.\n            \n\nPizza Dough:\n\n\n              Whisk water and sugar in a bowl and scatter the yeast over the top. Set aside until foamy, about 10 minutes. Stir in olive oil. Whisk the flour and salt in a large bowl. Make a well in the center and pour in the yeast mixture. Gradually stir the dry ingredients into the liquid to make a rough, shaggy dough. Turn out onto a lightly-floured work surface and knead until smooth and elastic, about 5 minutes. If the dough seems wet, add just enough flour to prevent sticking. Brush a large bowl with olive oil. Form the dough into a ball, rotate it around the bowl to coat and place it seam-side down in the bowl. Cover the bowl tightly with plastic wrap. Set aside at room temperature, until doubled, about 1 1/2 hours. Or cover and refrigerate overnight. If refrigerating bring to room temperature about 30 minutes before forming. Yield: Makes 1 1/2 pounds of dough, enough for 2 (12 inch) pies\n            \n\nTomato Sauce:\n\n\n              Heat the olive oil in a medium saucepan over medium-high heat. Add the garlic and cook until golden but not dark brown, about 20 seconds. Using your hands, crush the tomatoes and add them to the pot along with 1/2 cup water, basil, and season with salt. Bring to a boil, reduce heat to medium-low and simmer until the sauce thickens, about 15 minutes. Serve.\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 5.0}, {"food": "pizza rolls", "quantity": 1.5}, {"food": "potato flour", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1}, {"food": "pasta with tomato sauce", "quantity": 1.25}, {"food": "", "quantity": 1.5}, {"food": "martha white foods", "quantity": 0.5}, {"food": "garlic powder", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 0.5}, {"food": "chrysanthemum leaves", "quantity": 12.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1}, {"food": "coconut water", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "yeast extract spread", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "potato flour", "quantity": 3.0}, {"food": "salt", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "tomatoes", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 4.0}, {"food": "salt", "quantity": 1}], "title": "\nPancetta and Onion Pizza\n"}, {"directions": "\n\n              1. Whisk the flour and 2 teaspoons salt together with 2 cups water in a medium saucepan over medium-high heat and cook until the mixture thickens, pulls away from the side of the pan, and is a thick paste consistency, about 4 minutes. Stir in the chickpeas. Spoon leveled tablespoons of the mixture onto a parchment-lined baking sheet and flatten to 1-inch wide rounds about 1/3-inch thick. Cover and chill for at least 30 minutes. The recipe can be prepared up to this point and chilled overnight.\n            \n\n              2. Fill a small skillet with 1-inch oil and heat to 375 degrees F. Fry the fritters until golden, about 2 minutes per side. Transfer to a paper towel-lined plate to drain.\n            \n\n              3. Stir 1/4 cup chopped parsley into the ricotta, then dollop onto warm or room temperature fritters. Top with the chopped olives, 1 small parsley leaf, and a sprinkle of salt.\n            \n", "ingredients": [{"food": "chickpea flour", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "chickpeas", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 1}, {"food": "parsley", "quantity": 0.25}, {"food": "", "quantity": 1.0}, {"food": "black bean mango", "quantity": 0.25}], "title": "\nPanelle with Ricotta and Oil-Cured Black Olives\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F.\n            \n\n              In a large mixing bowl, whisk together the eggs, half-and-half, vanilla, and orange zest. Cut the crust off the top and bottom of the loaf with a serrated knife. Slice the loaf into 6 1-inch-thick rounds.\n            \n\n              Heat 1 tablespoon of the butter in a large skillet over medium heat. Dip 2 bread slices in the egg mixture and immediately lay them in the skillet. Cook, turning once, until golden brown, about 2 to 3 minutes per side. Transfer to a baking sheet and repeat with the remaining slices of bread. Bake the toasts until warmed through and slightly puffed, about 8 to 10 minutes.\n            \n\n              To serve, transfer the toasts to a large serving platter or plates and dust generously with confectioners' sugar. Serve with marinated berries or glazed apples and pears.\n            \n\nMarinated Berries:\n\n\n              In a small saucepan, combine the sugar, vanilla bean and seeds, citrus zests, and water. Bring to a boil and then reduce the heat to low. Simmer very gently until syrupy, about 25 minutes. Remove from the heat and add the citrus juices. Combine the berries in a bowl. Strain the warm syrup over the berries and marinate at room temperature for 30 minutes. Serve.\n            \n\nGlazed Apples and Pears Compote:\n\n\n              Peel, core, and cut both the apples and pears into 3/4-inch wedges. In a medium bowl toss the fruit with the lemon juice.\n            \n\n              Melt the butter in a medium skillet over medium heat. Add the sugar, orange zest, and cinnamon sticks and stir until sugar is dissolved. Add the fruit, increase the heat to medium-high, and cook, shaking the pan frequently, until glazed, about 10 minutes. Raise the heat to high, add the orange juice, and cook until the fruit is easily pierced with a paring knife, about 1 minute more. If desired, add the Calvados. If cooking on a gas burner, carefully tip the pan toward the flame to flambe the alcohol; if cooking over an electric element, hold a long match near the mixture. Swirl the pan over the heat until the flame subsides. Serve warm.\n            \n", "ingredients": [{"food": "eggs", "quantity": 6.0}, {"food": "", "quantity": 2.0}, {"food": "sugar", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "barbecue loaf", "quantity": 17.5}, {"food": "butter oil", "quantity": 3.0}, {"food": "sugar", "quantity": 1}, {"food": "barley flour or meal", "quantity": 1}, {"food": "sugar", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "", "quantity": 0.5}, {"food": "coconut water", "quantity": 1.0}, {"food": "orange juice", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "raspberries", "quantity": 0.5}, {"food": "blueberries", "quantity": 0.5}, {"food": "strawberries", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 3.0}, {"food": "prickly pears", "quantity": 3.0}, {"food": "", "quantity": 1.0}, {"food": "butter oil", "quantity": 0.25}, {"food": "sugar", "quantity": 3.0}, {"food": "grape juice", "quantity": 2.0}, {"food": "cinnamon", "quantity": 3.0}, {"food": "barley flour or meal", "quantity": 2.0}], "title": "\nPanettone French Toast\n"}, {"directions": "\n\n              Grease a 2 1/2- to 3-quart casserole dish with butter; set aside.\n            \n\n              Cut the panettone into 1-inch-thick slices (you should get about 5 or 6); if you have an odd number of slices, cut one in half. Spread the jam on half the slices. Spread the cream cheese on the other half. Press 1 slice of each together to form sandwiches. Cut the sandwiches into 1-inch squares, and arrange haphazardly in the prepared dish. (Don't worry; this can be a little messy. If the sandwich pieces come apart, just spread them out to fill in the spaces evenly. There's no need to re-form the pieces into sandwich squares.)\n            \n\n              Whisk together the half-and-half, eggs, granulated sugar, vanilla, cinnamon and salt in a large bowl until combined. Pour evenly over the panettone in the dish. Cover with plastic wrap, and refrigerate for at least 6 hours up to overnight.\n            \n\n              Preheat the oven to 350 degrees F. Remove the plastic wrap from the dish, and push down on the casserole. Sprinkle the almonds on top. Bake until puffed and golden brown and the custard is set (the center of the casserole will feel firm when touched), about 1 hour 10 minutes. If the top starts to brown too quickly, loosely cover with foil. Let cool for 20 minutes before serving warm or at room temperature with a dusting of confectioner's sugar.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1}, {"food": "", "quantity": 1.0}, {"food": "jam", "quantity": 1.5}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "", "quantity": 3.5}, {"food": "eggs", "quantity": 6.0}, {"food": "sugar", "quantity": 0.25}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "cinnamon", "quantity": 0.5}, {"food": "salt", "quantity": 0.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}, {"food": "sugar", "quantity": 1}], "title": "\nPanettone French Toast Casserole\n"}, {"directions": "\n\n              Rinse the trout and pat very dry. Place a sprig of sage in the cavity of each fish and season the inside with salt and pepper. Close the cavity by threading a wooden skewer through the flaps. Season the outside of the fish with salt and pepper and dredge in the cornmeal. (If dredging in flour, pat off the excess.) \n            \n\n              Heat two large skillets over medium high heat and divide the bacon fat between them. When the fat shimmers add the fish and fry until crisp and golden brown, about 4 minutes. Carefully flip the fish with a large flat spatula. Continue to cook the fish on the other side until just cooked though and golden, about 4 minutes. Transfer the fish to a platter and serve immediately with the lemon wedges.\n            \n", "ingredients": [{"food": "pan dulce", "quantity": 12.0}, {"food": "sage", "quantity": 4.0}, {"food": "black bean mango", "quantity": 1}, {"food": "barley flour or meal", "quantity": 0.5}, {"food": "low fat big franks", "quantity": 0.3333333333333333}, {"food": "lemon juice", "quantity": 1.0}], "title": "\nPanfried Trout\n"}, {"directions": "\n\n              Whisk the egg and buttermilk in a medium bowl. Soak chicken pieces in egg mixture while you gather remaining ingredients. Meanwhile, in another shallow bowl combine panko with paprika, garlic powder, Italian seasoning, and salt and pepper, to taste. Set a rack on a cookie sheet lined with paper towels.\n            \n\n              Heat oil in a large skillet over medium heat. Lift chicken from buttermilk, letting excess liquid drain back into the bowl, then dip into panko and turn to coat on all sides.\n            \n\n              Carefully place chicken in oil and cook until they are golden and crispy and cooked through, about for 5 minutes per side. Transfer chicken to the rack to cool. Place in sealed container. Pack in a lunch box with their favorite veggies and ranch, honey mustard or barbecue sauce for dipping.\n            \n", "ingredients": [{"food": "egg substitute", "quantity": 1.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.3333333333333333}, {"food": "fat free chicken breast ", "quantity": 1.0}, {"food": "bread crumbs", "quantity": 1.5}, {"food": "paprika", "quantity": 0.25}, {"food": "garlic powder", "quantity": 1.0}, {"food": "seasoning mix", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "Worcestershire sauce", "quantity": 1}, {"food": "celery seed", "quantity": 1}], "title": "\nPanko Chicken Nuggets\n"}, {"directions": "\n\n              Preheat the oven to 450 degrees F. Spray a small baking sheet generously with nonstick cooking spray.\n            \n\n              To make the dip, combine the buttermilk, sour cream and vinegar in a medium bowl. Add the blue cheese and mash with a fork, until blended. Season with salt and freshly cracked black pepper, to taste. Cover and refrigerate until ready to use.\n            \n\n              Season the chicken with salt and freshly cracked black pepper to taste. Lightly beat the egg white and water in a medium bowl. Combine the panko and cayenne on a sheet of waxed paper. Dip each tender into the egg whites, shaking off excess, and then roll into the panko to coat. Place the chicken on the baking sheet in 1 layer and generously spray with cooking spray. Bake on the top rack of the oven until the chicken is cooked through and golden brown, about 20 minutes. Serve with the dip and assorted crudites.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.5}, {"food": "sour cream", "quantity": 0.25}, {"food": "vinegar", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 0.3333333333333333}, {"food": "black bean mango", "quantity": 1}, {"food": "chicken tenders", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "coconut water", "quantity": 1.0}, {"food": "silk plain soy yogurt", "quantity": 0.75}, {"food": "", "quantity": 0.75}, {"food": "turkey sticks", "quantity": 1}], "title": "\nPanko-Crusted Chicken and Crudites with Blue Cheese Dip\n"}, {"directions": "\n\n              1. Heat the oven to 350 degrees F. Melt 4 tablespoons butter in a small pot. Stir in the breadcrumbs, half the shallots, the parsley, lemon zest, and season with salt and pepper. \n            \n\n              2. Sprinkle both sides of the halibut fillets with salt and pepper. Spread a thin layer of mayonnaise on top of each fillet, then press the panko mixture on top. \n            \n\n              3. Heat the remaining 3 tablespoons butter in a 12-inch skillet. Add the rainbow chard stems and remaining shallots. Cook 2 minutes, then turn off the heat. Fold in the torn chard leaves, 2 tablespoons water, and salt and pepper, to taste. Place the halibut fillets on top of the chard leaves. \n            \n\n              4. Transfer the skillet to the oven until the fish is just cooked through, 15 to 20 minutes. \n            \n", "ingredients": [{"food": "butter oil", "quantity": 7.0}, {"food": "", "quantity": 0.75}, {"food": "shallots", "quantity": 2.0}, {"food": "parsley", "quantity": 3.0}, {"food": "", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "halibut", "quantity": 4.0}, {"food": "mayonnaise dressing", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}], "title": "\nPanko-Crusted Halibut with Swiss Chard\n"}, {"directions": "\nSpecial equipment: 2 Pastry bags; Ateco #104 rose tip; Ateco #2 small round tip; Ateco #70 leaf tip\n\n              Frost the cupcakes with the buttercream.\n            \n\n              To pipe the flower: Place the grape-tinted frosting in a pastry bag with a #104 rose tip. Point the bag down at a 45 degree angle, with the skinny end of the rose tip aimed towards the center of the flower. Squeeze and release while making 5 tear shapes in a circle to form a flower. Repeat piping on top with 4 more tear shapes in a tight circle.\n            \n\n              Place the egg yolk-tinted frosting in a pastry bag with a #2 small round tip. Hold the bag straight up, and pipe a small dot into the center of the flower.\n            \n\n              To pipe the leaf: Place the avocado-tinted frosting in a pastry bag with a #70 leaf tip. Point the bag down at a 45 degree angle with the tip lightly touching the surface of the cupcake. Squeeze hard to build up the base and simultaneously lift the tip slightly. Relax the pressure as you pull the tip toward you, drawing the leaf to a point. Stop squeezing and lift the tip away. Pipe a second leaf on the other side of the flower.\n            \n\n              Repeat with the remaining cupcakes.\n            \n", "ingredients": [{"food": "", "quantity": 12.0}, {"food": "", "quantity": 2.0}, {"food": "", "quantity": 0.5}, {"food": "", "quantity": 0.5}, {"food": "", "quantity": 0.3333333333333333}], "title": "\nPansy Flower Cupcakes\n"}, {"directions": "\n\n              Bring a large pot of water to a boil. Add a liberal amount of salt, then add the pasta, stirring occasionally to avoid sticking. Cook the linguine until it is al dente, 10 to 12 minutes. Reserve 1 cup of pasta cooking water, then pour the linguine in a colander to drain.\n            \n\n              Meanwhile, process the red peppers, almonds, breadcrumbs, vinegar, garlic and paprika in a food processor until the texture is coarse but uniform. With the motor running, pour the oil slowly through the opening to emulsify and thicken the sauce. Season with 1/2 teaspooon salt and 1/4 teaspoon black pepper.\n            \n\n              Add the sauce to a large bowl. Add the linguine and enough of the reserved pasta water so that the sauce is loose enough to pour but smooth enough to stick to the pasta. Divide the linguine among individual bowls, and sprinkle with the chopped almonds.\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "whole milk", "quantity": 0.5}, {"food": "bread crumbs", "quantity": 0.3333333333333333}, {"food": "vinegar", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 5.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nPantry Pasta with Romesco Sauce\n"}, {"directions": "\n\n              Core the tomatoes and, if large, cut them into chunks; if small, halve or quarter them. Toss them gently with the shallot, garlic, oil, vinegar, 1 tablespoon salt, and pepper. Set aside until the tomatoes are very juicy, about 10 minutes.\n            \n\n              Fill a large bowl with ice water. Add the bread and set aside until soft, no more than 5 minutes. Using your hands, scoop the bread from the water, squeeze out as much water as possible, and rub it through your fingers into the tomatoes. Tear the basil over the salad and toss gently. (The bread salad can be served now or set aside at room temperature for a couple of hours.)\n            \n\n              Cook's Note It's easy to dry fresh bread. Tear it into chunks and microwave for 1 to 2 minutes. Or place the chunked bread on a baking sheet in a 250 degrees oven for a few minutes.\n            \n\n              Copyright (c) 2004 Television Food Network, G.P., All Rights Reserved.\n            \n", "ingredients": [{"food": "tomatoes", "quantity": 1.5}, {"food": "", "quantity": 1.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "vinegar", "quantity": 2.0}, {"food": "salt", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "garlic bread", "quantity": 10.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}], "title": "\nPanzanella\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Hollow out the center of the ciabatta loaf to form a rectangular \"bowl\"; set aside. Cut the removed bread into 1-inch cubes; spread 2 cups of the bread on a rimmed baking sheet (reserve the rest for another use). Bake the bread cubes until lightly toasted, 5 to 6 minutes. Let cool.\n            \n\n              Combine the lettuce, tomatoes, cucumber, roasted red peppers, salami, prosciutto, soppressata, cheese and toasted bread cubes in a large bowl. Whisk the olive oil, vinegar, 2 tablespoons water, the oregano, 1/2 teaspoon salt and a few grinds of pepper in a small bowl. Drizzle the dressing over the salad and\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "barbecue loaf", "quantity": 1.0}, {"food": "lettuce", "quantity": 1.0}, {"food": "tomatoes", "quantity": 1.0}, {"food": "cucumber", "quantity": 0.5}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "sliced salami", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 6.0}, {"food": "vinegar", "quantity": 6.0}, {"food": "", "quantity": 0.5}, {"food": "salt", "quantity": 1}], "title": "\nPanzanella Bread Bowl\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Line a baking sheet with parchment.\n            \n\n              Put the tapioca flour in the bowl of a stand mixer fitted with the paddle attachment.\n            \n\n              Combine the milk, oil, salt and 1/2 cup water in a medium saucepan and bring to a boil while whisking. Remove from the heat and pour over the tapioca flour in the mixing bowl. Begin to mix, first starting on low, then gradually increasing the speed to high as the mixture begins to thicken and turn smooth. (The mixture will look almost like glue.) While still beating, add the egg and beat until incorporated. Then add the cheeses, a small handful at a time, beating, until incorporated. (The mixture will by sticky and slightly stiff.)\n            \n\n              Use a small ice cream scoop or heaping tablespoons and scoop the dough out onto the prepared baking sheet, leaving at least 1inch between them. Moisten the palm of your hand with water and pat each scoop into a slightly rounded mound.\n            \n\n              Bake until they become puffed up, golden on top, deeply golden on the bottom and feel relatively light when picked up and dropped on the baking sheet, rotating about halfway through baking, 20 to 24 minutes. Let cool for at least a few minutes then eat warm or at room temperature.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.5}, {"food": "whole milk", "quantity": 0.6666666666666666}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "salt", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 0.5}], "title": "\nPao de Queijo\n"}, {"directions": "\n\n              Combine the papaya, banana, strawberries and about 15 ice cubes in a blender and puree until smooth. Pour into 2-ounce shot glasses and garnish with pineapple and/or cherries.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}, {"food": "maraschino cherries", "quantity": 1}], "title": "\nPapaya Smoothies\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the corn and cook until slightly tender, about 3 minutes. Remove with tongs, reserving the boiling water. Let the corn cool slightly, then cut off the kernels.\n            \n\n              Melt 2 tablespoons butter in a large skillet over medium heat. Add the tomatoes, 1 teaspoon salt and 1/2 teaspoon pepper and cook until the tomatoes soften, about 4 minutes. Add the garlic and cook 1 more minute. Add the wine and cook until reduced by half, about 5 minutes.\n            \n\n              Meanwhile, cook the pappardelle in the corn water as the label directs. Reserve 1 cup of the cooking water, then drain the pasta. Add the chicken broth and corn kernels to the skillet and bring to a simmer.\n            \n\n              Add the pasta to the skillet; add the scallions, parmesan, the remaining 3 tablespoons butter and 1/2 teaspoon salt. Toss to combine, adding the reserved cooking water as needed. Season with salt and pepper. Top with more parmesan and basil.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "corn bran", "quantity": 2.0}, {"food": "butter oil", "quantity": 5.0}, {"food": "grape juice", "quantity": 3.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "pepper", "quantity": 1}, {"food": "martha white foods", "quantity": 0.5}, {"food": "italian veg medley pasta", "quantity": 12.0}, {"food": "diced chicken", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "parmesan cheese", "quantity": 0.5}, {"food": "basil", "quantity": 1}], "title": "\nPappardelle With Corn\n"}, {"directions": "\n\n              Fill a large pot with 2 inches of water; bring to a boil. Add the lobsters, cover and cook over medium heat until the shells turn bright red, 8 to 10 minutes. Remove with tongs and rinse under cold water to cool slightly. Meanwhile, cut the kernels off the corn; reserve the cobs.\n            \n\n              Remove the meat from the lobster shells: Twist off the claws, then break off the tail; set the bodies aside. Pull the flippers off the tail, then insert your thumb into the flipper end and force out the meat. Crack the claws with a lobster cracker, mallet or the flat side of a knife and remove the meat. Chop the lobster meat into 1-inch pieces and transfer to a bowl; cover and refrigerate until ready to use.\n            \n\n              Rinse the lobster bodies to remove any green matter (tomalley) and roe. Heat 2 tablespoons butter and the olive oil in a large saucepan over medium-high heat. Add the lobster bodies and cook, turning occasionally, until the butter starts to brown, about 3 minutes. Add the wine, bring to a boil and cook until reduced by half, about 2 minutes. Add the corn cobs, celery stalk, whole shallot, parsley sprigs and 6 cups water; bring to a boil, then lower the heat and simmer until the liquid is reduced by about one-third, about 30 minutes. Strain the stock into a bowl or large measuring cup.\n            \n\n              Heat the remaining 1 tablespoon butter in a saucepan over medium heat. Add the diced shallot and cook until softened, about 2 minutes. Add the tomato paste and paprika; cook, stirring, until slightly darkened, about 1 minute. Stir in the prepared stock and cream and simmer until reduced by one-third, about 20 minutes (you should have 2 3/4 cups sauce). Add the corn kernels; simmer 5 more minutes.\n            \n\n              Bring a large pot of salted water to a boil. Add the pappardelle and cook as the label directs. Drain, then return to the pot. Add the sauce and the reserved lobster meat and cook over medium heat, stirring, until the lobster meat is heated through, about 1 minute. Stir in the chopped celery leaves and parsley and most of the chervil. Divide among plates and top with the remaining chervil.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "", "quantity": 3.0}, {"food": "hearts of palm", "quantity": 3.0}, {"food": "butter oil", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "martha white foods", "quantity": 0.5}, {"food": "celery seed", "quantity": 1.0}, {"food": "", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 2.3333333333333335}, {"food": "pasta with tomato sauce", "quantity": 2.0}, {"food": "sweet potatoes", "quantity": 0.25}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "italian veg medley pasta", "quantity": 1.0}, {"food": "chervil", "quantity": 0.3333333333333333}], "title": "\nPappardelle With Lobster and Corn\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Heat the olive oil and 1 tablespoon butter in a large skillet over medium-high heat. Add the scallions, snap peas, jalapeno and 1/4 teaspoon salt and cook, stirring, until soft, about 4 minutes. Transfer to a serving bowl and toss with the parsley and chives; reserve the skillet.\n            \n\n              Meanwhile, cook the pappardelle in the boiling water until al dente, about 6 minutes. Reserve 2/3 cup of the cooking water, then drain the pasta and toss with the vegetables.\n            \n\n              Pour the reserved cooking water into the skillet and add the remaining 2 tablespoons butter. Bring to a boil, whisking until the butter melts, then cook until reduced slightly, about 2 minutes. Pour the sauce over the pasta, sprinkle with 1/2 cup cheese and toss. Top with the remaining 1/4 cup cheese.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "butter oil", "quantity": 3.0}, {"food": "", "quantity": 1.5}, {"food": "sugar", "quantity": 0.5}, {"food": "pepper", "quantity": 1.0}, {"food": "parsley", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "italian veg medley pasta", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 0.75}], "title": "\nPappardelle With Snap Peas\n"}, {"directions": "\n\n              Bring a pot of salted water to a boil. Meanwhile, melt the butter in a medium skillet over medium heat. Add the shallot and saffron and cook, stirring occasionally, until the shallot is softened, about 2 minutes. Add the cream, 1/4 teaspoon salt, and pepper to taste; increase the heat to medium high and simmer until slightly thickened, about 2 minutes. Stir in the lemon juice and vanilla.\n            \n\n              Add the pasta to the boiling water and cook as the label directs. Remove 1/4 cup cooking water, then drain the pasta and transfer to the skillet with the sauce. Add the reserved cooking water, the parmesan and half of the chives and toss to coat. Serve topped with the lemon zest, remaining chives and more cheese.\n            \n\n              Photograph by Anna Williams\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "hearts of palm", "quantity": 1}, {"food": "ice cream swich", "quantity": 0.6666666666666666}, {"food": "pepper", "quantity": 1}, {"food": "lemon juice", "quantity": 0.25}, {"food": "vanilla extract", "quantity": 0.25}, {"food": "italian veg medley pasta", "quantity": 4.0}, {"food": "parmesan cheese", "quantity": 2.0}, {"food": "chives", "quantity": 2.0}, {"food": "lemon juice", "quantity": 0.5}], "title": "\nPappardelle in Saffron Cream\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the pasta and cook as the label directs. Reserve 1 cup cooking water, then put the peas in a colander and drain the pasta over the peas.\n            \n\n              Place the empty pot over medium heat and add the butter, swirling to melt. Add the radishes, shallot and red pepper flakes. Cook, stirring occasionally, until the radishes are slightly softened, about 2 minutes. Add the pasta and peas along with the spinach, herbs, lemon juice, 3/4 cup reserved cooking water, 1/2 teaspoon salt and a few grinds of pepper. Cook, tossing, until the spinach is wilted and the pasta is lightly coated, gradually adding more of the reserved cooking water if needed.\n            \n\n              Mix the ricotta, lemon zest, 1/4 teaspoon salt and a few grinds of pepper in a small bowl. Serve over the pasta.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "italian veg medley pasta", "quantity": 12.0}, {"food": "pigeon peas", "quantity": 1.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "barley flour or meal", "quantity": 1.0}, {"food": "", "quantity": 2.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "mustard spinach", "quantity": 5.0}, {"food": "mixed nuts", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.5}, {"food": "pepper", "quantity": 1}, {"food": "macaroni cheese", "quantity": 0.5}], "title": "\nPappardelle with Spring Vegetables\n"}, {"directions": "\n\n              1. In a large pot, heat the oil over medium-high heat. Add the pancetta and cook, stirring, until lightly browned, about 2 minutes. Lower the heat to medium and add the butter. Stir in the mushrooms, onions, carrots, celery, thyme, and salt and pepper to taste. Cook, stirring occasionally, until the vegetables are softened, about 10 minutes. Add the diced tomato and cook until soft, about 5 minutes more.\n            \n\n              2. Increase the heat to medium-high and add the veal and pork. Cook, breaking up the meat with a spoon, until it is no longer pink. Add the tomato paste and cook, stirring, 2 to 3 minutes. Add the wine and cook until the wine is reduced by half. Add the canned tomatoes, reduce the heat to medium, and simmer, uncovered, 40 minutes; stir occasionally and adjust the heat if necessary so the sauce simmers gently.\n            \n\n              3. When ready to serve, cook the pasta according to package directions. Drain. Meanwhile, stir the cream into the sauce, lower the heat, and cook 5 minutes more. Season the sauce with salt and pepper. Add the pasta to the sauce and mix well. Serve garnished with basil.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 12.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 1.0}, {"food": "veal", "quantity": 8.0}, {"food": "pork skins", "quantity": 8.0}, {"food": "pasta with tomato sauce", "quantity": 2.0}, {"food": "martha white foods", "quantity": 0.5}, {"food": "whole milk", "quantity": 1.0}, {"food": "italian veg medley pasta", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "chrysanthemum leaves", "quantity": 3.0}], "title": "\nPappardelle with Veal and Pork Ragu\n"}, {"directions": "\n\n              Melt 2 tablespoons butter in a large skillet over medium heat. Add the apples, onion, caraway seeds, 1/4 teaspoon salt and a few grinds of pepper. Cook, stirring occasionally, until the apples start browning around the edges, about 4 minutes. Add the sauerkraut and cook until the excess liquid evaporates, about 2 minutes. Add the apple cider and chicken stock and bring to a simmer. Reduce the heat to medium low and cook until the apples and onion soften, about 8 minutes.\n            \n\n              Meanwhile, season the pork with the paprika, 1 teaspoon salt and a few grinds of pepper. Melt the remaining 2 tablespoons butter in a separate large skillet over medium heat. Working in two batches, cook the pork until browned and just cooked through, 1 to 2 minutes per side. Transfer to a plate. Serve the pork with the sauerkraut mixture; top with the parsley.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "butter oil", "quantity": 4.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "seeds", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "sauerkraut", "quantity": 1.0}, {"food": "apple", "quantity": 0.5}, {"food": "diced chicken", "quantity": 0.5}, {"food": "multigrain cutlets", "quantity": 8.0}, {"food": "paprika", "quantity": 2.0}, {"food": "parsley", "quantity": 0.25}], "title": "\nPaprika Pork Scallopini with Sauerkraut and Apples\n"}, {"directions": "\n\n              Marinate the lamb: Combine the olive oil, lemon juice, garlic, paprika, cumin, oregano, red pepper flakes, 2 teaspoons salt and several grinds of black pepper in a medium bowl; whisk until smooth. Place the lamb on a rimmed baking sheet or in a roasting pan; poke about 10 slits into each side with the tip of a paring knife. Rub the marinade all over the lamb, massaging it into the meat and slits. Cover and refrigerate overnight.\n            \n\n              Remove the lamb from the refrigerator and bring to room temperature about 1 hour before roasting. Preheat the oven to 350 degrees F and set a rack in a roasting pan. Wipe any excess marinade off the lamb and season all over with salt and pepper; transfer to the rack. Roast until a thermometer inserted into the thickest part registers 130 degrees F to 135 degrees F, about 1 hour 50 minutes. Remove from the oven, transfer to a cutting board and let rest 30 to 45 minutes before carving.\n            \n\n              Meanwhile, make the mint sauce: Combine the mint, parsley, garlic, mustard, capers, lemon juice, sugar, red pepper flakes and 1/4 teaspoon salt in a blender and puree until smooth. With the machine running, slowly drizzle in the olive oil and blend until smooth. Transfer to a bowl. Carve the lamb and serve with the sauce.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "parsley", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "capers", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "sugar", "quantity": 0.5}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "lamb", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.75}, {"food": "garlic powder", "quantity": 10.0}, {"food": "smoked turkey roll", "quantity": 3.0}, {"food": "cumin seed", "quantity": 3.0}, {"food": "", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "hearts of palm", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1}, {"food": "", "quantity": 1.0}], "title": "\nPaprika Roast Leg of Lamb with Mint Sauce\n"}, {"directions": "\n\n              Put a small pile each of green, purple and gold sanding sugar on a plate, keeping them separate. Moisten the rim of a martini glass, then press part of the rim into each colored sugar. Combine the vodka, Grand Marnier and Baileys in a cocktail shaker with ice. Shake well, then strain into the prepared glass. Dust with cinnamon. \n            \n\n              Photograph by Lisa Shin\n            \n", "ingredients": [{"food": "sugar", "quantity": 1}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "", "quantity": 0.5}, {"food": "", "quantity": 0.5}, {"food": "cinnamon", "quantity": 1}], "title": "\nParade Time Cocktail\n"}, {"directions": "\n\n              Place the eggs in a saucepan; cover with water. Bring to a boil and cook for 8 to 10 minutes. Drain and cool in a bowl of cold water.\n            \n\n              Meanwhile, combine the vinegar, 1/2 teaspoon salt, and pepper to taste in a medium bowl. Whisk in the olive oil. Put the rolls cut-side up on a work surface and lightly drizzle with a quarter of the dressing. Place the arugula on the roll bottoms. Top with the sliced tomato, onion and artichokes. Season with salt and drizzle with another quarter of the dressing.\n            \n\n              Drain the tuna, but leave lightly coated with oil. Toss the tuna in the remaining dressing, then divide among the sandwiches. Peel and thinly slice the hard-boiled eggs and layer the slices over the tuna. Top with the anchovy fillets, if desired, then the olives and radishes. Cover with the roll tops, pressing gently but firmly. Wrap the sandwiches in plastic wrap and place a skillet on top to weigh them down; set aside for at least 15 minutes so the bread absorbs the flavors.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "eggs", "quantity": 3.0}, {"food": "vinegar", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "pizza rolls", "quantity": 4.0}, {"food": "cheesecake mix", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.25}, {"food": "artichoke hearts", "quantity": 1.0}, {"food": "tuna salad", "quantity": 2.0}, {"food": "vegetarian fillets", "quantity": 4.0}, {"food": "barley flour or meal", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}], "title": "\nParisian Tuna Sandwiches\n"}, {"directions": "\n\n              Heat 1/2 cup milk until lukewarm (105 degrees F to 110 degrees F). Pour into the bowl of a stand mixer fitted with the dough hook attachment, sprinkle in the sugar and yeast and let stand until foamy, about 5 minutes. Add the softened butter, about half each of the flour and remaining milk, and the fine salt; mix on medium speed until incorporated, about 1 minute. Add the egg and mix until incorporated, then add the remaining flour and milk; knead on medium-high speed until the dough is smooth and pulls away from the bowl, about 5 minutes (it will still be sticky).\n            \n\n              Lightly brush a large bowl with vegetable oil and add the dough. Cover with plastic wrap and set aside in a warm place until doubled in size, about 2 hours.\n            \n\n              Lightly brush two 12-cup muffin pans with some of the melted butter. Line a baking sheet with parchment paper. Punch down the dough. Tear off about 1 tablespoon of dough and roll into a ball, then put on the prepared baking sheet; repeat with the remaining dough. Dip the dough balls in the remaining melted butter, letting the excess drip off, and arrange 3 balls in each muffin cup to make a clover shape. Cover the pans loosely with plastic wrap and let rise in the refrigerator, at least 8 hours or up to 1 day. Cover and refrigerate the remaining melted butter.\n            \n\n              Position racks in the lower and upper thirds of the oven and preheat to 375 degrees F. Remove the muffin pans from the refrigerator, uncover and let stand at room temperature, 1 hour. Sprinkle with sea salt and bake, rotating the pans halfway through, until the rolls are golden, 15 to 20 minutes. Melt the reserved butter, then brush on the hot rolls while still in the pan. Serve or let cool and freeze.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "whole milk", "quantity": 1.75}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "", "quantity": 1.25}, {"food": "turkey sticks", "quantity": 2.5}, {"food": "potato flour", "quantity": 6.5}, {"food": "salt", "quantity": 2.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "sea lion", "quantity": 1}], "title": "\nParker House Rolls With Sea Salt\n"}, {"directions": "\n\n              Whisk 1/4 cup mayonnaise, 3 tablespoons grated parmesan, 1/2 teaspoon pepper and 1 tablespoon water. Trim 1 pound asparagus and cut into pieces; place in a steamer basket set over simmering water. Add 1 cup drained canned butter beans; cover and steam until tender, 3 to 5 minutes. Transfer to a platter. Season with salt; drizzle with the sauce and top with shaved parmesan.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [], "title": "\nParmesan Asparagus and Butter Beans\n"}, {"directions": "\n\n              Combine 3/4 cup warm water (105 degrees F to 110 degrees F) and the sugar in a food processor. Sprinkle the yeast on the surface and set aside until foamy, about 5 minutes. Add the olive oil and pulse once. Add the flour and salt; pulse to form a smooth dough, about 2 minutes. Brush a large bowl with olive oil. Transfer the dough to the bowl and form into a ball. Cover with plastic wrap and set aside in a warm place until doubled in size, about 1 1/2 hours.\n            \n\n              Lay out a large sheet of parchment paper and brush with olive oil. Transfer the dough to the parchment and pat into a 6-by-12-inch rectangle. Brush the dough lightly with olive oil. Cover with plastic wrap and set aside 10 minutes. (At this point, you can refrigerate the dough, covered, up to 12 hours.)\n            \n\n              Preheat the oven to 350 degrees F. Line 2 baking sheets with parchment; brush with olive oil. Cut the dough in half crosswise with a chef's knife or pizza cutter to make two 6-inch squares. Cut each half into 10 equal pieces.\n            \n\n              On a lightly floured surface, stretch and roll each piece of dough with your hands into a thin 12-to-14-inch-long rope. Transfer the ropes to the prepared baking sheets, arranging them about 1/2 inch apart.\n            \n\n              Whisk the egg white with 2 tablespoons water in a small bowl. Brush the breadsticks lightly with the egg wash, then sprinkle with parmesan. Cover loosely with plastic wrap; set aside 10 minutes.\n            \n\n              Uncover the breadsticks and bake until golden and crisp, about 30 minutes, rotating the baking sheets halfway through. Slide off the baking sheets and let cool on racks. (The breadsticks will crisp up as they cool; if they are still flexible, bake about 7 more minutes.) Store in an airtight container up to 3 days.\n            \n\n              Photograph by Andrew Purcell\n            \n", "ingredients": [{"food": "sugar", "quantity": 1}, {"food": "yeast extract spread", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "potato flour", "quantity": 2.25}, {"food": "salt", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "parmesan cheese", "quantity": 1}], "title": "\nParmesan Breadsticks\n"}, {"directions": "\n\n              Preheat a baking sheet on the lower rack in a 450 oven. Blanch 1 head chopped broccoli in boiling water with salt and sliced garlic for 1 minute; drain. Toss with a splash of olive oil, a handful each of breadcrumbs and parmesan, salt and pepper. Place on the hot baking sheet and top with more cheese and breadcrumbs; roast until golden, 15 minutes.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nParmesan Broccoli\n"}, {"directions": "\n\n              Toss 1 1/2 cups freshly grated parmesan with 1 tablespoon flour, then flavor with 1 to 2 teaspoons minced herbs, spices and/or citrus zest. Make 12 mounds of the cheese mixture (2 tablespoons each) on a baking sheet lined with parchment and coated with cooking spray; flatten into 4-inch rounds. Bake at 375 degrees F until golden, 8 to 10 minutes. While hot, gently remove with a thin spatula and let cool completely.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [], "title": "\nParmesan Crisps\n"}, {"directions": "\n\n              Put a baking sheet in the oven and preheat to 250 degrees F. Whisk 4 eggs, the milk, 1/4 cup cheese, the parsley, 1/2 teaspoon salt and a few grinds of pepper in a baking dish; set aside.\n            \n\n              Heat 1 tablespoon olive oil in a large nonstick skillet over medium heat. Add the pancetta and cook, flipping, until crisp, 4 to 5 minutes. Drain on paper towels; reserve the drippings in the skillet.\n            \n\n              Heat 1 tablespoon olive oil in another large nonstick skillet over medium heat. Add the bread to the egg mixture and let soak, turning once, about 1 minute. Add 4 of the bread slices to the skillet and sprinkle each with 1 tablespoon cheese. Cook until golden on the bottom, about 2 minutes. Flip, sprinkle each with 1 tablespoon cheese and cook until golden and the cheese on the bottom is crisp, about 2 minutes. Flip again and cook until the cheese melts, about 1 more minute. Transfer to the baking sheet to keep warm and repeat with the remaining bread and cheese.\n            \n\n              Heat the skillet with the pancetta drippings over medium heat. Crack the remaining 4 eggs into the skillet and cook until the whites are set, about 3 minutes. Divide the French toast among plates and top with the fried eggs. Toss the arugula in a bowl with the remaining 1 tablespoon olive oil and a pinch each of salt and pepper. Add to the plates. Drizzle with the vinegar and season with pepper.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "eggs", "quantity": 8.0}, {"food": "milk", "quantity": 0.75}, {"food": "parmesan cheese", "quantity": 1.25}, {"food": "parsley", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "garlic bread", "quantity": 8.75}, {"food": "arugula", "quantity": 6.0}, {"food": "vinegar", "quantity": 1.0}], "title": "\nParmesan French Toast with Pancetta and Eggs\n"}, {"directions": "\n\n              Slice one 18-ounce tube polenta into 1/2-inch-thick \"fries.\" Working in batches, dredge the fries in flour and deep-fry in 1 inch 375 degrees F vegetable oil until lightly golden and crisp. Remove and drain on a paper towel-lined plate; sprinkle with grated parmesan and chopped mixed herbs. Season with salt and pepper.\n            \n", "ingredients": [], "title": "\nParmesan Polenta Fries\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F and line a baking sheet with foil. Season the pork chops with salt and pepper. Heat 1 tablespoon vegetable oil in a large nonstick skillet over medium-high heat. Add the pork chops and sear until golden brown, 2 to 3 minutes per side. Transfer to the prepared baking sheet (reserve the skillet).\n            \n\n              Mix the parmesan, oregano, lemon zest and garlic in a small bowl. Sprinkle on the pork chops. Bake until just cooked through, about 5 minutes. Remove from the oven and let rest 5 minutes.\n            \n\n              Meanwhile, add the figs and 3 tablespoons water to the reserved skillet. Cook over medium-low heat until the figs are soft and most of the water has evaporated, about 2 minutes; season with salt and pepper. Transfer to a large bowl and add the arugula, fennel, croutons, the remaining 1 tablespoon vegetable oil and the lemon juice; toss. Serve with the pork.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [{"food": "pork skins", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "parmesan cheese", "quantity": 0.25}, {"food": "", "quantity": 0.5}, {"food": "grape juice", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "figs", "quantity": 12.0}, {"food": "arugula", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "croutons", "quantity": 1.0}], "title": "\nParmesan Pork Chops with Arugula-Fig Salad\n"}, {"directions": "\n\n              Cut 2 fennel bulbs into 1-inch wedges; toss with 3 tablespoons olive oil, 1 tablespoon chopped thyme, 1/2 teaspoon kosher salt and a pinch of red pepper flakes on a rimmed baking sheet. Cover with foil and roast at 425 degrees F, 20 minutes. Uncover and toss; continue roasting until tender and golden, 15 to 20 minutes, sprinkling with 1/4 cup shredded parmesan during the last 5 minutes.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [], "title": "\nParmesan Roasted Fennel\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Coat a 9-inch-square baking dish or a 9-inch cast-iron skillet with cooking spray. Whisk the cornmeal, flour, sugar, baking powder, baking soda and 1/4 teaspoon salt in a large bowl. In a separate bowl, whisk the egg, milk, sour cream and melted butter; whisk into the dry ingredients until combined. Fold in the corn, parmesan and basil.\n            \n\n              Pour the batter into the prepared dish or skillet. Bake until the cornbread springs back when pressed in the center, 25 to 35 minutes. Let cool 15 minutes in the dish, then loosen the edges and slice.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "yellow rice", "quantity": 1.5}, {"food": "potato flour", "quantity": 0.25}, {"food": "sugar", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "egg substitute", "quantity": 1.0}, {"food": "milk", "quantity": 1.0}, {"food": "silk plain soy yogurt", "quantity": 1.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "sunflower seed kernels", "quantity": 0.5}, {"food": "parmesan cheese", "quantity": 0.5}, {"food": "basil", "quantity": 0.25}], "title": "\nParmesan-Basil Cornbread\n"}, {"directions": "\n\n              Grate the zest of 1 lemon and set aside; juice both lemons. Combine the garlic and olive oil in a large microwave-safe bowl and microwave until the garlic starts sizzling, 1 to 2 minutes; let cool. Add the lemon juice, herb sprigs, 1 teaspoon each salt and pepper, and the chicken wings. Using your hands, rub the wings with the oil mixture; firmly press the wings down, making sure they are covered with some of the herbs and garlic. Cover and refrigerate at least 4 hours or overnight, stirring once or twice.\n            \n\n              Meanwhile, pulse the butter, basil leaves, lemon zest and 1/2 teaspoon each salt and pepper in a mini food processor until combined. Cover and refrigerate until ready to use.\n            \n\n              Preheat a grill to medium high and prepare for indirect grilling: On a charcoal grill, bank the coals to one side; on a gas grill, turn off half the burners. Remove the basil butter from the refrigerator. Remove the wings from the marinade. Brush the grill grates with olive oil and place the wings on the cooler side of the grill (indirect heat). Cover the grill and cook, turning the wings once, until almost completely cooked through and the skin is beginning to crisp, about 30 minutes. Move to direct heat and grill, turning often, until the skin is crisp and lightly charred, 10 to 15 more minutes.\n            \n\n              Transfer the wings to a large bowl. Add the basil butter and toss to coat. Add the parmesan and season with salt and pepper; toss again. Serve with lemon wedges.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "lemons", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "basil", "quantity": 0.5}, {"food": "", "quantity": 5.0}, {"food": "thyme", "quantity": 8.0}, {"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 5.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "parmesan cheese", "quantity": 0.25}], "title": "\nParmesan-Garlic Chicken Wings\n"}, {"directions": "\n\n              Slice 1 head cauliflower into florets and halve; spread in a single layer on a baking sheet. Drizzle with 3 tablespoons olive oil. Sprinkle with 1/4 cup grated parmesan, 1 1/2 teaspoons chopped mixed thyme and rosemary, 1 teaspoon kosher salt and a few grinds of pepper. Roast at 425 degrees F, 30 minutes; flip and roast 15 more minutes.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [], "title": "\nParmesan-Herb Cauliflower\n"}, {"directions": "\n\n              Make Classic Shortbread dough, adding 1/2 cup parmesan, 1 tablespoon lemon zest and 2 teaspoons pepper with the butter. Roll into tiny balls, then bake 8 to 12 minutes at 300 degrees.\n            \n", "ingredients": [], "title": "\nParmesan-Pepper Balls\n"}, {"directions": "\n\n              Peel and roughly chop 2 pounds parsnips. Cook in boiling salted water until soft, about 20 minutes; drain. Puree with 3 tablespoons butter; season with salt and pepper. Sprinkle with grated parmesan.\n            \n\n              Use a food processor or immersion blender to puree these veggies-they're too fibrous for a potato masher.\n            \n\n              Photograph by Sam Kaplan\n            \n", "ingredients": [], "title": "\nParsnip Mash\n"}, {"directions": "\n\n              Make the applesauce: Cut the apples into 1-inch pieces. Remove 3 wide strips zest from the lemon with a vegetable peeler; transfer to a saucepan and squeeze in the lemon juice. Add the apples and cinnamon stick, cover and cook over medium heat until soft, 15 to 20 minutes. Uncover and increase the heat to medium high. Continue to cook, mashing and stirring the apples, until they thicken, 10 to 15 minutes. Remove the cinnamon stick, then pass the apples through a food mill or puree in a food processor. Set aside until ready to serve.\n            \n\n              Meanwhile, make the latkes: Grate the potatoes, parsnips and onion using the medium grater attachment of a food processor or the large holes of a box grater. Squeeze the mixture by the handful over the sink to remove any excess liquid. Mix with the garlic, eggs, parsley and chives in a large bowl, then add the flour and 1/2 teaspoon each salt and pepper. Shape into 12 thin patties, squeezing to remove any remaining liquid as you form each one; lay on a sheet of parchment.\n            \n\n              Heat 1/4 inch of peanut oil in a large skillet over medium-high heat. Fry the latkes in batches until golden brown, 4 to 5 minutes per side. Drain on paper towels and season with salt while hot. Serve with the cinnamon applesauce.\n            \n\n              Photograph by Anna Williams\n            \n", "ingredients": [{"food": "mixed nuts", "quantity": 3.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 0.5}, {"food": "", "quantity": 0.5}, {"food": "onion powder", "quantity": 0.5}, {"food": "garlic powder", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "parsley", "quantity": 2.0}, {"food": "chives", "quantity": 2.0}, {"food": "potato flour", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1}], "title": "\nParsnip-Potato Latkes With Cinnamon Applesauce\n"}, {"directions": "\n\n              Cook 2 strips chopped thick-cut bacon in vegetable oil over medium-high heat until almost crisp. Add 1 thinly sliced onion; cook until softened. Add 1 pound parsnips (peeled and cut into 2-inch pieces), 2 sliced celery stalks, and salt and pepper. Cook until lightly browned, 5 minutes. Add 1 1/2 cups chicken broth;simmer until mostly reduced, 10 minutes. Add a little water; stir in 1 tablespoon butter, some chopped parsley and thyme, and salt and pepper.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [], "title": "\nParsnips with Bacon\n"}, {"directions": "\n\n              Melt 4 tablespoons butter and one 10-ounce bag marshmallows in a pot over medium heat, stirring, then remove from the heat and stir in 6 cups party mix (such as Chex Mix). Press into a buttered 9-by-13-inch baking dish and let set. Sprinkle with coarse salt before slicing.\n            \n\n              Photograph by Ralph Smith\n            \n", "ingredients": [], "title": "\nParty Mix Marshmallow Treats\n"}, {"directions": "\nSpecial equipment: 8-inch springform pan\n\n              For the cheesecake: Position a rack in the middle of the oven and preheat to 325 degrees F. Brush an 8-inch springform pan with a light coating of canola oil.\n            \n\n              Puree the mango and passion fruit juice in a food processor until smooth. Add the cream cheese and continue to process until smooth. Then add the sugar, yogurt, and cornstarch, pulsing to combine. Then add the eggs, lime zest and juice and pulse to combine. Take care not to overmix the batter. Pour batter into the prepared pan.\n            \n\n              Bake the cheesecake until the outside of the cake is set but the center is still a little loose, about 45 minutes. Turn the oven off and open the door to let out some heat. Close door and continue to cook the cheesecake in the residual heat in the oven for 20 minutes. This gentle finish minimizes the risk of the dreaded crack in your cheesecake.\n            \n\n              Run a knife around the edges and cool to room temperature, about 1 hour. Cover and refrigerate for 1 hour.\n            \n\n              Meanwhile make the topping: Put about half of the passion fruit juice and all the lime juice in a medium bowl and sprinkle the gelatin over the surface. Don't stir. Set aside until the gelatin \"blooms\", about 1 minute. Boil the remaining passion fruit juice and all of the sugar in a small saucepan until the sugar dissolves. Whisk the hot juice into the gelatin mixture until smooth. Refrigerate until just begins to set, about 20 minutes. Stir in the fresh passion fruit pulp and seeds and pour over the top of the cooled cheesecake. Refrigerate for at least 8 hours or overnight.\n            \n\n              To make mango coulis: Puree the passion fruit juice, mango, lime juice, and sugar in a food processor.\n            \n\n              Bring cheesecake to room temperature 30 minutes before serving. Remove the springform ring. To serve, dip a knife in warm water, wipe dry before slicing each piece. Serve with mango coulis.\n            \n", "ingredients": [{"food": "pan dulce", "quantity": 1}, {"food": "diced chicken", "quantity": 1.0}, {"food": "fruit juice smoothie", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "silk banana-strawberry soy yogurt", "quantity": 2.0}, {"food": "cornstarch", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "", "quantity": 3.0}, {"food": "lime", "quantity": 1.0}, {"food": "lime juice", "quantity": 1.0}, {"food": "fruit juice smoothie", "quantity": 1.0}, {"food": "lime juice", "quantity": 1.0}, {"food": "", "quantity": 1.5}, {"food": "sugar", "quantity": 2.0}, {"food": "fruit cocktail", "quantity": 1}, {"food": "fruit juice smoothie", "quantity": 0.25}, {"food": "black bean mango", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "lime juice", "quantity": 0.5}], "title": "\nPassion Fruit Cheesecake\n"}, {"directions": "\n\n              Combine 1 cup tequila, 1 cup passion fruit nectar, 1/4 cup orange-flavored liqueur, 2 teaspoons superfine sugar and a pinch of salt in a cocktail shaker. Shake well, then pour into 4 short glasses filled with crushed ice. Rub the rims with lime wedges, then add to the drink.\n            \n", "ingredients": [], "title": "\nPassion Fruit Margaritas\n"}, {"directions": "\n\n              Cut the passion fruits in half and scoop the seeded flesh into a blender. Add the mango, yogurt, orange juice, vanilla, a pinch of salt and 4 ice cubes. Blend until smooth; you'll still be able to see the broken up seeds. Drink right away.\n            \n", "ingredients": [{"food": "", "quantity": 2.0}, {"food": "black bean mango", "quantity": 0.5}, {"food": "silk banana-strawberry soy yogurt", "quantity": 0.3333333333333333}, {"food": "", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 0.25}, {"food": "salt", "quantity": 1}], "title": "\nPassion Fruit-Mango Smoothie\n"}, {"directions": "\n\n              Combine the vodka, passion fruit puree and coconut syrup in a cocktail shaker; fill with ice. Shake well and strain into 2 cocktail glasses. Garnish with cherries.\n            \n", "ingredients": [{"food": "", "quantity": 4.0}, {"food": "fruit cocktail", "quantity": 4.0}, {"food": "coconut water", "quantity": 1.0}, {"food": "maraschino cherries", "quantity": 1}], "title": "\nPassion Potion\n"}, {"directions": "\n\n              Fill a cocktail shaker with ice. Pour the vodka, passion fruit juice, syrup, and lime juice into the shaker. Cover and shake vigorously, until combined and chilled, about 30 seconds. (In general, by the time the shaker mists up the drink is ready.) Strain cosmo into a chilled cocktail glass. Sprinkle with passion fruit seeds, if desired.\n            \n\n              Copyright (c) 2005 Television Food Network, G.P., All Rights Reserved.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "", "quantity": 3.0}, {"food": "fruit juice smoothie", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "lime juice", "quantity": 0.5}, {"food": "fruit cocktail", "quantity": 1}], "title": "\nPassionate Cosmos\n"}, {"directions": "\n\n              Heat the olive oil in a large skillet over medium-high heat. Add the chorizo and cook, stirring occasionally, until golden and crisp, about 3 minutes. Remove to a plate using a slotted spoon. Add the pasta to the skillet and season with 1/4 teaspoon salt and a few grinds of pepper. Cook, stirring constantly, until toasted, about 3 minutes.\n            \n\n              Add the paprika and garlic to the skillet. Cook, stirring, 1 minute. Add 2 cups water, the green beans, olives and chorizo; nestle the clams in the skillet. Cover and cook until the pasta is tender and the clams open, 8 to 10 minutes. (Discard any unopened clams.) Stir in the piquillo pepper and parsley. Serve with lemon wedges.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 6.0}, {"food": "italian veg medley pasta", "quantity": 12.0}, {"food": "salt", "quantity": 1}, {"food": "paprika", "quantity": 1.5}, {"food": "garlic powder", "quantity": 2.0}, {"food": "fava beans", "quantity": 4.0}, {"food": "olives", "quantity": 0.3333333333333333}, {"food": "", "quantity": 16.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "parsley", "quantity": 0.5}, {"food": "", "quantity": 1}], "title": "\nPasta Paella with Clams\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the fusilli and cook as the label directs. Add the sugar snap peas and/or broccoli, carrots and bell pepper to the boiling water during the last 2 minutes of cooking. Reserve 1/2 cup cooking water, then drain the pasta and vegetables and return to the pot.\n            \n\n              Meanwhile, heat the olive oil in a large skillet over medium heat. Add the garlic and cook until just golden, about 30 seconds. Add the tomatoes, red pepper flakes and 1 teaspoon salt; cook until the tomatoes begin to wilt, about 2 minutes. Stir in 1/4 cup of the reserved cooking water. Pour the tomato mixture over the pasta and vegetables. Add the mint, parmesan and half the goat cheese and toss to combine. Season with salt.\n            \n\n              Divide the pasta among bowls. Top with the remaining goat cheese and drizzle with olive oil.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "italian veg medley pasta", "quantity": 12.0}, {"food": "barley flour or meal", "quantity": 0.5}, {"food": "carrots", "quantity": 2.0}, {"food": "yellow rice", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "garlic powder", "quantity": 4.0}, {"food": "silk black cherry soy yogurt", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.75}, {"food": "", "quantity": 0.5}, {"food": "parmesan cheese", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 4.0}], "title": "\nPasta Primavera\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the pasta and cook as the label directs, adding the broccoli, carrots, bell pepper and peas during the last 3 minutes of cooking. Reserve 1 cup cooking water, then drain the pasta and vegetables and return to the pot.\n            \n\n              Meanwhile, make the sauce: Heat 2 tablespoons butter in a large skillet over medium-high heat. Add the garlic and cook, stirring, until it begins to soften, about 1 minute. Add the vegetable broth, 1/2 teaspoon salt, and pepper to taste; bring to a simmer and cook until slightly reduced, about 3 minutes. Whisk in the remaining 2 tablespoons butter until melted and the sauce is thickened, about 1 more minute.\n            \n\n              Pour the sauce over the pasta and vegetables and add the cheese, parsley and lemon juice. Cook over low heat, stirring, until the cheese melts, about 1 minute, adding enough of the reserved pasta water to loosen the sauce. Season with salt and pepper and top with more cheese.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "", "quantity": 12.0}, {"food": "broccoli raab", "quantity": 4.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "pigeon peas", "quantity": 1.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "parmesan cheese", "quantity": 0.5}, {"food": "barley flour or meal", "quantity": 2.0}, {"food": "", "quantity": 0.5}], "title": "\nPasta Primavera\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the pasta and cook as the label directs. Reserve 1/2 cup cooking water, then drain.\n            \n\n              Meanwhile, whisk 3 tablespoons olive oil, the vinegar and beet juice in a large bowl; season with 1/2 teaspoon salt and a few grinds of pepper. Add the beets, radishes and radicchio and toss well to coat. Set aside.\n            \n\n              Heat the remaining 5 tablespoons olive oil in a large skillet over medium-high heat. Add the red onion, garlic, 1/2 teaspoon salt and a few grinds of pepper. Cook, stirring occasionally, until the onion is softened, about 4 minutes; add to the beet mixture and toss to coat.\n            \n\n              Add the pasta, basil and 1/4 cup each ricotta salata and reserved cooking water to the beet mixture; season with salt and pepper. Toss well to coat, adding enough of the remaining cooking water to loosen. Top with the remaining ricotta salata.\n            \n\n              Photograph by David Malosh\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "italian veg medley pasta", "quantity": 12.0}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "vinegar", "quantity": 2.0}, {"food": "grape juice", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "basil", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 0.5}], "title": "\nPasta Primavera with Beets, Radishes and Radicchio\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the pasta and cook as the label directs. Reserve 1/2 cup cooking water, then drain.\n            \n\n              Meanwhile, melt the butter in a large nonstick skillet over medium heat. Add the carrots, bell peppers, squash, chile, garlic, thyme and vinegar; season with 1/2 teaspoon salt and a few grinds of pepper. Reduce the heat to medium low; cover and cook, stirring halfway through, until the vegetables are very tender, about 20 minutes.\n            \n\n              Add the heavy cream to the skillet; bring to a simmer. Gradually stir in the parmesan until just melted, about 1 minute. Add the tomatoes.\n            \n\n              Increase the heat to medium and add the pasta and the reserved cooking water. Cook, tossing, until coated, about 2 minutes; season with salt and pepper. Top with more parmesan.\n            \n\n              Photograph by David Malosh\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "egg substitute", "quantity": 1.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "thyme", "quantity": 1.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "pepper", "quantity": 1}, {"food": "ice cream swich", "quantity": 0.75}, {"food": "parmesan cheese", "quantity": 0.3333333333333333}, {"food": "barley flour or meal", "quantity": 1.5}], "title": "\nPasta Primavera with Carrots, Bell Peppers and Squash\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the pasta and cook as the label directs; add the peas, asparagus and kale to the pot during the last 3 minutes of cooking and stir occasionally. Reserve 1/2 cup cooking water, then drain the pasta and vegetables.\n            \n\n              Meanwhile, combine the olive oil, all but 2 tablespoons chives, the lemon zest and juice, 1 teaspoon salt and a few grinds of pepper in a blender. Add 3 tablespoons cold water and pulse until smooth, scraping down the inside of the blender. Transfer to a large bowl. Stir in the tarragon and drizzle with olive oil.\n            \n\n              Add the pasta and vegetables to the chive puree along with 1/4 cup of the reserved cooking water and half of the cheese; season with salt and pepper. Toss well to coat, adding more cooking water to loosen, if necessary. Serve topped with the remaining cheese and chives.\n            \n\n              Photograph by David Malosh\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "", "quantity": 8.0}, {"food": "pigeon peas", "quantity": 8.0}, {"food": "asparagus", "quantity": 1.0}, {"food": "kale", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "chives", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "", "quantity": 1.0}, {"food": "parmesan cheese", "quantity": 0.25}], "title": "\nPasta Primavera with Peas, Asparagus and Kale\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the pasta and cook as the label directs; drain and rinse under cold water. Transfer to a large bowl.\n            \n\n              Add the asparagus, corn and sun-dried tomatoes to the bowl with the pasta.\n            \n\n              Make the dressing: Mix the mayonnaise, sour cream, lemon juice, garlic, parmesan, and salt and pepper to taste in a bowl. Pour over the pasta salad and toss to coat. Season with salt and pepper. Chill for up to 3 hours.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "italian veg medley pasta", "quantity": 0.5}, {"food": "asparagus", "quantity": 1.0}, {"food": "sunflower seed kernels", "quantity": 1.0}, {"food": "tomatoes", "quantity": 0.5}, {"food": "mayonnaise dressing", "quantity": 0.25}, {"food": "sour cream", "quantity": 0.25}, {"food": "lemon juice", "quantity": 1.0}, {"food": "garlic powder", "quantity": 0.25}, {"food": "parmesan cheese", "quantity": 0.75}, {"food": "pepper", "quantity": 1}], "title": "\nPasta Salad With Asparagus, Corn and Sun-Dried Tomatoes\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the pasta and cook as the label directs; drain and rinse under cold water. Transfer to a large bowl.\n            \n\n              Add the chicken, cucumber, cherry tomatoes and feta to the bowl with the pasta.\n            \n\n              Make the dressing: Cook the garlic and red pepper flakes in a saucepan with the olive oil over medium heat, stirring, 3 minutes; let cool. Season with salt and pepper. Pour over the pasta salad and toss to coat. Season with salt and pepper. Chill for up to 3 hours.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "", "quantity": 0.5}, {"food": "diced chicken", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "silk black cherry soy yogurt", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 0.5}, {"food": "garlic powder", "quantity": 3.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "pepper", "quantity": 1}], "title": "\nPasta Salad With Chicken, Cucumber, Cherry Tomatoes and Feta\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the tortellini and cook as the label directs; drain and rinse under cold water. Transfer to a large bowl.\n            \n\n              Add the salami, carrots, peas and roasted red peppers to the bowl with the tortellini.\n            \n\n              Make the dressing: Whisk the olive oil, white wine vinegar, shallot, 1/2 teaspoon salt and pepper to taste in a bowl. Pour over the pasta salad and toss to coat. Season with salt and pepper. Chill for up to 3 hours.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "tortellini", "quantity": 0.5}, {"food": "salami", "quantity": 1.0}, {"food": "carrots", "quantity": 1.0}, {"food": "pigeon peas", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "vinegar", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "pepper", "quantity": 1}], "title": "\nPasta Salad With Salami, Carrots, Peas and Roasted Red Peppers\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the pasta and cook as the label directs; drain and rinse under cold water. Transfer to a large bowl.\n            \n\n              Add the steak, bell pepper, green beans and bacon to the bowl with the pasta.\n            \n\n              Make the dressing: Mix the mayonnaise, sour cream, lemon juice, garlic, parmesan, and salt and pepper to taste in a bowl. Pour over the pasta salad and toss to coat. Season with salt and pepper. Chill for up to 3 hours.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "italian veg medley pasta", "quantity": 0.5}, {"food": "", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "fava beans", "quantity": 1.0}, {"food": "bacon", "quantity": 0.5}, {"food": "mayonnaise dressing", "quantity": 0.25}, {"food": "sour cream", "quantity": 0.25}, {"food": "lemon juice", "quantity": 1.0}, {"food": "garlic powder", "quantity": 0.25}, {"food": "parmesan cheese", "quantity": 0.75}, {"food": "pepper", "quantity": 1}], "title": "\nPasta Salad With Steak, Bell Pepper, Green Beans and Bacon\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the pasta and cook as the label directs; drain and rinse under cold water. Transfer to a large bowl. \n            \n\n              Add the tuna, celery, white beans and olives to the bowl with the pasta. \n            \n\n              Make the dressing: Whisk the mayonnaise, sour cream, lemon juice, herbs, and salt and pepper to taste in a bowl. Pour over the pasta salad and toss to coat. Season with salt and pepper. Chill for up to 3 hours. \n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "italian veg medley pasta", "quantity": 0.5}, {"food": "tuna salad", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "fava beans", "quantity": 1.0}, {"food": "olives", "quantity": 0.5}, {"food": "mayonnaise dressing", "quantity": 0.5}, {"food": "sour cream", "quantity": 3.0}, {"food": "lemon juice", "quantity": 1.5}, {"food": "mixed nuts", "quantity": 0.5}, {"food": "pepper", "quantity": 1}], "title": "\nPasta Salad With Tuna, Celery, White Beans and Olives\n"}, {"directions": "\n\n              In a large bowl, whisk together the juice of 3 lemons, the honey and chopped dill. Slowly whisk in the olive oil until the dressing is emulsified. Season with salt and pepper. Reserve. \n            \n\n              Bring a large stockpot of water to a boil. Add the juice of the remaining 2 lemons, the dill stems and 1/2 cup salt. Add the shrimp and cook until opaque and cooked through, 3 to 4 minutes. Remove the shrimp using a slotted spoon and add to the dressing. Toss to coat. \n            \n\n              Bring the poaching liquid back up to a boil. Drop the pasta and cook until al dente, 9 to 10 minutes. Drain the pasta and run it under cold water until the pasta is cooled. Remove the dill stems. \n            \n\n              Add the pasta, grape tomatoes and cucumbers to the bowl with the shrimp and toss to combine. Season with salt and pepper.\n            \n", "ingredients": [{"food": "lemons", "quantity": 5.0}, {"food": "honey smoked ham", "quantity": 2.0}, {"food": "dill seed", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "grape juice", "quantity": 2.0}, {"food": "diced chicken", "quantity": 2.0}], "title": "\nPasta Salad with Poached Shrimp and Lemon-Dill Dressing\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the pasta and cook until just al dente, about 10 minutes. Add the escarole and cook, stirring occasionally, until tender, about 2 more minutes.\n            \n\n              Meanwhile, toast the pine nuts in a large skillet over medium-high heat, about 1 minute. Add 1 tablespoon olive oil, the breadcrumbs, and salt and pepper to taste; cook until golden, about 2 minutes. Transfer the mixture to a plate. Wipe out the skillet, add the pancetta and cook until crisp, about 5 minutes. Transfer to paper towels and blot dry.\n            \n\n              Add the remaining 1 tablespoon olive oil to the skillet, then add the garlic and jalapeno and cook until fragrant, about 1 minute. Drain the pasta and escarole, reserving 1 cup cooking water, and add to the skillet. Add half of the pancetta and toss, drizzling in enough pasta water to moisten. Season with salt and pepper.\n            \n\n              Divide the pasta among bowls, top with the breadcrumb mixture, remaining pancetta and the parmesan. Drizzle with olive oil.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "spaghetti", "quantity": 12.0}, {"food": "escarole", "quantity": 1.0}, {"food": "pine nuts", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "pepper", "quantity": 1}, {"food": "", "quantity": 0.25}, {"food": "garlic powder", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "parmesan cheese", "quantity": 2.0}], "title": "\nPasta With Escarole\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Meanwhile, heat 3 tablespoons olive oil in a large skillet over medium-high heat. Add the garlic and cook 30 seconds, then stir in the escarole, chickpeas, 1/4 teaspoon salt and the red pepper flakes; cover and cook until the escarole wilts, 3 to 4 minutes. Add the pasta to the boiling water and cook as the label directs. After a few minutes, remove 1 1/2 cups of the pasta cooking water and add to the skillet with the escarole mixture; simmer, uncovered, until the liquid is reduced by half and the escarole is tender, about 5 minutes. When the pasta is done, reserve 1 cup cooking water, then drain. Add the pasta to the skillet and cook, tossing to combine, 1 minute; add some of the reserved cooking water if the pasta seems dry. Add the remaining 1 tablespoon olive oil and toss. Remove from the heat and stir in the cheese.\n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "garlic powder", "quantity": 6.0}, {"food": "escarole", "quantity": 1.0}, {"food": "chickpeas", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "italian veg medley pasta", "quantity": 12.0}, {"food": "parmesan cheese", "quantity": 0.5}], "title": "\nPasta With Escarole and Chickpeas\n"}, {"directions": "\n\n              Preheat the oven to 450 degrees F. Bring a large pot of salted water to a boil. Put 2 pieces of foil side by side on a baking sheet. Put the almonds on one piece of foil and the broccoli on the other. Transfer to the oven; roast until the almonds are lightly toasted, about 7 minutes. Remove the foil with the almonds. Continue roasting the broccoli until tender, about 7 more minutes. Season the broccoli with salt and pepper and transfer to a large bowl. \n            \n\n              Add the pasta to the boiling water and cook as the label directs. Meanwhile, pulse the almonds in a food processor until finely chopped; with the motor running, add the garlic and process until finely chopped. Drizzle in the olive oil and process until blended. Add the basil and pulse until smooth; transfer to the bowl with the broccoli. \n            \n\n              Put the tomatoes and half of their juice (about 1 cup) in the food processor and pulse until pureed. Add to the bowl with the broccoli mixture and stir to combine. Add 1 teaspoon salt and 1/2 teaspoon pepper. Drain the pasta and toss with the sauce. \n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "almonds", "quantity": 0.5}, {"food": "basil", "quantity": 1.0}, {"food": "whole milk", "quantity": 1.0}, {"food": "broccoli raab", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "spaghetti", "quantity": 12.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 0.5}], "title": "\nPasta With Roasted Broccoli and Almond-Tomato Sauce\n"}, {"directions": "\n\n              Toss the tomatoes in a large bowl with 2 tablespoons olive oil, the vinegar and a large pinch each of salt and pepper; set aside to marinate.\n            \n\n              Meanwhile, bring a large pot of salted water to a boil. Add the pasta and cook as the label directs. Reserve 1/2 cup cooking water, then drain. Add the warm pasta to the tomatoes along with the salami and 1/4 cup of the reserved cooking water; stir to combine.\n            \n\n              Add the remaining 1 tablespoon olive oil, the mozzarella, basil and parsley to the pasta; toss until combined and slightly saucy. Add the remaining reserved cooking water as needed to loosen, 1 tablespoon at a time. Season with salt and pepper.\n            \n", "ingredients": [{"food": "", "quantity": 1.5}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "italian veg medley pasta", "quantity": 12.0}, {"food": "salami", "quantity": 2.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "basil", "quantity": 0.5}, {"food": "parsley", "quantity": 2.0}], "title": "\nPasta With Tomatoes, Salami and Smoked Mozzarella\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the pasta and cook as the label directs, adding the broccolini during the last 2 minutes of cooking. Reserve 1 cup cooking water, then drain the pasta and broccolini. Meanwhile, roll the sausage meat into about 20 small meatballs. Heat 1 tablespoon olive oil in a large skillet over medium-high heat. Add the meatballs and cook, turning occasionally, until browned and cooked through, 5 to 6 minutes. Drain on paper towels. Pour off any drippings from the skillet, then add the remaining 3 tablespoons olive oil, the garlic, red pepper flakes and 1/2 teaspoon salt. Cook over medium heat, stirring, 1 minute. Add the pasta, broccolini and meatballs. Whisk the egg with the reserved cooking water in a small bowl, then add to the skillet and stir until the sauce thickens slightly. Season with salt and pepper. Divide the pasta among bowls. Sprinkle with the cheese and drizzle with olive oil. \n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "italian veg medley pasta", "quantity": 12.0}, {"food": "", "quantity": 2.0}, {"food": "pork turkey sausage", "quantity": 8.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "garlic powder", "quantity": 4.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "egg substitute", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "parmesan cheese", "quantity": 0.5}], "title": "\nPasta With Turkey Meatballs\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the pasta and cook as the label directs. Drain, reserving 1 cup cooking water.\n            \n\n              Trim the zucchini, then coarsely grate into a colander set in the sink. Toss the zucchini with 1/4 teaspoon salt and let sit 10 minutes.\n            \n\n              Meanwhile, heat the olive oil in a large skillet over medium heat. Add the garlic, red pepper flakes and 1/4 teaspoon salt and cook, stirring, until the garlic is golden, 3 to 4 minutes. Add the tomatoes and cook until slightly softened, 3 to 4 minutes. Squeeze any excess moisture from the zucchini, then add to the skillet. Add the pasta, ham and the reserved cooking water and toss until warmed through, 2 to 3 minutes. Season with salt and pepper. Remove from the heat and fold in the cheese, parsley and mint.\n            \n\n              Photographs by Antonis Achilleos\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "italian veg medley pasta", "quantity": 10.0}, {"food": "", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "pineapple chunks", "quantity": 2.0}, {"food": "ham", "quantity": 0.25}, {"food": "pepper", "quantity": 1}, {"food": "macaroni cheese", "quantity": 0.3333333333333333}, {"food": "parsley", "quantity": 3.0}, {"food": "chrysanthemum leaves", "quantity": 6.0}], "title": "\nPasta With Zucchini and Ham\n"}, {"directions": "\n\n              Heat the olive oil in a large pot over medium heat. Add the onion, garlic and red pepper flakes and cook, stirring occasionally, until the onion is slightly soft, about 2 minutes. Remove 1 tablespoon of the flavored oil and set aside. Add the tomato paste and cook, stirring, 2 more minutes. Add the chicken broth, 4 cups water and the cheese rind, if using. Bring to a boil, then add the pasta and cook, stirring occasionally, 5 minutes. Add the lentils along with the liquid from one of the cans; reduce the heat to medium low and simmer until the pasta is tender, 10 to 12 more minutes. Meanwhile, whisk 1 tablespoon parsley and 1 tablespoon water into the reserved flavored oil. Stir 1/4 cup parmesan and the remaining parsley into the soup; remove the cheese rind (if using) and add salt to taste. Ladle into bowls; drizzle with the flavored oil and top with the remaining 1/4 cup parmesan. Serve with bread, if desired. \n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 5.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "garlic powder", "quantity": 4.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.75}, {"food": "pasta with tomato sauce", "quantity": 2.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "parmesan cheese", "quantity": 0.5}, {"food": "italian veg medley pasta", "quantity": 8.0}, {"food": "", "quantity": 2.0}, {"food": "parsley", "quantity": 0.3333333333333333}, {"food": "salt", "quantity": 1}, {"food": "garlic bread", "quantity": 1}], "title": "\nPasta and Lentil Soup\n"}, {"directions": "\n\n              The night before serving, sort through the beans and discard any small, cracked or shriveled ones. Place the beans in a pot or jar large enough to cover them with water by at least 3 inches. Leave the beans in a cool place or in the refrigerator overnight to rehydrate.\n            \n\n              The next day, strain the beans through a colander (discard the water). Add the beans to a medium saucepan with enough water to cover by at least 2 inches, about from the tip of your finger to your knuckle. Turn the heat to medium-high, bring the liquid to a boil, then return to a simmer and cook, stirring occasionally and skimming off any foam that rises to the top, until the beans are tender, 50 minutes to 1 hour. Add additional water when necessary to keep the beans submerged. When the beans are done, turn off the heat, add 1 1/2 teaspoons salt and stir to incorporate; set aside.\n            \n\n              Put the salt pork in a medium pot over medium heat and cook, stirring occasionally, until crispy, about 12 minutes. Remove the salt pork and discard. Pour off all but 2 tablespoons of the fat. Add the tomato paste to the pot, and cook until it darkens, about 2 minutes. Add 2 cups of the cooking water from the beans, and simmer for 10 minutes. Strain the beans, add them to the pot and cook just long enough to heat them through, about 5 minutes.\n            \n\n              Meanwhile, bring a large pot of generously salted water to a rolling boil, and cook the pasta according to the package directions for al dente. Add as many pasta shapes as you wish, as long as their cooking times are within 2 minutes of one another (according to the package directions). Drain, reserving 2 cups of the cooking water. Add the pasta back to the pot, add the beans with their liquid and the reserved pasta water and stir in 2 to 3 teaspoons of pepper. Ladle the soup into serving bowls, and grate the Pecorino Romano over the top if using.\n            \n", "ingredients": [{"food": "fava beans", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "pork skins", "quantity": 4.0}, {"food": "pasta with tomato sauce", "quantity": 2.0}, {"food": "mixed nuts", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 1}], "title": "\nPasta e Fagioli\n"}, {"directions": "\n\n              Heat 3 tablespoons olive oil in a large pot over medium-high heat. Add the garlic and cook, stirring, until golden, about 2 minutes. Add the onion, carrots and celery and cook, stirring occasionally, until the vegetables start softening, 12 to 15 minutes. Stir in the tomato paste and rosemary and cook until the tomato paste darkens in color, about 3 minutes.\n            \n\n              Stir in 6 cups water, the chickpeas with their liquid, the parmesan rind, 1 teaspoon salt and a few grinds of pepper. Bring to a boil, then reduce the heat and simmer until the vegetables are soft, about 10 minutes. Remove 1 cup of the soup (chickpeas, vegetables and broth) and puree in a blender, then return to the pot. (Alternatively, partially puree the soup in the pot with an immersion blender.)\n            \n\n              Stir the pasta and escarole into the soup. Cook until the pasta is tender and the escarole is wilted, about 6 minutes. Remove from the heat and stir in the grated parmesan. Top each serving with the remaining 1 tablespoon olive oil and more parmesan.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.25}, {"food": "garlic powder", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "carrots", "quantity": 2.0}, {"food": "celery seed", "quantity": 2.0}, {"food": "pasta with tomato sauce", "quantity": 0.25}, {"food": "rosemary", "quantity": 1.0}, {"food": "chickpeas", "quantity": 1.0}, {"food": "parmesan cheese", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "italian veg medley pasta", "quantity": 0.75}, {"food": "escarole", "quantity": 1.0}], "title": "\nPasta e Fagioli with Chickpeas\n"}, {"directions": "\n\n              Heat olive oil in a large deep skillet over medium heat. Add onion, carrot and celery, cook until vegetables are slightly softened, 5 minutes. Add 1 cup water, season with salt and pepper, cover, cook until tender,10 minutes.\n            \n\n              Meanwhile, finely chop sage, thyme, and garlic together. Stir beans and chopped herbs mixture into vegetables\n            \n\n              Cook pasta according to package directions, for 5 minutes. Add escarole, stir and cook, until shells are al dente, 1 to 2 minutes more. Drain.\n            \n\n              Add pasta and escarole to the vegetables. Stir in 3/4 cup cheese, season with salt and pepper to taste. Serve with grated cheese and a dollup of tomato pesto if desired.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.25}, {"food": "onion powder", "quantity": 1.0}, {"food": "carrots", "quantity": 2.0}, {"food": "celery seed", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 6.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "fava beans", "quantity": 3.0}, {"food": "pepper", "quantity": 0.75}, {"food": "italian veg medley pasta", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "parmesan cheese", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 0.25}], "title": "\nPasta e Fagioli: Penne with Beans and Escarole\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Cook the prosciutto in a large skillet over medium-high heat until it renders some fat and begins to brown, about 2 minutes. Add the garlic and thyme and cook until the garlic just begins to soften, about 30 seconds. Remove the skillet from the heat and add the wine. Return to the heat and cook until the wine evaporates slightly, about 2 more minutes. Add 1/4 teaspoon salt and pepper to taste. Add the cream and nutmeg and cook, stirring occasionally, until the sauce thickens slightly, about 3 more minutes.\n            \n\n              Meanwhile, add the pasta to the boiling water and cook as the label directs, adding the asparagus during the last minute of cooking. Reserve 1/2 cup cooking water, then drain the pasta and asparagus.\n            \n\n              Add the cheese to the cream sauce and stir to combine. Add the pasta and asparagus and toss to coat, adding some of the reserved cooking water to loosen, if needed. Season with salt and pepper. Divide among bowls and top with more cheese.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 0.5}, {"food": "garlic powder", "quantity": 1.0}, {"food": "thyme", "quantity": 2.0}, {"food": "martha white foods", "quantity": 0.5}, {"food": "pepper", "quantity": 1}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "", "quantity": 12.0}, {"food": "asparagus", "quantity": 1.5}, {"food": "parmesan cheese", "quantity": 0.25}], "title": "\nPasta with Asparagus and Prosciutto\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the pasta and cook as the label directs. Reserve 1 cup of the cooking water; drain the pasta.\n            \n\n              Meanwhile, cook the bacon in a large skillet over medium heat, stirring occasionally, until crisp, about 8 minutes. Remove with a slotted spoon and drain on paper towels; pour off all but 1 tablespoon of the drippings from the skillet.\n            \n\n              Add the leeks to the drippings in the skillet. Season with 1/2 teaspoon each salt and pepper and cook, stirring occasionally, until soft, about 3 minutes. Add the heavy cream and cook until it begins to thicken, about 2 minutes.\n            \n\n              Add the pasta to the skillet along with the parmesan, half of the bacon and 1/2 teaspoon pepper; toss to coat, adding enough of the reserved pasta cooking water to loosen. To serve, top with the remaining bacon, more parmesan and parsley.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "italian veg medley pasta", "quantity": 12.0}, {"food": "bacon", "quantity": 4.5}, {"food": "silk light vanilla", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "ice cream swich", "quantity": 0.75}, {"food": "parmesan cheese", "quantity": 0.3333333333333333}, {"food": "parsley", "quantity": 1}], "title": "\nPasta with Bacon and Leeks\n"}, {"directions": "\n\n              Try this twist on kasha varnishkes, a classic Jewish dish made with buckwheat and bow ties: Toast 1 cup farro in a saucepan over medium-high heat with olive oil. Add 2 cups water and 1/2 teaspoon salt. Bring to a boil, then cover and simmer until the water is absorbed, 20 to 25 minutes. Meanwhile, cook 1 pound orecchiette as directed; drain. Brown 3 tablespoons butter; toss with the pasta and farro (or toss with walnut oil). Season with salt.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [], "title": "\nPasta with Farro\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the pasta and cook as the label directs; drain.\n            \n\n              Meanwhile, heat the olive oil in a large skillet over medium heat. Add the pancetta and cook, stirring occasionally, until crisp, about 7 minutes. Add the onion and cook until soft, about 2 minutes. Add the garlic and red pepper flakes and cook, stirring, until the garlic begins to brown, about 2 minutes. Stir in the lentils, then add the tomatoes, 2 cups water, the basil and 1/2 teaspoon salt. Increase the heat to medium high and bring the sauce to a boil; cook 3 minutes. Reduce the heat to medium low and simmer, stirring occasionally, until slightly thickened, about 10 minutes.\n            \n\n              Add the pasta to the sauce along with half of the parmesan. Season with salt and toss. Divide among bowls; drizzle with olive oil and top with the remaining parmesan and more basil.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "spaghetti", "quantity": 12.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "", "quantity": 0.5}, {"food": "onion powder", "quantity": 0.5}, {"food": "garlic powder", "quantity": 4.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "lentils", "quantity": 1.0}, {"food": "plum", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 8.0}, {"food": "parmesan cheese", "quantity": 0.5}], "title": "\nPasta with Pancetta and Lentils\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 425 degrees F.\n            \n\n              Coarsely chop the broccoli florets and tender stems and toss with 1 tablespoon of the olive oil, 1/2 teaspoon salt and 1/4 teaspoon pepper. Spread in a single layer on a rimmed baking sheet and roast until tender with the edges crispy, 20 minutes.\n            \n\n              Meanwhile, bring a large pot of water to a boil. Add a generous pinch of salt and the pasta. Cook according to the package directions. Reserve 1/2 cup pasta water and drain the pasta. Toss the hot pasta with the roasted broccoli, sun-dried tomatoes, 1/4 cup pasta water, the remaining 1 tablespoon olive oil and the reserved sun-dried tomato oil. Stir in the mozzarella, parsley and as much remaining pasta water as needed to make a light sauce. Season to taste with salt and pepper.\n            \n", "ingredients": [{"food": "broccoli raab", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 8.0}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "diced chicken", "quantity": 6.0}, {"food": "parsley", "quantity": 2.0}], "title": "\nPasta with Roasted Broccoli, Sun-Dried Tomatoes and Mozzarella\n"}, {"directions": "\n\n              Position racks in the upper and lower thirds of the oven; preheat to 475 degrees F. Quarter the tomatoes, then scoop the seeds and pulp into a sieve set over a bowl (reserve the tomatoes). Press on the seeds and pulp to extract the juice (you should have about 1/2 cup). Chop the tomatoes and toss with 3 tablespoons olive oil on a rimmed baking sheet; season with salt. Toss the zucchini with 3 tablespoons olive oil on a separate baking sheet; season with salt and pepper. Roast, switching the position of the pans halfway through, until tender and browned in spots, 15 minutes.\n            \n\n              Meanwhile, bring a large pot of salted water to a boil. Cook the pasta as the label directs; reserve 1 cup cooking water, then drain.\n            \n\n              Heat the remaining 2 tablespoons olive oil in a large skillet over medium heat. Add the garlic; cook 2 minutes. Add the cherry peppers; cook 1 minute. Stir in the tomato paste, then the reserved tomato juice and 1/2 cup cooking water. Bring to a boil; simmer until reduced by half, 5 minutes. Add the pasta, vegetables, basil and parmesan to the skillet; season with salt. Cook, tossing, 1 minute, adding more of the reserved cooking water as needed to loosen.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "plum", "quantity": 1.5}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "pineapple chunks", "quantity": 1.75}, {"food": "pepper", "quantity": 1}, {"food": "italian veg medley pasta", "quantity": 12.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "basil", "quantity": 0.5}, {"food": "parmesan cheese", "quantity": 0.5}], "title": "\nPasta with Roasted Tomatoes\n"}, {"directions": "\n\n              Soak the mushrooms in 1 cup hot water, 5 minutes. Strain through a paper towel-lined sieve, reserving the liquid. Rinse the mushrooms.\n            \n\n              Bring a large pot of salted water to a boil. Add the tortellini and cook as the label directs. Reserve 1 cup cooking water, then drain.\n            \n\n              Meanwhile, pulse the mushrooms, carrots, celery, onion and thyme in a food processor until finely chopped. Heat 4 tablespoons butter in a large Dutch oven or pot over medium-high heat. Add the vegetables, season with salt and pepper and cook, stirring, until they start browning, about 4 minutes. Add the wine and the reserved mushroom liquid; bring to a simmer, scraping up the browned bits. Cook until reduced by half, about 3 minutes.\n            \n\n              Add the tomatoes to the pot and cook, stirring, until the sauce thickens, about 10 minutes. Add the basil, the remaining 2 tablespoons butter and the tortellini. Toss to coat, adding the reserved pasta water as needed to loosen.\n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [{"food": "mushrooms", "quantity": 1.25}, {"food": "salt", "quantity": 1}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "carrots", "quantity": 3.0}, {"food": "celery seed", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "thyme", "quantity": 1.0}, {"food": "butter oil", "quantity": 6.0}, {"food": "pepper", "quantity": 1}, {"food": "martha white foods", "quantity": 0.5}, {"food": "tomatoes", "quantity": 1.0}, {"food": "basil", "quantity": 1.0}], "title": "\nPasta with Vegetable \"Bolognese\"\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the pasta and cook as the label directs. Reserve about 1 1/4 cups cooking water, then drain.\n            \n\n              Meanwhile, pulse the bread in a food processor to make coarse crumbs. Heat 1 tablespoon olive oil in a large skillet over medium-low heat. Add the breadcrumbs and toss until toasted, 4 minutes. Transfer to a small bowl and stir in 1 tablespoon mint, 1 teaspoon lemon zest, 1/4 teaspoon salt and a few grinds of pepper.\n            \n\n              Wipe out the skillet and return to medium heat. Add 1 tablespoon olive oil and the pancetta. Cook until the pancetta is crisp around the edges, about 2 minutes. Add the red onion and cook until it starts softening, about 2 minutes. Increase the heat to medium high, add the zucchini and season with 1/2 teaspoon salt and a few grinds of pepper. Cook, stirring, until lightly browned around the edges, about 2 minutes. Add 3/4 cup of the reserved cooking water and cook until the zucchini is tender, 2 to 3 minutes.\n            \n\n              Add the pasta to the skillet. Drizzle the remaining 1 tablespoon olive oil on top and toss, adding the remaining cooking water as needed to loosen. Remove the skillet from the heat; add the cheese and the remaining 1 tablespoon mint and 1 teaspoon lemon zest. Top with the seasoned breadcrumbs.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "italian veg medley pasta", "quantity": 12.0}, {"food": "garlic bread", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "", "quantity": 2.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "pepper", "quantity": 1}, {"food": "diced chicken", "quantity": 4.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "", "quantity": 1.5}, {"food": "parmesan cheese", "quantity": 0.5}], "title": "\nPasta with Zucchini and Mint\n"}, {"directions": "\n\n              Put the bacon in a large pot or Dutch oven over medium heat and cook, stirring occasionally, until crisp, about 4 minutes. Add the onion and cook, stirring occasionally, until slightly softened, about 3 minutes. Add the carrots, garlic, tomato paste, thyme and 1/2 teaspoon each salt and pepper and cook until the carrots begin to soften, about 2 minutes. \n            \n\n              Add the chicken broth, 6 cups water and the parmesan rind. Increase the heat to high; cover and bring to a boil. Add the pasta and beans and cook, uncovered, 5 minutes. Reduce the heat to medium and add the kale. Simmer, uncovered, until slightly thickened, about 7 minutes. Remove the parmesan rind, stir in half of the grated cheese and season with salt and pepper. Ladle into bowls and top with the remaining cheese. \n            \n\n              Per Serving: Calories: 499; Total Fat: 16 grams; Saturated Fat: 6 grams; Protein: 23 grams; Total carbohydrates: 66 grams; Sugar: grams; Fiber: 9 grams; Cholesterol: 44 milligrams; Sodium: 763 milligrams \n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [{"food": "bacon", "quantity": 3.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "carrots", "quantity": 3.5}, {"food": "garlic powder", "quantity": 2.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "thyme", "quantity": 0.75}, {"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 2.0}, {"food": "parmesan cheese", "quantity": 0.5}, {"food": "italian veg medley pasta", "quantity": 1.5}, {"food": "fava beans", "quantity": 1.0}, {"food": "frozen yogurt", "quantity": 1.0}], "title": "\nPasta, Kale and White Bean Soup\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Bring a large pot of salted water to a boil. Add the pasta and cook as the label directs. Meanwhile, make the filling: Heat the olive oil in a large skillet over medium-high heat. Add the meat and cook, breaking it up with a wooden spoon, until browned, about 5 minutes. Add the onion and cinnamon and cook until the onion is soft, about 5 more minutes. Add the Worcestershire sauce and wine and cook until the wine starts to evaporate, about 2 more minutes. Add the tomato sauce, 2 cups water, 1 teaspoon salt and 1/4 teaspoon pepper and bring to a simmer. Stir in the parsley and cook, stirring occasionally, until slightly thickened, about 20 minutes. Stir in 1 tablespoon breadcrumbs and remove from the heat.\n            \n\n              When the pasta is done, drain and return to the pot off the heat; stir in the butter, then the beaten eggs and 1 cup cheese until the pasta is coated.\n            \n\n              Brush the bottom and sides of a 9-by-13-inch baking dish with olive oil. Spread half of the pasta in the dish, then top with the meat filling and the remaining pasta.\n            \n\n              Make the bechamel: Melt the butter in a medium saucepan over low heat. Whisk in the flour and cook, whisking, 1 minute. (Do not let the flour brown.) Whisk in the yogurt and 3/4 cup water and gently simmer, whisking, until slightly thickened, about 5 more minutes. (Do not let the mixture boil.) Remove from the heat and whisk in the eggs, nutmeg and 1/4 teaspoon salt.\n            \n\n              Pour the bechamel evenly over the pasta in the baking dish. Sprinkle with the remaining 1 cup cheese and 1 tablespoon breadcrumbs and bake until golden, 40 to 45 minutes. Let rest 10 minutes before serving.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "barley flour or meal", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "cinnamon", "quantity": 0.75}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "martha white foods", "quantity": 0.25}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "parsley", "quantity": 0.25}, {"food": "", "quantity": 2.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "eggs", "quantity": 2.0}, {"food": "parmesan cheese", "quantity": 2.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "potato flour", "quantity": 0.25}, {"food": "silk banana-strawberry soy yogurt", "quantity": 3.0}, {"food": "eggs", "quantity": 2.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "salt", "quantity": 1}], "title": "\nPastitsio\n"}, {"directions": "\nSpecial equipment: 16 toothpicks\n\n              Preheat the oven to 375 degrees F. Mix the shredded cheese, peppers, mayonnaise, mustard and pepper in a medium bowl.\n            \n\n              Stack 4 slices of the bread on a cutting board. Using a knife or 2 1/2-inch round cutter, trim the bread into football shapes, save the trimmings for another use. Continue with the remaining bread.\n            \n\n              Lay the bread slices on a rimmed baking sheet and brush with the melted butter. Place in oven and toast until crisp, about 5 minutes.\n            \n\n              Spread about 1 tablespoon of the pepper cheese mixture on the bread. Top with some pastrami, a pickle and another slice of bread.\n            \n\n              To make the laces, cut the cheese into 16 long strips. Cut each strip into 1 long and 3 short pieces. Lay the long strip lengthwise on the sandwich, and then the 3 short strips crosswise to make the laces. Repeat with all the strips. Put the sandwiches back into the oven for 2 minutes to set the cheese laces. Secure the sandwiches with a toothpick and serve.\n            \n", "ingredients": [{"food": "cheddar cheese", "quantity": 1.0}, {"food": "peppers", "quantity": 0.3333333333333333}, {"food": "mayonnaise dressing", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "fruit cocktail", "quantity": 32.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 8.0}, {"food": "garlic bread", "quantity": 16.0}, {"food": "martha white foods", "quantity": 1.0}], "title": "\nPastrami Football Finger Sandwiches\n"}, {"directions": "\n\n              Position an oven rack in the center of the oven and preheat to 375 degrees F.\n            \n\n              Wrap the sliced pastrami in foil and put on to a baking sheet. Remove 1/4 inch of the crust from the ends of the loaf, then cut the loaf crosswise into 4 even pieces. Use a fork to score one cut end and gently dig a square hole into each piece of bread to make a box, leaving a 1/2-inch layer of bread around the walls and bottom (see Cook's Note). Save the removed crumbs for another use. \n            \n\n              Microwave the butter and a large pinch of salt in a small microwave-safe bowl until melted, about 1 minute. Brush the bread boxes inside and out with the melted butter. Put 1 slice of cheese at the bottom of each bread box. Put the boxes open-side up on the same baking sheet as the pastrami and bake until the cheese melts and the inside of the bread is lightly browned and crispy in parts, about 10 minutes. The pastrami should be warmed through. \n            \n\n              Meanwhile, whisk together the mayonnaise, ketchup, horseradish, onion powder, Worcestershire sauce and hot sauce in a small bowl. Season to taste with salt if needed. Set aside. \n            \n\n              Layer each bread box with 1 1/2 tablespoons of the dressing, a quarter of the pastrami, a quarter of the sauerkraut and top with 2 more slices of cheese. Return to the oven and bake until the cheese melts, about 5 minutes. Drizzle with the remaining dressing. Serve whole or cut in half.\n            \n", "ingredients": [{"food": "pasta with sliced franks in tomato sauce", "quantity": 0.75}, {"food": "barbecue loaf", "quantity": 1.0}, {"food": "butter oil", "quantity": 6.0}, {"food": "salt", "quantity": 1}, {"food": "macaroni cheese", "quantity": 12.0}, {"food": "mayonnaise dressing", "quantity": 0.5}, {"food": "", "quantity": 0.25}, {"food": "horseradish", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "Worcestershire sauce", "quantity": 0.5}, {"food": "Worcestershire sauce", "quantity": 1}, {"food": "sauerkraut", "quantity": 1.5}], "title": "\nPastrami Reuben Bread Boxes\n"}, {"directions": "\n\n              Cook 1 cup rye berries in simmering salted water until tender, about 1 hour. Drain, transfer to a bowl and let cool. Add 1 cup each thinly sliced red cabbage and celery and 1/2 cup chopped pastrami. Whisk 3 tablespoons each cider vinegar and whole-grain mustard and 1/3 cup olive oil; toss with the rye berry mixture. Season with salt and pepper.\n            \n\n              Photograph by Chris Court\n            \n", "ingredients": [], "title": "\nPastrami and Rye Berry Salad\n"}, {"directions": "\n\n              Toss 2 pounds diced potatoes and 1 pound grated plum tomatoes in a baking dish with olive oil. Add a spoonful of sugar and 2 bay leaves; season with salt, paprika and cayenne pepper. Bake at 425 degrees until the potatoes are tender, about 40 minutes. Thin a little mayonnaise with water; drizzle over the potatoes and sprinkle with sliced scallions.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nPatatas Bravas\n"}, {"directions": "\n\n              Put 1 pound each chopped blue potatoes and white potatoes and 1/2 pound chopped red potatoes in a large pot. Cover with cold water; add 2 tablespoons white wine vinegargarlic and a pinch of salt. Bring to a boil, then simmer until the potatoes are tender, about 15 minutes. Drain and cool slightly (discard the garlic). Toss with 1 1/2 cups halved cherry tomatoes, 1/3 cup torn basil and 2 tablespoons each chopped scallions and parsley. Dress with 1/4 cup olive oil, 2 more tablespoons vinegar, and salt and pepper.\n            \n\n              Photograph by Ryan Liebe\n            \n", "ingredients": [], "title": "\nPatriotic Potato Salad\n"}, {"directions": "\n\n              Place the meat on a parchment paper-lined baking sheet and, using your hands, break it up into small pieces and combine evenly. Season the meat with salt and pepper to taste.\n            \n\n              Divide the meat into 6 portions (about 4 ounces each). Using your hands, form each portion into a ball shape by gently tossing it from one hand to the other. Form each portion into a thin patty. Each patty should be somewhat larger than a slice of the rye bread since it will shrink when cooked.\n            \n\n              Heat 1 tablespoon of the oil in a large cast-iron skillet over medium-heat. Add the onion, season with salt and pepper, and cook, stirring occasionally, until caramelized, about 7 minutes. Transfer the onion to a bowl.\n            \n\n              Wipe out the skillet; return to the heat, and heat 1 tablespoon oil. Add 2 patties and saute, turning once, until well browned and cooked to medium, about 1 minute per side. Transfer to a plate and repeat with the remaining oil and patties.\n            \n\n              Arrange 1/6 of the onion over one bread slice. Place 1 cheese slice over the onion and top with a patty. Top the patty with a slice of cheese and cover with a bread slice. Spread about 2 teaspoons of butter over the outside of each slice. Repeat with the remaining ingredients to make 6 sandwiches.\n            \n\n              Heat the cast-iron skillet over medium heat. Add 2 sandwiches and cook, turning once, until lightly browned and the cheese has melted, about 5 minutes per side. Transfer to a cutting board and repeat with the remaining 4 sandwiches. Cut sandwiches in half crosswise and serve.\n            \n", "ingredients": [{"food": "ground turkey", "quantity": 0.75}, {"food": "ground turkey", "quantity": 0.75}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "onions", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 12.0}, {"food": "garlic bread", "quantity": 12.0}, {"food": "butter oil", "quantity": 0.5}], "title": "\nPatty Melt\n"}, {"directions": "\n\n              Heat 1 teaspoon olive oil in a large nonstick skillet over medium-high heat. Add the onions and cook, stirring, until soft, 2 to 3 minutes. Push to one side of the skillet; add the mushrooms and cook until browned, about 2 minutes. Season with salt and pepper, then mix the mushrooms and onions together and cook until the onions are golden, about 10 more minutes. Add the vinegar and 2 tablespoons Worcestershire sauce. Transfer the mixture to a bowl and keep warm.\n            \n\n              Meanwhile, mix the turkey, beef and the remaining 2 teaspoons Worcestershire sauce in a bowl. Shape into 4 equal-size oval patties.\n            \n\n              Wipe out the skillet, add 1 tablespoon olive oil and place over medium-high heat. Season the patties with salt and pepper and cook until browned on the bottom, about 4 minutes. Flip and cook through, 1 to 2 more minutes.\n            \n\n              Divide the onions and mushrooms among 4 bread slices; top with a slice of cheese, a patty, another slice of cheese and another bread slice. Wipe out the skillet; add 1 tablespoon olive oil and place over medium heat. Cook the sandwiches in two batches until the bread is toasted and the cheese melts, 1 to 2 minutes per side, adding the remaining 2 teaspoons oil as needed.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "onions", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 10.0}, {"food": "salt", "quantity": 1}, {"food": "vinegar", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "ground turkey", "quantity": 10.0}, {"food": "frankfurter beef", "quantity": 6.0}, {"food": "garlic bread", "quantity": 8.0}, {"food": "luncheon slices", "quantity": 8.0}], "title": "\nPatty Melts\n"}, {"directions": "\n\n              Make the slaw: Combine the cabbage, apple, carrot and scallions in a bowl. Add 2 tablespoons dijonnaise and the vinegar; season with salt and pepper and toss. Set aside.\n            \n\n              Heat 1 tablespoon butter in a large nonstick skillet over medium-high heat. Add the onion and cook, stirring occasionally, until tender and lightly browned, about 8 minutes. Season with salt and pepper. Transfer to a bowl and wipe out the skillet.\n            \n\n              Preheat the broiler. Line a baking sheet with foil. Form the beef into four 1/4-inch-thick oval patties; season with salt and pepper. Transfer to the prepared baking sheet. Broil until cooked through, about 3 minutes. Top with the sauteed onion and cheese and continue broiling until the cheese is just melted, about 30 seconds.\n            \n\n              Spread 4 slices bread with the remaining 2 tablespoons dijonnaise; top with the patties and remaining bread. Melt the remaining 1 tablespoon butter in the skillet over medium-high heat. Working in batches, add the sandwiches and cook until golden, 1 1/2 minutes per side, reducing the heat as needed. Serve with the apple slaw.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "swamp cabbage", "quantity": 0.5}, {"food": "apple", "quantity": 1.0}, {"food": "carrots", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "mixed nuts", "quantity": 0.25}, {"food": "vinegar", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "frankfurter beef", "quantity": 12.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "rye grain", "quantity": 8.0}], "title": "\nPatty Melts with Apple Slaw\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: a 2-inch ice cream scoop\n\n              Position an oven rack in the lower third of the oven and preheat to 225 degrees F. Line 2 baking sheets with parchment paper.\n            \n\n              For the meringues: Combine the egg whites, cream of tartar and salt in the very clean bowl of a stand mixer fitted with the whisk attachment. Whisk on medium speed until foamy, about 1 minute. Increase the speed to medium-high and beat until thick and opaque, about 1 minute more. Gradually add the confectioners' sugar, 1/4 cup at a time, and beat until stiff shiny peaks form, about 5 minutes more. \n            \n\n              Scoop the meringue using a 2-inch ice cream scoop and scrape off excess with the back of a knife to flatten. Unmold each scoop onto the prepared baking sheets, leaving 1 1/2 inches between each. Use the back of a metal tablespoon to make a shallow well in the center of each mound that will hold the \"yolk.\" Bake until the meringues are dry and crisp on the outside, about 2 hours. Let cool completely.\n            \n\n              For the curd: Simmer 1 inch of water in a medium saucepan over medium-high heat. Combine the egg yolks, sugar, lemon juice and zest in a medium metal bowl and whisk until smooth. Place the bowl on top of the saucepan (make sure the bottom of the bowl is not touching the water) and whisk until the curd is thickened, light yellow and coats the back of a spoon, about 8 minutes. Remove the curd from the heat and use a rubber spatula to stir in the butter, one piece at a time, allowing each addition to melt before adding the next. Transfer to a clean container and press a sheet of plastic wrap directly against the surface of the curd. Chill thoroughly, at least 3 hours and up to 1 week. \n            \n\n              To serve, spoon 1 tablespoon of curd into the well of each meringue and serve immediately.\n            \n", "ingredients": [{"food": "egg substitute", "quantity": 4.0}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "salt", "quantity": 0.25}, {"food": "sugar", "quantity": 2.25}, {"food": "egg substitute", "quantity": 3.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "lemon juice", "quantity": 1.25}, {"food": "diced chicken", "quantity": 0.5}], "title": "\nPavlova Eggs with Lemon Curd\n"}, {"directions": "\n\n              Cook 4 ounces chopped prosciutto in a skillet with 2 tablespoons olive oil over medium heat until crisp, 4 minutes. Stir in 3 sliced garlic cloves and 1 tablespoon tomato paste; cook 1 minute. Ladle in 1 cup pasta-cooking water and simmer until reduced by half, 4 minutes. Add 1/4 cup heavy cream and simmer until thickened, 3 minutes. Toss with 1 pound cooked ravioli, 1 cup blanched frozen peas and some chopped parsley. Top with grated parmesan.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [], "title": "\nPea-Prosciutto Sauce\n"}, {"directions": "\nSpecial equipment: a 9-by-5-inch loaf pan that is at least 2 inches deep\n\n              Add the peach slices to a medium bowl. Drizzle 2 tablespoons of the honey over the peaches and toss until coated. Set aside for at least 30 minutes.\n            \n\n              Beat the yogurt, heavy cream and remaining 4 tablespoons honey in a large bowl with an electric mixer on medium-high speed until stiff peaks form, about 2 minutes.\n            \n\n              Line a 9-by-5-inch loaf pan that is at least 2 inches deep with plastic wrap, leaving about 2 inches of overhang on all sides. Spread a heaping 1/2 cup of the yogurt-cream mixture over the bottom of the pan. Evenly layer about 14 slices (about 1/2 cup) of the peaches over the cream. Top with 1 1/2 sheets of graham crackers. Break up the remaining 1/2 sheet into small pieces and use them to fill in the gaps. Repeat twice with the remaining yogurt-cream mixture, peaches and graham crackers (making sure to end with a layer of graham crackers on top). Cover the top of the pan with the overhanging plastic wrap. Refrigerate for at least 8 hours and up to 12.\n            \n\n              When ready to serve, unwrap the top of the loaf plan and invert it onto a flat plate or cutting board. Remove the plastic wrap, sprinkle with the pistachios and drizzle with honey.\n            \n", "ingredients": [{"food": "luncheon slices", "quantity": 2.25}, {"food": "honey smoked ham", "quantity": 6.0}, {"food": "silk banana-strawberry soy yogurt", "quantity": 1.5}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "crackers", "quantity": 6.0}, {"food": "", "quantity": 0.25}], "title": "\nPeach Baklava Icebox Cake\n"}, {"directions": "\n\n              With a box grater, grate peaches into a pitcher. Add the sugar and water to the peaches and place pitcher in refrigerator until chilled and sugar has dissolved, or until needed.\n            \n\n              When ready to serve, pour the superfine sugar on a plate and invert a chilled Champagne glass in the sugar to coat rim. Pour about a 1/8th of the peach mixture into the prepared glass and top off with Prosecco. Stir gently and serve.\n            \n", "ingredients": [{"food": "peaches", "quantity": 6.0}, {"food": "sugar", "quantity": 0.25}, {"food": "coconut water", "quantity": 0.25}, {"food": "", "quantity": 1.0}], "title": "\nPeach Bellini\n"}, {"directions": "\n\n              Arrange 8 ounces sliced fresh mozzarella, 2 sliced heirloom tomatoes and 2 sliced peaches on a platter. Drizzle with 3 tablespoons olive oil and 1 tablespoon white balsamic vinegar. Season with salt and pepper and top with fresh basil.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [], "title": "\nPeach Caprese Salad\n"}, {"directions": "\n\n              1. For the filling: Position a rack in the center of the oven and preheat the oven to 375 degrees F. In a medium bowl, stir together the sugar, flour, and nutmeg. Gradually whisk in 1/4 cup water and lemon juice to make a smooth mixture. Add the fruit and toss gently to coat evenly. Transfer to a shallow, 2-quart heatproof baking or gratin dish and dot with butter. Set aside.\n            \n\n              2. To make the biscuit: In a large bowl, stir together the flour, sugar, baking powder, and 1/2 teaspoon fine salt. Work in the butter with your fingertips until the texture resembles coarse meal. Add the milk, vanilla, and lemon zest to the dry ingredients and stir just until moistened to make wet, slightly lumpy dough. Do not over mix.\n            \n\n              3. Put the baking dish on the stovetop over a medium-low heat, and stir the fruit mixture gently until it simmers. Reduce heat to low and cook until thickened, about 2 minute. Remove from the heat.\n            \n\n              4. Drop large spoonfuls of dough onto the top of the peaches, randomly spacing mounds of dough and leaving some uncovered areas, to give a \"cobbled\" look. Spread the dough to an even thickness and sprinkle dough with sugar, if desired.\n            \n\n              5. Bake the cobbler until the biscuit is lightly browned about 45 minutes. Let the cobbler set up at room temperature for 20 to 30 minutes before serving. Serve warm or at room temperature.\n            \n", "ingredients": [{"food": "sugar", "quantity": 0.3333333333333333}, {"food": "potato flour", "quantity": 2.0}, {"food": "nutmeg", "quantity": 0.125}, {"food": "lemon juice", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 6.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "potato flour", "quantity": 1.5}, {"food": "sugar", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 4.0}, {"food": "milk", "quantity": 0.75}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}], "title": "\nPeach Cobbler\n"}, {"directions": "\n\n              Fill a large wine goblet with crushed ice. Gently muddle the rye, peach nectar, dash of bitters, peaches, mint, and a squeeze of lemon juice in a cocktail shaker. Pour over ice and serve cold.\n            \n", "ingredients": [{"food": "ice cream swich", "quantity": 1}, {"food": "rye grain", "quantity": 2.0}, {"food": "peach nectar", "quantity": 2.5}, {"food": "", "quantity": 1}, {"food": "peaches", "quantity": 5.0}, {"food": "chrysanthemum leaves", "quantity": 3.0}, {"food": "lemon juice", "quantity": 1.0}], "title": "\nPeach Cobbler Cocktail\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              For the cupcakes: Position an oven rack in the middle of the oven and preheat the oven to 350 degrees F. Line one 12-cup standard muffin tin with cupcake liners and spray the top of the tin lightly with baking spray.\n            \n\n              Spread the pecans out on a baking sheet and bake until nicely toasted, 8 to 10 minutes. Allow to cool, then pulse in a food processor until finely ground. Add the flour, baking powder, baking soda and salt and pulse to combine. Set aside.\n            \n\n              Combine the granulated sugar and butter in the bowl of a stand mixer fitted with a paddle attachment (or in a large bowl if using a hand-held electric mixer). Beat on medium-high speed until light and fluffy, about 5 minutes. Add the eggs 1 at a time, beating to incorporate after each addition. Scrape down the sides of the bowl as needed. Beat in the lemon zest. Adjust the speed to low and add the flour mixture and sour cream in alternating batches, beginning and ending with the flour.\n            \n\n              Divide the batter evenly in the tin, filling each cup about two-thirds full. Top each with 2 peach wedges. Bake until the edges are golden and a toothpick inserted in the center comes out clean, 22 to 24 minutes. Cool the cupcakes on a rack in the tin for 10 minutes, then remove. Cool on the rack completely.\n            \n\n              Combine the peach preserves and lemon juice in a small microwave-safe bowl and heat for a few seconds just to warm through. Generously brush the top of each cupcake with the preserves.\n            \n\n              For the pecan crumble: Combine the flour, pecans, brown sugar, butter and salt in a bowl. Spread the mixture out on a rimmed baking sheet and bake until golden, about 15 minutes, rotating the baking sheet about halfway through. Allow to cool completely, then crumble.\n            \n\n              For the cream topping: Combine the heavy cream, sour cream and confectioners' sugar in the bowl of a stand mixer fitted with a whisk attachment. Whip on medium-high speed until stiff peaks form, about 4 minutes.\n            \n\n              Top each cupcake with the cream topping and sprinkle with the pecan crumble. Serve immediately.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1}, {"food": "", "quantity": 0.5}, {"food": "potato flour", "quantity": 1.25}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "salt", "quantity": 0.5}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "butter oil", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "lemon juice", "quantity": 0.5}, {"food": "sour cream", "quantity": 0.3333333333333333}, {"food": "silk peach soy yogurt", "quantity": 24.0}, {"food": "silk peach soy yogurt", "quantity": 0.25}, {"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 0.3333333333333333}, {"food": "", "quantity": 0.3333333333333333}, {"food": "sugar", "quantity": 0.25}, {"food": "butter oil", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "sour cream", "quantity": 0.25}, {"food": "sugar", "quantity": 1.0}], "title": "\nPeach Cobbler Cupcakes\n"}, {"directions": "\n\n              Position an oven rack in the center of the oven, and preheat to 325 degrees F. Whisk together the butter, brown sugar, preserves, vanilla and salt in a large bowl. Add the oats and pecans, and toss until evenly coated. Spread out on a rimmed baking sheet.\n            \n\n              Bake the oat mixture until golden and toasted, 30 to 35 minutes, stirring about halfway through. Let cool completely on the baking sheet. Stir in the dried peaches and chocolate chips. (The granola can be stored in an airtight container at room temperature for up to 5 days.)\n            \n", "ingredients": [{"food": "butter oil", "quantity": 4.0}, {"food": "sugar", "quantity": 3.0}, {"food": "silk peach soy yogurt", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "oats", "quantity": 1.75}, {"food": "pecans", "quantity": 1.0}, {"food": "peaches", "quantity": 6.0}, {"food": "baking chocolate", "quantity": 0.5}], "title": "\nPeach Cobbler Granola\n"}, {"directions": "\n\n              Stir 1 1/4 cups granulated sugar, the lemon juice and peaches in a large pot; let sit 15 minutes. Bring to a simmer over medium-high heat, then reduce the heat to low and cook until the peaches are tender, about 15 minutes. Remove 3/4 cup peaches with a slotted spoon and refrigerate for topping. Puree the remaining peaches and cooking liquid in a blender; transfer to a bowl and freeze until very thick, about 1 hour.\n            \n\n              Meanwhile, preheat the oven to 350 degrees F and line a baking sheet with foil. Coarsely crush the graham crackers and toss with the remaining 1/4 cup granulated sugar, the pecans and butter on the prepared baking sheet; spread into a thin layer. Bake 7 minutes, then stir and continue baking until golden brown, 6 to 10 more minutes. Let cool and harden, then crumble and set aside.\n            \n\n              Assemble the cake: Let 2 pints ice cream soften at room temperature until spreadable, about 10 minutes. Coat a 9-inch springform pan with cooking spray and line the bottom and sides with plastic wrap, leaving a 2-inch overhang. Spread the softened ice cream in the prepared pan, then top evenly with the peach puree. Freeze until the puree is firm, about 45 minutes.\n            \n\n              Let the remaining 2 pints ice cream soften, 10 minutes, then spread over the peach puree. Sprinkle with 1 cup of the pecan mixture and press it into the ice cream. Cut the pound cakes lengthwise into 1 1/2-inch-thick slices; arrange the slices in a single layer on top of the ice cream, trimming as needed. Cover with plastic wrap and freeze until firm, at least 6 hours or overnight.\n            \n\n              Beat the heavy cream, confectioners' sugar and vanilla in a bowl with a mixer on medium speed until soft peaks form. Uncover the cake, then invert onto a plate; remove the springform ring and the remaining plastic wrap. Cover the top and sides with the whipped cream. Top with the reserved peaches and remaining pecan mixture. Freeze until firm, about 1 hour.\n            \n\n              Photograph by Yunhee Kim\n            \n", "ingredients": [{"food": "sugar", "quantity": 1.5}, {"food": "", "quantity": 1.0}, {"food": "peaches", "quantity": 4.75}, {"food": "crackers", "quantity": 1.0}, {"food": "pecans", "quantity": 0.5}, {"food": "butter oil", "quantity": 4.0}, {"food": "ice cream swich", "quantity": 4.0}, {"food": "", "quantity": 1}, {"food": "corn cakes", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 1.5}, {"food": "sugar", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 2.0}], "title": "\nPeach Cobbler Ice Cream Cake\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 200 degrees F. Line a baking sheet with two kitchen towels stacked on top of each other and place in the oven. This will keep your cooked pancakes warm.\n            \n\n              Whisk the flour, cornstarch, confectioners' sugar, baking powder, baking soda and salt together in a large bowl. Whisk the milk, eggs, melted butter and almond extract together in another bowl. Add the milk mixture to the flour mixture and whisk until ingredients are just incorporated and batter is thick (it's okay if there are some lumps). Let the batter rest for 5 minutes. \n            \n\n              Heat a large nonstick skillet over medium heat and brush with butter. Ladle 1/4 cup batter onto the skillet; repeat to make a second pancake. Arrange 4 peach slices over each pancake and sprinkle with 1 teaspoon brown sugar. Cook, until pancakes are golden on the bottom and bubbly on top, about 1 minute 30 seconds. Flip the pancakes and cook until the peaches and sugar are caramelized and the batter is cooked through on the second side, about 1 minute 30 seconds more. Transfer the pancakes, fruit side up, to the baking sheet in the oven, tucking them between the two kitchen towels. Repeat with the remaining batter, peaches and brown sugar to make more pancakes, brushing the skillet with more butter between each batch. \n            \n\n              To serve, place 3 pancakes, fruit side up, on each plate. Sprinkle with almonds, dust with confectioners' sugar and serve immediately with maple syrup or whipped cream.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.6666666666666665}, {"food": "cornstarch", "quantity": 0.25}, {"food": "sugar", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 0.5}, {"food": "milk", "quantity": 1.25}, {"food": "eggs", "quantity": 2.0}, {"food": "butter oil", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "luncheon slices", "quantity": 2.0}, {"food": "sugar", "quantity": 0.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.25}, {"food": "whipped cream substitute", "quantity": 1}], "title": "\nPeach Cobbler Pancakes\n"}, {"directions": "\n\n              Fill a cocktail shaker halfway with ice. Add the vodka, peach schnapps and cranberry juice cocktail. Shake well, then strain into a cocktail glass. Garnish with lime, if desired.\n            \n\n              Photograph by Jonathan Kantor\n            \n", "ingredients": [{"food": "", "quantity": 1.5}, {"food": "silk peach soy yogurt", "quantity": 0.75}, {"food": "cranberry juice cocktail", "quantity": 0.75}, {"food": "", "quantity": 1}], "title": "\nPeach Cosmo\n"}, {"directions": "\n\n              Let the ham sit at room temperature 30 minutes. Preheat the oven to 325 degrees F. Trim off any skin from the ham if needed. Score the ham through the fat in a diagonal crosshatch pattern without cutting into the meat. Place the ham, flat-side down, on a rack in a roasting pan. Pour 1/4 inch of water into the bottom of the pan. Roast the ham until it reaches an internal temperature of about 130 degrees F, about 2 1/2 hours or 15 minutes per pound.\n            \n\n              Meanwhile, toast the coriander seeds in dry skillet until fragrant, about 1 minute. Cool and crack in a mortar and pestle or on a cutting board with a small pan. Combine the peach preserves, lemon juice, ginger and coriander in a small saucepan and bring to a boil over medium-high heat. Reduce the heat to low and simmer gently until thickened, 10 to 15 minutes. Strain into a small bowl.\n            \n\n              Remove the ham from the oven when it has reached 130 degrees F internally. Increase the oven temperature to 425 degrees F. Spoon or brush some of the glaze all over the ham. Add water as needed to the bottom of the pan. Return the ham to the oven and roast, basting every 10 minutes with the remaining glaze, until glossy, glazed and well browned, about 45 minutes more.\n            \n", "ingredients": [{"food": "honey smoked ham", "quantity": 8.0}, {"food": "seeds", "quantity": 1.0}, {"food": "silk peach soy yogurt", "quantity": 13.0}, {"food": "lemon juice", "quantity": 0.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}], "title": "\nPeach Ginger Glazed Ham\n"}, {"directions": "\n\n              Put the sugar, 2 tablespoons of the lemon juice, vanilla and cloves in a heavy, nonreactive skillet. Cook over medium heat, stirring occasionally, until the sugar dissolves, about 5 minutes.\n            \n\n              Add the peaches to the skillet and stir once to coat. Raise the heat to medium-high, and bring to a visible simmer. Cook, stirring occasionally, until the mixture is thick and jam-like and the peach pieces are very soft, 15 to 20 minutes, depending on ripeness of the peaches. Check the pan midway, you may need to lower the temperature to medium if the mixture starts to brown.\n            \n\n              Crush the peaches with a potato masher, until most of the mixture is smooth and there are only a few chunky pieces left. (The longer the mixture cooks, the thicker the jam will be after it cools.) Remove from the heat, stir in the remaining 2 teaspoons of lemon juice, and let cool before refrigerating. Cool completely in the refrigerator before using. Discard the cloves before serving. The jam will keep in the refrigerator for up to 2 weeks.\n            \n", "ingredients": [{"food": "sugar", "quantity": 1.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 0.25}, {"food": "cloves", "quantity": 2.0}, {"food": "peaches", "quantity": 4.0}], "title": "\nPeach Jam\n"}, {"directions": "\n\n              For the pudding: Put the eggs yolks in a medium bowl. Whisk together the milk, sugar, cornstarch and salt in a medium saucepan, and bring to a low simmer over medium heat, whisking constantly to prevent sticking on the bottom. Once the mixture comes to a simmer, continue whisking until it is just thicker than heavy cream, 3 to 4 minutes. Remove the saucepan from the heat, pour about 1 cup of the mixture into the egg yolks and whisk to combine. Pour this milk-egg mixture back into the milk mixture in the saucepan. Return the saucepan to medium heat, and whisk until very thick, 3 to 4 minutes. (When you drag the whisk through the thickened pudding, the streaks should hold firm for a few seconds.)\n            \n\n              Whisk the butter and vanilla into the pudding, and transfer it to a large bowl to cool. Set the bowl in some ice water and whisk frequently to help the pudding cool faster.\n            \n\n              For the raspberry topping: While the pudding cools, stir together 2 tablespoons water and the cornstarch in a small bowl. Heat the raspberries and sugar in a medium skillet over medium heat, stirring occasionally, until the raspberries thaw and break down and the sugar dissolves completely, 3 to 4 minutes. Stir in the cornstarch mixture, and bring to a simmer, stirring constantly; continue cooking and stirring until the mixture thickens enough to coat the back of a spoon, 1 to 2 minutes. Remove the skillet from the heat, and let the mixture cool completely.\n            \n\n              Build the pie: Spread 1/2 the cooled pudding into an even layer in the pie crust. Scatter the peaches over the pudding, then the cookies over the peaches. Finish with an even layer of the remaining pudding. Cover with a piece of plastic wrap, and refrigerate for 1 hour. Spread the raspberry topping over the pudding. (Stir the topping first to smooth out if needed.) Refrigerate the pie until the pudding is completely set, about 2 hours. Slice and serve.\n            \n", "ingredients": [{"food": "egg substitute", "quantity": 3.0}, {"food": "whole milk", "quantity": 3.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "cornstarch", "quantity": 5.0}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "", "quantity": 1}, {"food": "cornstarch", "quantity": 2.0}, {"food": "raspberries", "quantity": 10.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "pie crust", "quantity": 1.0}, {"food": "peaches", "quantity": 15.5}, {"food": "chocolate chip cookies", "quantity": 10.0}], "title": "\nPeach Melba Snickerdoodle Pudding Pie\n"}, {"directions": "\n\n              Toss the raspberries and raspberry jam in a medium bowl and let stand 20 minutes at room temperature.\n            \n\n              Slice or quarter the peaches, depending on their size, divide among 4 dessert bowls and sprinkle the sugar over the tops. Let sit until they get a little juicy, about 15 minutes, turning them over once or twice.\n            \n\n              To serve, put one scoop of frozen yogurt on top of the peaches. Spoon some raspberries over each scoop. Top each with 1 tablespoon of crushed cookies. Serve immediately.\n            \n", "ingredients": [{"food": "raspberries", "quantity": 1.0}, {"food": "silk raspberry soy yogurt", "quantity": 0.25}, {"food": "peaches", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "frozen yogurt", "quantity": 1.0}, {"food": "chocolate chip cookies", "quantity": 0.25}], "title": "\nPeach Melba Split\n"}, {"directions": "\n\n              Make the crust: Preheat the oven to 375 degrees F. Spread the almonds on a baking sheet and bake until slightly golden, about 5 minutes. Transfer to a bowl and let cool completely.\n            \n\n              Combine the flour, 1/3 cup of the toasted almonds, the granulated sugar and salt in a food processor and pulse until finely ground. Add the butter and pulse until the mixture looks like coarse meal. Add 2 tablespoons ice water and pulse until the dough just comes together. Turn out the dough onto a piece of plastic wrap and form into a disk; wrap tightly and refrigerate until slightly firm, about 15 minutes. Unwrap the dough and press evenly into the bottom and up the sides of a 9-inch tart pan with a removable bottom. Freeze until firm, about 10 minutes.\n            \n\n              Place the tart pan on a baking sheet. Line the crust with foil and fill with pie weights or dried beans. Bake until the edge of the crust is slightly golden, about 20 minutes. Remove the foil and weights and continue baking until the crust is golden brown all over, 15 to 20 more minutes. Transfer to a rack to cool completely.\n            \n\n              Make the glaze: Combine the diced peach, granulated sugar, lemon zest and juice, and 1 cup water in a small saucepan. Bring to a simmer over medium heat and cook until the peach is soft and the glaze is thickened, about 10 minutes. Remove the lemon zest; let the glaze cool.\n            \n\n              Make the filling: Mix the ricotta, cream cheese, confectioners' sugar and nutmeg in a bowl with a mixer until smooth; spread evenly in the crust. Arrange the sliced peaches on top of the filling in concentric circles. Brush with all but about 1 tablespoon of the glaze. Gently toss the raspberries with the remaining glaze, then scatter on top of the tart along with the remaining toasted almonds. Serve immediately or cover and refrigerate up to 4 hours.\n            \n\n              Photograph by Yunhee Kim\n            \n", "ingredients": [{"food": "pie crust", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}, {"food": "potato flour", "quantity": 0.75}, {"food": "sugar", "quantity": 2.0}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 6.0}, {"food": "", "quantity": 1}, {"food": "diced chicken", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "lemon juice", "quantity": 2.0}, {"food": "dessert topping", "quantity": 1}, {"food": "macaroni cheese", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "sugar", "quantity": 0.25}, {"food": "hearts of palm", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "raspberries", "quantity": 0.5}], "title": "\nPeach Melba Tart\n"}, {"directions": "\n\n              Melt the oil and butter in a medium saucepan over medium heat. Add the shallot and garlic season with the salt and pepper, and cook until tender, about 4 minutes. Stir in the peaches, brown sugar, cherries, and mustard. Cook, stirring occasionally, until peaches get nice and juicy and turn into a thick chunky compote, about 8 minutes. Cool and serve at room temperature with chicken or pork.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "salt", "quantity": 0.75}, {"food": "black bean mango", "quantity": 1}, {"food": "peaches", "quantity": 1.0}, {"food": "sugar", "quantity": 0.25}, {"food": "maraschino cherries", "quantity": 0.3333333333333333}, {"food": "mustard spinach", "quantity": 2.0}], "title": "\nPeach Mustard Chutney\n"}, {"directions": "\n\n              Combine the lime chunks and sugar in a large pitcher. Using a muddler or large wooden spoon, mash the limes to release the juices. Add the peach chunks and mint and lightly muddle to bruise the mint and break up the peaches; stir in the rum. (The mixture can be refrigerated up to 6 hours.)\n            \n\n              Just before serving, pour the peach-rum mixture into ice-filled glasses and top with seltzer. Garnish with peach wedges.\n            \n", "ingredients": [{"food": "limes", "quantity": 2.0}, {"food": "sugar", "quantity": 0.5}, {"food": "pineapple chunks", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "martha white foods", "quantity": 16.0}, {"food": "dessert topping", "quantity": 1}], "title": "\nPeach Picker\n"}, {"directions": "\n\n              Combine 2 1/2 pounds peach wedges with 3/4 cup light brown sugar, the juice of 1 lemon, 2 tablespoons quick-cooking tapioca, 1/2 teaspoon vanilla extract, 1/2 teaspoon cinnamon, 1/4 teaspoon nutmeg and 1/4 teaspoon salt. Pour into pie shell; dot with 4 tablespoons butter.\n            \n\n              Perfect All-Butter Piecrust\n            \n\n              Pulse 3 1/2 cups flour, 1/4 cup sugar and 1 teaspoon salt in a food processor. Add 1 diced stick cold butter; process until combined. Add 2 more diced sticks cold butter; pulse three times, or until the mixture resembles coarse meal. Add 1 tablespoon white or cider vinegar. Gradually pour in 1/3 cup ice water, pulsing about four times until combined. Turn out onto a clean surface and press into a cohesive dough without overworking (you should see bits of butter). Wrap in plastic wrap and press into a 1-inch-thick disk; refrigerate at least 1 hour before rolling out.\n            \n\n              How to Make a Pie\n            \n\n              Divide the chilled dough in half; roll 1 piece into a 12-inch, 1/8-inch-thick circle on a lightly floured surface (refrigerate the other piece).\n            \n\n              Roll the dough onto a rolling pin, then unroll it into a 9-inch glass pie plate, letting it hang over the edge; add filling (see options above).\n            \n\n              Roll out the other piece of dough and place over the filling; press the crust edges together and trim, leaving a 1-inch overhang. Roll up or pinch the overhang to seal.\n            \n\n              Place a foil-lined baking sheet on a rack in the lower third of the oven; preheat to 450 degrees. Wrap an oiled, wide band of foil around the pie edge to protect the crust. Make slashes in the top of the crust; chill for 30 minutes.\n            \n\n              Reduce the oven to 400 degrees. Bake the pie for 30 minutes. Remove the foil band, brush the crust with heavy cream and sprinkle with sugar. Bake until golden brown, about 30 minutes; cool before slicing.\n            \n\n              Photograph by Karl Juengel\n            \n", "ingredients": [], "title": "\nPeach Pie\n"}, {"directions": "\n\n              Make the doughnuts: Preheat the oven to 400 degrees F. Line a baking sheet with parchment paper. Unfold one puff pastry sheet on a work surface and brush off the excess flour. Brush all over with the beaten egg. Unfold the second puff pastry sheet on top of the first one and press to seal. Cut out eight rounds using a 3-inch cookie cutter. Cut out the middles with a 1-inch cookie cutter. Cut out more 1-inch rounds from the scraps, if desired. Arrange on the prepared baking sheet and bake until browned and crisp, 20 to 25 minutes.\n            \n\n              Microwave the peach preserves until melted, about 30 seconds. Brush on the doughnuts and doughnut holes while still hot. Let cool completely on the baking sheet.\n            \n\n              Meanwhile, make the filling: Combine the peaches, peach nectar and salt in a small saucepan. Cook over medium heat, stirring occasionally, until the peaches are soft and most of the liquid has evaporated, 8 to 10 minutes. Transfer to a blender and puree until smooth. Refrigerate until thick and cold, at least 2 hours.\n            \n\n              Make the glaze: Whisk the confectioners' sugar, 1 tablespoon peach nectar, the lemon juice and vanilla in a small bowl until smooth; add up to 1 more tablespoon peach nectar if needed.\n            \n\n              Using a sharp knife, cut each doughnut horizontally into 3 rings. Spread some of the peach filling on the bottom rings and top with a second ring, then spread with more peach filling and add the top ring. (You will not use all the filling.) Drizzle the glaze over the doughnuts. Sprinkle with the freeze-dried strawberries. Let the glaze set, 10 to 15 minutes. Serve at room temperature or chilled with the remaining peach filling for dipping.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "cream puff shell", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "silk peach soy yogurt", "quantity": 3.0}, {"food": "peaches", "quantity": 2.0}, {"food": "peach nectar", "quantity": 0.5}, {"food": "hearts of palm", "quantity": 1}, {"food": "sugar", "quantity": 1.0}, {"food": "peach nectar", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.125}, {"food": "strawberries", "quantity": 1}], "title": "\nPeach Puff Pastry Doughnuts\n"}, {"directions": "\n\n              With a box grater, grate 2 peach halves into a pitcher. Finely dice the remaining peaches, adding to the pitcher, along with the rum and vanilla bean. Cover and refrigerate until chilled, about 2 hours, more than that and the vanilla becomes too potent. Add the ginger ale and serve.\n            \n\n              Copyright 2004 Television Food Network, G.P. All rights reserved.\n            \n", "ingredients": [{"food": "peaches", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.25}, {"food": "ginger", "quantity": 5.0}], "title": "\nPeach Punch\n"}, {"directions": "\n\n              Soak 1/2 thinly sliced red onion in ice water for 10 minutes; drain and pat dry. Whisk 2 tablespoons white wine vinegar and 2 teaspoons each honey and Dijon mustard in a large bowl; whisk in 1/4 cup olive oil. Add the onion, 6 peaches (cut into wedges), 1/2 cup chopped candied walnuts and 1/4 cup each fresh basil and mint. Season with salt and pepper and toss.\n            \n\n              Photograph by Bobbi Lin\n            \n", "ingredients": [], "title": "\nPeach Salad\n"}, {"directions": "\n\n              With a box grater, grate 2 of the peach halves into a pitcher, discard the skins. Finely dice the remaining peaches, add them to the pitcher along with the wine and herbs. Cover and refrigerate until chilled, at least 2 hours. Serve.\n            \n", "ingredients": [{"food": "peaches", "quantity": 3.0}, {"food": "", "quantity": 1.0}, {"food": "lemon juice", "quantity": 10.0}], "title": "\nPeach Sangria\n"}, {"directions": "\n\n              Pour 1 cup peach nectar into an ice cube tray; freeze 4 hours. Freeze 2 large sliced peaches, 2 hours. Chill 4 wineglasses. Blend the peach ice cubes, frozen peaches, 2 cups dry rose and 2 ounces each brandy and peach schnapps until slushy. Pour into the glasses.\n            \n\n              Photograph by Sarah Anne Ward\n            \n", "ingredients": [], "title": "\nPeach Sangria Slushies\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: A rimmed 10-by-15-inch baking sheet\n\n              Adjust a rack to the bottom third of the oven and preheat the oven to 375 degrees F. Grease the bottom and sides of a rimmed 10-by-15-inch baking sheet with butter.\n            \n\n              For the dough: Combine the butter, flour, confectioners' sugar and salt in a food processor and process until the mixture comes together in a solid mass (this may take a few minutes). Drop pieces of the dough all over the prepared baking sheet. Use your fingers to press the dough evenly along the bottom and about 1/2 inch up the sides of the pan, filling any gaps. Set aside.\n            \n\n              For the filling: Toss together the peaches, brown sugar, lemon juice, cornstarch, vanilla, cinnamon, salt and nutmeg in a large bowl until the cornstarch dissolves. Transfer the filling onto the crust and spread in an even layer. Bake for 30 minutes.\n            \n\n              For the streusel: While the pie bakes, make the strussel topping by combining the flour, almonds, brown sugar, melted butter and salt in a small bowl until evenly moistened.\n            \n\n              Remove the pie from the oven and sprinkle the streusel evenly over the filling. Return the pie to the oven and bake until the topping is golden brown and the filling is bubbly, 25 to 30 minutes more. (If the crust browns too quickly during baking, cover the pie loosely with foil.)\n            \n\n              Let the pie cool. Serve warm or at room temperature.\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 2.0}, {"food": "potato flour", "quantity": 3.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "salt", "quantity": 0.5}, {"food": "", "quantity": 1}, {"food": "peaches", "quantity": 3.0}, {"food": "sugar", "quantity": 1.5}, {"food": "", "quantity": 1.0}, {"food": "cornstarch", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "nutmeg", "quantity": 0.25}, {"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 0.75}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}, {"food": "sugar", "quantity": 0.5}, {"food": "butter oil", "quantity": 6.0}, {"food": "salt", "quantity": 0.25}], "title": "\nPeach Streusel Slab Pie\n"}, {"directions": "\n\n              Put an oven rack in the lower third of the oven. Preheat the oven to 425 degrees F.\n            \n\n              Place the puff pastry between two sheets of parchment paper and roll it out a bit to make a 9-by-10-inch rectangle. Remove the top piece of paper. Use the tip of a sharp knife to gently score the dough, without cutting all the way through, 1 inch from the edges all the way around. Transfer to a sheet pan and store in the freezer while you prepare the peaches.\n            \n\n              Cut the peaches into 1-inch wedges. Toss them with 1 tablespoon honey. Remove the dough from the freezer, sprinkle on the thyme, and arrange the peaches in a single layer on top, leaving the border clear.\n            \n\n              Bake the tart until the crust is deep golden-brown and the peaches are tender, about 25 minutes. Remove from the oven to a cooling rack and cool slightly before serving. Cut into squares, top each with a dollop of ricotta, and drizzle some honey over the cheese.\n            \n", "ingredients": [{"food": "puff pastry", "quantity": 1.0}, {"food": "peaches", "quantity": 12.0}, {"food": "honey smoked ham", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 0.5}], "title": "\nPeach Tart with Honey and Thyme\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees. Butter a 9-by-13-inch baking dish. Make the biscuits: Whisk the flour, granulated sugar, baking powder, nutmeg and salt in a medium bowl. Add the butter and work it in with your fingers until it is in pea-size pieces. Stir in the heavy cream until the mixture just comes together into a shaggy dough. Turn out onto a floured baking sheet and pat until 1/4 inch thick; freeze until firm, about 10 minutes.\n            \n\n              Make the filling: Toss the peaches, granulated sugar, cornstarch, orange zest and juice, and vanilla in a bowl until the peaches are coated. Gently stir in the berries. Transfer to the prepared baking dish.\n            \n\n              Cut out circles from the cold dough using 2 1/2-inch cookie cutters. Arrange the circles on the fruit mixture; brush with heavy cream and sprinkle with coarse sugar. Bake until the biscuits are golden brown and the filling is bubbling, 50 minutes to 1 hour. Transfer to a rack and let cool.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 6.0}, {"food": "potato flour", "quantity": 1.5}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "nutmeg", "quantity": 0.25}, {"food": "salt", "quantity": 0.25}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "sugar", "quantity": 1}, {"food": "peaches", "quantity": 3.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "cornstarch", "quantity": 0.25}, {"food": "grape juice", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "raspberries", "quantity": 1.0}, {"food": "blueberries", "quantity": 1.0}], "title": "\nPeach and Berry Cobbler\n"}, {"directions": "\n\n              Heat 2 1/2 cups water, the butter and cardamom in a medium saucepan over medium heat just to a simmer. Add the peaches, reduce the heat to low and cook until the peaches are very tender but not falling apart, 25 to 30 minutes. Cool in the liquid about 15 minutes and then drain and cool the fruit to room temperature. (This can also be done a couple hours ahead and the peaches can be left in the liquid until ready to assemble.) \n            \n\n              Blend the goat cheese with the cream, honey and orange zest in a small bowl. \n            \n\n              To assemble, pat the peaches dry with paper towels if very wet and place 6 on a large serving plate. Top each peach with some of the cheese mixture, a sprinkle of pistachios and another peach, followed by more cheese and pistachios and a third peach. Garnish each napoleon with a drizzle of honey, some more pistachios and a light sprinkling of orange zest and sea salt, if using.\n            \n", "ingredients": [{"food": "", "quantity": 4.5}, {"food": "drumstick pods", "quantity": 2.5}, {"food": "peaches", "quantity": 18.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "ice cream swich", "quantity": 0.25}, {"food": "honey smoked ham", "quantity": 1.0}, {"food": "orange", "quantity": 0.25}, {"food": "", "quantity": 2.0}, {"food": "sea lion", "quantity": 1}], "title": "\nPeach and Goat Cheese Napoleons\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Make the topping: Whisk the flour, sugar, baking powder, salt and nutmeg in a large bowl. Work in the butter with your fingers or a pastry blender until the mixture looks like coarse meal with some pea-size lumps. Add the cream and stir with a fork until combined. Turn out onto a lightly floured surface; knead 4 or 5 times to bring the dough together. Pat into a 1/2-inch-thick round, then use a 1 1/2-to-2-inch cookie cutter to cut out biscuits. Pat the scraps together and cut out more biscuits. Put the biscuits on a baking sheet and chill until ready to use.\n            \n\n              Make the filling: Melt the butter in a large ovenproof skillet over medium heat. Add the peaches, flour, honey, lemon juice, lemon zest, vanilla, cinnamon and nutmeg and cook, stirring occasionally, until bubbling, about 5 minutes. Stir in the raspberries, then arrange the biscuits on top. Brush the biscuits with cream and sprinkle lightly with sugar.\n            \n\n              Transfer the skillet to the oven and bake until the fruit is bubbling and the biscuits are cooked through, about 25 minutes. (If the biscuits are browning too quickly, cover loosely with foil.) Let cool slightly before serving.\n            \n\n              Photograph by Anna Williams\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.75}, {"food": "sugar", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "salt", "quantity": 0.5}, {"food": "nutmeg", "quantity": 0.125}, {"food": "butter oil", "quantity": 1.5}, {"food": "ice cream swich", "quantity": 0.125}, {"food": "butter oil", "quantity": 2.0}, {"food": "peaches", "quantity": 5.5}, {"food": "potato flour", "quantity": 2.0}, {"food": "honey smoked ham", "quantity": 0.5}, {"food": "lemon juice", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "cinnamon", "quantity": 0.5}, {"food": "nutmeg", "quantity": 0.25}, {"food": "raspberries", "quantity": 1.0}], "title": "\nPeach and Raspberry Cobbler\n"}]