[{"directions": "\n\n              Make Margherita Pizzas; before adding cheese, top with olives, artichoke hearts, ham and sauteed mushrooms in 4 sections.\n            \n\n              Margherita Pizzas\n            \n\n              Stretch dough into two thin 9-inch rounds. Top each with 1/2 cup crushed San Marzano tomatoes, dried oregano, salt, pepper and olive oil; bake until golden. Sprinkle with 1/2 pound diced mozzarella, torn basil and salt. Bake until the cheese melts, then drizzle with olive oil.\n            \n\n              How to make a pizza:\n            \n\n              Step 1:Place a pizza stone or an inverted baking sheet on the lowest oven rack and preheat to 500 degrees.\n            \n\n              Step 2: Stretch 1 pound dough on a floured pizza peel, large wooden cutting board or parchment paper.\n            \n\n              Step 3: Top as desired, then slide the pizza (with the parchment paper, if using) onto the stone or baking sheet. Bake until golden, about 15 minutes.\n            \n\n              Pizza Dough\n            \n\n              Whisk 3 3/4 cups flour and 1 1/2 teaspoons salt. Make a well and add 1 1/3 cups warm water, 1 tablespoon sugar and 1 packet yeast. When foamy, mix in 3 tablespoons olive oil; knead until smooth, 5 minutes. Brush with olive oil, cover in a bowl and let rise until doubled, about 1 hour 30 minutes. Divide into two 1-pound balls. Use 1 pound per recipe unless noted.\n            \n\n              Photographs by Kana Okada\n            \n", "ingredients": [], "title": "\nQuattro Stagioni\n"}, {"directions": "\n\n              Put the cilantro, onions and pickled jalapeno if using on a cutting board, and chop them into a rough mixture.\n            \n\n              Melt the butter in a large saucepan over medium heat. Add the flour, and stir until it is absorbed. Pour in the beer and milk; whisk constantly until the mixture comes to a simmer and thickens enough to coat the back of a spoon, about 5 minutes. Remove from the heat, and stir in the Monterey Jack until completely melted and smooth.\n            \n\n              Transfer the queso dip to a warmed serving dish, a fondue pot or a small slow cooker set to warm or low. Sprinkle the cilantro mixture on top, and sprinkle with a little chipotle powder if using. Serve with tortilla chips.\n            \n", "ingredients": [{"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "onion powder", "quantity": 0.5}, {"food": "", "quantity": 2.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "potato flour", "quantity": 3.0}, {"food": "", "quantity": 12.0}, {"food": "whole milk", "quantity": 0.25}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "onion powder", "quantity": 1}, {"food": "potato chips", "quantity": 1}], "title": "\nQueso Dip\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Cook the chorizo, stirring, in a medium skillet or a flameproof gratin dish over medium-high heat until golden, about 5 minutes. Remove with a slotted spoon and pour off any excess rendered fat, reserving about 1 tablespoon in the pan. If there is less than 1 tablespoon, add enough olive oil to make 1 tablespoon. \n            \n\n              Reduce the heat to medium and cook the onions, stirring occasionally, until soft, 5 to 6 minutes. Add the garlic and cook, stirring, until fragrant, about 30 seconds. Sprinkle in the flour and cook, stirring, until the flour is golden, 1 minute. Pour in the beer and bring to a boil. Stir in the chopped jalapenos and pickling juice and cook 2 minutes. Gradually add the milk, whisking, and bring to a gentle boil until thickened, about 1 minute. Add the cheeses and reduce the heat to low. Cook, stirring frequently, until the cheese fully melts, about 3 minutes. Stir in the reserved chorizo. Transfer to a serving dish, garnish with the cilantro and serve warm with dippers.\n            \n", "ingredients": [{"food": "chorizo", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "potato flour", "quantity": 5.0}, {"food": "", "quantity": 0.5}, {"food": "grape juice", "quantity": 0.25}, {"food": "milk", "quantity": 0.75}, {"food": "diced chicken", "quantity": 4.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "", "quantity": 2.0}, {"food": "tortilla", "quantity": 1}], "title": "\nQueso Fundido con Chorizo\n"}, {"directions": "\n\n              Preheat the broiler. Put the poblanos on a broiler pan and broil, turning occasionally, until charred all over, about 10 minutes. Transfer to a bowl, cover with a plate and let steam until cool enough to handle, about 10 minutes. Scrape off the charred skin with a paring knife and remove the stems and seeds; chop the peppers and set aside.\n            \n\n              Heat the olive oil in an 8- or 9-inch cast-iron skillet over medium heat; add the chorizo and cook, breaking up the meat with a wooden spoon, until cooked through, about 5 minutes. Add the scallions and poblanos and cook until the scallions are wilted, about 2 minutes. Add the flour and cook, stirring to coat, 1 minute.\n            \n\n              Add the lager and bring to a boil; cook until thickened, about 1 minute. Add the cheese, a handful at a time, stirring until melted before adding more. Transfer the skillet to the broiler and broil until browned and bubbling, 1 to 2 minutes. Serve with chips.\n            \n\n              Photograph by Andrew Purcell\n            \n", "ingredients": [{"food": "peppers", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "chorizo", "quantity": 8.0}, {"food": "", "quantity": 0.5}, {"food": "potato flour", "quantity": 2.0}, {"food": "", "quantity": 0.5}, {"food": "cheddar cheese", "quantity": 2.0}, {"food": "potato chips", "quantity": 1}], "title": "\nQueso Fundido with Chorizo\n"}, {"directions": "\n\n              Place a rack in the top third of the oven and preheat the oven to broil. \n            \n\n              Trim off about an inch from the bottom of the asparagus and peel about halfway up. Toss the asparagus with the olive oil on a baking sheet. Season with salt and pepper and broil until slightly blistered and tender, about 7 minutes. Remove from the oven and set aside. \n            \n\n              Combine the mayonnaise, Parmesan, lemon juice and 1/2 teaspoon pepper and set aside. \n            \n\n              Fill a straight-sided skillet with about 2 inches of water and bring it to a bare simmer over medium heat. Add the vinegar. Crack an egg into a cup and gently slip it into the water. Repeat with the remaining eggs and cook until the whites are set but the yolks are still runny, 3 to 4 minutes. Using a slotted spoon, gently scoop the eggs from the water and blot dry with a paper towel. \n            \n\n              To serve, divide the asparagus among 4 plates, top each with a poached egg, drizzle with a quarter of the sauce and garnish with a sprig of dill.\n            \n", "ingredients": [{"food": "asparagus", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "mayonnaise dressing", "quantity": 0.3333333333333333}, {"food": "", "quantity": 0.3333333333333333}, {"food": "lemon juice", "quantity": 2.0}, {"food": "dill seed", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "eggs", "quantity": 4.0}], "title": "\nQuick Asparagus Benedict\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Heat the oil in a medium saucepan over medium-high heat. Add the onion and cook, stirring, until lightly browned, about 4 minutes. Add the garlic and crushed pepper and cook, stirring frequently, until fragrant, about 45 seconds. Add the tomato paste and cook, stirring, until lightly browned, about 1 minute more. Add the tomatoes, vinegar, sugar, and salt and bring to a boil. Lower the heat, and simmer, uncovered, stirring occasionally, until deep red in color and reduced to about 4 cups, about 25 minutes. Season with pepper to taste. Use now, or store, covered in the refrigerator for up to 3 days or freeze for up to 1 month.\n            \n\n              Copyright 2001 Television Food Network, G.P. All rights reserved\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "garlic powder", "quantity": 6.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "salt", "quantity": 1.5}, {"food": "black bean mango", "quantity": 1}], "title": "\nQuick Barbeque Sauce\n"}, {"directions": "\n\n              Combine the sugar, milk, vanilla and butter in the bowl of a stand mixer fitted with a paddle (or a large bowl if using a hand mixer). Beat until smooth, scraping down the sides of the bowl as needed.\n            \n\n              Swirl in the preserves using a spatula to make pretty streaks.\n            \n\n              Frost the muffins and watch them turn into cupcakes!\n            \n", "ingredients": [{"food": "sugar", "quantity": 1.0}, {"food": "milk", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "butter oil", "quantity": 1.0}, {"food": "silk peach soy yogurt", "quantity": 1.0}, {"food": "muffins", "quantity": 12.0}], "title": "\nQuick Cupcakes with Peach Frosting\n"}, {"directions": "\n\n              Cut 1 pound packaged cooked beets into wedges, reserving 1 tablespoon liquid from the package. Whisk the liquid with 1 tablespoon cider vinegar, 2 teaspoons grated ginger, 1/2 teaspoon honey and 2 tablespoons vegetable oil. Toss with the beets and season with salt and pepper.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [], "title": "\nQuick Ginger Beets\n"}, {"directions": "\nSpecial equipment: A Bundt or tube pan\n\n              Position a rack in the lower third of the oven and preheat to 350 degrees F. Spray a bundt or tube pan lightly with cooking spray.\n            \n\n              Toss the Parmesan, oregano, garlic, rosemary and thyme in a small bowl until well mixed. Roll each biscuit half into a ball. Put 8 of the balls in a medium bowl and drizzle with 2 tablespoons of the oil, tossing until well coated. Transfer each ball to the Parmesan mixture to coat, then place in the prepared pan. Working in batches of 8, repeat with the remaining dough balls, overlapping in the pan as necessary.\n            \n\n              Bake until the dough is puffed and browned, about 50 minutes; check halfway through the baking time and tent with foil if the bread is browning too quickly.\n            \n\n              Let the bread cool 10 minutes. Loosen the bread from the sides of the pan with a thin spatula. Invert the pan onto a baking sheet, then flip the bread (decorative-side up) onto a serving plate.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "garlic powder", "quantity": 0.25}, {"food": "rosemary", "quantity": 0.25}, {"food": "thyme", "quantity": 0.25}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 0.5}], "title": "\nQuick Herb and Cheese Monkey Bread\n"}, {"directions": "\n\n              1. Put the all-purpose flour, rye flour, baking powder and salt in a food processor and pulse until blended. Pour the club soda into a measuring cup and add the vinegar. Pour the liquid into the processor as it is running and mix until the batter is very smooth. Let sit for 10 minutes.\n            \n\n              2. Heat a 10-inch nonstick skillet over medium heat. Spray the skillet with a thin coating of nonstick spray. Make the injera the way you make a crepe: Remove the skillet from the heat and tilt the edge farther from you down toward the floor. Pour 1/3 cup of the batter in a pool slightly off-center further from you, and then quickly swirl the pan so that the batter covers the entire surface. Place the pan back on the heat, cover with a lid and cook until the edges start pulling from the pan and the top is shiny and slightly dry, 90 seconds to 2 minutes. Peel the injera from the pan and transfer to a plate, top-side up. Serve cool.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.5}, {"food": "rye flour", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "salt", "quantity": 0.5}, {"food": "", "quantity": 2.75}, {"food": "vinegar", "quantity": 3.0}, {"food": "", "quantity": 1}], "title": "\nQuick Injera\n"}, {"directions": "\n\n              Heat the oil in a medium saucepan over medium-high heat. Add the onion and garlic, and cook stirring, until lightly browned, about 3 minutes. Add the tomatoes, their juice, and bring to a boil. Adjust the heat to maintain a simmer, and cook covered, for 10 minutes. Add the herbs and chopped fresh tomatoes, if using, and simmer for a few more minutes until fresh tomatoes are cooked through.\n            \n\n              Remove and discard the herb sprigs. Stir in the salt and season with pepper, to taste. Use now, store covered in the refrigerator for up to 3 days, or freeze for up to 2 months.\n            \n\n              Cook's note: For more texture add seeded chopped tomatoes at the end. Also add fresh chopped herbs for a fuller herb flavor.\n            \n\n              Serving Suggestions: Serve this sauce over a pound dry pasta; linguini, fettuccine, spaghetti or fusilli, or, polenta, egg dishes, shellfish, or use for stews or braises. This sauce, when cooked a little longer and slightly thicker (around 2 cups), is also ideal for spreading on pizza.\n            \n\n              Copyright 2003 Television Food Network, G.P. All rights reserved\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "garlic powder", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.5}, {"food": "thyme", "quantity": 1}, {"food": "basil", "quantity": 1}, {"food": "plum", "quantity": 3.0}, {"food": "salt", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nQuick Marinara Sauce\n"}, {"directions": "\n\n              Heat the oil in a medium saucepan over medium-high heat. Saute the onion and garlic, stirring, until lightly browned, about 5 minutes. Add the tomatoes with about half of their juices (discarding the rest), the herb sprigs and basil and bring to a boil. Reduce heat and simmer, uncovered for about 25 to 30 minutes or until thickened.\n            \n\n              Remove and discard the herb sprigs. Stir in the salt and season with pepper, to taste. Serve or store covered in the refrigerator for up to 3 days, or freeze for up to 2 months.\n            \n\n              Copyright (c) 2004 Television Food Network, G.P., All Rights Reserved.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.25}, {"food": "onion powder", "quantity": 0.25}, {"food": "garlic powder", "quantity": 4.0}, {"food": "whole milk", "quantity": 3.0}, {"food": "thyme", "quantity": 3.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "salt", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nQuick Marinara Sauce\n"}, {"directions": "\n\n              Heat the oil in a medium saucepan over medium-high heat. Saute the onion and garlic, stirring, until lightly browned, about 3 minutes. Add the tomatoes and the herb sprigs and bring to a boil. Lower the heat and simmer, covered, for 10 minutes.\n            \n\n              Remove and discard the herb sprigs. Stir in the salt and season with pepper to taste. Use now, store covered in the refrigerator for up to 3 days, or freeze for up to 2 months.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.25}, {"food": "garlic powder", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.5}, {"food": "hearts of palm", "quantity": 1}, {"food": "hearts of palm", "quantity": 1}, {"food": "salt", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nQuick Marinara Sauce\n"}, {"directions": "\n\n              Blanch 1/3 pound each halved baby carrots, green beans and yellow beans, 2 to 4 minutes. Cool in ice water, then put in a glass bowl with 1/2 sliced red onion. Make the brine: Boil 2 cups each white vinegar and water, 1/4 cup kosher salt, 2 bay leaves, 3/4 cup sugar, the zest and juice of 1 lemon, and 1 teaspoon each peppercorns and coriander seeds; pour over the vegetables, then let cool. Chill at least 4 hours.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [], "title": "\nQuick Pickled Vegetables\n"}, {"directions": "\n\n              Divide 12 ounces trimmed green wax beans and yellow wax beans, 1 seedless cucumber (cut into spears), 1 quartered Fresno chile pepper, 3 quartered garlic cloves and 1/4 bunch chopped dill between two 1-quart jars. Bring 3 cups water, 1 3/4 cups distilled white vinegar, 1/3 cup kosher salt, 1/4 cup sugar and 1 teaspoon cracked coriander seeds to a boil, then pour over the vegetables. Loosely screw on the lids. Let cool, tighten the lids and refrigerate until chilled, at least 4 hours.\n            \n\n              Photograph by Ryan Liebe\n            \n", "ingredients": [], "title": "\nQuick Pickles\n"}, {"directions": "\n\n              Toss the pork pieces with the thyme, 1/4 teaspoon salt and 1/4 teaspoon pepper. Heat 1/2 of the oil in a medium Dutch oven over medium-high heat. Add the pork pieces in a single layer and cook until lightly browned, about 5 minutes. Transfer with a slotted spoon to a bowl. \n            \n\n              Heat the remaining oil in the same pot and add the carrots, celery, onions and bell pepper and cook, stirring, until softened, 7 to 10 minutes. Stir in the paprika, tomato paste, caraway and garlic until fragrant and the tomato paste has darkened slightly, 1 to 2 minutes. Stir in the broth and 1 1/2 cups water and bring to a simmer. Cook until the vegetables are tender and the broth has thickened, about 45 minutes. \n            \n\n              Meanwhile, cook the noodles according to package directions and keep warm. \n            \n\n              Add the pork back to the stew and cook, stirring, until the pork is cooked through and hot. Stir in the vinegar and season with salt and pepper. Toss with the hot egg noodles and garnish with chives.\n            \n", "ingredients": [{"food": "pork skins", "quantity": 1.25}, {"food": "thyme", "quantity": 0.25}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 4.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 3.0}, {"food": "pasta with tomato sauce", "quantity": 2.0}, {"food": "seeds", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "frankfurter beef", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "egg substitute", "quantity": 2.0}, {"food": "chives", "quantity": 1}], "title": "\nQuick Pork Goulash\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              In a large Dutch oven, heat 2 teaspoons of the oil over medium heat. Add the garlic and onion and season with salt and pepper. Cook until softened and lightly browned, about 5 minutes. Add the chili powder, cumin, cinnamon and cayenne and cook until toasted, 1 minute more. Stir in the chicken broth, ketchup, molasses and 1/3 cup of the vinegar. Bring to a simmer and add the pork. Simmer, covered, until the pork is just cooked through and tender, about 20 minutes.\n            \n\n              Meanwhile, in a medium bowl, whisk the mustard with the remaining 1 teaspoon oil and 1 tablespoon vinegar in a large bowl. Add the broccoli slaw and toss well. Season with salt and pepper and set aside. \n            \n\n              Remove the pork to a cutting board and let stand for 5 minutes. Increase the heat under the Dutch oven to medium high and cook the sauce until thickened, about 5 minutes. \n            \n\n              Shred the pork with 2 forks into large chunks and return to the thickened sauce. Toss well to coat and simmer 10 minutes, tossing occasionally, to let the pork absorb the sauce. Serve on the buns with the slaw on the sandwiches or on the side.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "chili powder", "quantity": 2.0}, {"food": "cumin seed", "quantity": 1.0}, {"food": "cinnamon", "quantity": 0.5}, {"food": "pepper", "quantity": 0.25}, {"food": "diced chicken", "quantity": 1.5}, {"food": "", "quantity": 0.3333333333333333}, {"food": "molasses", "quantity": 2.0}, {"food": "vinegar", "quantity": 0.3333333333333333}, {"food": "pork skins", "quantity": 1.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "broccoli raab", "quantity": 3.0}, {"food": "pizza rolls", "quantity": 6.0}], "title": "\nQuick Pulled Pork Sandwiches\n"}, {"directions": "\n\n              Heat the oil in a 10-inch skillet over medium heat and add the onions. Cook, stirring occasionally, until the onions begin to soften, about 4 minutes. Add the garlic and cook, stirring, until fragrant, about 30 seconds. Add 1/2 cup of the pico de gallo and the chipotle in adobo, if using, and cook, stirring frequently, until the tomatoes begin to break down, about 4 minutes. Add the chicken broth and bring to a simmer.\n            \n\n              Sprinkle the pork with 1 teaspoon salt and 1/2 teaspoon pepper. Add the pork to the skillet with the sauce and return to a simmer. Cover the skillet and simmer, flipping once, until the pork is just cooked through and tender, about 20 minutes. Remove the pork, cover loosely with aluminum foil and set aside for 5 minutes.\n            \n\n              Meanwhile, bring the sauce in the skillet to a boil and cook over medium-low heat until slightly thickened, about 5 minutes. Shred the pork with 2 forks, add it back to the skillet and toss well to coat. Season with additional salt and pepper if needed.\n            \n\n              Divide the shredded pork among the tostadas. Top with lettuce, cheese and the remaining pico de gallo. Drizzle with crema and top with radish slices. Serve with lime wedges.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "dulce de leche", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "diced chicken", "quantity": 0.5}, {"food": "pork skins", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "tostada shells", "quantity": 8.0}, {"food": "lettuce", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "sour cream", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "", "quantity": 1}], "title": "\nQuick Pulled Pork Tostadas\n"}, {"directions": "\n\n              Peel 1 pound golden or red beets, then cut into matchsticks. Toss with 1 1/2 teaspoons kosher salt; set aside until they release their liquid, about 15 minutes. Rinse, drain and pat dry; transfer to a glass bowl. Bring 1 cup cider vinegar, 1 cup water, 1/2 cup sugar, 1 halved serrano chile (seeded, if desired), 4 strips grapefruit zest, 1 1/2 teaspoons peppercorns and 1/4 teaspoon salt to a boil in a small saucepan. Pour over the beets. Let cool, then cover and refrigerate at least 1 day and up to 10 days.\n            \n\n              TIP:  Use these pickled beets as you would sauerkraut-on top of a sandwich, burger or hot dog.\n            \n\n              How to Peel and Juice a Beet\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [], "title": "\nQuick Spicy Pickled Beets\n"}, {"directions": "\n\n              Heat the vegetable oil in a large pot over medium-high heat. Add the tomato paste, chili powder and cumin and cook, stirring, until the mixture darkens, about 1 minute. Add 1/2 cup water, the bell pepper, scallion whites and 1 teaspoon salt. Cook, stirring, until the bell pepper is crisp-tender, about 4 minutes. Add the turkey and cook, breaking up the meat with a wooden spoon, until cooked through, about 4 minutes.\n            \n\n              Stir the tomatoes, chicken broth, beans and crushed tortilla chips into the pot; bring to a simmer. Partially cover and cook, stirring occasionally, until thickened, 10 to 12 minutes. Stir in all but a few tablespoons of the scallion greens and season with salt. Top with more crushed tortilla chips, sour cream, cheddar and the remaining scallion greens.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 2.0}, {"food": "chili powder", "quantity": 2.0}, {"food": "cumin seed", "quantity": 1.0}, {"food": "pepper", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 5.0}, {"food": "salt", "quantity": 1}, {"food": "ground turkey", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "fava beans", "quantity": 1.0}, {"food": "tortilla", "quantity": 1.0}, {"food": "cheddar cheese", "quantity": 1}], "title": "\nQuick Turkey Chili\n"}, {"directions": "\n\n              Halve the onion and slice as thinly and evenly as you can, no thicker than 1/8 inch. (A mandoline works well for this, but you can do it with a sharp knife and some patience.) Add the onions, mushroom slices and parsley to a large bowl.\n            \n\n              In a small bowl, whisk the lemon juice and olive oil. Ladle the dressing over the salad and toss to combine. Season with salt and pepper.\n            \n", "ingredients": [{"food": "onion powder", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nQuick Vidalia Onion, Mushroom and Parsley Salad\n"}, {"directions": "\n\n              Heat the oil in a medium soup pot over medium-high heat. Add the corn and cook until it starts to brown slightly, about 3 minutes. Add the tomato paste, rosemary and oregano and cook, stirring constantly, until the tomato paste begins to darken in color, about 1 minute. Slowly whisk in the chicken broth until the paste is smooth and then incorporated into the liquid. Add the whole can of diced tomatoes (including the liquid), and bring the mixture to a boil. Stir in the pasta, the white beans and reserved liquid and the soy sauce. Season with salt and pepper. Cook the pasta until al dente, 7 to 8 minutes, stirring in the green beans during the last 2 minutes. Serve in individual bowls with a little oil drizzled on top.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "sunflower seed kernels", "quantity": 8.0}, {"food": "pasta with tomato sauce", "quantity": 2.0}, {"food": "rosemary", "quantity": 0.5}, {"food": "", "quantity": 0.25}, {"food": "diced chicken", "quantity": 1.0}, {"food": "diced chicken", "quantity": 14.0}, {"food": "italian veg medley pasta", "quantity": 0.75}, {"food": "fava beans", "quantity": 14.0}, {"food": "soy sauce", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "fava beans", "quantity": 14.0}], "title": "\nQuick and Easy Minestrone\n"}, {"directions": "\n\n              Trim the ends and dark green tops from the leeks and discard. Cut the leeks in half lengthwise, then crosswise into 1-inch pieces. Immerse them in a bowl of cold water, swish to remove any grit and lift them out into a colander. Clean the bowl, change the water and repeat until the water remains clear. You should have 6 cups leeks. Once they are all in the colander, toss them a bit with your fingers to separate the leaves.\n            \n\n              Heat a large skillet over high heat until hot. Add 1 tablespoon of the oil and swirl to coat the bottom of the pan. Add half the leeks and a generous pinch each salt and pepper. Spread the leeks into a single layer and cook, without stirring, until slightly charred, about 1 minute. Stir in a small pinch pepper flakes and continue cooking, without stirring, 1 minute. Toss and stir until the leeks just start to wilt, about 1 more minute. Transfer to a bowl. Repeat with 1 tablespoon of the oil, the remaining leeks, a generous pinch each salt and pepper and another small pinch pepper flakes, adding the leeks to the bowl when done.\n            \n\n              Heat the remaining tablespoon of oil in the skillet (let it get really hot). Add the shrimp, garlic and another pinch pepper flakes (or to taste). Season with salt and pepper, and cook, tossing, until the shrimp just starts to turn pink in spots, less than 1 minute. Add the leeks and toss to combine; the shrimp should now be pink. Serve immediately over rice if using.\n            \n", "ingredients": [{"food": "leeks", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "black bean mango", "quantity": 1}, {"food": "ruby red grapefruit juice blend", "quantity": 0.75}, {"food": "", "quantity": 8.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "crisped rice bar", "quantity": 1}], "title": "\nQuick, Spicy Leek and Shrimp Stir-Fry\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Add the rice wine vinegar, palm sugar, fish sauce and dried chiles to a saucepan and bring to a boil. Place the watermelon into a bowl over an ice bath. Once the liquid comes to a boil, pour over the watermelon and stir to combine until the mixture has cooled.\n            \n\n              Add to a platter of cheeses, meats, crackers, dried fruit, etc.\n            \n", "ingredients": [{"food": "vinegar", "quantity": 1.5}, {"food": "sugar", "quantity": 0.25}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "bird", "quantity": 2.0}, {"food": "watermelon seed krnls", "quantity": 8.0}, {"food": "fruit cocktail", "quantity": 1}], "title": "\nQuick-Pickled Watermelon\n"}, {"directions": "\n\n              Put the wine, sugar, salt and 1/2 cup water in a high-sided medium skillet and bring to a boil over medium-high heat. Add the quince and bring to a boil. Reduce to a simmer and cook, partially covered, until the quince slices are very tender and translucent but still hold their shape, 20 to 30 minutes. \n            \n\n              Remove the quince to a bowl with a slotted spoon, leaving the syrup in the skillet. Return the heat to high and simmer the syrup until thickened, about 3 minutes. (You should have 1/3 cup syrup when finished.) Pour the hot syrup over the quince and stir in the crystallized ginger. Serve warm, at room temperature, or cool. The quince will keep covered in the refrigerator for 3 days. \n            \n", "ingredients": [{"food": "martha white foods", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 2.0}, {"food": "diced chicken", "quantity": 2.0}], "title": "\nQuince Compote\n"}, {"directions": "\nSpecial equipment: A pastry brush.\n\n              Preheat the oven to 400 degrees F. Line a baking sheet with parchment.\n            \n\n              Melt 2 tablespoons of the butter in a large skillet over medium-high heat until it starts to brown. Add the quince and cook, stirring occasionally, until slightly softened and nicely browned in spots, 3 to 4 minutes. Add the sugar and 1/4 cup water, bring to a simmer, and cook, stirring occasionally, until the liquid is syrupy and the quince is tender, 4 to 5 minutes more. Stir in the salt. Transfer the mixture to a metal bowl and refrigerate to cool, about 10 minutes.\n            \n\n              Fill a small bowl with water. Dice the remaining 4 tablespoons cold butter into bits and fold it into the fruit. Dust a cutting board with flour and roll out the puff pastry to a 12-inch square. Cut into 4 6-inch squares.\n            \n\n              Brush the edges of one of the pastry squares with water. Spoon 1/2 cup of the filling into the center of the square and spread it out a bit towards 2 opposite corners. Fold the dough diagonally over the filling to make a triangle and seal by pressing the edges with a fork. Transfer to the prepared baking sheet. Repeat with the remaining pastry squares and filling. Arrange the turnovers 2-inches apart. Make 2 or 3 vents in the top of each turnover with a sharp knife, using the tip to open the vents to expose the fruit (this will prevent the vents from closing in the oven). If your kitchen is very hot, pop each turnover in the freezer while you work and cut vents them when they are chilled. You can fill and freeze the turnovers for up to 5 days before baking; add an additional 5 minutes to the baking time.\n            \n\n              Bake the turnovers until deep golden brown, 18 to 22 minutes, rotating the pan after 10 minutes. Place the pan on a rack and let the turnovers cool for 5 minutes before serving. The turnovers can also be served at room temperature.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 4.0}, {"food": "", "quantity": 1.25}, {"food": "sugar", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "potato flour", "quantity": 1}, {"food": "puff pastry", "quantity": 1.0}], "title": "\nQuince Turnovers\n"}, {"directions": "\n\n              Make the quinoa: Bring the quinoa and 2 1/2 cups water to a boil in a large saucepan over medium-high heat. Cover, reduce the heat to medium-low and gently simmer until the quinoa is tender (the little tails will pop out) and most of the water is absorbed, 20 to 25 minutes Drain off any excess water. Stir in the chopped cilantro, scallions, oil and 1/2 teaspoon salt. Serve warm or at room temperature. (The quinoa can be cooked, cooled and refrigerated, covered, for up to 2 days. Microwave just enough to take the chill off, about 2 minutes, stirring about halfway through.)\n            \n\n              Make the avocado cream: While the quinoa cooks, process or blend the avocado, sour cream, Parmesan, lime juice, 1 tablespoon water, cayenne and 3/4 teaspoon salt in a food processor or blender until smooth and creamy.\n            \n\n              If the corn still has a chill, microwave it for about 1 minute.\n            \n\n              Build the bowls: Divide the quinoa evenly among 4 bowls. Top each with neat piles and/or rows of chicken, tortilla chips, corn, salsa and pepitas. Top with some sauce, a sprig of cilantro and a lime quarter.\n            \n", "ingredients": [{"food": "ruby red grapefruit juice blend", "quantity": 1.5}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "avocado", "quantity": 1.0}, {"food": "sour cream", "quantity": 0.25}, {"food": "", "quantity": 3.0}, {"food": "", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "corn bran", "quantity": 1.0}, {"food": "diced chicken", "quantity": 2.5}, {"food": "tortilla", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1.0}, {"food": "", "quantity": 0.25}], "title": "\nQuinoa Bowl with Chicken and Avocado Cream\n"}, {"directions": "\n\n              For the crust: Put the quinoa in a medium bowl and cover with water by about 1 inch. Cover and refrigerate at least 8 hours or up to overnight.\n            \n\n              For the sauce: Meanwhile, heat the olive oil in a large skillet over medium heat. When the oil is hot, add the garlic and cook until the edges are light golden, about 1 minute. Add the tomatoes, oregano, red pepper flakes, 1/2 cup water and salt. Bring to a simmer and cook until thickened, about 10 minutes. Set aside while you make the crust.\n            \n\n              Preheat the oven to 425 degrees F with a pizza stone or baking sheet on the bottom rack. Drain the soaked quinoa and rinse well. Line a rimmed half-sheet pan with parchment paper and brush the paper with olive oil. Put the quinoa in a food processor with the oil, baking powder, salt and 2/3 cup water and process to make a smooth, thick batter. Spread the batter into the prepared pan and bake on the hot pizza stone until set, 12 to 15 minutes.\n            \n\n              Flip the crust over in the pan and remove the parchment. (If the crust sticks to the sides, run a knife around the edge to loosen.) Bake until the top is crusty and the edges are crisp, about 5 minutes more.\n            \n\n              Spread the pizza sauce on the crust, almost to the edges. Sprinkle with the mozzarella and Parmesan and top with the pepperoni. Roughly tear the basil leaves and scatter over the top. Bake the pizza on the top rack until the cheese is melted and bubbly, about 15 minutes. Cut into squares and serve. \n            \n", "ingredients": [{"food": "martha white foods", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "plum", "quantity": 28.0}, {"food": "", "quantity": 0.5}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "salt", "quantity": 0.5}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 0.25}], "title": "\nQuinoa Crust Pizza\n"}, {"directions": "\n\n              Bring 2 cups water to a boil in a small saucepan over high heat. Stir in the quinoa. Cover, reduce the heat to low and cook until the liquid is just absorbed and the quinoa is moist and nearly tender, about 15 minutes.\n            \n\n              Transfer the quinoa to a large bowl and immediately stir in the oil, apricots, 1 1/4 teaspoons salt and 3/4 teaspoon pepper. Set aside to cool slightly, about 20 minutes, stirring a couple times. Refrigerate until chilled, at least 2 hours.\n            \n\n              When the quinoa is cool and ready to serve, stir in the arugula, basil, lemon juice and pistachios. Add salt and pepper to taste. Sprinkle with the goat cheese and serve.\n            \n", "ingredients": [{"food": "quinoa", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.5}, {"food": "diced chicken", "quantity": 12.5}, {"food": "black bean mango", "quantity": 1}, {"food": "arugula", "quantity": 5.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.25}, {"food": "lemon juice", "quantity": 1.25}, {"food": "", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 3.0}], "title": "\nQuinoa Salad with Apricots, Basil and Pistachios\n"}, {"directions": "\n\n              Place the quinoa and 2 cups water in a small saucepan. Bring to a boil over high heat. Stir once, cover and reduce the heat to low. Continue to cook until the water is absorbed and the quinoa is tender, about 20 minutes. Remove from the heat and let stand 5 minutes, uncover and fluff with a fork.\n            \n\n              Meanwhile, heat 1 teaspoon of the sesame oil in a medium nonstick skillet over medium-high heat. Add the garlic and cook until fragrant, about 1 minute. Add the mushrooms and continue to cook, stirring, until the mushrooms are tender, about 5 minutes. Add the snow peas, 1/4 teaspoon salt and 1/4 teaspoon pepper. Cook, stirring, until bright green but still crisp-tender, about 3 minutes. Remove from the heat. Combine the cooked quinoa, mushroom mixture, soy sauce, scallions and remaining 2 teaspoons sesame oil in a medium bowl. Toss gently to combine. Season with additional salt and pepper. Serve warm or at room temperature. \n            \n\n              Calories: 210 Fat: 6 grams Saturated Fat: 1 gram Protein: 8 grams Carbohydrates: 32 grams Sugar: 2 grams Fiber: 4 grams Cholesterol: 0 milligrams Sodium: 260 milligrams\n            \n", "ingredients": [{"food": "quinoa", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "black bean mango", "quantity": 1}, {"food": "soy sauce", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}], "title": "\nQuinoa With Shiitakes and Snow Peas\n"}, {"directions": "\n\n              Heat the olive oil in a large skillet over medium-high heat. Add the bell peppers, scallion whites and celery and cook, stirring, until soft, about 5 minutes. Add the garlic, tomato paste, cayenne and 1/2 teaspoon salt and cook, stirring often, until the tomato paste turns brick red, about 2 minutes. Stir in the quinoa, then add 2 cups water and the beans. Bring to a simmer and cook, stirring often, until most of the water is absorbed and the quinoa is cooked through, about 15 minutes. Add up to 1/4 cup more water if necessary. \n            \n\n              Remove the skillet from the heat and stir in the spinach until just wilted. Stir in 1/2 teaspoon salt and half each of the scallion greens and cheese. Divide among bowls and sprinkle with the remaining scallion greens and cheese. Serve with hot sauce. \n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "pasta with tomato sauce", "quantity": 2.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "quinoa", "quantity": 1.0}, {"food": "fava beans", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 4.0}, {"food": "cheddar cheese", "quantity": 0.5}, {"food": "Worcestershire sauce", "quantity": 1}], "title": "\nQuinoa and Bean Pilaf\n"}, {"directions": "\n\n              1. Heat 1 tablespoon oil in a Dutch oven over medium heat. Add the garlic and pepper flakes and cook until the garlic begins to brown, 2 minutes. Add the kale, tossing well. Add 1 cup broth and 1/2 cup water. Cover and cook until wilted, 5 minutes. Add the squash, season with salt and reduce heat to a simmer. Continue to cook, covered, until the kale and squash are tender, 12 to 15 minutes. Uncover and stir in the vinegar. \n            \n\n              2. Meanwhile, in a medium saucepan over medium heat add the quinoa, remaining 1 3/4 cups broth, and 1 cup water and bring to a boil. Reduce heat and simmer, gently stirring once or twice, until the quinoa is tender and the liquid has been absorbed, about 15 minutes. Let stand 5 minutes. \n            \n\n              3. Fluff the quinoa with a fork and then stir in the chopped parsley, remaining 1 tablespoon olive oil, and season with salt. \n            \n\n              4. To serve, top the quinoa with the braised kale and squash and their juices and sprinkle with the toasted chopped hazelnuts. \n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.75}, {"food": "turnip greens", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "vinegar", "quantity": 1.0}, {"food": "quinoa", "quantity": 1.25}, {"food": "parsley", "quantity": 1.0}, {"food": "hazelnuts or filberts", "quantity": 0.3333333333333333}], "title": "\nQuinoa and Braised Kale with Toasted Hazelnuts\n"}, {"directions": "\n\n              Put the quinoa in a fine mesh strainer and rinse under cold running water until the water runs clear. Bring a small saucepan of water to a boil, add the quinoa and cook until it is translucent and tender and the threadlike germ wraps around each kernel, 8 to 12 minutes. Strain the quinoa well, return it to the saucepan and stir in the lentils; cover and keep warm.\n            \n\n              Heat the oil in a large nonstick skillet over medium-high heat. Add the onions and cook, stirring frequently, until deep golden brown, 5 to 7 minutes. Add the garlic, cumin, cinnamon, lemon zest, 3/4 teaspoon salt and a few grinds of pepper and stir until toasted and fragrant, about 1 minute. Add 1/2 cup water and scrape up any brown bits. Add the chicken, bring to a simmer and cook until almost all of the liquid evaporates and the chicken is moistened, about 2 minutes.\n            \n\n              Meanwhile, put the green beans in a microwave-safe bowl with 1 tablespoon water. Cover and microwave until hot, about 3 minutes\n            \n\n              Add the chicken-onion mixture, lemon juice and 1/4 teaspoon salt to the quinoa-lentil mixture and stir to combine. Divide among four bowls. Top each with greens beans, almonds and a dollop of yogurt.\n            \n", "ingredients": [{"food": "quinoa", "quantity": 1.0}, {"food": "lentils", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "cumin seed", "quantity": 1.0}, {"food": "cinnamon", "quantity": 0.5}, {"food": "grape juice", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "rice bowl with chicken", "quantity": 1.0}, {"food": "fava beans", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "silk banana-strawberry soy yogurt", "quantity": 0.25}], "title": "\nQuinoa with Chicken and Lentils\n"}, {"directions": "\n\n              Position an oven rack in the center of the oven and preheat to 400°F. Line a rimmed baking sheet with foil and set aside.\n            \n\n              Place the squash in a medium bowl and add 3 tablespoons of the oil, the thyme and 2 teaspoons of salt and season with pepper to taste. Mix until the squash is well coated. Transfer to the prepared baking sheet and spread squash out into a single layer. Roast until a paring knife slides into the squash with no resistance, about 30 minutes, stirring about halfway through the cooking time. Put the pistachios on a small baking sheet and toast until fragrant, about 5 minutes.\n            \n\n              Meanwhile, rinse the quinoa in cold water in a fine-mesh strainer. Bring the broth or water to a boil and stir in the quinoa. Simmer, uncovered, until a small white spiral becomes visible in each grain, about 9 minutes. Drain the quinoa and transfer it to a medium bowl. Add the remaining 2 tablespoons olive oil, the pistachios, cranberries, vinegar, 1/2 teaspoon salt and pepper to taste.\n            \n\n              Place the spinach in a large mixing bowl and toss with the hot squash until slightly wilted. Add the quinoa mixture and toss again. Serve warm or at room temperature.\n            \n", "ingredients": [{"food": "pineapple chunks", "quantity": 2.75}, {"food": "vegetable oil", "quantity": 5.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "meat drippings ", "quantity": 1}, {"food": "quinoa", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 4.0}, {"food": "meat drippings ", "quantity": 1}, {"food": "vinegar", "quantity": 1.0}, {"food": "mustard spinach", "quantity": 3.0}], "title": "\nQuinoa with Roasted Butternut Squash\n"}, {"directions": "\n\n              Bring a medium saucepan of water to a boil. Add the quinoa, and cook until tender, 10 to 12 minutes. Strain well, and cool completely. (The quinoa can be cooked a day ahead.)\n            \n\n              Put the vinegar, 1 tablespoon of the oil, mustard, 1 tablespoon water, 1/4 teaspoon salt and a few grinds of pepper in a jar or other container with a lid. Secure the lid, and shake until combined. (The vinaigrette can be made a day ahead; shake well before serving.)\n            \n\n              Heat 1 tablespoon of the oil in a large nonstick skillet over medium-high heat. Add the peppers and onions, and cook, stirring occasionally, until they are just tender and browned in some spots, 5 to 7 minutes. Add the hot sauce, and stir. Remove the skillet from the heat, and let the vegetables cool completely. Wipe out the skillet, and set aside.\n            \n\n              Toss the quinoa, pepper-onion mixture, spinach, ham, Cheddar and scallions with the vinaigrette in a large bowl. Season to taste with salt and pepper. Divide among 4 serving bowls.\n            \n\n              Heat the remaining 1 tablespoon oil in the skillet over medium heat. Pour in the eggs, and add a pinch of salt. Tilt the skillet so the eggs completely cover the bottom. As the eggs turn from runny to cooked at the edge of the skillet, push the cooked eggs all around the edge to the middle of the skillet with a heatproof spatula so the uncooked eggs can spill into the free space and cook (this helps the eggs cook faster, and you won't have to flip the omelet). Once all the eggs are just cooked through, slide the omelet out onto a cutting board. Let it cool for a few minutes, then roll it up into a cylinder and cut it into 1/2-inch slices. Top each salad with a few \"pinwheels\" of egg. Serve hot sauce on the side.\n            \n", "ingredients": [{"food": "martha white foods", "quantity": 1.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "pepper", "quantity": 1.5}, {"food": "ruby red grapefruit juice blend", "quantity": 1.5}, {"food": "onion powder", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1}, {"food": "mustard spinach", "quantity": 5.0}, {"food": "ham", "quantity": 4.0}, {"food": "martha white foods", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "eggs", "quantity": 3.0}], "title": "\nQuinoa, Ham and Pepper Breakfast Salad\n"}, {"directions": "\n\n              Cook 1/2 cup red quinoa as the label directs. Put 3 shucked ears of corn in a bowl with a few tablespoons of water; loosely cover and microwave until tender, about 3 minutes. Cool, then cut off the kernels. Toss the quinoa and corn with 1 chopped large heirloom tomato, 2 sliced scallions, 3 tablespoons each olive oil and lime juice, 1/2 teaspoon kosher salt and a pinch of cayenne.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nQuinoa-Corn Salad\n"}, {"directions": "\n\n              Cook 1/4 cup quinoa as the label directs, then spread on a baking sheet to cool.\n            \n\n              Preheat the oven to 425 degrees F. Remove the stems from 24 large cremini mushrooms.\n            \n\n              Wipe the caps clean with a damp paper towel, then toss with 2 tablespoons olive oil and season with salt. Arrange on a baking sheet.\n            \n\n              Combine the cooled quinoa, 1/2 cup each chopped scallions and chopped toasted walnuts, 1/4 cup chopped dill and/or parsley, 1/3 cup crumbled feta and 2 tablespoons chopped sun-dried tomatoes in a bowl. Drizzle with olive oil, season with salt and toss. Divide among the mushroom caps.\n            \n\n              Bake until the mushrooms are tender and the filling is golden, 15 to 17 minutes. Let cool 5 minutes, then remove from the baking sheet.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [], "title": "\nQuinoa-Feta Stuffed Mushrooms\n"}, {"directions": "\n\n              Rinse 1 cup quinoa; toast in a saucepan over medium-high heat, stirring, 4 minutes. Add 1 1/2 cups water. Bring to a boil; reduce the heat, cover and simmer 13 minutes. Whisk 2 tablespoons olive oil with 1 teaspoon each whole-grain mustard and red wine vinegar in a large bowl; add 4 thinly sliced celery stalks and 2 tablespoons each chopped red onion, kalamata olives and parsley. Season with salt. Add the quinoa; toss.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [], "title": "\nQuinoa-Olive Salad\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F.\n            \n\n              For the zucchini salsa: Puree the zucchini, onion, jalapeno, cilantro, lime juice, 1 teaspoon salt and 1/4 teaspoon pepper in a blender.\n            \n\n              For the quinoa and goat cheese piquillo peppers: Bring the quinoa, 2 cups water and 1/2 teaspoon salt to a boil in a medium saucepan. Reduce to a simmer, cover and cook until tender, about 10 minutes. Drain and toss with the olive oil. Let cool about 10 minutes.\n            \n\n              Fold in the goat cheese and raisins. Stuff the quinoa filling into the piquillo peppers and place them in a 2-quart baking dish and cover with foil. Heat the peppers until the filling is hot throughout, about 20 minutes.\n            \n\n              Serve the peppers with the zucchini salsa.\n            \n", "ingredients": [{"food": "", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.25}, {"food": "pepper", "quantity": 0.5}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "lime juice", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.5}, {"food": "", "quantity": 1}, {"food": "quinoa", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 6.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.5}, {"food": "peppers", "quantity": 14.0}], "title": "\nQuinoa-Stuffed Piquillo Peppers\n"}, {"directions": "\n\n              Prepare 1 cup quinoa as the label directs. Stir to cool slightly. Toss with 1 cup halved grape tomatoes, one 15-ounce can hearts of palm (drained, rinsed and sliced), 2 chopped scallions, 2 tablespoons olive oil and a pinch of sugar; season with salt. Sprinkle with chopped parsley.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [], "title": "\nQuinoa-Tomato Salad\n"}]