[{"directions": "\n\n              Preheat the oven to 425 degrees F. \n            \n\n              In a roasting pan, rub the 2 onions in their skins with the 2 tablespoons oil. Bake until squishy soft, turning them once, about 45 minutes. Set aside to cool completely. Peel the onions and set aside. \n            \n\n              Meanwhile, finely dice the remaining onion. Preheat a large, heavy-bottomed skillet over medium-high heat. Add the remaining 1 cup oil and heat until hot. Add the diced onion and cook, stirring occasionally, until they just begin to lightly brown, about 5 minutes. Lower the heat to medium-low and continue to cook, stirring occasionally, until golden brown, about 18 minutes more. Strain the onions through a sieve over a bowl. Transfer the onions to a paper towel-lined plate and spread them into a single layer. Reserve 1/4 cup of the onion oil and let it cool completely. (Reserve the remaining oil for dressings or marinades.) \n            \n\n              Puree the roasted onions in a food processor. Add the mayonnaise, sour cream, vinegar, and salt, and pulse until smooth. While the motor is running, drizzle in the 1/4 cup of reserved onion oil until incorporated. Season with pepper and hot sauce, to taste. Transfer the onion dip to a serving bowl and stir in the scallion. Refrigerate until very thick, about 3 hours or overnight. \n            \n\n              When ready to serve top with the fried onions. Serve with chips. \n            \n", "ingredients": [{"food": "pork skins", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "mayonnaise dressing", "quantity": 2.0}, {"food": "sour cream", "quantity": 0.5}, {"food": "vinegar", "quantity": 1.0}, {"food": "salt", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "Worcestershire sauce", "quantity": 1}, {"food": "martha white foods", "quantity": 2.0}, {"food": "potato chips", "quantity": 1}], "title": "\n\"Really\" Onion Dip\n"}, {"directions": "\n\n              Put the dried anchovies, kombu, onion and 4 cups cold water in a large saucepan and bring to a boil. Lower the heat and simmer for 15 minutes, then strain the broth into a large saucepan (discard the solids). Bring the broth back to a simmer, add the corn syrup, gochujang, brown sugar, gochugaru, garlic and beef bouillon and stir to combine. Add the tteok and bring to a boil. Reduce the heat to low and simmer until the broth is thickened and reduced by two-thirds, 10 to 15 minutes.\n            \n\n              Meanwhile, bring a medium pot of water to a boil and blanch the ramen noodles until just tender, 2 to 3 minutes. Drain and set aside. \n            \n\n              When the broth is reduced, add the fishcakes, ramen noodles and scallions. Simmer for 1 to 2 more minutes until well coated. Garnish with the halved eggs and sesame seeds. Serve immediately.\n            \n", "ingredients": [{"food": "anchovies", "quantity": 0.5}, {"food": "", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "silk light vanilla", "quantity": 0.25}, {"food": "ruby red grapefruit juice blend", "quantity": 3.0}, {"food": "sugar", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "frankfurter beef", "quantity": 1.0}, {"food": "crisped rice bar", "quantity": 3.0}, {"food": "noodles", "quantity": 3.0}, {"food": "", "quantity": 1.5}, {"food": "", "quantity": 3.0}, {"food": "eggs", "quantity": 2.0}, {"food": "sesame seeds", "quantity": 1}], "title": "\nRabokki/Tteokbokki (Spicy Ramen and Rice Cake)\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              For the ribs: Prepare an outdoor grill l for cooking over indirect medium heat (if your grill has a thermometer, aim to keep the temperature at about 350 degrees F). Combine the brown sugar, chili powder, smoked paprika, granulated garlic and 1 teaspoon salt and 1/4 teaspoon pepper in a small bowl.\n            \n\n              Insert a butter knife between the membrane and bone on the back of the rack of ribs. Grab the membrane with a paper towel to grip it and pull off and discard the membrane. Sprinkle the spice mixture on both sides of the ribs and rub it in. Wrap the ribs tightly in aluminum foil and set on the indirect side of the grill. Cook, turning the package once, until the meat is tender and pulling from the bone but not totally falling apart, 1 hour 15 minutes to 1 hour 30 minutes.\n            \n\n              For the BBQ sauce: Meanwhile, combine the ketchup, vinegar, light brown sugar, honey mustard, hot sauce, chili powder, smoked paprika, granulated garlic, liquid smoke if using and 1/4 cup water in a small saucepan. Bring to a simmer and cook over medium heat, stirring occasionally, until thickened, 10 to 12 minutes.\n            \n\n              When the ribs are tender, remove them from the grill and unwrap them (leave the grill on). Let cool until you can touch the ribs without burning your fingers. With a knife, slit the skin on the back of the ribs and carefully pull out the bones, keeping the slab in one piece.\n            \n\n              Increase the grill temperature to high for cooking over direct heat. Add the boneless slab to the grill, rounded-side up, and brush with some of the BBQ sauce. Grill until the underside begins to crisp, about 2 minutes. Carefully flip the slab and brush the underside of the ribs with more sauce. Continue to grill the ribs until they're glossy and caramelized, 2 to 3 minutes more. Place the ribs on the hero roll, brush with more sauce and top with onions and pickles. Cut into 4 pieces. Serve with the extra sauce on the side.\n            \n", "ingredients": [{"food": "sugar", "quantity": 1.0}, {"food": "chili powder", "quantity": 2.0}, {"food": "smoked turkey roll", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "garlic powder", "quantity": 0.25}, {"food": "", "quantity": 1.5}, {"food": "smoked turkey roll", "quantity": 12.0}, {"food": "onion powder", "quantity": 1}, {"food": "", "quantity": 0.75}, {"food": "vinegar", "quantity": 0.25}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "chili powder", "quantity": 1.0}, {"food": "smoked turkey roll", "quantity": 0.5}, {"food": "garlic powder", "quantity": 0.25}, {"food": "", "quantity": 0.25}], "title": "\nRack-o-Ribs Hero\n"}, {"directions": "\n\n              Mix 3 tablespoons softened butter with 4 minced anchovies. Spread on white bread and sandwich with sliced radishes. Trim the crusts and cut into pieces.\n            \n", "ingredients": [], "title": "\nRadish-Anchovy Tea Sandwich\n"}, {"directions": "\n\n              Preheat the oven to 450 degrees F. Toss the bell pepper halves with 1 tablespoon olive oil and 1/2 teaspoon salt in a large microwave-safe bowl. Cover and microwave until the peppers soften, 10 to 12 minutes.\n            \n\n              Meanwhile, mix the ragu, couscous, raisins, 1/2 cup cheese, 3 teaspoons vinegar, the parsley and 1/4 teaspoon salt in a bowl.\n            \n\n              Whisk the remaining 1 tablespoon olive oil and 1 teaspoon vinegar, the tomato paste and 3/4 cup water in the bottom of a large nonreactive baking dish. Carefully transfer the peppers, cut-side up, to the baking dish and fill with the couscous mixture. Sprinkle with the remaining 1/4 cup cheese.\n            \n\n              Cover the dish with foil and bake until the peppers are tender and the filling is hot, about 20 minutes. Transfer to plates and drizzle with the cooking liquid from the dish.\n            \n\nFettuccine With Quick Ragu\n\n\n              Pulse the onion, celery, carrot, garlic and rosemary in a food processor until finely chopped.\n            \n\n              Heat the olive oil in a large saucepan over medium-high heat. Add the chopped vegetables and cook, stirring, until softened and golden, 3 to 5 minutes. Add the veal, 1 teaspoon salt and 1/2 teaspoon pepper and cook, breaking up the meat with a wooden spoon, until no longer pink, about 3 minutes. Add the tomatoes, milk, 1 cup water and 1/2 teaspoon salt. Bring to a boil, then reduce the heat and simmer until slightly thickened, about 20 minutes.\n            \n\n              Meanwhile, bring a large pot of salted water to a boil and cook the fettuccine as the label directs. Drain the pasta, then toss with half of the ragu (about 3 cups). Top with parmesan. Reserve the remaining ragu to make stuffed peppers.\n            \n\n              Per serving: Calories 484; Fat 12 g (Saturated 3 g); Cholesterol 48 mg; Sodium 462 mg; Carbohydrate 71 g; Fiber 5 g; Protein 25 g\n            \n", "ingredients": [{"food": "cheesecake mix", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 3.0}, {"food": "couscous", "quantity": 0.5}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.75}, {"food": "macaroni cheese", "quantity": 0.75}, {"food": "vinegar", "quantity": 4.0}, {"food": "parsley", "quantity": 0.5}, {"food": "pasta with tomato sauce", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "celery seed", "quantity": 1.0}, {"food": "carrot juice", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "rosemary", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "ground turkey", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "tomatoes", "quantity": 1.0}, {"food": "whole milk", "quantity": 0.5}, {"food": "", "quantity": 12.0}, {"food": "parmesan cheese", "quantity": 1}], "title": "\nRagu-Stuffed Peppers\n"}, {"directions": "\n\n              Heat the olive oil in a medium saucepan over medium heat; add the garlic and shallots and cook, stirring frequently, until fragrant, about 2 minutes. Add 2/3 cup water, the bell peppers, oregano, 1 teaspoon salt and pepper to taste, bring to a boil over high heat and cook until the peppers just begin to soften, 2 to 3 minutes. Stir in the couscous, immediately cover and remove from the heat. Let stand, covered, until the liquid is absorbed and the couscous is tender, about 7 minutes. \n            \n\n              Transfer to a platter or large bowl and serve with lemon wedges for squeezing.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.5}, {"food": "barley flour or meal", "quantity": 3.0}, {"food": "", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "couscous", "quantity": 0.6666666666666666}, {"food": "", "quantity": 1}], "title": "\nRainbow Bell Pepper Couscous\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Coat a 9-inch square (2 1/4-inch-deep) cake pan with cooking spray. Prepare 1 cake mix as directed, beating in 1/2 teaspoon almond extract. Tint pink with gel food coloring. Transfer to the pan; bake about 35 minutes. Let cool.\n            \n\n              Repeat to make a yellow and a green cake. (Bake both cakes at the same time if you have 2 pans.)\n            \n\n              Trim the tops of each cake with a long serrated knife to make level.\n            \n\n              Put the pink cake, trimmed-side up, on an inverted baking sheet. Spread with 1/2 cup jam.\n            \n\n              Top with the yellow cake, trimmed-side up; spread with the remaining 1/2 cup jam, then top with the green cake, trimmed-side down. Freeze the stack 1 hour.\n            \n\n              Microwave the chocolate and butter together in a microwave-safe bowl in 30-second intervals, stirring, until melted and smooth. Let cool slightly.\n            \n\n              Using an offset spatula, spread the chocolate mixture in a thick layer on top of the cake.\n            \n\n              Use the tines of a fork to create wavy lines in the chocolate. Return to the freezer until the chocolate is set but not hard, about 15 minutes.\n            \n\n              Trim all four sides of the cake with a long serrated knife. Transfer to a platter.\n            \n\n              Photograph by Ralph Smith\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "shortening cake mix", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 1.5}, {"food": "yellow rice", "quantity": 1}, {"food": "silk raspberry soy yogurt", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "butter oil", "quantity": 6.0}], "title": "\nRainbow Cookie Cake\n"}, {"directions": "\n\n              Position racks in the upper and lower thirds of the oven; preheat to 350 degrees F. Coat three 9-by-13-inch baking pans with cooking spray, line the bottoms with parchment paper and coat with more cooking spray.\n            \n\n              Beat the almond paste, butter, sugar and salt in a large bowl with a mixer on high speed\n            \n\n              until fluffy, about 3 minutes. Reduce the mixer speed to medium; beat in the egg yolks, vanilla and lemon zest, then reduce the mixer speed to low and mix in the flour (the batter will be thick).\n            \n\n              Beat the egg whites in a separate large bowl with a mixer on low speed; increase the speed to high and beat until stiff peaks form. Fold the egg whites into the batter in three batches. Divide the batter evenly among 3 bowls. Mix the red food coloring into one and the green into another, leaving the third plain. Pour one color batter into each pan; spread into a thin layer with an offset spatula.\n            \n\n              Bake, switching the pans halfway through, until just firm, 14 to 16 minutes. Transfer to racks and let cool completely in the pans.\n            \n\n              Remove the green layer to a cutting board; discard the parchment. Top with 1/2 cup jam, the plain layer, the remaining 1/2 cup jam and the red layer. Wrap the stack in plastic wrap. Top with a baking sheet and place a few heavy cans on top. Refrigerate at least 4 hours or overnight.\n            \n\n              Make the glaze: Microwave the chocolate, stirring every 30 seconds, until smooth. Unwrap the stack and spread the chocolate on top using an offset spatula. Refrigerate until set, about 10 minutes. Cut into small squares.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "almond paste", "quantity": 8.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "sugar", "quantity": 1.0}, {"food": "salt", "quantity": 0.25}, {"food": "eggs", "quantity": 4.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "", "quantity": 12.0}, {"food": "silk raspberry soy yogurt", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 4.0}], "title": "\nRainbow Cookies\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Make the cupcakes: Preheat the oven to 325 degrees F. Line a 12-cup muffin pan with white paper liners. Whisk the flour, baking powder, baking soda and salt in a medium bowl; set aside. Stir together the milk, lemon juice and vanilla in a small bowl; set aside (the milk will curdle). Beat the butter, 3/4 cup sugar and the lemon zest in a large bowl with a mixer on medium-high speed until light and fluffy, about 5 minutes. Reduce the mixer speed to low. Beat in the flour mixture in three batches, alternating with the milk mixture in two batches, until combined. Increase the mixer speed to medium and beat briefly until smooth.\n            \n\n              Beat the egg whites in a large bowl with a mixer on high speed until foamy. Gradually beat in the remaining 1/4 cup sugar; continue beating until stiff glossy peaks form, about 3 minutes. Using a rubber spatula, fold the beaten egg whites into the batter in two batches. Divide the batter evenly among 6 small bowls; tint each with 1 to 3 drops gel food coloring, stirring to distribute the color.\n            \n\n              Divide the purple batter evenly among the prepared muffin cups (about 1 1/2 teaspoons per cup) and gently spread to cover the bottom; layer the blue, green, yellow, orange and red batters on top, gently spreading each color but making sure not to swirl the colors together. (The liners will be full.) Bake until the tops of the cupcakes spring back when gently pressed, about 20 minutes. Let cool 5 minutes in the pan, then transfer to a rack to cool completely.\n            \n\n              Meanwhile, make the frosting: Whisk the sugar, egg whites, water, vanilla, cream of tartar and salt in a large metal bowl set over a saucepan of simmering water until combined (do not let the bowl touch the water). With the bowl still over the simmering water, beat the mixture with a hand mixer on medium-high speed until stiff glossy peaks form, 5 to 7 minutes. Remove the bowl from the saucepan and let cool 5 minutes. Transfer the frosting to a piping bag fitted with a large round tip. Generously pipe onto the cupcakes.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.75}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 0.5}, {"food": "whole milk", "quantity": 0.6666666666666666}, {"food": "grape juice", "quantity": 1.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "butter oil", "quantity": 1.5}, {"food": "sugar", "quantity": 1.0}, {"food": "egg substitute", "quantity": 3.0}, {"food": "orange", "quantity": 1}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "egg substitute", "quantity": 2.0}, {"food": "coconut water", "quantity": 0.25}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "hearts of palm", "quantity": 1}], "title": "\nRainbow Cupcakes\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              For yellow/classic deviled eggs: Put the eggs in a large saucepan in one layer with cold water to cover by 1 inch. Bring to a simmer and reduce heat to low. Cook at a bare simmer for 10 minutes, then immediately run under cold water to stop the cooking. When cool, peel the eggs and halve them lengthwise.\n            \n\n              Put the egg yolks in a bowl with the mayonnaise, pickle brine, mustard, sugar, hot sauce and 1/4 teaspoon salt. Mash with a fork until smooth. You should have a heaping cup of egg mixture; divide it into 6 portions.\n            \n\n              For yellow eggs: Stuff 4 egg whites with 1 portion of the yolk mixture and set aside.\n            \n\n              For red eggs: Mash 1 portion of the yolk mixture with the paprika and stuff into 4 egg whites. Coat the filling with the chopped red pepper.\n            \n\n              For orange eggs: Cook the baby carrots and saffron in a small saucepan with water to cover until tender. Drain, reserving the water, cool the carrots and chop. Fish the saffron threads from the water and add them along with the carrots to 1 portion of the yolk mixture. Mash well and stuff into 4 egg whites. Coat the filling with the shredded carrots.\n            \n\n              For green eggs: Mash 1 portion of the yolk mixture with the avocado, parsley and lime juice and stuff into 4 egg whites. Coat the filling with more parsley.\n            \n\n              For blue eggs: Stuff 4 egg whites with 1 portion of the yolk mixture. Coat the filling with the crushed chips.\n            \n\n              For purple eggs: Finely chop about 1 tablespoon of the cooked beet and mash with the remaining portion of the egg yolk mixture. Stuff the filling into the 4 remaining egg whites. Slice the remaining beet and use to top the eggs.\n            \n", "ingredients": [{"food": "eggs", "quantity": 12.0}, {"food": "mayonnaise dressing", "quantity": 0.3333333333333333}, {"food": "pickle loaf", "quantity": 1.0}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "sugar", "quantity": 0.5}, {"food": "Worcestershire sauce", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "paprika", "quantity": 0.5}, {"food": "diced chicken", "quantity": 1}, {"food": "carrots", "quantity": 3.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "avocado", "quantity": 0.25}, {"food": "parsley", "quantity": 1.0}, {"food": "lime juice", "quantity": 1}, {"food": "potato chips", "quantity": 1}, {"food": "silk very vanilla", "quantity": 1.0}], "title": "\nRainbow Deviled Eggs\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Line six or seven shot glasses on a work surface or a big bowl of crushed ice (if making a snow cone). This can get messy.\n            \n\n              Add the grenadine to a cocktail shaker. Add enough crushed ice to the ice until the shaker is three-quarters full. Slowly pour the pineapple juice over the back of a spoon or ice scoop into the shaker. Then add the gin and a splash of curacao. This will create layers. Strain the liquid into the shot glasses. If making ice cones, pour over the crushed ice, making sure there is enough space for all of the colors.\n            \n", "ingredients": [{"food": "", "quantity": 0.5}, {"food": "ice cream swich", "quantity": 1}, {"food": "fruit juice smoothie", "quantity": 5.0}, {"food": "barley flour or meal", "quantity": 2.0}, {"food": "", "quantity": 1}], "title": "\nRainbow Shots or Snow Cones\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              For the banana-avocado smoothie base: Put the almond milk, flax seeds, honey, banana and avocado in a blender. Blend on high until the mixture is mostly smooth, about 1 minute. Add the ice cubes and blend until completely smooth.\n            \n\n              To make it pink, yellow, green or purple: Add the color additions and blend again until completely smooth.\n            \n", "ingredients": [{"food": "milk", "quantity": 0.6666666666666666}, {"food": "seeds", "quantity": 1.0}, {"food": "honey smoked ham", "quantity": 1.0}, {"food": "banana", "quantity": 1.0}, {"food": "avocado", "quantity": 0.5}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "strawberries", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "turmeric", "quantity": 0.5}, {"food": "grapes", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "diced chicken", "quantity": 0.5}, {"food": "blueberries", "quantity": 1.5}], "title": "\nRainbow Smoothie\n"}, {"directions": "\n\n              Soak three 3-ounce packages ramen noodles in hot water, 5 minutes. Drain; pat dry. Toss with 1 tablespoon sesame oil and 1 teaspoon salt. Heat 3 tablespoons peanut oil in a nonstick skillet over medium-high heat. Spread the noodles in the pan and cook 6 to 8 minutes per side. Drain on paper towels. Top with scallions and/or cilantro.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nRamen Cake\n"}, {"directions": "\n\n              Make the dipping sauce: Whisk the pineapple preserves and teriyaki sauce in a bowl.\n            \n\n              Make the chicken fingers: Combine the egg white and the flavor packet from one ramen package in a large bowl (discard the remaining flavor packet). Add the chicken and toss to coat.\n            \n\n              Pulse the ramen noodles in a food processor to make fine crumbs. Transfer the crumbs to a baking sheet and stir in the sesame seeds.\n            \n\n              Heat 1/2 inch of vegetable oil in a large skillet or heavy-bottomed pot until hot but not smoking. Remove the chicken from the egg white mixture, shaking off any excess, and coat with the ramen crumbs, pressing firmly to adhere. Fry the chicken in batches, adjusting the heat if necessary, until golden brown and cooked through, about 2 minutes per side. Transfer to a rack set over a baking sheet to drain. Serve with the dipping sauce.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "pineapple chunks", "quantity": 0.5}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "diced chicken", "quantity": 1}, {"food": "egg substitute", "quantity": 1.0}, {"food": "pineapple chunks", "quantity": 2.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "sesame seeds", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1}], "title": "\nRamen Chicken Fingers\n"}, {"directions": "\n\n              Heat 3 tablespoons vegetable oil in a large skillet over medium heat. Add the garlic, onion and ginger and cook, stirring occasionally, until the onion is dark brown, about 30 minutes.\n            \n\n              Meanwhile, make the broth: Put the bacon and chicken wings in a Dutch oven and add enough water to cover. Bring to a boil, then reduce the heat to medium and simmer 10 minutes. Drain and wipe the pot clean. Rinse the bacon and wings under cold water, then return to the pot; add 4 quarts water and the dried mushrooms. Bring to a boil, then reduce the heat to medium; add the garlic mixture and gently simmer 1 hour, 15 minutes.\n            \n\n              Strain the broth through a colander into a large bowl, pressing on the solids to extract as much of the liquid as possible. Skim any excess fat from the surface. Measure the broth, adding water if necessary to yield 2 quarts. (The broth can be made up to 4 days ahead; cover and refrigerate.)\n            \n\n              Just before serving, heat the remaining 1 tablespoon vegetable oil and the scallions in a medium skillet over medium heat until the mixture starts sizzling. Add the sake, soy sauce, 1 1/2 teaspoons salt, the sugar, peppercorns and 1/2 cup water. Simmer, reducing to 1/2 cup, about 5 minutes.\n            \n\n              Bring the broth and the scallion mixture to a simmer in a large saucepan over medium heat. Add the noodles and cook until softened, 1 to 3 minutes. Gently pull the noodles apart with tongs. Transfer the soup to bowls and top as desired.\n            \n\n              Toppings Bar\n            \n\n              Take your pick: These taste great in just about any combination.\n            \n\n              Shredded rotisserie chicken\n            \n\n              Sauteed mushrooms\n            \n\n              Nori strips (seaweed)\n            \n\n              Shredded kale\n            \n\n              Cubed firm tofu\n            \n\n              Snow peas\n            \n\n              Toasted sesame seeds\n            \n\n              Sliced radishes\n            \n\n              Sliced scallions\n            \n\n              Bean sprouts\n            \n\n              Kimchi\n            \n\n              Watercress\n            \n\n              Sliced jalapeno\n            \n\n              Pickled ginger\n            \n\n              Wasabi paste\n            \n\n              Fried egg\n            \n\n              Sesame oil\n            \n\n              Sriracha\n            \n\n              Roasted squash: Toss cubed butternut or kabocha squash (no need to peel) with olive oil and sprinkle with salt, sugar and red pepper flakes. Roast at 425 degrees F, 30 minutes.\n            \n\n              Sauteed shrimp: Stir-fry peeled deveined shrimp in hot olive oil with minced ginger, chopped scallions and a pinch each of sugar, salt and pepper.\n            \n\n              Roasted pork belly:  Put 1 cup each sake and water, 1/2 cup each soy sauce and mirin, and 1/4 cup sugar in a Dutch oven. Add 2 pounds skinless pork belly, 1 quartered onion, 1/2 head garlic and 4 thin slices ginger. Cover with foil. Roast at 325 degrees F,3 hours; slice.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.25}, {"food": "garlic powder", "quantity": 8.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "luncheon slices", "quantity": 8.0}, {"food": "bacon", "quantity": 1.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "mushrooms", "quantity": 12.0}, {"food": "silk light vanilla", "quantity": 12.0}, {"food": "barley flour or meal", "quantity": 0.25}, {"food": "soy sauce", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "sugar", "quantity": 1.0}, {"food": "martha white foods", "quantity": 1.0}, {"food": "barley flour or meal", "quantity": 8.0}, {"food": "", "quantity": 1}], "title": "\nRamen Noodle Soup\n"}, {"directions": "\n\n              Bring a small pot of water to a boil over high heat; prepare a bowl of ice water. Gently add the 2 whole eggs (in their shells) to the boiling water and cook for 8 minutes. Drain and transfer to the bowl of ice water immediately. When cool enough to handle, peel, slice and set aside.\n            \n\n              Fill the same small pot with water and bring to a boil over high heat. Add the bacon and boil until some of the fat has rendered, about 4 minutes. Drain and set aside.\n            \n\n              Preheat the oven to 350 degrees F. \n            \n\n              Bring another small pot of water to a boil over high heat. Add the ramen noodles and cook for 30 seconds. Immediately drain the ramen and combine with the beaten egg in a medium bowl. \n            \n\n              Brush the inside of large cast-iron skillet all over with the oil. Mound the ramen in the center of the skillet. Place a smaller skillet, around 6 inches in diameter, on top of the mound and press down firmly. Let sit for 5 minutes. Remove the smaller skillet and transfer the cast-iron skillet with the ramen onto a burner over medium heat. Cook, shaking the skillet occasionally to avoid sticking, until the ramen bottom is golden and crispy, about 5 minutes.  \n            \n\n              Flip the ramen with a spatula. Remove the skillet from the heat and top the ramen with the mayonnaise, tonkatsu sauce and hot sauce. Top the sauces with the cabbage, radish, bean sprouts and scallions. \n            \n\n              Bake until the toppings are warmed through, about 5 minutes. Transfer the pizza out of the cast-iron skillet onto a cutting board. Top with the seaweed snacks, togarashi, soft-boiled eggs, pickled ginger, bacon and finger chile. Cut into wedges and serve immediately. \n            \n", "ingredients": [{"food": "", "quantity": 3.0}, {"food": "bacon", "quantity": 3.0}, {"food": "noodles", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "mayonnaise dressing", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "swamp cabbage", "quantity": 0.3333333333333333}, {"food": "radish seeds", "quantity": 0.25}, {"food": "brussels sprouts", "quantity": 0.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "seaweed", "quantity": 0.25}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "ginger", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1.0}], "title": "\nRamen Pizza\n"}, {"directions": "\n\n              Position a rack in the upper third of the oven; preheat to 450 degrees F. Brush a baking sheet with vegetable oil. Drop the garlic, ginger and scallions through the feed tube of a food processor with the motor running and pulse until chopped; transfer half of the mixture to a pot. Add the panko, 1 tablespoon soy sauce, 1/2 teaspoon sugar and the egg to the processor; pulse to combine. Add the pork; pulse until just combined. Form into 20 small balls and arrange on the prepared baking sheet. Bake until firm, 8 to 10 minutes.\n            \n\n              Meanwhile, add 2 tablespoons vegetable oil to the pot with the garlic mixture. Cook over medium-high heat, stirring, 2 minutes. Add the tomatoes, the remaining 2 tablespoons soy sauce and 1/2 teaspoon sugar. Cook, stirring, until thickened, 5 minutes. Stir in 1 1/2 cups water. Add the meatballs and reduce the heat to medium low; simmer until cooked through, 8 to 10 more minutes.\n            \n\n              Soak the ramen in hot water until soft, 4 to 5 minutes; drain. Add to the pot and toss to coat. Divide among bowls.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "ginger", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 1.25}, {"food": "soy sauce", "quantity": 3.0}, {"food": "sugar", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "pork skins", "quantity": 0.5}, {"food": "tomatoes", "quantity": 1.0}, {"food": "noodles", "quantity": 3.0}], "title": "\nRamen with Pork Meatballs\n"}, {"directions": "\n\n              1. Combine sugar and 1 cup water in a small saucepan. Bring to a boil until sugar dissolves. Remove this simple syrup from heat and cool completely. Stir gin, lemon juice, lime juice, simple syrup, and orange blossom water together in a large pitcher. Refrigerate until chilled.\n            \n\n              2. Pour 4 ounces of gin mixture, 1 cup of ice, and a splash of light cream into a cocktail shaker. Shake vigorously until frothy, about 30 seconds. Strain into a highball glass. Top with club soda and garnish with citrus slices.\n            \n", "ingredients": [{"food": "sugar", "quantity": 1.0}, {"food": "coconut water", "quantity": 1.0}, {"food": "", "quantity": 4.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "lime juice", "quantity": 1.0}, {"food": "coconut water", "quantity": 4.0}, {"food": "light ice cream", "quantity": 1.0}, {"food": "", "quantity": 4.0}, {"food": "", "quantity": 1}, {"food": "lime", "quantity": 0.25}], "title": "\nRamos Gin Fizz\n"}, {"directions": "\n\n              Cook the bacon in a medium skillet over medium heat, stirring, until crisp, about 8 minutes. Transfer to a paper towel-lined plate using a slotted spoon.\n            \n\n              Whisk the sour cream, mayonnaise and buttermilk in a large bowl. Add the scallions, dill, 1/2 teaspoon salt and a few grinds of pepper; whisk to combine. Add the chicken and half each of the bacon and tomatoes; toss to coat. Add the avocado and gently toss.\n            \n\n              Serve the chicken salad in the lettuce leaves; top with the remaining bacon and tomatoes. Serve with the dinner rolls.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [{"food": "bacon", "quantity": 8.0}, {"food": "sour cream", "quantity": 0.25}, {"food": "mayonnaise dressing", "quantity": 0.25}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 2.0}, {"food": "", "quantity": 3.0}, {"food": "dill seed", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 3.0}, {"food": "barley flour or meal", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "pizza rolls", "quantity": 4.0}], "title": "\nRanch Chicken Salad Cups\n"}, {"directions": "\n\n              Preheat a grill or grill pan to medium high. Combine 1/4 cup buttermilk, the hot sauce, 1/2 teaspoon salt, and pepper to taste in a large bowl. Add the chicken and turn to coat; let stand 10 minutes.\n            \n\n              Meanwhile, make the ranch sauce: Mince the garlic with 1/4 teaspoon salt on a cutting board; mash with the flat side of a chef's knife to make a paste. Combine the garlic paste, mayonnaise, vinegar, the remaining 2 tablespoons buttermilk and the chives in a small bowl. Season with salt and pepper.\n            \n\n              Transfer the chicken to the grill, letting the excess marinade drip off. Grill until marked on the bottom, 3 to 4 minutes, then flip the chicken, top each piece with a slice of cheese and continue grilling until just cooked through, 2 to 4 more minutes.\n            \n\n              Spread each roll with some of the ranch sauce and fill with the chicken, lettuce and tomato. Serve with potato chips.\n            \n", "ingredients": [{"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.25}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 4.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "mayonnaise dressing", "quantity": 0.3333333333333333}, {"food": "vinegar", "quantity": 2.0}, {"food": "barley flour or meal", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "onion powder", "quantity": 4.0}, {"food": "chrysanthemum leaves", "quantity": 1}, {"food": "potato chips", "quantity": 1}], "title": "\nRanch Chicken Sandwiches\n"}, {"directions": "\n\n              Put the eggs in a saucepan and cover with cold water by 1 inch. Bring to a boil; reduce the heat to low and simmer 10 minutes.\n            \n\n              Drain the eggs and transfer to a bowl of ice water to cool; peel and halve lengthwise. Scoop out the yolks and transfer to a bowl.\n            \n\n              Add the mayonnaise, sour cream, horseradish, mustard, 1/4 teaspoon salt and a few grinds of pepper; mash until smooth. Stir in the diced cucumber and the parsley, chives and dill. Spoon the filling into the egg whites; top each with a cucumber wedge. Refrigerate 30 minutes to 1 hour.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "eggs", "quantity": 6.0}, {"food": "mayonnaise dressing", "quantity": 2.0}, {"food": "sour cream", "quantity": 2.0}, {"food": "horseradish", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 0.25}, {"food": "parsley", "quantity": 2.0}, {"food": "chives", "quantity": 1.0}, {"food": "dill seed", "quantity": 1.0}], "title": "\nRanch Deviled Eggs \n"}, {"directions": "\n\n              Mash the garlic and salt to a paste with the side of a chef's knife. In a medium bowl, whisk together the garlic, mayonnaise, buttermilk, parsley, scallion, orange zest and pepper, to taste. Use immediately or store covered, in the refrigerator, for up to 3 days.\n            \n", "ingredients": [{"food": "garlic powder", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "mayonnaise dressing", "quantity": 1.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.5}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "martha white foods", "quantity": 1.0}, {"food": "orange", "quantity": 0.75}, {"food": "black bean mango", "quantity": 1}, {"food": "carrots", "quantity": 2.0}], "title": "\nRanch Dip and Baby Carrots\n"}, {"directions": "\n\n              Mash the garlic and salt to a paste with the side of a chef's knife. In a medium bowl, whisk together the garlic, mayonnaise, 1/4 cup buttermilk, parsley, chives, scallion, vinegar and pepper to taste. If the sauce is very thick, thin the dressing with a couple tablespoons more of the buttermilk. Use immediately or store covered, in the refrigerator, for up to 3 days.\n            \n", "ingredients": [{"food": "garlic powder", "quantity": 2.0}, {"food": "salt", "quantity": 0.5}, {"food": "barley flour or meal", "quantity": 1.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.5833333333333333}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "chives", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nRanch Dressing\n"}, {"directions": "\n\n              Whisk the sour cream, buttermilk, garlic, onion powder and sugar in a large bowl until smooth; season with 3/4 teaspoon salt and 1/4 teaspoon pepper.\n            \n\n              Halve the avocados and discard the pits; scoop the avocados into the bowl with the dressing and mash. Stir in the tomatoes, onion, chives and parsley and season with salt and pepper. Serve with chips.\n            \n\n              You can make this guacamole 4 to 6 hours ahead; lightly cover and refrigerate. The sour cream and buttermilk will help prevent discoloration.\n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [{"food": "sour cream", "quantity": 0.6666666666666666}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.5}, {"food": "garlic powder", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "sugar", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "avocados", "quantity": 4.0}, {"food": "barley flour or meal", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.75}, {"food": "chives", "quantity": 0.25}, {"food": "parsley", "quantity": 2.0}, {"food": "potato chips", "quantity": 1}], "title": "\nRanch Guacamole\n"}, {"directions": "\nSpecial equipment: a 1-ounce ice cream scoop, optional, and a deep-frying thermometer\n\n              Put the milk and macaroni in a small saucepan and bring the milk to a boil over medium heat, stirring frequently to keep the macaroni from clumping. Simmer until the macaroni is tender and the milk has thickened to the consistency of heavy cream, 3 to 4 minutes. Remove the saucepan from the heat, add the Monterrey Jack, mozzarella, cream cheese, butter, 1 packet of the ranch seasoning (8 teaspoons) and 1 1/2 teaspoons salt and stir until smooth, thick and creamy. Transfer the mixture to a shallow bowl and cool to room temperature to stiffen up.\n            \n\n              Meanwhile, put the flour, eggs and breadcrumbs into 3 separate shallow dishes and season each with salt and pepper.\n            \n\n              Using a 1-ounce ice cream scoop or 2 tablespoons, scoop out balls of the cooled macaroni mixture and put them on a baking sheet. Roll each ball in your hand until smooth, then dredge in the flour, dip in the eggs to coat and roll in the breadcrumbs until completely covered. Put the balls back on the baking sheet and refrigerate until chilled, at least 1 hour.\n            \n\n              Pour enough oil into a large heavy pot to come 2 inches up the side and attach a deep-frying thermometer to the pot. Heat the oil over medium heat to 360 degrees F.\n            \n\n              Working in batches, fry the balls until golden brown on the outside and heated through inside, about 6 minutes. Using a slotted spoon, lift the balls from the oil and transfer to a paper towel-lined plate.\n            \n\n              Stir together the mayonnaise, buttermilk and remaining packet ranch seasoning in a small bowl until smooth. Transfer the mac 'n' cheese balls to a serving platter, drizzle with some of the dressing and serve with the remaining dressing on the side for dipping.\n            \n", "ingredients": [{"food": "whole milk", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 6.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "", "quantity": 2.6666666666666665}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "", "quantity": 1.3333333333333333}, {"food": "black bean mango", "quantity": 1}, {"food": "potato flour", "quantity": 0.5}, {"food": "eggs", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "mayonnaise dressing", "quantity": 0.5}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.25}], "title": "\nRanch Mac and Cheese Balls\n"}, {"directions": "\n\n              Toss 2 cups cubed raisin-walnut bread with 2 tablespoons melted butter. Bake at 400 degrees F until crisp, 12 to 15 minutes. Puree 1/4 cup each mayonnaise, sour cream, buttermilk, sliced scallions, chopped dill and chopped mint, and 1/4 teaspoon kosher salt in a blender. Toss 2 chopped romaine hearts with the dressing, 1/2 cup candied pecans and the croutons. Season with salt and pepper.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [], "title": "\nRanch Salad with Candied Pecans\n"}, {"directions": "\nSpecial equipment: 2 wire racks 2 rimmed baking sheets\n\n              For the ranch seasoning: Mix together the parsley and/or dill, chives, garlic powder, onion powder, 2 teaspoons salt and 1/4 teaspoon pepper in a small bowl. Set aside.\n            \n\n              For the zucchini fries: Adjust 2 oven racks to the top and bottom thirds of the oven and preheat oven to 425 degrees F. Put the wire racks in the baking sheets and coat each generously with cooking spray.\n            \n\n              Combine the flour with half of the ranch seasoning in a large re-sealable plastic bag. Put the eggs in another large plastic bag; put the breadcrumbs in a third large plastic bag.\n            \n\n              Add about a half of the zucchini rounds to the flour, and use a combination of your hands and shaking the bag to coat the zucchini. Remove the zucchini and shake off any excess flour. Transfer to the egg wash and repeat until coated. (It's less messy if you use only one hand for the dry ingredients and the other for the wet.) Let any excess egg drip off before transferring to the breadcrumb mixture; repeat until fully coated (you'll still see some green and white of the zucchini peeking through the breading). Transfer to the prepared baking sheets and coat the breaded zucchini generously with cooking spray (there's no need to turn them). Repeat with the remaining zucchini.\n            \n\n              Bake, rotating the baking sheets from top to bottom about halfway through, until golden brown and tender, 25 to 30 minutes.\n            \n\n              Make the ranch dressing: Whisk together the remaining ranch seasoning with the buttermilk, mayonnaise and vinegar. Serve with the Ranch Fries.\n            \n", "ingredients": [{"food": "dill seed", "quantity": 0.25}, {"food": "chives", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "onion powder", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 0.5}, {"food": "eggs", "quantity": 2.0}, {"food": "silk plain soy yogurt", "quantity": 2.5}, {"food": "", "quantity": 1.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.5}, {"food": "mayonnaise dressing", "quantity": 2.0}, {"food": "vinegar", "quantity": 1.0}], "title": "\nRanch Zucchini Fries\n"}, {"directions": "\n\n              Combine the onion powder, garlic powder, dried dill, 1 teaspoon salt and 1/2 teaspoon pepper in a small bowl. Put the wings in a large bowl and toss with 1 1/2 cups buttermilk, the onion slices and 1 teaspoon of the spice mix; cover and refrigerate 2 hours. Drain well, discarding the onion.\n            \n\n              Preheat the oven to 425 degrees F. Brush a rimmed baking sheet with vegetable oil. Toss the wings with all but 1 teaspoon of the remaining spice mix and spread on the baking sheet. Roast until browned and crisp, about 45 minutes.\n            \n\n              Meanwhile, make the ranch-chipotle sauce: Combine the mayonnaise, the remaining 2 tablespoons buttermilk, the vinegar, sugar, hot sauce and chives in a bowl. Add the reserved 1 teaspoon spice mix and season with salt. Cover and refrigerate until ready to serve.\n            \n\n              Transfer the wings to a platter and serve with the sauce.\n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [{"food": "mayonnaise dressing", "quantity": 0.5}, {"food": "vinegar", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "chives", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "dill seed", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 3.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 1.5}, {"food": "onion rings", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1}], "title": "\nRanch-Chipotle Chicken Wings\n"}, {"directions": "\n\n              Puree the raspberries, juice and sugar in a food processor until smooth. Pour through a mesh strainer into a bowl and discard the raspberry seeds. Stir in the buttermilk, cream and a pinch of salt, then cover and refrigerate until cold, about 1 hour.\n            \n\n              Transfer the mixture to an ice cream maker and freeze according to the manufacturer's instructions. Transfer to an airtight container and freeze until firm, at least 2 hours. Serve sprinkled with pepper.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "", "quantity": 6.0}, {"food": "apple juice", "quantity": 0.25}, {"food": "sugar", "quantity": 1.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 1.5}, {"food": "ice cream swich", "quantity": 0.25}, {"food": "pepper", "quantity": 1}], "title": "\nRaspberry Buttermilk Sherbet\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F. Put the berries in the bottom of a 10-inch stainless steel skillet. Use a fork to beat the egg and 1/4 cup water in a small bowl until combined. Put the flour and sugar in the bowl of a food processor and pulse until the mixture is uniform. Drop in the butter cubes, toss with a fork to coat in the flour mixture and pulse until the mixture is crumbly and moist, about 8 long pulses. Add half of the egg mixture and process about 15 seconds. Add the rest and process another 15 seconds. \n            \n\n              Dollop the batter over the berries. Spread the batter with the back of a spoon--some berries will poke through, which is fine. Bake until the berries are bubbling and a wooden skewer inserted into the center of the cake comes out with a few crumbs attached, about 30 minutes. Cool slightly and serve. \n            \n", "ingredients": [{"food": "butter oil", "quantity": 6.0}, {"food": "", "quantity": 3.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "potato flour", "quantity": 0.75}, {"food": "sugar", "quantity": 0.5}], "title": "\nRaspberry Cloud Cake\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Position a rack in the center of the oven and preheat to 300°F. Place four 9-ounce ramekins in a roasting pan. Bring a large pot of water to a boil and keep hot until ready to use.\n            \n\n              Set aside 12 of the raspberries and cook the rest with 1/2 cup of the sugar in a small saucepan over medium-high heat until the sugar has dissolved, the berries have broken down completely and the mixture starts to thicken, about 10 minutes. Let cool completely.\n            \n\n              Put the cream, half-and-half and salt in a medium saucepan. Split the vanilla bean in half lengthwise, scrape out the seeds with the back of a paring knife and add them, along with the bean, to the cream mixture. Bring the mixture to a boil over medium-high heat; immediately remove from the heat, cover and set aside.\n            \n\n              Combine the egg yolks with the remaining 1/2 cup of sugar in a large bowl and whisk until the mixture is pale yellow and thick. Whisking constantly, slowly pour in the hot cream mixture until well combined. Pour the custard through a fine-mesh strainer into a clean medium bowl and discard the vanilla bean.\n            \n\n              Spoon 2 tablespoons of the raspberry coulis into each ramekin and spread to cover the bottom. Carefully ladle the custard into the ramekins, dividing evenly, and place the roasting pan in the oven. Carefully pour the hot water into the roasting pan until it reaches about 2/3 of the way up each ramekin. Bake until the custard is just set and still slightly jiggles, about 55 minutes. Immediately transfer the ramekins to a rack to cool to room temperature, then chill, uncovered, for 3 hours up to 2 days.\n            \n\n              Just before serving, place the ramekins on a rimmed baking sheet and sprinkle sugar (about 1 tablespoon) over the top of each custard, tilting to spread evenly. Wipe off the ramekins with a moist paper towel. Using a torch, carefully caramelize the sugar until it is melted and a deep golden color. Once the sugar has hardened, garnish each custard with 3 of the reserved raspberries and serve.\n            \n", "ingredients": [{"food": "raspberries", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "egg substitute", "quantity": 8.0}], "title": "\nRaspberry Creme Brulee\n"}, {"directions": "\n\n              Make the filling: Beat the cream cheese and sugar in a large bowl with a mixer on medium-high speed until smooth and fluffy, about3 minutes. Add 1 egg and beat until incorporated; set aside. Butter 2 baking sheets. Lay out a large piece of parchment paper and dust with flour. Cut the dough in half. Place 1 piece on the parchment and roll into a 16-by-6-inch rectangle. Sprinkle with 1 tablespoon breadcrumbs, then spread half of the cream cheese filling over the dough, leaving a 1-inch border on all sides. Sprinkle 1/2 cup raspberries lengthwise down the middle. Use the parchment to lift the dough and roll it around the filling into a 16-inch log. Transfer the log to one of the prepared baking sheets, seam-side down, and form into a wreath, pinching the ends together to seal. Repeat to form a second wreath. Cover the wreaths loosely with buttered plastic wrap and let rise in a warm place until doubled in size, about 1 hour, 30 minutes. Position racks in the upper and lower thirds of the oven; preheat to 350 degrees F. Uncover the wreaths. Use kitchen shears to cut long vents crosswise into the tops of the wreaths at 1-inch intervals, using your fingers to gently separate the dough at each cut. Beat the remaining egg with 1 tablespoon water in a small bowl; brush the tops of the wreaths with the egg wash. Transfer to the oven and bake until golden brown, 30 to 35 minutes, switching the position of the baking sheets halfway through. Let cool to room temperature on the baking sheets. Dust with confectioners' sugar before serving. \n            \n\nBasic Sweet-Roll Dough\n\n\n              Warm 1/2 cup water and the milk in a saucepan over low heat until a thermometer registers 100 degrees F to 110 degrees F. Remove from the heat and sprinkle the yeast on top, then sprinkle with a pinch of the sugar; set aside, undisturbed, until foamy, about 5 minutes.\n            \n\n              Whisk the melted butter, egg yolk and vanilla into the yeast mixture until combined. In a large bowl, whisk the flour, the remaining sugar, the salt and nutmeg. Make a well in the center, then add the yeast mixture and stir with a wooden spoon to make a thick and slightly sticky dough. Turn out onto a floured surface and knead until soft and elastic, about 6 minutes. Shape into a ball.\n            \n\n              Brush a large bowl with butter. Add the dough, turning to coat lightly with the butter. Cover with plastic wrap and let rise at room temperature until the dough is doubled in size, about 1 hour, 15 minutes.\n            \n\n              Turn the dough out of the bowl and knead briefly to release excess air; re-form into a ball and return to the bowl. Lightly butter a large piece of plastic wrap and lay it directly on the surface of the dough. Cover the bowl tightly with plastic wrap and refrigerate at least 4 hours or overnight.\n            \n\n              Photograph by Johnny Miller\n            \n", "ingredients": [{"food": "macaroni cheese", "quantity": 8.0}, {"food": "sugar", "quantity": 0.5}, {"food": "eggs", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1}, {"food": "potato flour", "quantity": 1}, {"food": "nutmeg", "quantity": 1.0}, {"food": "", "quantity": 2.0}, {"food": "raspberries", "quantity": 1.0}, {"food": "sugar", "quantity": 1}, {"food": "whole milk", "quantity": 0.5}, {"food": "", "quantity": 1.25}, {"food": "sugar", "quantity": 0.25}, {"food": "butter oil", "quantity": 4.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.5}, {"food": "potato flour", "quantity": 2.75}, {"food": "salt", "quantity": 0.75}, {"food": "nutmeg", "quantity": 0.5}], "title": "\nRaspberry Danish Wreaths\n"}, {"directions": "\n\n              Mash the raspberries with the mint and sugar in a large bowl, using a potato masher or muddler, until the raspberries break down into very small pieces. Add the rum, lime juice and Lillet and stir to combine. Cover and refrigerate 1 to 4 hours. \n            \n\n              Strain the mixture into a large pitcher with ice. Add some raspberries and mint for garnish and top off with the seltzer. Serve immediately.\n            \n", "ingredients": [{"food": "raspberries", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "sugar", "quantity": 1.0}, {"food": "martha white foods", "quantity": 0.75}, {"food": "lime juice", "quantity": 1.0}, {"food": "", "quantity": 750.0}, {"food": "", "quantity": 1}, {"food": "", "quantity": 1.0}], "title": "\nRaspberry Lime Punch\n"}, {"directions": "\n\n              Pour 1 teaspoon raspberry liqueur into 8 champagne flutes. Add a raspberry to each and muddle with the handle of a wooden spoon. Fill the glasses halfway with orange juice and then finish with champagne.\n            \n", "ingredients": [{"food": "silk raspberry soy yogurt", "quantity": 8.0}, {"food": "raspberries", "quantity": 8.0}, {"food": "orange juice", "quantity": 3.0}, {"food": "barley flour or meal", "quantity": 1.0}], "title": "\nRaspberry Mimosa\n"}, {"directions": "\n\n              1. Position a rack in the middle of the oven and preheat the oven to 375 degrees F. Line twelve 1/2-cup muffin cups with paper liners. \n            \n\n              2. Whisk the flour, sugar, baking powder, salt and nutmeg together in a medium bowl. Whisk the oil, milk, eggs, and vanilla together in another bowl. Finely grate the zest from the oranges into the wet ingredients. \n            \n\n              3. Make a small \"well\" or space in the center of the dry ingredients. Pour the wet ingredients and raspberries into the center. Stir the wet and dry ingredients together with a wooden spoon until the dry ingredients are moistened but still a bit lumpy. (Do not over mix the batter or your muffins will be dense and tough.) Divide the batter evenly among the muffin liners and sprinkle the tops generously with sugar (about 1/2 teaspoon per muffin). \n            \n\n              4. Bake until golden brown and a toothpick inserted in the centers come out clean, about 25 to 30 minutes, rotating the pan halfway through cooking. Cool muffins in the pan on a rack for 5 to 10 minutes. Turn the muffins out of the pan and cool on the rack. Serve warm or at room temperature.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.5}, {"food": "sugar", "quantity": 0.75}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "hearts of palm", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "whole milk", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "oranges", "quantity": 2.0}, {"food": "raspberries", "quantity": 1.5}], "title": "\nRaspberry Orange Muffins\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              For the dough: Stir together the water, yeast and granulated sugar in a spouted measuring cup. Let sit until the yeast is foamy, about 5 minutes.\n            \n\n              Combine the salt, cardamom and 3 1/2 cups flour in the bowl of a stand mixer fitted with the paddle attachment and mix briefly on low speed to combine. Beat together the 1 egg, 3 yolks, honey and oil in a medium bowl. Stir in the yeast mixture. Add the wet ingredients to the flour mixture, mixing on low speed until combined. Add 1 more cup flour and mix on medium speed to make a sticky dough that comes together in a loose mass around the paddle. Switch to the dough hook and knead on medium speed to make a smooth but still somewhat sticky dough that clears the sides of the bowl, adding up to 1/2 cup more flour if necessary, about 4 minutes.\n            \n\n              Dump the dough onto a floured work surface and knead by hand a few times to make a smooth ball. Oil a large bowl and turn the dough ball in the oil to coat it. Cover with plastic wrap and let rise in a warm place until doubled in size, about 1 hour.\n            \n\n              For the filling and glaze: Meanwhile, stir together the jam and cardamom in a small bowl. \n            \n\n              Shape the dough: When the dough has risen, punch it down and divide it into 4 equal pieces. Line an unrimmed baking sheet with parchment paper. \n            \n\n              Form the dough pieces into balls on a floured work surface. With a lightly floured rolling pin, roll one ball into a 10-inch circle and place on the prepared baking sheet. Spread with a third of the filling, leaving a 1-inch border all around. Roll out another dough disc in the same manner and place on top of the first; top with the second third of filling. Repeat with a third dough disc and the remaining filling. Roll out the remaining dough disc and place it on top of the last layer of filling. \n            \n\n              Center the bottom of a small drinking glass (about 2 inches in diameter) in the middle of the dough to mark the center. At the 12 o'clock mark, cut through the dough with a very sharp knife from the edge of the glass to the edge of the dough circle, leaving the dough underneath the glass uncut. Repeat at the 3 o'clock, 6 o'clock and 9 o'clock points on the circle to make 4 quarters. Cut through the middle of each quarter in the same manner to make 8 equal wedges. Cut through each wedge one more time in the same manner to make 16 wedges. \n            \n\n              Remove the drinking glass. Lift the edges of 2 wedges that are next to each other and twist them away from each other twice, then pinch the ends together to reconnect them and make a pointed tip. Repeat with the remaining pairs of wedges. Cover the dough with oiled plastic wrap and let rise in a warm place until doubled in size, about 45 minutes. \n            \n\n              Position an oven rack in the center of the oven and preheat the oven to 350 degrees F. Beat the egg yolk and 2 tablespoons milk in a small bowl. Brush the egg wash all over the risen dough. Pinch the points again to reshape if the dough has risen so much that the points no longer look pointy. Bake the bread until puffed and golden brown, about 30 minutes. Cool on a rack until just warm, about 30 minutes. \n            \n\n              Stir together the confectioners' sugar, lemon juice and 2 tablespoons milk in a small bowl, adding up to 1 tablespoon more milk or confectioners' sugar if needed so that the glaze is the correct consistency to slowly drizzle off the end of the spoon. Drizzle the glaze all over the bread and let harden, about 30 minutes. Serve warm or at room temperature.\n            \n", "ingredients": [{"food": "coconut water", "quantity": 1.25}, {"food": "yeast extract spread", "quantity": 2.25}, {"food": "sugar", "quantity": 1.0}, {"food": "salt", "quantity": 1.5}, {"food": "ground turkey", "quantity": 0.5}, {"food": "potato flour", "quantity": 4.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "honey smoked ham", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "silk raspberry soy yogurt", "quantity": 0.75}, {"food": "ground turkey", "quantity": 0.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "milk", "quantity": 4.0}, {"food": "sugar", "quantity": 0.75}, {"food": "lemon juice", "quantity": 0.5}], "title": "\nRaspberry Snowflake Pull-Apart Bread\n"}, {"directions": "\n\n              Put the raspberry concentrate in a glass. Top off with seltzer. Add ice and serve.\n            \n", "ingredients": [{"food": "silk raspberry soy yogurt", "quantity": 0.25}, {"food": "silk plain soy yogurt", "quantity": 0.75}, {"food": "", "quantity": 1}], "title": "\nRaspberry Soda\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Blend the tofu in a food processor until smooth. Add the confectioners' sugar, cream cheese, flour and vanilla and puree until combined.\n            \n\n              Stack the phyllo sheets on a flat surface and cover with a slightly damp kitchen towel. Cut a piece of parchment paper slightly longer than the phyllo. Lay 1 sheet phyllo on the parchment with a long side facing you (keep the remaining phyllo covered). Brush with 1 tablespoon butter and sprinkle with 1 tablespoon graham cracker crumbs. Top with another sheet of phyllo, then more butter and crumbs. Repeat with the remaining phyllo sheets, topping each with butter and crumbs. Reserve the remaining butter and crumbs for topping.\n            \n\n              Spoon the tofu mixture across the length of the phyllo, leaving a 1-inch border at the long edge closest to you and a 2-inch border at the short ends. Sprinkle the raspberries on top of the tofu mixture. Starting with the long edge, use the parchment to roll the phyllo tightly over the filling to make a log; turn seam-side down on the parchment. Brush with the remaining butter and sprinkle with the remaining crumbs.\n            \n\n              Transfer the parchment and strudel to a baking sheet. Bake until golden, about 18 minutes, rotating the baking sheet halfway through. Slide the strudel onto a cutting board and let cool completely, about 1 hour. Dust with confectioners' sugar.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [{"food": "firm tofu", "quantity": 6.0}, {"food": "sugar", "quantity": 1.5}, {"food": "macaroni cheese", "quantity": 3.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.5}, {"food": "phyllo dough", "quantity": 5.0}, {"food": "butter oil", "quantity": 6.0}, {"food": "cracker barrel", "quantity": 6.0}, {"food": "raspberries", "quantity": 1.0}], "title": "\nRaspberry Strudel\n"}, {"directions": "\n\n              Preheat the oven to 325 degrees F and line a baking sheet with parchment paper. Whisk the egg whites, sugar, salt and vanilla in a large bowl until combined; fold in the coconut.\n            \n\n              Scoop heaping tablespoonfuls of the coconut mixture about 1 inch apart onto the baking sheet. Use your fingers to form into pyramids; bake 10 minutes. Make an indentation in each cookie using the back of a teaspoon; fill each with the raspberry jam, then continue baking until golden brown around the edges, 10 to 15 more minutes. Let cool 10 minutes on the baking sheet, then transfer to a rack to cool completely.\n            \n", "ingredients": [{"food": "egg substitute", "quantity": 3.0}, {"food": "sugar", "quantity": 0.5}, {"food": "salt", "quantity": 0.125}, {"food": "vanilla extract", "quantity": 0.25}, {"food": "coconut water", "quantity": 1.0}, {"food": "silk raspberry soy yogurt", "quantity": 0.5}], "title": "\nRaspberry Thumbprint Macaroons\n"}, {"directions": "\n\n              Whisk together the sugar, cornstarch and salt in a large saucepan; whisk in the milk until smooth. Heat over medium-high heat, whisking, until bubbles begin to form. Remove from the heat. \n            \n\n              Whisk the egg in a medium bowl. Slowly pour 1/4 cup of the hot milk mixture into the egg while whisking vigorously until smooth. Pour the mixture back into the saucepan and cook over medium-high heat, whisking vigorously, until thick and starting to bubble, about 2 minutes. Transfer the mixture to a bowl and let cool until thick, whisking frequently. Whisk in the sour cream and vanilla. \n            \n\n              Scoop about 1 scant tablespoon vanilla pudding into each tartlet shell and top each with a raspberry. Serve immediately, or cover and refrigerate up to 2 hours.\n            \n", "ingredients": [{"food": "sugar", "quantity": 0.25}, {"food": "cornstarch", "quantity": 2.0}, {"food": "salt", "quantity": 0.125}, {"food": "milk", "quantity": 1.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "sour cream", "quantity": 4.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "tostada shells", "quantity": 24.0}, {"food": "raspberries", "quantity": 24.0}], "title": "\nRaspberry Vanilla Tartlets\n"}, {"directions": "\n\n              Preheat a baking sheet in a 450 degrees F oven. Roll out 1 pound pizza dough into a 12-inch round. Brush with melted butter and sprinkle with sugar. Bake on the hot baking sheet until golden, about 8 minutes. Brush with 1/4 cup raspberry jam, then bake 2 more minutes. Cool slightly. Beat 1/3 cup mascarpone or cream cheese with 3 tablespoons confectioners' sugar and 1/2 teaspoon vanilla. Spread over the pizza and top with raspberries, toasted almonds and confectioners' sugar.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nRaspberry-Almond Pizza\n"}, {"directions": "\n\n              Puree the raspberries with 3/4 cup sugar and 1/3 cup water in a blender. Pour through a fine-mesh sieve into a bowl.\n            \n\n              Bring half of the raspberry puree to a boil in a small saucepan over medium heat. Sprinkle 4 teaspoons gelatin over 1/2 cup cold water in a medium bowl; let stand 1 minute. Stir in the hot raspberry puree until the gelatin dissolves, then stir in the remaining raspberry puree.\n            \n\n              Spray nine 5-ounce paper cups with cooking spray. Fill each cup about three-quarters full with the raspberry gelatin mixture. Refrigerate until the gelatin starts setting but the surface is still tacky, about 45 minutes.\n            \n\n              Meanwhile, bring the half-and-half and the remaining 1/4 cup sugar to a boil in a small saucepan, stirring until the sugar dissolves. Add the chocolate, reduce the heat to low and cook, stirring, until smooth. Sprinkle the remaining 2 teaspoons gelatin over 1/2 cup cold water in a medium bowl; let stand 1 minute. Pour in the chocolate mixture and stir until the gelatin dissolves. Pour the chocolate gelatin mixture into the cups on top of the raspberry gelatin and refrigerate until fully set, about 3 hours.\n            \n\n              Unmold the gelatin: Invert the cups onto plates and carefully tear off the paper. Top with whipped cream and raspberries.\n            \n\n              Photograph by Jonathan Kantor\n            \n", "ingredients": [{"food": "raspberries", "quantity": 3.0}, {"food": "sugar", "quantity": 1.0}, {"food": "onion powder", "quantity": 6.25}, {"food": "", "quantity": 1}, {"food": "", "quantity": 0.6666666666666666}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 1}], "title": "\nRaspberry-Chocolate Gelatin\n"}, {"directions": "\n\n              Toss 1/2 cup raspberries with 1 tablespoon chocolate liqueur; layer with crumbled brownies and chocolate ice cream in 2 glasses. Top with whipped cream and more raspberries.\n            \n\n              Photograph by Anna Williams\n            \n", "ingredients": [], "title": "\nRaspberry-Chocolate Parfaits\n"}, {"directions": "\n\n              Make the dough: Whisk the flour, baking powder and salt in a medium bowl. Beat the butter, brown sugar and granulated sugar in a large bowl with a mixer on medium-high speed until fluffy, about 3 minutes. Add the egg and vanilla and beat until combined. Reduce the mixer speed to low; add the flour mixture and beat until just combined. Divide the dough in half and shape into two 2-by-6-inch rectangles. Wrap each rectangle in plastic wrap and refrigerate until firm, at least 1 hour.\n            \n\n              Meanwhile, make the filling: Combine the dried figs, jam and juice in a small saucepan. Bring to a simmer over medium-low heat and cook, stirring frequently, until the juice is syrupy, about 25 minutes. Let cool slightly, then transfer to a food processor and puree until smooth. Set aside to cool completely.\n            \n\n              Line a baking sheet with parchment paper. Lightly flour 1 piece of dough and roll it out between 2 sheets of parchment paper into a 4-by-12-inch rectangle. Repeat with the remaining dough. Refrigerate until firm, about 30 minutes.\n            \n\n              Remove the top pieces of parchment and trim the edges of the dough rectangles. Spread the filling lengthwise down the center of each dough rectangle in a 2-inch-wide strip. Brush the long edges lightly with the beaten egg. Fold 1 long side of dough over the filling, then fold over the other long side; press gently to seal. Place both logs seam-side down on the prepared baking sheet, a few inches apart, and refrigerate until firm, about 30 minutes.\n            \n\n              Preheat the oven to 375 degrees F. Bake the cookie logs until golden brown, rotating the pan halfway through, about 20 minutes. Let cool 15 minutes on the pan. Transfer the logs to a cutting board; slice into 1-inch pieces and transfer to racks to cool completely.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.25}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "figs", "quantity": 1.0}, {"food": "silk raspberry soy yogurt", "quantity": 0.5}, {"food": "grape juice", "quantity": 0.5}, {"food": "egg substitute", "quantity": 1.0}], "title": "\nRaspberry-Fig Bars\n"}, {"directions": "\nSpecial equipment: a 3 1/2-inch ramekin\n\n              Pulse together the cream cheese, sugar, vanilla extract and salt in a food processor until smooth. Add the flour and butter and pulse until the dough just comes together in a solid mass (chunks of butter should be visible), about 6 to 8 long pulses. Shape the dough into a rectangle about 1/2-inch-thick. Wrap in plastic wrap and refrigerate until firm, at least 1 hour. Wipe out the food processor.\n            \n\n              Meanwhile, make the filling: Combine the figs, raspberry jam and juice in a small saucepan. Bring to a simmer over medium-low heat and cook, stirring frequently, until the figs are plump and the juice is syrupy, about 25 minutes. Remove from heat and cool slightly. Puree in the food processor until smooth and set aside to cool completely. \n            \n\n              Preheat the oven to 375 degrees F. Generously spray the back side of a baking sheet with cooking spray and set aside.  \n            \n\n              Put the chilled dough between 2 pieces of parchment. Roll out the dough into an 11-by-13-inch rectangle and 1/8-inch-thick (see Cook's Note). Refrigerate until firm, about 30 minutes. Remove the top piece of the parchment, to free it from the dough, then place it back on top. Turn the dough over and remove the top piece of parchment. Spread the fig mixture evenly over the dough. \n            \n\n              Roll the dough into a log using the parchment as a guide (the dough is very soft and the parchment will make it easier to roll). Transfer the log to the prepared baking sheet, brush with the egg wash and coat with the sanding sugar. Cut 20 slits across the log, about 1/2-inch apart. Each slit should go about three-quarters of the way through the log so that it is still completely intact. Bend about a quarter of the log by turning some of the newly cut \"tabs\" out so that the pinwheels of filling are facing up. Continue turning the \"tabs\" out and bending the log until you have a ring. Butt the ends up against each other. \n            \n\n              Spray the outside of a 3 1/2-inch round ramekin with cooking spray and place in the center of the ring. Chill the shaped rugelach dough for 30 minutes. Bake until cooked through and golden brown, 30 to 35 minutes.\n            \n\n              Remove the ramekin and let the ring cool for 5 minutes then slide a flat spatula underneath to free the ring from the baking sheet. Gently slide the ring onto a cooling rack and let cool completely before serving. \n            \n", "ingredients": [{"food": "macaroni cheese", "quantity": 4.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "salt", "quantity": 0.25}, {"food": "potato flour", "quantity": 1.5}, {"food": "butter oil", "quantity": 1.0}, {"food": "figs", "quantity": 5.0}, {"food": "silk raspberry soy yogurt", "quantity": 0.5}, {"food": "grape juice", "quantity": 0.5}, {"food": "", "quantity": 1}, {"food": "egg substitute", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}], "title": "\nRaspberry-Fig Pull-Apart Cookies\n"}, {"directions": "\n\n              Puree the raspberries and grapefruit juice in a blender. Strain the mixture through a fine-mesh sieve into a medium saucepan, pushing it through with a rubber spatula. Rinse the sieve.\n            \n\n              Whisk the sugar, cornstarch, grapefruit zest and salt into the raspberry puree. Whisk in the egg yolks. Cook the mixture over medium heat, whisking constantly, until it¿s thick like pudding, 5 to 7 minutes. Remove from the heat and whisk in the butter a few pieces at a time until incorporated.\n            \n\n              Strain the mixture through the sieve into a small bowl, pushing it through with a rubber spatula. Press plastic wrap directly onto the surface to prevent a skin from forming. Refrigerate until completely set, at least 4 hours and up to 5 days.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "raspberries", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.5}, {"food": "sugar", "quantity": 0.5}, {"food": "cornstarch", "quantity": 4.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "egg substitute", "quantity": 3.0}, {"food": "butter oil", "quantity": 3.0}], "title": "\nRaspberry-Grapefruit Curd\n"}, {"directions": "\n\nIcing and Filling:\n\n\n              For the cakes:\n            \n\n              Position a rack in the lower third of the oven and preheat to 350 degrees F. Lightly brush 2 (9-inch) round cake pans with shortening or butter. Line bottoms with buttered parchment paper and dust with flour. \n            \n\n              Sift the flour, baking powder, soda, and salt into a medium bowl; whisk to combine evenly. Stir the sour cream, lemon juice and vanilla together in a liquid measuring cup, and set aside. \n            \n\n              Beat the butter in a standing mixer with the paddle attachment on high until light and creamy, about 2 minutes. Stop and scrape butter off the sides of the bowl. Continue beating while gradually adding the sugar-- it should take a couple minutes to add all the sugar. Continue beating until very light and fluffy, about 3 to 4 minutes more. Scrape down the sides of the bowl and beat in the lemon zest. Add the eggs, 1 at a time, beating well after each addition. \n            \n\n              At low speed, add the flour mixture in 3 parts, alternating with the sour cream in 2 parts, beginning and ending with the flour. Scrape the sides of the bowl and mix for 15 seconds longer. \n            \n\n              Divide the batter evenly between the prepared pans and smooth the top with a knife. (Lightly tap the pan on the counter so the batter settles evenly.) \n            \n\n              Bake the cakes until a toothpick inserted in the center comes out clean, about 35 to 40 minutes. Cool in the pan on a rack for 20 minutes; then turn cakes out onto the rack to cool completely. \n            \n\n              For the Icing:\n            \n\n              Bring a few inches of water to a boil in a saucepan that can hold a mixer's bowl above the water. Whisk the sugar, the egg whites, lemon juice, cream of tartar, and salt in the bowl by hand. Set the bowl above the boiling water and continue whisking until the mixture is hot to the touch and the sugar dissolves, about 1 to 2 minutes. Transfer the bowl to a standing mixer fitted with the whisk attachment and beat the whites at medium-high speed until they almost holds a stiff peak and are cool, about 10 minutes. Beat in the butter, a little at a time, until the icing is smooth and spreadable. (If the icing separates, just keep beating and it will come back together.) \n            \n\n              To assemble the cake:\n            \n\n              Slice each cake in half horizontally with a serrated knife, to make 4 even layers, taking care that they are as flat and straight as possible. \n            \n\n              Set a large flat plate on a large inverted bowl or bottom of a salad spinner (of course, if you have a cake stand, use that), dabbing a little frosting on the bottom of the plate to secure it. Place a cake layer top side up on the plate. Using an offset spatula spread about half of the jam in a thin layer over the first cake layer, leaving about 1/4-inch border along the outside. Lay the second cake layer on top, stacking it as straight as possible. Using an offset spatula spread about 1 cup of the icing on the top layer. Place a third cake layer on top. \n            \n\n              Spread remaining red raspberry jam over the cake layer and place the final layer on top, pressing down lightly to secure all 4 layers together. Spread about 3/4 of the remaining icing around the sides with a knife or offset spatula, then ice the top of the cake. Use an offset spatula to smooth icing as much as possible. Press plain or iced cookies around the sides, taking care to leave space to cut the cake. Garnish with additional candied almonds and sprinkle the top of the cake with pastel colored sanding sugars. Serve immediately or set aside at room temperature for up to 2 hours before serving. If refrigerating the cake, bring to room temperature 30 minutes before serving.\n            \n\nSugar Cookies for Decorating (and eating):\n\n\n              Whisk the flour, baking powder, and salt in a medium bowl. \n            \n\n              Beat the butter and both sugars in another medium bowl with an electric mixer on medium-high speed until light and fluffy, about 30 seconds. Add the eggs and vanilla mixing until fully incorporated. Slowly add the flour mixture, and continue beating just until the dough comes together, stopping and scraping down the sides of the bowl as needed. \n            \n\n              Divide dough in half, pat into disks, wrap in plastic wrap and refrigerate until firm, at least 2 hours. \n            \n\n              Generously flour a clean work surface. (For a nice, even layer of flour, lightly sift flour over the work surface.) Gently roll chilled dough about 1/4-inch thick. Cut into desired shape using a cookie cutter, working quickly enough so dough remains chilled. If dough gets too soft, refrigerate on a lined baking sheet until firm again, about 30 minutes. \n            \n\n              Transfer cut cookies to un-greased baking sheets, leaving about 1-inch between cookies. Refrigerate the formed cookies for at least 30 minutes. Lightly dust off excess flour with a dry pastry brush. (Excess dough can be pressed into a disk, chilled and rerolled.) \n            \n\n              Preheat the oven to 325 degrees F. Bake the cookies, until the bottoms are golden, about 12 to 15 minutes depending on shape. Cool on the baking sheets until firm enough to transfer to a rack to cool. Decorate as desired and serve. Store in an airtight container at room temperature for up to 1 week. \n            \n", "ingredients": [{"food": "potato flour", "quantity": 3.0}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "sour cream", "quantity": 1.25}, {"food": "lemon juice", "quantity": 0.25}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "eggs", "quantity": 5.0}, {"food": "sugar", "quantity": 1.25}, {"food": "egg substitute", "quantity": 5.0}, {"food": "lemon juice", "quantity": 1.5}, {"food": "ice cream swich", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 1.5}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "barley flour or meal", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "almonds", "quantity": 1}, {"food": "potato flour", "quantity": 2.5}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 0.75}, {"food": "sugar", "quantity": 0.5}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.5}], "title": "\nRaspberry-Lemon Easter Cake\n"}, {"directions": "\n\n              For the Gelatines: Use a melon baller to portion the melon into small round balls. Divide the melon balls and half the raspberries evenly among 4 tall narrow glasses or dessert cups, about 8 ounces each.\n            \n\n              Sprinkle the gelatin over 1 cup of the Prosecco and stir to combine (fresh sparkling wine will bubble up, so do this in a medium bowl with room for froth). Let stand until the gelatin softens, about 5 minutes.\n            \n\n              Toss the remaining raspberries with the sugar and water in a medium saucepan and heat over low heat until raspberries break down and sugar dissolves, about 5 minutes. Pour off about 3 tablespoons of the raspberry juice, and reserve for flavoring the whipped cream.\n            \n\n              Add the remaining Prosecco to the berries in the saucepan and heat over medium-low until the berries break up and flavor the wine, about 2 minutes. It's best not to let the wine boil. Stir in gelatin mixture until dissolved, about 1 more minute. Strain and press through a fine mesh strainer to remove any fruit pips. Pour Prosecco gelatin into glasses over the fruit and refrigerate until set, about 3 hours.\n            \n\n              For the Cream: Just before serving whip the cream and sugar until soft peaks form. Fold in the reserved raspberry juice. Dollop the cream on top of each set gelatin and serve.\n            \n", "ingredients": [{"food": "watermelon seed krnls", "quantity": 0.25}, {"food": "raspberries", "quantity": 1.5}, {"food": "", "quantity": 1.25}, {"food": "barley flour or meal", "quantity": 2.0}, {"food": "sugar", "quantity": 0.75}, {"food": "coconut water", "quantity": 0.25}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "sugar", "quantity": 1.0}], "title": "\nRaspberry-Melon Gelatine Royale\n"}, {"directions": "\n\n              Place 1 thinly sliced orange and 1 pint raspberries (lightly crushed) in a pitcher. For still infused water, add 2 quarts of water. For sparkling water, add 1 quart of seltzer during prep and a second quart just before serving. Refrigerate 2 to 4 hours to allow the ingredients to infuse. Stir well and strain, discarding the solids. For serving, add fresh orange slices and raspberries for garnish and plenty of ice. The infused water will keep refrigerated for up to 2 days.\n            \n", "ingredients": [], "title": "\nRaspberry-Orange Water\n"}, {"directions": "\n\n              Chop the chocolate and put in a heatproof bowl. Bring the heavy cream, butter and salt to a simmer in a saucepan over medium heat; pour over the chocolate and let sit until completely melted, about 10 minutes. Stir with a rubber spatula or whisk until smooth. (If necessary, microwave in 20-second intervals until the chocolate melts.)\n            \n\n              Whisk in the vanilla and raspberry extracts, then stir in the peanut butter. Stir until the ganache is smooth and shiny. Pour into a shallow baking dish and refrigerate until firm, at least 3 hours or overnight.\n            \n\n              Roll tablespoonfuls of the ganache into 18 to 24 balls, then roll in cocoa powder. Transfer to a parchment-lined baking sheet, cover with plastic wrap and refrigerate until firm, at least 1 hour or overnight. (To make these in advance, roll into balls but do not coat; cover and freeze up to 2 weeks. Let sit at room temperature for 20 minutes before uncovering, then roll in coating.)\n            \n\n              Photograph by Johnny Miller\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 12.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "peanut butter ", "quantity": 0.25}, {"food": "onion powder", "quantity": 1}], "title": "\nRaspberry-Peanut Butter Chocolate Truffles With Cocoa Powder\n"}, {"directions": "\n\n              Make the cupcakes: Preheat the oven to 350 degrees F. Line a 12-cup muffin pan with liners. Whisk the flour, baking powder, baking soda and salt in a medium bowl. Whisk the melted butter, sugar, sour cream, eggs and vanilla in a large bowl until smooth. Add the flour mixture and whisk until smooth.\n            \n\n              Divide the batter among the prepared muffin cups, filling each about two-thirds of the way. Bake until the tops of the cupcakes are golden and spring back when gently pressed, 18 to 20 minutes. Let cool 5 minutes in the pan, then transfer to a rack to cool completely.\n            \n\n              Meanwhile, make the filling: Combine the raspberries, 1 cup water and the sugar in a medium saucepan and bring to a boil, stirring occasionally. Reduce the heat to a simmer and cook until reduced by half, about 15 minutes. Whisk the cornstarch, rosewater and 1 tablespoon water in a small bowl. Add to the raspberries and continue to cook, stirring, until thickened, 2 to 3 minutes. Strain the sauce through a fine-mesh sieve into a bowl, pressing on the solids with a rubber spatula. Let cool, about 20 minutes.\n            \n\n              Meanwhile, make the frosting: Put the sugar and egg whites in the bowl of a stand mixer; set the bowl over a saucepan of simmering water (do not let the bowl touch the water). Whisk until the mixture is warm and the sugar dissolves, 3 to 5 minutes. Transfer the bowl to the stand mixer; beat with the whisk attachment on medium-high speed until stiff glossy peaks form, 6 to 8 minutes. Switch to the paddle attachment. With the mixer on medium-high speed, beat in the butter a few pieces at a time, making sure the pieces are incorporated before adding more. (It¿s OK if the frosting looks curdled¿it will smooth out as you beat.) Once all the butter is added, continue beating until the frosting is smooth, 1 to 2 more minutes. Add 3 to 4 tablespoons of the raspberry filling and the rosewater and beat until thick and smooth.\n            \n\n              With a paring knife, cut a 3/4-inch-deep slit across the top of each cupcake, nearly edge to edge; gently squeeze the sides of the cupcake so the slit opens. Spoon about 1 teaspoon of the raspberry filling into each cupcake. Let stand 5 minutes, then spoon the remaining filling into the cupcakes. Spread the frosting on the cupcakes. Sprinkle with coarse sugar.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.3333333333333333}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 0.75}, {"food": "sour cream", "quantity": 0.5}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "raspberries", "quantity": 2.0}, {"food": "coconut water", "quantity": 1.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "cornstarch", "quantity": 1.5}, {"food": "", "quantity": 0.5}, {"food": "sugar", "quantity": 1.0}, {"food": "egg substitute", "quantity": 3.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "", "quantity": 0.75}, {"food": "sugar", "quantity": 1}], "title": "\nRaspberry-Rose Cupcakes\n"}, {"directions": "\n\n              Line a 9-by-5-inch loaf pan with plastic wrap, leaving a 2-inch overhang on all sides.\n            \n\n              Make the white layer: Sprinkle the gelatin over 1/2 cup milk in a medium bowl. Let stand 2 minutes. Heat the remaining 1/2 cup milk in a small saucepan over medium heat until steaming. Pour over the gelatin mixture and whisk until combined. Add the sugar and whisk until dissolved. Whisk in the sour cream, vanilla and salt until smooth. Pour the mixture into the prepared loaf pan, then lightly tap the pan on the counter to make an even layer. Refrigerate until set, 45 minutes to 1 hour.\n            \n\n              Make the red layer: Combine the watermelon, raspberries, sugar, lemon juice and salt in a blender; process until smooth. Strain through a fine-mesh sieve into a bowl, pressing the puree through with the back of a spoon. Transfer 1 cup of the puree to another bowl and sprinkle with the gelatin; let stand 2 minutes. Heat 1 cup of the remaining puree in a saucepan over medium heat until steaming. Pour over the gelatin mixture and whisk until combined. Stir in the remaining puree; let cool.\n            \n\n              Spoon the cooled puree over the white layer; loosely cover with the overhanging plastic wrap. Refrigerate until completely set, about 3 hours.\n            \n\n              Make the sauce: Combine the blueberries, sugar, salt and 1/4 cup water in a saucepan over medium heat. Cook, stirring, until the berries burst, about 5 minutes. Transfer to a blender and add the lemon juice; puree until smooth. Let cool completely.\n            \n\n              Unwrap the terrine; invert onto a platter. Slice and serve with the blueberry sauce and fresh blueberries.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "onion powder", "quantity": 2.0}, {"food": "whole milk", "quantity": 1.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "sour cream", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "hearts of palm", "quantity": 1}, {"food": "watermelon seed krnls", "quantity": 4.0}, {"food": "raspberries", "quantity": 2.0}, {"food": "sugar", "quantity": 0.25}, {"food": "lemon juice", "quantity": 2.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "onion powder", "quantity": 4.0}, {"food": "blueberries", "quantity": 2.0}, {"food": "sugar", "quantity": 0.25}, {"food": "hearts of palm", "quantity": 1}, {"food": "lemon juice", "quantity": 1.0}], "title": "\nRaspberry-Watermelon Terrine With Blueberry Sauce\n"}, {"directions": "\n\n              Heat 2 tablespoons olive oil in a large skillet over medium-high heat. Add the scallion whites, zucchini, eggplant and red pepper flakes. Cook, stirring occasionally, until the vegetables soften, 8 to 10 minutes. Add the garlic and season with salt and pepper. Continue cooking until the garlic is softened, about 1 more minute.\n            \n\n              Stir the tomatoes, beans (and their liquid) and 1/2 cup basil into the skillet and bring to a simmer. Cook, stirring occasionally, until the sauce thickens, 6 to 8 minutes.\n            \n\n              Reduce the heat to medium low to maintain a gentle simmer. Make 8 wells in the sauce and crack 1 egg into each well; season each with salt and pepper. Cover and cook until the egg whites are set but the yolks are still runny, 8 to 10 minutes. Remove from the heat and top with the scallion greens and the remaining 1/2 cup basil. Drizzle with the remaining 1 tablespoon olive oil. Serve with the baguette.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "martha white foods", "quantity": 4.0}, {"food": "yellow rice", "quantity": 1.0}, {"food": "eggplant", "quantity": 1.5}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "garlic powder", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 1.0}, {"food": "fava beans", "quantity": 1.0}, {"food": "basil", "quantity": 1.0}, {"food": "eggs", "quantity": 8.0}, {"food": "luncheon slices", "quantity": 4.0}], "title": "\nRatatouille Skillet Eggs\n"}, {"directions": "\n\n              Heat the olive oil in a large pot over medium-high heat. Add the onion and garlic and cook until soft, about 3 minutes. Add 1 to 2 teaspoons herbes de Provence and 1 teaspoon salt. Add the eggplant, zucchini and bell pepper and cook, stirring, 5 minutes. Add the tomatoes and their juices, the broth and half of the basil. Bring to a boil, then reduce the heat and simmer 20 minutes. \n            \n\n              Preheat the broiler. Brush the bread with olive oil; sprinkle with the remaining 2 teaspoons herbes de Provence and salt to taste. Broil until lightly toasted. Top with the cheese, then broil until melted. \n            \n\n              Puree about half of the soup in a blender, then return to the pot. Season with salt and pepper. Ladle the soup into bowls and top with the cheese toasts and the remaining basil.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "dulce de leche", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "whole milk", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 1}, {"food": "luncheon slices", "quantity": 8.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "pepper", "quantity": 1}], "title": "\nRatatouille Soup\n"}, {"directions": "\n\n              Heat 3 tablespoons olive oil in a large Dutch oven or pot over medium-high heat. Add the onion and 1/4 teaspoon salt; cover and cook, stirring occasionally, until tender and golden, about 4 minutes.\n            \n\n              Reduce the heat to medium and add the eggplant and garlic. Cover and cook, stirring occasionally, until the eggplant is just golden and starts softening, about 4 minutes. Add the tomatoes; cover and cook, stirring occasionally, until the tomatoes just start breaking down, about 3 minutes.\n            \n\n              Add the broth, 1/2 teaspoon salt and a few grinds of pepper. Cover and bring to a simmer, then uncover and cook until the eggplant is tender, about 10 minutes. Add the squash and continue simmering until tender, about 5 more minutes; season with salt and pepper.\n            \n\n              Combine the parsley, parmesan, lemon juice and the remaining 2 tablespoons olive oil in a small bowl. Top each bowl of soup with some parsley mixture; serve with bread.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 5.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "eggplant", "quantity": 1.75}, {"food": "garlic powder", "quantity": 2.0}, {"food": "tomatoes", "quantity": 1.5}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "pepper", "quantity": 1}, {"food": "yellow rice", "quantity": 1.5}, {"food": "parsley", "quantity": 0.5}, {"food": "parmesan cheese", "quantity": 0.5}, {"food": "lemon juice", "quantity": 1.0}, {"food": "garlic bread", "quantity": 1}], "title": "\nRatatouille Soup\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the ravioli and cook as the label directs. Reserve 1/2 cup of the cooking water, then drain the ravioli. \n            \n\n               Combine the butter, cream and peas in a large skillet and bring to a simmer over medium heat; cook 1 minute. Add the ravioli, cheese, nutmeg and a splash of the reserved cooking water to the skillet and toss. Add more cooking water to thin the sauce, if needed. Season with salt and pepper. Divide among bowls and top with the parsley. \n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "mushroom & asparagus risotto", "quantity": 2.0}, {"food": "pepper", "quantity": 1}, {"food": "butter oil", "quantity": 4.0}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "pigeon peas", "quantity": 1.0}, {"food": "parmesan cheese", "quantity": 0.5}, {"food": "hearts of palm", "quantity": 1}, {"food": "parsley", "quantity": 2.0}], "title": "\nRavioli Alfredo With Peas\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the ravioli and cook as the label directs. Reserve 1/2 cup cooking water, then drain.\n            \n\n              Meanwhile, melt the butter in a large skillet over medium-high heat. Add the shallot, artichoke hearts, 1/4 teaspoon salt and a few grinds of pepper. Cook, stirring, until the artichokes are golden brown, about 5 minutes. Add the wine and cook until mostly evaporated, about 1 minute. Add the heavy cream and bring to a simmer. Add the parmesan, peas and nutmeg. Cook, stirring, until the sauce is thickened, about 1 minute.\n            \n\n              Add the ravioli, tarragon and reserved cooking water to the skillet; gently stir to combine. Season with salt and pepper.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "mushroom & asparagus risotto", "quantity": 2.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "", "quantity": 1.0}, {"food": "artichoke hearts", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "martha white foods", "quantity": 0.25}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "parmesan cheese", "quantity": 0.5}, {"food": "pigeon peas", "quantity": 0.5}, {"food": "hearts of palm", "quantity": 1}, {"food": "", "quantity": 2.0}], "title": "\nRavioli Alfredo with Artichokes\n"}, {"directions": "\nSpecial equipment: a 9-inch pie dish\n\n              Preheat the oven to 375 degrees F.\n            \n\n              Bring a large pot of generously salted water to a boil and cook the ravioli according to the package directions. Toss with the butter in a large bowl. Let sit until cool enough to handle, about 10 minutes. Sprinkle with the Parmesan and toss to coat.\n            \n\n              Grease a 9-inch pie dish with nonstick cooking spray. Spread 1/4 cup of the marinara on the bottom of the prepared dish. Standing the ravioli on their sides, shingle the pasta around the edge of the pie dish until you have completed a circle. Inside the ravioli circle, shingle alternating pieces of mozzarella and sun-dried tomatoes until you have a second circle. Repeat the circles, alternating ravioli with the mozzarella and sun-dried tomatoes, until the pie dish is filled. Curl a ravioli around a piece of mozzarella and tuck it in the center.\n            \n\n              Bake the pie until the cheese is melted and the pasta is slightly toasted, about 15 minutes. Cool for 15 minutes before slicing and serving with the remaining marinara sauce.\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 9.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "", "quantity": 0.75}, {"food": "pie fillings", "quantity": 1}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "whole milk", "quantity": 12.25}, {"food": "vegetable oil", "quantity": 12.5}], "title": "\nRavioli Rose Pie\n"}, {"directions": "\n\n              Soak 1/4 thinly sliced red onion in ice water, 20 minutes; drain. Meanwhile, cook a 9-ounce package cheese ravioli as the label directs; drain and rinse under cold water. Whisk 1 tablespoon each olive oil and lemon juice, 1 grated garlic clove, 1/2 teaspoon lemon zest, and salt and pepper to taste in a large bowl. Add the ravioli, onion, 1/2 cup halved cherry tomatoes, 1/4 cup chopped oil-cured olives and some chopped parsley; toss to combine.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nRavioli Salad\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Combine the vinegar, honey and bay leaf in a small saucepan and boil over medium-high heat until syrupy, 4 to 5 minutes. Cover to keep warm.\n            \n\n              Add the ravioli to the boiling water and cook as the label directs. Meanwhile, melt the butter in a large skillet over medium heat, then add the sage and walnuts and cook until the nuts are toasted, about 3 minutes. Increase the heat to high, ladle in about 1 cup cooking water and bring to a boil. Cook until reduced by about half, 1 to 2 minutes.\n            \n\n              Drain the ravioli, reserving another 1/2 cup cooking water. Add the ravioli to the skillet and toss to coat, adding the reserved water as needed. Remove from the heat, toss with the parmesan and season with salt. Divide the ravioli among plates and drizzle with the balsamic syrup.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "vinegar", "quantity": 0.25}, {"food": "honey smoked ham", "quantity": 2.0}, {"food": "corier leaf", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 2.0}, {"food": "butter oil", "quantity": 6.0}, {"food": "chrysanthemum leaves", "quantity": 0.3333333333333333}, {"food": "walnuts", "quantity": 1.0}, {"food": "parmesan cheese", "quantity": 0.75}], "title": "\nRavioli With Sage-Walnut Butter\n"}, {"directions": "\n\n              Heat the olive oil in a large pot over medium heat. Add the onion, carrots, celery and thyme and cook, stirring occasionally, until the vegetables begin to soften, about 4 minutes. Add the broth and 3 cups water and increase the heat to high. Cover and bring to a boil, then add the ravioli. Reduce the heat to medium and simmer until the ravioli are tender (see label for approximate cooking time). \n            \n\n              Add the escarole to the soup and cook, stirring, until wilted. Season with salt and pepper. Ladle the soup into bowls and sprinkle with the cheese. Serve with the bread. \n            \n\n              Photograph by Andrew Purcell\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "thyme", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "escarole", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "parmesan cheese", "quantity": 3.0}, {"food": "luncheon slices", "quantity": 8.0}], "title": "\nRavioli and Vegetable Soup\n"}, {"directions": "\n\n              Bring a large, wide pot of salted water to a boil.\n            \n\n              Melt 2 tablespoons of the butter in a large skillet over medium heat. Add the onions, sprinkle with salt and cook, stirring occasionally, until tender, about 4 minutes. Increase the heat to medium-high, add half the radicchio, sprinkle with salt and pepper and cook, stirring and turning, until tender, about 5 minutes. Transfer everything to a medium bowl.\n            \n\n              Melt 2 tablespoons of the remaining butter in the skillet; add the remaining radicchio, sprinkle with salt and pepper and cook, stirring and turning, until tender, about 5 minutes. Return the first batch of vegetables to the skillet, stir to combine, remove from the heat and cover to keep warm.\n            \n\n              While cooking the radicchio, add the ravioli to the pasta water, stir well and cook until just tender, about 6 minutes. Reserve 1/3 cup of the pasta water, then strain the ravioli in a colander.\n            \n\n              Melt the remaining 1 tablespoon butter in the pasta pot over low heat. Add the sage and cook, stirring, about 1 minute. Add the ravioli and toss to coat with sage butter. Add the vegetables and stir well. Add 3 tablespoons of the reserved pasta water and toss to coat. The ravioli should be nicely slicked; if it seems dry, add the remaining water a tablespoon at a time. Season with salt and pepper. Divide the ravioli among four warm bowls and serve.\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 5.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "radicchio", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "macaroni cheese", "quantity": 12.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}], "title": "\nRavioli with Radicchio and Sage\n"}, {"directions": "\n\n              To make the real deal, fry 8 slices bacon until extra crisp. Drain on paper towels, then finely chop and spread on a baking sheet. Bake in a 350 degrees F oven for 5 minutes. Let cool on clean paper towels until most of the fat is absorbed.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [], "title": "\nReal Bacon Bits\n"}, {"directions": "\n\n              Preheat oven to 425 degrees F.\n            \n\n              Rub unpeeled onions with a bit of the olive oil; roast until soft, about 45 minutes. Cool and peel.\n            \n\n              Finely dice the peeled raw onion. Heat a large skillet over medium-high heat; add remaining oil and heat until quite hot. Add diced onion and cook, stirring occasionally, until edges begin to brown, about 5 minutes. Turn to medium-low and cook until onion is golden brown, about 18 minutes. Scrape onion, oil, and juices into a sieve over a bowl. Drain onions and spread on a paper towel-lined plate. Cool the strained oil.\n            \n\n              Puree roasted onions in a food processor. Add mayonnaise, sour cream, vinegar, and salt; pulse until smooth. With the motor running, drizzle in 1/4 cup of the flavored reserved oil. Transfer to a serving bowl. Stir in scallions, pepper, and hot sauce to taste. Refrigerate at least 3 hours. Scatter the fried onions over the top just before serving with potato chips.\n            \n", "ingredients": [{"food": "", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "mayonnaise dressing", "quantity": 2.0}, {"food": "sour cream", "quantity": 0.5}, {"food": "vinegar", "quantity": 1.0}, {"food": "salt", "quantity": 2.0}, {"food": "martha white foods", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "Worcestershire sauce", "quantity": 1}, {"food": "potato chips", "quantity": 1}], "title": "\nReally Onion Dip\n"}, {"directions": "\n\n              Beat the cream and vanilla in a chilled non-reactive bowl with a whisk or an electric mixer just until they hold a loose peak. (Lift the beater from the cream and look at the shape of the peak at the end of the whisk; it should hold a lazy curve.) Sift the sugar over the cream and continue to beat just until it holds a soft peak. Take care not to over beat the cream or it will be look curdy. Serve, or refrigerate covered for up to 4 hours.\n            \n", "ingredients": [{"food": "ice cream swich", "quantity": 1.5}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "sugar", "quantity": 2.0}], "title": "\nReally Vanilly Whipped Cream\n"}, {"directions": "\n\n              For the cake: Preheat the oven to 350 degrees F. Butter three 8-inch round cake pans, then line the bottoms with parchment paper and butter and flour the paper (see Cook's Note).\n            \n\n              Whisk the flour, baking powder and salt in a bowl until evenly combined. Combine the sugar, oil, vanilla and eggs in another bowl. Pour 1 tablespoon red ale into a small bowl and reserve. Pour the remaining red ale into the egg mixture and whisk until smooth. Pour the egg and beer mixture over the flour mixture and whisk until the batter is just combined. Divide the batter among the prepared pans, shaking the pans to distribute the batter evenly, then bake until a cake tester inserted in the center of the cakes comes out clean, 30 to 35 minutes.\n            \n\n              Let the cakes cool in the pans for 20 minutes, then invert them onto a cooling rack and remove the parchment paper. Flip the cakes right-side up again and let cool completely.\n            \n\n              For the frosting and fruit: Meanwhile, combine the butter, confectioners' sugar, milk, lemon juice, vanilla and salt in a bowl and beat with an electric mixer on medium speed until lightened and creamy, about 3 minutes. In another bowl, toss the strawberries with the granulated sugar and the reserved red ale and refrigerate 15 minutes to 1 hour.\n            \n\n              Place a cake layer on a cake plate, then spread 1 cup of the frosting over the cake with an offset spatula or butter knife. Spoon about a quarter of the strawberries over the frosting, arranging them evenly over the top. Repeat with the second cake layer, another 1 cup frosting and third of the remaining strawberries. Top with the last cake layer and the remaining 1 cup frosting. (If not serving immediately, wrap the cake in plastic wrap and let stand at room temperature for up to 1 day.)\n            \n\n              When ready to serve, pile the remaining strawberries on top of the cake.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1}, {"food": "potato flour", "quantity": 3.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "eggs", "quantity": 3.0}, {"food": "ruby red grapefruit juice blend", "quantity": 12.0}, {"food": "butter oil", "quantity": 3.0}, {"food": "sugar", "quantity": 3.0}, {"food": "milk", "quantity": 1.5}, {"food": "lemon juice", "quantity": 2.25}, {"food": "vanilla extract", "quantity": 1.5}, {"food": "salt", "quantity": 0.75}, {"food": "luncheon slices", "quantity": 1.25}, {"food": "sugar", "quantity": 1.0}], "title": "\nRed Ale and Strawberry Stack Cake\n"}, {"directions": "\n\n              Put the berries, 1/2 cup cold water, beet, lemon juice, honey and coconut oil into a blender. Blend on high until smooth, turning off the blender and pushing down on the ingredients with a spatula or wooden spoon as needed to help the blending process. Add 1 to 2 tablespoons more water if needed to adjust consistency.\n            \n", "ingredients": [{"food": "mixed nuts", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "honey smoked ham", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}], "title": "\nRed Berry-and-Beet Smoothie\n"}, {"directions": "\n\n              Place the cabbage in a large bowl, sprinkle with the salt and rub in the salt with your fingers. Transfer to a colander and place the colander over the bowl. Fill a large sealable plastic bag with water, close tightly and place on top of the cabbage as a weight. Place in the refrigerator to drain for about 4 hours. Squeeze the cabbage with your hands to press out as much water as possible, and put the cabbage in bowl. In a small saucepan combine the vinegar, sugar, and water, bring to a boil. Pour over the cabbage and toss to combine. Marinate the slaw in the refrigerator for 4 to 6 hours before serving, stirring occasionally. Serve.\n            \n\n              Copyright 2001 Television Food Network, G.P. All rights reserved.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "salt", "quantity": 2.0}, {"food": "vinegar", "quantity": 1.25}, {"food": "sugar", "quantity": 0.5}, {"food": "coconut water", "quantity": 0.75}], "title": "\nRed Cabbage Slaw\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Spread the walnuts on a baking sheet; roast until golden, about 12 minutes. Soak the shallot in cold water, 10 minutes, then drain and rinse. Toss the cabbage with 1 teaspoon salt in a large bowl.\n            \n\n              Whisk the vinegar, lemon juice, mustard, sugar and 1/2 teaspoon pepper in another bowl. Gradually whisk in the olive oil, then the creme fraiche. Stir in the celery and shallots. Add to the cabbage and toss. Cover and chill at least 30 minutes or up to 6 hours. Before serving, thinly slice the endive lengthwise and toss with the cabbage mixture; season with salt and pepper. Sprinkle with the nuts.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "walnuts", "quantity": 0.5}, {"food": "", "quantity": 1.0}, {"food": "swamp cabbage", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "vinegar", "quantity": 2.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "ice cream swich", "quantity": 0.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "endive", "quantity": 3.0}], "title": "\nRed Cabbage-Endive Salad\n"}, {"directions": "\n\n              Simmer 3/4 cup pomegranate juice and 1/4 cup sugar in a small skillet until reduced by half, about 5 minutes. Stir in a dash of orange-flower water; let cool to room temperature. Pour 1 to 2 teaspoons of the syrup into each of 6 flutes. Add a splash of gin and top with champagne; stir gently.\n            \n\n              Photograph by Anna Williams\n            \n", "ingredients": [], "title": "\nRed Carpet Cocktails\n"}, {"directions": "\n\n              Make the dressing: Whisk the vinegar, mustard, sugar, 1 teaspoon salt and 1/2 teaspoon pepper in a large bowl. Gradually whisk in the olive oil until well blended.\n            \n\n              Add the cabbage, parsley, scallions and grapes to the bowl and toss to coat with the dressing. Cover and refrigerate 1 to 4 hours before serving.\n            \n\n              Photograph by Yunhee Kim\n            \n", "ingredients": [{"food": "vinegar", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "swamp cabbage", "quantity": 1.5}, {"food": "parsley", "quantity": 0.3333333333333333}, {"food": "", "quantity": 6.0}, {"food": "ruby red grapefruit juice blend", "quantity": 2.0}], "title": "\nRed Coleslaw With Grapes\n"}, {"directions": "\n\n              Romesco Sauce: Soak 1 dried New Mexico chile pepper in hot water, 10 minutes; drain, then remove the stem and seeds. Puree 1 garlic clove, 1 slice toasted bread, 1/4 cup smoked almonds and the chile in a food processor. Add 2 cups quartered tomatoes, 2 tablespoons red wine vinegar and 1/2 teaspoon smoked paprika; puree. With the motor running, slowly pour in 3/4 cup olive oil. Season with salt and more paprika.\n            \n\n              Serve with:\n            \n\n              Acorn Squash: Halve, seed and cut into 1/2-inch-thick wedges. Toss with olive oil, salt and pepper. Roast at 425 degrees F, stirring halfway through, until tender, 15 to 20 minutes. (You can do this at the same time as the carrots.)\n            \n\n              Baby Carrots: Trim, then toss with olive oil, chopped dill and parsley, and salt. Roast at 425 degrees F, tossing halfway through, until tender, 15 to 20 minutes.\n            \n\n              Baby Bell Peppers\n            \n\n              Smoked Almonds\n            \n\n              Radishes\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [], "title": "\nRed Crudites with Romesco Sauce\n"}, {"directions": "\n\n              Cook 2 thinly sliced large red onions in a skillet with 1/4 cup olive oil over low heat, covered, until golden, 30 minutes. Stir in 3 tablespoons cider vinegar, 2 tablespoons brown sugar and 1 teaspoon grated peeled ginger; season with salt. Cook until thick, about 20 more minutes.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [], "title": "\nRed Onion Marmalade\n"}, {"directions": "\n\n              Slice the potatoes 1/3-inch thick and put in a saucepan with 1 teaspoon of the salt, the water, and the wine. Tie the parsley stems, peppercorns, and thyme in a piece of cheesecloth and add to the pot. Bring to a boil over high heat and immediately lower the heat to maintain a gentle simmer. Cook until the potatoes are tender but not mushy, about 12 minutes. Drain; discard the herb bundle and transfer the potatoes to a bowl.\n            \n\n              While the potatoes are cooking make the dressing. In a small bowl, whisk together the vinegar, parsley, shallots, the remaining 2 teaspoons of the salt and pepper. Gradually whisk in the oil to make a dressing. Toss the warm potatoes with the dressing gently so as not to break up the potatoes. Allow the salad to sit at room temperature for 1 hour to marinate, tossing several times to coat the potatoes. Season with salt and pepper, to taste. Serve at room temperature.\n            \n\n              Copyright 2003 Television Food Network, G.P. All rights reserved.\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 2.0}, {"food": "salt", "quantity": 1.0}, {"food": "coconut water", "quantity": 4.0}, {"food": "martha white foods", "quantity": 1.0}, {"food": "parsley", "quantity": 4.0}, {"food": "black bean mango", "quantity": 6.0}, {"food": "thyme", "quantity": 2.0}, {"food": "", "quantity": 1}, {"food": "vinegar", "quantity": 3.0}, {"food": "hearts of palm", "quantity": 0.5833333333333333}, {"food": "onion powder", "quantity": 0.3333333333333333}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.5}], "title": "\nRed Potato Salad\n"}, {"directions": "\n\n              Press the raspberry candies into the frosting at one edge of the cupcake. Cut the green gel candy into 3 thin strips and make stems for each raspberry. Cut the fish in half and put one half at the bottom of the bouquet to make a leaf.\n            \n", "ingredients": [{"food": "ruby red grapefruit juice blend", "quantity": 3.0}, {"food": "frosting", "quantity": 1.0}, {"food": "spaghetti", "quantity": 1.0}, {"food": "", "quantity": 1.0}], "title": "\nRed Raspberry Bouquet\n"}, {"directions": "\n\n              Combine the red rice, 3 cups water and 1/2 teaspoon salt in a medium saucepan. Cover and bring to a simmer over medium heat. Reduce the heat to medium low and cook until the rice is tender, about 45 minutes. (Drain any excess water.)\n            \n\n              Meanwhile, heat the olive oil in a large deep skillet over medium-high heat. Add the onion; sprinkle with the sugar and season with salt and pepper. Cook, stirring, until the onion is soft, about 5 minutes. Add the ginger and dried cherries; cook, stirring, until the onion is golden brown, about 7 more minutes.\n            \n\n              Stir the prepared rice into the onion mixture. Add the baby spinach and orange juice and stir until the spinach is just wilted, about 1 minute. Season with salt and pepper.\n            \n\n              Photograph by Linda Pug\n            \n", "ingredients": [{"food": "crisped rice bar", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "sugar", "quantity": 1}, {"food": "pepper", "quantity": 1}, {"food": "ginger", "quantity": 1.5}, {"food": "maraschino cherries", "quantity": 0.5}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "", "quantity": 1.0}], "title": "\nRed Rice with Spinach and Dried Cherries\n"}, {"directions": "\n\n              Mix the wine, liqueur and sugar in a pitcher, stirring to dissolve the sugar, then add the fruit.\n            \n\n              Refrigerate at least 1 hour and up to 1 day.\n            \n\n              Add the seltzer just before serving.\n            \n\n              Photograph by Yunhee Kim\n            \n", "ingredients": [{"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "", "quantity": 0.25}, {"food": "orange", "quantity": 0.25}, {"food": "sugar", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "apple", "quantity": 1.0}, {"food": "", "quantity": 1.5}], "title": "\nRed Sangria\n"}, {"directions": "\n\n              Heat the oil in a large pot over medium heat. When it shimmers, add the garlic, ginger, and Thai red curry paste and cook, stirring constantly, until dark red and very fragrant, about 5 minutes. Add the chicken broth, coconut milk, fish sauce, lemongrass, 1 teaspoon salt and a pinch of sugar. Bring the mixture to a boil, then reduce the heat to a simmer and cook, uncovered, until the lemongrass and ginger are tender, about 15 minutes. Discard the lemongrass.\n            \n\n              Meanwhile, put the noodles in a medium bowl and cover with hot water. Let stand for 10 minutes, then drain and set aside. Toss together the red onion, cilantro, scallions and Thai basil in a medium bowl and set aside.\n            \n\n              Stir the chicken into the broth and simmer over low heat until tender, 5 minutes for chicken breast and about 15 minutes for chicken thighs. Increase the heat to high and stir in the noodles. Bring the soup to a boil, then immediately remove from the heat. Stir in the lime juice. Serve the soup in bowls topped with the reserved onion and herb mixture.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 6.0}, {"food": "diced chicken", "quantity": 8.0}, {"food": "coconut milk", "quantity": 13.0}, {"food": "Worcestershire sauce", "quantity": 3.0}, {"food": "", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "sugar", "quantity": 1}, {"food": "fat free chicken breast ", "quantity": 2.0}, {"food": "rice noodles", "quantity": 3.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 0.3333333333333333}, {"food": "silk light vanilla", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 0.3333333333333333}, {"food": "", "quantity": 1.0}], "title": "\nRed Thai Curry Chicken Soup\n"}, {"directions": "\n\n              For the red velvet cake: Position an oven rack in the center of the oven, and preheat to 350 degrees F. Line an 8-inch square baking pan with foil, leaving an overhang on all sides. Coat the foil with cooking spray.\n            \n\n              Whisk together the flour, granulated sugar, baking soda and salt in a medium bowl; set aside. Stir together the cocoa powder and 2 tablespoons very hot water in a small bowl until smooth; let cool slightly. Stir together the milk and vinegar in another small bowl, and let stand until thickened, 3 to 5 minutes.\n            \n\n              Whisk together the oil, eggs and vanilla in a large bowl until smooth. Whisk in the food coloring and the cocoa mixture. Alternate whisking in the flour mixture in three additions and the milk mixture in two, starting and ending with the flour, until just combined. Pour into the prepared pan.\n            \n\n              Bake until a toothpick inserted in the center comes out clean, about 30 minutes. Once the cake is cool enough to touch, press it down slightly to make the layer even. Place the pan on a cooling rack and let cool completely.\n            \n\n              For the cheesecake: While the red velvet cake bakes, combine the gelatin with 2 tablespoons water in a small microwave-safe bowl, and set aside to soften, about 5 minutes.\n            \n\n              Heat the granulated sugar and corn syrup over medium heat in a small skillet. Cook, swirling the pan but not stirring, until the mixture turns amber, 5 to 7 minutes. Remove the skillet from the heat, and carefully whisk in the cream and bourbon. (If the caramel seizes and hardens, continue to stir over medium heat until it melts and is smooth again.) Bring the mixture to a fast simmer, and cook until the caramel thickens enough to coat the back of a spoon, 3 to 4 minutes. Let cool to room temperature, stirring occasionally to help the caramel cool faster.\n            \n\n              Beat the cream cheese with an electric mixer on medium-high speed in a large bowl until completely smooth, about 1 minute. Scrape down the side of the bowl. Add the cooled caramel, sour cream and confectioners' sugar, and beat on medium-high speed until incorporated and smooth, about 1 minute.\n            \n\n              Microwave the gelatin until melted, stirring as needed, about 30 seconds. Add it to the cream cheese mixture, and beat on medium-high speed to combine, about 30 seconds.\n            \n\n              Spread the cheesecake mixture over the red velvet cake in an even layer. Cover loosely with plastic wrap, and refrigerate until set, at least 2 hours.\n            \n\n              Make the whipped cream: Beat the cream and confectioners' sugar together with an electric mixer at medium-high speed in a large bowl until medium peaks form. Spread the cream over the cheesecake.\n            \n\n              Use the foil overhang to lift the bars out of the pan. Peel down the foil, and thinly trim the edges of the bars. Cut into 12 even rectangles, wiping the knife clean between cuts.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 1.25}, {"food": "sugar", "quantity": 0.75}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 0.25}, {"food": "onion powder", "quantity": 1.0}, {"food": "milk", "quantity": 0.5}, {"food": "vinegar", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.6666666666666666}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "", "quantity": 1}, {"food": "", "quantity": 0.25}, {"food": "sugar", "quantity": 0.5}, {"food": "silk light vanilla", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 3.0}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "sour cream", "quantity": 0.75}, {"food": "sugar", "quantity": 1.5}, {"food": "", "quantity": 1}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "sugar", "quantity": 3.0}], "title": "\nRed Velvet Bourbon Cheesecake Bars\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Generously oil a 12-cup muffin pan.\n            \n\n              Combine the cake mix, oil, 3 of the eggs and 1 cup water until smooth; divide among the muffin cups. Bake until a tester comes out clean, about 18 minutes. Cool in the pan for 5 minutes, then cool completely on a wire rack.\n            \n\n              Meanwhile, beat the cream cheese, butter, confectioners' sugar, 1 teaspoon of the vanilla and a pinch of salt in the bowl of a stand mixer fitted with a paddle attachment (or in a large bowl if using a hand mixer) until smooth.\n            \n\n              Whisk the milk, egg yolks, granulated sugar, remaining 5 eggs and 1 tablespoon vanilla, and a pinch of salt in a large bowl until smooth.\n            \n\n              Butter a shallow 3-quart baking dish. Cut the cupcakes in quarters and scatter half over the bottom of the dish. Dollop half the frosting over the cupcakes, then pour in half the custard mixture. Repeat the layering once. Cover and refrigerate at least 1 hour or overnight.\n            \n\n              When ready to bake, preheat the oven to 350 degrees F. Uncover the bread pudding and sprinkle the pecans on top. Bake until the top is golden brown and the center is set, about 1 hour. If the pecans start to burn, loosely tent the dish with foil. Cool completely on a wire rack.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "shortening cake mix", "quantity": 16.0}, {"food": "egg substitute", "quantity": 8.0}, {"food": "macaroni cheese", "quantity": 12.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "sugar", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "whole milk", "quantity": 4.0}, {"food": "sugar", "quantity": 0.25}, {"food": "pecans", "quantity": 1.0}], "title": "\nRed Velvet Bread Pudding\n"}, {"directions": "\n\n              For the cake: Position an oven rack in the middle of the oven, and preheat to 350 degrees F. Coat two 9-inch round cake pans with cooking spray; dust with flour, and tap out the excess.\n            \n\n              Whisk together the flour, granulated sugar, baking soda and salt in a medium bowl; set aside. Stir together the hot water and cocoa powder in a small bowl until smooth; let cool slightly. Stir together the milk and vinegar in another small bowl, and let stand until thickened, 3 to 5 minutes.\n            \n\n              Whisk together the oil, eggs and vanilla in a large bowl until smooth. Whisk in the red food coloring and the cocoa mixture. Alternate whisking in the flour mixture in three additions and the milk in two, starting and ending with the flour, until just combined. Divide the batter evenly between the prepared pans.\n            \n\n              Bake until a toothpick inserted in the center comes out clean, about 30 minutes. Let cool for 10 minutes in the pans, turn out onto cooling racks and let cool completely.\n            \n\n              For the frosting: While the cake layers are cooling, beat the cream cheese, butter, vanilla and salt with an electric mixer on medium speed in a large bowl until smooth and fluffy. Gradually beat in the confectioners' sugar until smooth. Increase the speed to high, and beat until very fluffy and there is no gritty texture left from the sugar. Beat in the milk to adjust the consistency if the frosting seems too thick.\n            \n\n              To assemble: Place one cake layer bottom-side down on a cake plate. Top with 1 cup of the frosting, and spread to the edge. Top with the second layer, and frost the top and sides with the remaining frosting. If the frosting becomes too soft while assembling the cake, briefly chill the cake and frosting and then finish frosting.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 2.75}, {"food": "sugar", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "salt", "quantity": 0.5}, {"food": "hot pockets ham cheese stuffed swich", "quantity": 0.25}, {"food": "onion powder", "quantity": 2.0}, {"food": "milk", "quantity": 1.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1.25}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "butter oil", "quantity": 1.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "sugar", "quantity": 3.0}, {"food": "milk", "quantity": 1.0}], "title": "\nRed Velvet Cake\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Make the crust: Preheat the oven to 350 degrees F. Mix the cookie crumbs, melted butter, sugar and salt in a bowl. Press into the bottom and 1 inch up the sides of a 9-inch springform pan. Put the pan on a baking sheet and bake until set, about 10 minutes. Let cool completely.\n            \n\n              Make the filling: Reduce the oven temperature to 325 degrees F. Beat the cream cheese, sugar, lemon juice and vanilla in a stand mixer fitted with the paddle attachment until smooth, 4 to 5 minutes. Add the flour, then beat in the eggs one at a time. Transfer 2 cups batter to a bowl; stir in the cocoa powder and food coloring. Pour the red batter into the crust, then pour the white batter on top. Using a spoon, pull some of the red batter up from the bottom of the cake and swirl. Bake until the edges are set but the center is still wobbly, about 1 hour, 20 minutes.\n            \n\n              Turn off the oven but keep the cake inside to cool, 20 minutes. Run a knife around the edge of the pan (don't remove the springform side), then transfer to a rack to cool. Refrigerate at least 4 hours before slicing.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "chocolate chip cookies", "quantity": 1.5}, {"food": "butter oil", "quantity": 5.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "hearts of palm", "quantity": 1}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "sugar", "quantity": 1.25}, {"food": "lemon juice", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "eggs", "quantity": 4.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}], "title": "\nRed Velvet Cheesecake\n"}, {"directions": "\n\n              Put the white chocolate in a microwave-safe bowl and microwave in 30-second intervals, stirring, until smooth. Whisk the flour, cocoa powder, baking powder and salt in a medium bowl; set aside.\n            \n\n              Whisk the eggs, vegetable oil and food coloring in a large bowl; whisk in the granulated sugar and melted white chocolate until smooth. Stir the flour mixture into the egg mixture with a wooden spoon until combined. Transfer the dough to a piece of plastic wrap and pat into a rectangle; tightly wrap and refrigerate until firm, at least 2 hours or overnight.\n            \n\n              Position racks in the upper and lower thirds of the oven and preheat to 300 degrees F. Line 2 baking sheets with parchment paper. Put the confectioners' sugar in a bowl. Roll tablespoonfuls of dough into balls; toss the balls in the confectioners' sugar to coat. Slightly flatten the balls, then dip again in the confectioners' sugar. Arrange the cookies 2 inches apart on the prepared baking sheets. Bake, switching the pans halfway through, until the cookies are puffed and firm, 16 to 18 minutes. Let cool completely on the baking sheets.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 2.0}, {"food": "potato flour", "quantity": 1.25}, {"food": "onion powder", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 0.25}, {"food": "eggs", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.5}, {"food": "sugar", "quantity": 0.75}, {"food": "sugar", "quantity": 1.0}], "title": "\nRed Velvet Crackle Cookies\n"}, {"directions": "\n\n              Make the swirl: Combine the cream cheese, granulated sugar, eggs, sour cream, heavy cream and vanilla in a food processor and puree until smooth; set aside.\n            \n\n              Make the cake: Position a rack in the lower third of the oven; preheat to 350 degrees F. Generously coat a 10- to 15-cup Bundt pan with cooking spray and dust with flour, tapping out the excess. Whisk the flour, granulated sugar, cocoa powder, baking soda and salt in a large bowl. Whisk the vegetable oil, sour cream, eggs, food coloring, vanilla, vinegar and 1/4 cup water in a medium bowl. Pour the wet ingredients into the dry ingredients and whisk until just combined.\n            \n\n              Spread 3 cups of the batter in the prepared Bundt pan. Pour in the cream cheese swirl mixture, then spoon the remaining cake batter evenly over the top. Bake until the top is cracked and a toothpick inserted into the cake comes out clean, about 1 hour 10 minutes. Transfer to a rack and let cool 20 minutes in the pan, then carefully invert onto a plate and let cool completely, at least 2 hours.\n            \n\n              Make the glaze: Combine the cream cheese, confectioners' sugar, sour cream, vanilla and salt in a food processor and puree until smooth. Pour and spread on the cooled cake.\n            \n", "ingredients": [{"food": "macaroni cheese", "quantity": 2.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "eggs", "quantity": 2.0}, {"food": "sour cream", "quantity": 3.0}, {"food": "ice cream swich", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 2.5}, {"food": "sugar", "quantity": 1.75}, {"food": "onion powder", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.5}, {"food": "sour cream", "quantity": 0.75}, {"food": "eggs", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "sugar", "quantity": 0.5}, {"food": "sour cream", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}], "title": "\nRed Velvet Cream Cheese Bundt Cake\n"}, {"directions": "\n\n              Heat oven to 375 degrees F.\n            \n\n              Beat the cream cheese and butter with an electric mixer on medium speed in a large bowl until fluffy, 2 to 3 minutes. Add the eggs, one at a time, beating well after each addition; mix in the raspberry liqueur.\n            \n\n              Sift the red velvet cake mix into the bowl and stir until completely blended and the mixture forms a dough. Cover and refrigerate at least 30 minutes.\n            \n\n              Line two baking sheets with parchment paper. Using your hands, roll 1 teaspoon of dough at a time into a ball, and then roll each ball in the desired decoration. Place the balls on the prepared baking sheet, about 3 inches apart. These will be baked in three batches, so it is best to keep the dough in the refrigerator while one batch is baking, and roll them right before they go into the oven.\n            \n\n              Bake until the cookies spread and the tops begin to crackle, 10 to 12 minutes. Cool the cookies on the baking sheet for 5 minutes, and then remove to a rack to cool completely.\n            \n", "ingredients": [{"food": "macaroni cheese", "quantity": 8.0}, {"food": "butter oil", "quantity": 6.0}, {"food": "eggs", "quantity": 2.0}, {"food": "silk raspberry soy yogurt", "quantity": 2.0}, {"food": "shortening cake mix", "quantity": 18.0}, {"food": "sugar", "quantity": 1}], "title": "\nRed Velvet Crinkle Cookies\n"}, {"directions": "\n\n              Make the cupcakes: Preheat the oven to 350 degrees F. Line a 12-cup muffin pan with liners. Whisk the flour, cocoa powder, baking soda, cinnamon, allspice and salt in a large bowl. Combine the granulated sugar, milk, vegetable oil, egg, vinegar, red food coloring and vanilla in a blender and blend until smooth. Add to the flour mixture and stir until combined.\n            \n\n              Divide the batter among the prepared muffin cups, filling them three-quarters of the way. Bake until the tops of the cupcakes spring back when gently pressed, 20 to 25 minutes. Let cool 5 minutes in the pan, then remove to a rack to cool completely.\n            \n\n              Meanwhile, make the frosting: Beat the cream cheese, butter, vanilla and salt in a large bowl with a mixer on medium-high speed until creamy, 2 to 3 minutes. Reduce the speed to medium low; gradually add the confectioners' sugar and beat until smooth. Increase the mixer speed to high and beat until fluffy, about 1 more minute. (If the frosting is too soft, refrigerate a few minutes before using.) Spread the frosting on the cupcakes and dip in the nonpareils; shake off any excess.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.0}, {"food": "onion powder", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "cinnamon", "quantity": 0.5}, {"food": "allspice", "quantity": 0.25}, {"food": "salt", "quantity": 0.25}, {"food": "sugar", "quantity": 0.75}, {"food": "whole milk", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 6.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "sugar", "quantity": 2.0}, {"food": "mixed nuts", "quantity": 1.0}], "title": "\nRed Velvet Cupcakes with Nonpareils\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Brush two 9-inch-round cake pans with vegetable oil; dust with flour and tap out the excess.\n            \n\n              Make the cake: Whisk the flour, cocoa powder, baking soda and salt in a medium bowl. Combine the granulated sugar, vegetable oil, buttermilk, eggs and vanilla in a large bowl; whisk until smooth. Whisk in the food coloring, then add the flour mixture and whisk until smooth.\n            \n\n              Spread 3/4 cup batter in each of the prepared pans (you'll have a very thin layer of batter); set the remaining batter aside. Bake until a toothpick inserted into the center of a cake comes out clean and the top springs back when pressed, 16 to 18 minutes. Transfer to a rack and let cool about 5 minutes in the pans, then invert the cakes onto the rack to cool completely.\n            \n\n              Meanwhile, cool the pans under cold water, then wipe clean. Brush with oil and dust with flour again. Repeat to make 2 more cake layers, using 3/4 cup batter for each, then repeat again. You will have 6 layers.\n            \n\n              Make the frosting: Beat the cream cheese, butter and salt in a stand mixer fitted with the paddle attachment on medium-high speed until fluffy. Beat in the vanilla, then beat in the confectioners' sugar in three additions until smooth.\n            \n\n              Put 1 cake layer on a serving plate and spread evenly with a scant 1 cup frosting. Repeat with the remaining 5 cake layers, then frost the top and sides of the cake with the remaining frosting in a thin layer (just enough so the nonpareils will stick). Refrigerate until the frosting is just set but still soft, about 10 minutes.\n            \n\n              Put the cake (on the plate) on a rimmed baking sheet. Cover the top and sides completely with the nonpareils, reusing the ones that fall onto the baking sheet.\n            \n\n              Photograph by Kate Mathis\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.3333333333333333}, {"food": "potato flour", "quantity": 3.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "sugar", "quantity": 1.5}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 1.0}, {"food": "eggs", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.5}, {"food": "frosting", "quantity": 1}, {"food": "macaroni cheese", "quantity": 2.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "sugar", "quantity": 5.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}], "title": "\nRed Velvet Fireworks Cake\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Whisk the cream cheese, sour cream, milk and confectioners' sugar until smooth in a medium bowl; set aside.\n            \n\n              Sift the flour, cocoa powder, baking soda, baking powder and 1/2 teaspoon salt into a large bowl. Beat the eggs and granulated sugar in a large bowl until pale yellow; beat in the buttermilk, melted butter, food coloring, vanilla and vinegar. Add the egg mixture to the flour mixture and fold just until incorporated. Transfer some of the batter to a squeeze bottle with a 1/4-inch opening.\n            \n\n              Heat a griddle or large nonstick skillet over medium-low heat. Lightly coat the hot skillet with melted butter and squeeze some of the batter onto it in the outline of a heart or hearts of the desired size. Fill in each outline with more batter; use a spatula to spread it to the edges of the heart. Cook each pancake until bubbles begin to pop on the surface, about 3 minutes. Carefully flip and cook until the bottom is set and the pancake is cooked through, 1 to 2 minutes longer. Repeat with the remaining batter.\n            \n\n              Drizzle the cream cheese mixture and maple syrup on top of the pancakes and sprinkle with pecans.\n            \n", "ingredients": [{"food": "macaroni cheese", "quantity": 4.0}, {"food": "sour cream", "quantity": 0.25}, {"food": "whole milk", "quantity": 3.0}, {"food": "sugar", "quantity": 2.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "eggs", "quantity": 2.0}, {"food": "sugar", "quantity": 0.75}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 1.25}, {"food": "butter oil", "quantity": 0.5}, {"food": "ruby red grapefruit juice blend", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "syrup", "quantity": 1}, {"food": "pecans", "quantity": 1}], "title": "\nRed Velvet Heart Pancakes\n"}, {"directions": "\n\n              Put the cream cheese in the bowl of a stand mixer fitted with a whisk attachment (or in a large bowl if using a hand mixer) and whisk on medium speed until fluffy. Add the sugar and a pinch of salt and whisk until smooth. Add the cream and vanilla and whisk just until medium-soft peaks form. Refrigerate until firm, about 2 hours.\n            \n\n              Line a 1 1/2-quart loaf pan with plastic wrap, leaving at least a 2-inch overhang on all sides. On the bottom of the loaf pan, lay 6 cookies face-down, overlapping slightly. Spread 3/4 cup of the whipped cream evenly over the cookies. Top with 3 heaping tablespoons of the chocolate. Repeat the layering two more times with 6 to 7 cookies. Place the last 6 to 7 cookies on the shaved chocolate. Fold the plastic wrap over the top of the loaf pan so the entire top layer is covered. Refrigerate overnight.\n            \n\n              To serve, turn back the plastic wrap, flip the icebox cake out onto a platter and remove the plastic. Top with the reserved chocolate and serve immediately.\n            \n\nRed Velvet Cookies:\n\n\n              Sift the flour, cocoa powder, baking soda and 1/8 teaspoon salt into a medium bowl.\n            \n\n              Beat the butter and granulated sugar in the bowl of a stand mixer fitted with a paddle attachment (or a large bowl if using a hand mixer) on medium speed just until combined. Beat in the egg yolk just until combined. Beat in the food coloring and vanilla until the color is evenly distributed, scraping down the bowl as needed. Reduce the mixer speed to low and gradually add the flour mixture. Beat just until the dough comes together. Form the dough into two 1-inch-thick disks, wrap tightly in plastic and refrigerate until firm, about 2 hours.\n            \n\n              Preheat the oven to 350 degrees F. Line two baking sheets with parchment paper.\n            \n\n              Lightly dust a sheet of parchment paper with flour. Unwrap one disk, place it on the paper and cover with a large sheet of plastic wrap. Roll the dough out to 1/8 inch thick. Peel off the plastic wrap and, using a 2 1/2-inch round cookie or biscuit cutter, cut the dough into rounds. Place them on the prepared baking sheets, spacing them 1 inch apart (about 12 cookies per sheet). Gather the scraps, chill until firm, roll again and cut. Repeat with the remaining disk.\n            \n\n              Bake the cookies until brick-red and set, 8 to 10 minutes, rotating the baking sheets halfway through. Let the cookies cool on the sheets for 3 minutes, then transfer to a wire rack to cool completely.\n            \n", "ingredients": [{"food": "macaroni cheese", "quantity": 12.0}, {"food": "sugar", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "", "quantity": 24.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "potato flour", "quantity": 1.25}, {"food": "onion powder", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 6.0}, {"food": "sugar", "quantity": 0.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.5}, {"food": "vanilla extract", "quantity": 1.0}], "title": "\nRed Velvet Ice Box Cake\n"}, {"directions": "\n\n              Sift the flour, cocoa powder, baking soda and 1/8 teaspoon salt into a medium bowl.\n            \n\n              Beat the butter and granulated sugar in the bowl of a stand mixer fitted with a paddle attachment (or a large bowl if using a hand mixer) on medium speed just until combined. Beat in the egg yolk just until combined. Beat in the food coloring and vanilla until the color is evenly distributed, scraping down the bowl as needed. Reduce the mixer speed to low and gradually add the flour mixture. Beat just until the dough comes together. Form the dough into two 1-inch-thick disks, wrap tightly in plastic and refrigerate until firm, about 2 hours.\n            \n\n              Preheat the oven to 350 degrees F. Line two baking sheets with parchment paper.\n            \n\n              Lightly dust a sheet of parchment paper with flour. Unwrap one disk, place it on the paper and cover with a large sheet of plastic wrap. Roll the dough out to 1/8 inch thick. Peel off the plastic wrap and, using a 2 1/2-inch round or square cookie or biscuit cutter, cut out the dough. Place the cut-outs on the prepared baking sheets, spacing them 1 inch apart (about 12 cookies per sheet). Gather the scraps, chill until firm, roll again and cut. Repeat with the remaining disk.\n            \n\n              Bake the cookies until brick-red and set, 8 to 10 minutes, rotating the baking sheets halfway through. Let the cookies cool on the sheets for 3 minutes, then transfer to a wire rack to cool completely.\n            \n\n              Line a rimmed baking sheet with parchment. Scoop a generous 1/4 cup ice cream into a 2 1/2-inch round or square cookie or biscuit cutter set on the parchment. Smooth the top flat and remove the cutter. Repeat with the remaining ice cream to form 12 to 14 disks or squares, spaced evenly apart. Freeze until firm, about 2 hours.\n            \n\n              Place 1 portion of ice cream on 1 cookie and top with another cookie. Trim off any ragged edges of ice cream. Repeat with the remaining cookies and ice cream. Freeze for at least 4 hours or overnight.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.25}, {"food": "onion powder", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 6.0}, {"food": "sugar", "quantity": 0.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 2.0}], "title": "\nRed Velvet Ice Cream Sandwiches\n"}, {"directions": "\n\n              Make the cake: Preheat the oven to 350 degrees F. Butter two 9-inch-round cake pans and line the bottoms with parchment paper; butter the parchment. Whisk the flour, cocoa powder, baking soda and salt in a bowl.\n            \n\n              Beat the granulated sugar, 12 tablespoons butter and the vegetable oil in a stand mixer fitted with the paddle attachment on medium-high speed until fluffy, about 4 minutes. Beat in the eggs one at a time. Beat in the food coloring, vinegar and vanilla. Reduce the mixer speed to low; add the flour mixture in 3 batches, alternating with the buttermilk, beginning and ending with the flour, until just combined.\n            \n\n              Divide the batter between the prepared pans. Bake until a toothpick inserted into the center comes out clean, 35 to 40 minutes. Let cool 10 minutes on racks, then turn the cakes out onto the racks to cool completely. Using a long serrated knife, carefully slice each cake in half horizontally to make 2 even layers.\n            \n\n              Make the frosting: Beat the cream cheese and butter in a stand mixer with the paddle attachment on medium-high speed until fluffy. Add the confectioners' sugar, lemon juice, vanilla and salt; beat until smooth.\n            \n\n              Put 1 cake layer on a platter; spread 1 1/4 cups frosting on top. Repeat to make 4 layers, ending with the cake. Cover the top and sides with a thin layer of frosting (this is the \"crumb coat\"; it doesn't have to be perfect). Chill 15 minutes, then cover with the remaining frosting.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "butter oil", "quantity": 12.0}, {"food": "potato flour", "quantity": 3.0}, {"food": "onion powder", "quantity": 3.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "sugar", "quantity": 1.75}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "eggs", "quantity": 3.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "sugar", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "salt", "quantity": 0.125}], "title": "\nRed Velvet Layer Cake\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Line 48 mini muffin cups (2 large tins or 4 small) with paper liners. \n            \n\n              Whisk together the flour, cocoa and 1/4 teaspoon of the salt in a medium bowl. Beat together the oil and granulated sugar on medium-high speed with a hand mixer in a large bowl until well combined. Add the egg and beat until well blended. Beat in the food coloring and 1/2 teaspoon of the vanilla. \n            \n\n              On low speed, alternately add the flour mixture and buttermilk in thirds, beginning and ending with the flour, beating well after each addition. Whisk together the baking soda and vinegar in a small bowl, and then beat into the batter until fully incorporated. \n            \n\n              Using a small ice cream scoop sprayed with nonstick cooking spray, evenly divide the batter among the cupcake liners. Bake until a toothpick inserted in the center of a cupcake comes out clean, 18 to 20 minutes. Remove the cupcakes from the tins and cool completely on a wire rack. \n            \n\n              Meanwhile, beat the cream cheese in a large bowl until smooth and fluffy. Sift the confectioners' sugar over the mixture and beat until smooth. Beat in the remaining 1/4 teaspoon salt and 1/2 teaspoon vanilla. Spread or pipe the frosting over the cooled cupcakes.\n            \n", "ingredients": [{"food": "wheat flour", "quantity": 1.5}, {"food": "onion powder", "quantity": 2.0}, {"food": "salt", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.75}, {"food": "sugar", "quantity": 0.75}, {"food": "egg substitute", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "sugar", "quantity": 1.0}], "title": "\nRed Velvet Mini Cupcakes\n"}, {"directions": "\n\n              Whisk the cream cheese, sour cream, milk and confectioners' sugar until smooth in a medium bowl; set aside.\n            \n\n              Sift the flour, cocoa powder, baking soda, baking powder and 1/2 teaspoon salt into a large bowl. Beat the eggs and granulated sugar in a medium bowl until pale yellow; beat in the buttermilk, melted butter, food coloring, vanilla and vinegar. Add the egg mixture to the flour mixture and fold just until incorporated.\n            \n\n              Heat a griddle or large nonstick skillet over medium-low heat. Lightly coat the hot skillet with melted butter. Pour 1/4-cupfuls of batter on the hot skillet, spaced evenly apart; use a spatula to spread out slightly if needed. Cook until bubbles begin to pop on the surface, about 3 minutes. Carefully flip and cook until the bottoms are set and the pancakes are cooked through, 1 to 2 minutes longer. Repeat with the remaining batter.\n            \n\n              To serve, drizzle the cream cheese and syrup on top of the pancakes and sprinkle with pecans.\n            \n", "ingredients": [{"food": "macaroni cheese", "quantity": 4.0}, {"food": "sour cream", "quantity": 0.25}, {"food": "whole milk", "quantity": 3.0}, {"food": "sugar", "quantity": 2.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "eggs", "quantity": 2.0}, {"food": "sugar", "quantity": 0.75}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 1.25}, {"food": "butter oil", "quantity": 0.5}, {"food": "ruby red grapefruit juice blend", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "syrup", "quantity": 1}, {"food": "pecans", "quantity": 1}], "title": "\nRed Velvet Pancakes\n"}, {"directions": "\n\n              Make the cookies: Whisk the flour, cocoa powder, baking soda and salt in a medium bowl. Beat the butter, confectioners' sugar and vanilla in a stand mixer fitted with the paddle attachment on medium speed until smooth, about 1 minute. Reduce the mixer speed to low and beat in the flour mixture in 2 additions. Add the food coloring and beat until combined. Transfer the dough to a clean surface and knead a few times. Roll into a 10-inch-long, 1-inch-diameter log; wrap in plastic wrap and freeze until firm, about 2 hours.\n            \n\n              Meanwhile, make the filling: Pulse the coconut, cream cheese, confectioners' sugar, salt and vanilla in a food processor until combined. Refrigerate until ready to use.\n            \n\n              Preheat the oven to 350 degrees F. Line 2 baking sheets with parchment paper. Remove the dough from the freezer and unwrap. Slice the dough into 1/4-inch-thick rounds and arrange about 1 inch apart on the prepared baking sheets. Bake until the cookies are firm around the edges, 8 to 10 minutes. Let cool 2 minutes on the baking sheets, then transfer to a rack to cool completely.\n            \n\n              Spread about 1 teaspoon of the filling on the flat side of half of the cookies, then sandwich with the remaining cookies.\n            \n\n              Cook's Note: If the dough feels dry after you beat in the food coloring, beat in up to 2 more tablespoons softened butter until the dough stays together when pinched and is kneadable.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "hearts of palm", "quantity": 1}, {"food": "butter oil", "quantity": 6.0}, {"food": "sugar", "quantity": 0.75}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "coconut water", "quantity": 0.75}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "hearts of palm", "quantity": 1}, {"food": "vanilla extract", "quantity": 0.5}], "title": "\nRed Velvet Sandwich Cookies\n"}, {"directions": "\n\n              For the cookies: Sift the flour, cocoa powder, baking soda and 1/8 teaspoon salt into a medium bowl.\n            \n\n              Beat the butter and granulated sugar in the bowl of a stand mixer fitted with a paddle attachment (or a large bowl if using a hand mixer) on medium speed just until combined. Beat in the egg yolk just until combined. Beat in the food coloring and vanilla until the color is evenly distributed, scraping down the bowl as needed. Reduce the mixer speed to low and gradually add the flour mixture. Beat just until the dough comes together. Form the dough into two 1-inch-thick disks, wrap tightly in plastic and refrigerate until firm, about 2 hours.\n            \n\n              Preheat the oven to 350 degrees F. Line two baking sheets with parchment paper.\n            \n\n              Lightly dust a sheet of parchment paper with flour. Unwrap one disk, place it on the paper and cover with a large sheet of plastic wrap. Roll the dough out to 1/8 inch thick. Peel off the plastic wrap and, using a 2 1/2-inch round cookie or biscuit cutter, cut the dough into rounds. Place them on the prepared baking sheets, spacing them 1 inch apart (about 12 cookies per sheet). Gather the scraps, chill until firm, roll again and cut. Repeat with the remaining disk.\n            \n\n              Bake the cookies until set and brick-red, 8 to 10 minutes, rotating the baking sheets halfway through. Let the cookies cool on the sheets for 3 minutes, then transfer to a wire rack to cool completely.\n            \n\n              For the filling: Meanwhile, in the bowl of a stand mixer fitted with a paddle attachment (or a medium bowl if using a hand mixer), beat the butter on medium speed until light and creamy. Add the cream cheese and beat until smooth and creamy, 2 to 3 minutes. Add the confectioners' sugar, vanilla and a pinch of salt and beat until smooth and fully incorporated. Refrigerate the filling until it is slightly firm, about 2 hours.\n            \n\n              To assemble the cookies, put a heaping teaspoon of filling on a cookie and top with another cookie, gently pressing to spread the filling to the edge of the cookies.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.25}, {"food": "onion powder", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 6.0}, {"food": "sugar", "quantity": 0.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "sugar", "quantity": 0.75}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "salt", "quantity": 1}], "title": "\nRed Velvet Sandwich Cookies\n"}, {"directions": "\n\n              Make the cookies: Whisk the flour, cocoa powder, baking powder and salt in a medium bowl. Beat the butter, shortening and granulated sugar in a large bowl with a mixer on medium-high speed until light and fluffy, about 2 minutes. Add the egg, vanilla and food coloring and beat until smooth and the color is fully incorporated. Reduce the mixer speed to low; add the flour mixture and beat until just combined. Cover and refrigerate until firm, about 1 hour.\n            \n\n              Position racks in the upper and lower thirds of the oven; preheat to 350 degrees F. Line 2 baking sheets with parchment paper. Roll tablespoonfuls of dough into balls and arrange 2 inches apart on the prepared baking sheets. Bake, switching the pans halfway through, until the cookies are puffed and set, 16 to 18 minutes. Let cool 2 minutes on the baking sheets, then make an indentation in each cookie using the back of a small measuring spoon. Transfer to racks to cool completely.\n            \n\n              Make the filling: Microwave the white chocolate and heavy cream in a microwave-safe bowl in 20-second intervals, stirring, until smooth. Beat the cream cheese, butter and confectioners' sugar in a bowl with a mixer on medium-high speed until smooth and fluffy, about 2 minutes. Add the white chocolate mixture, vanilla and salt and beat until smooth. Transfer to a pastry bag fitted with a star tip and pipe into the indentations in the cookies. Sprinkle with red sanding sugar. Store in the refrigerator.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.5}, {"food": "onion powder", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 6.0}, {"food": "vegetable oil", "quantity": 4.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 3.5}, {"food": "ice cream swich", "quantity": 1.5}, {"food": "macaroni cheese", "quantity": 3.0}, {"food": "butter oil", "quantity": 1.5}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "sugar", "quantity": 1}], "title": "\nRed Velvet Thumbprints\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: a pastry bag fitted with a large round tip and a plastic straw\n\n              For the cupcakes: Preheat the oven to 350 degrees F. Line a 12-cup muffin tin with paper liners.\n            \n\n              Sift the flour, granulated sugar, cocoa, baking soda and salt into a large bowl. Whisk together the buttermilk, oil, sour cream, food coloring, vinegar, vanilla and egg in another large bowl. \n            \n\n              Add the buttermilk mixture to the flour mixture and stir until just incorporated. Divide the batter among the cupcake liners. Bake until a toothpick inserted in the center of a cupcake comes out with a few moist crumbs, 16 to 18 minutes. Remove the cupcakes from the tin and cool completely on a wire rack.  \n            \n\n              Microwave the chocolate and coconut oil together in a small microwave-safe bowl until mostly melted, about 1 minute. Stir, then microwave again until completely smooth, about 15 seconds more. \n            \n\n              Use a small sharp knife to cut out and remove a plug from the middle of each cupcake, making sure not to go all the way to the bottom and leaving a 1/4-inch border around the side (eat the plugs). Brush the holes with the melted chocolate and place in the freezer until the chocolate hardens, about 15 minutes. \n            \n\n              Whisk together the jam, 1 drop of red food coloring and 1 tablespoon water in a small bowl until completely smooth. Spoon 1 tablespoon of the jam into each of the chocolate holes; set aside. \n            \n\n              For the cream cheese frosting: Meanwhile, beat the cream cheese in a large bowl with an electric mixer on medium speed until smooth and fluffy, about 2 minutes. Gradually beat in the butter until smooth. Add the confectioners' sugar and vanilla and beat until light and fluffy, about 1 minute. Scrape into a pastry bag fitted with a large round tip. Pipe on top of the cupcakes so the jam is covered. \n            \n\n              Poke 2 holes into the frosting on each cupcake using the end of a plastic straw to resemble vampire bites, making sure you hit the cupcake and not the jam-filled hole. Drizzle the remaining jam into the holes to resemble blood. \n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.75}, {"food": "sugar", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "salt", "quantity": 0.5}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "sour cream", "quantity": 0.5}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "silk raspberry soy yogurt", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "butter oil", "quantity": 6.0}, {"food": "sugar", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.5}], "title": "\nRed Velvet Vampire Cupcakes\n"}, {"directions": "\n\n              Make the cookies: Preheat the oven to 375 degrees F. Line 2 large baking sheets with parchment paper. Combine the semisweet and milk chocolate in a microwave-safe bowl and microwave at 50 percent power until melted, about 2 minutes. Whisk until smooth.\n            \n\n              Whisk the melted butter, sour cream, eggs, vinegar, vanilla and food coloring in a bowl until combined. In another bowl, whisk the flour, sugar, cocoa powder, baking powder, baking soda and salt.\n            \n\n              Add the flour mixture to the butter mixture in four equal batches, whisking each batch completely before adding the next. Stir in the melted chocolate.\n            \n\n              Scoop heaping tablespoonfuls of batter onto the prepared baking sheets and smooth the tops with a damp finger. Bake until the cookies spring back when lightly pressed, 8 to 10 minutes. Let cool 10 minutes on the baking sheets, then transfer to racks to cool completely.\n            \n\n              Meanwhile, make the filling: Beat the cream cheese and butter with a mixer until smooth. Beat in the confectioners' sugar and vanilla seeds. Sandwich a heaping tablespoonful of filling between 2 cookies; repeat with the remaining cookies and filling. Refrigerate 30 minutes before serving.\n            \n\n              Photograph by Kate Mathis\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "butter oil", "quantity": 12.0}, {"food": "sour cream", "quantity": 0.5}, {"food": "eggs", "quantity": 2.0}, {"food": "vinegar", "quantity": 1.5}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "potato flour", "quantity": 2.25}, {"food": "sugar", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "butter oil", "quantity": 3.0}, {"food": "sugar", "quantity": 2.5}, {"food": "vanilla extract", "quantity": 1.0}], "title": "\nRed Velvet Whoopie Pies\n"}, {"directions": "\n\n              Scrape off and discard the frosting from the cupcakes; crumble the cupcakes into crumbs. Press all but 1/4 cup crumbs into the bottom and up the sides of a 9-inch deep-dish pie plate. Freeze 30 minutes.\n            \n\n              Meanwhile, let the ice cream and sorbet soften at room temperature, about 15 minutes. Spread the ice cream evenly over the crust using an offset spatula or rubber spatula; spread the sorbet on top. (Return the pie to the freezer between layers if the ice cream gets too soft.) Freeze while you make the whipped cream.\n            \n\n              Beat the heavy cream and confectioners' sugar in a large bowl with a mixer on medium-high speed until soft peaks form, about 3 minutes. Top the pie with the whipped cream and sprinkle the reserved cupcake crumbs around the edge. Freeze until firm, at least 4 hours or overnight.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "ruby red grapefruit juice blend", "quantity": 4.0}, {"food": "ice cream swich", "quantity": 1.5}, {"food": "blueberry muffin mix", "quantity": 1.5}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "sugar", "quantity": 2.0}], "title": "\nRed Velvet-Blueberry Ice Cream Pie\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Butter an 11-by-17-inch rimmed baking sheet and line with parchment paper; butter the parchment and dust with flour. \n            \n\n              Bring the cola to a simmer in a medium skillet over medium-high heat and cook until reduced to 1/2 cup, 10 to 12 minutes. Let cool. Whisk the flour, cocoa powder, baking powder, baking soda and salt in a bowl.\n            \n\n              In a separate large bowl, whisk the granulated sugar, vegetable oil, buttermilk, eggs, food coloring, almond and vanilla extracts, and the cola syrup. Stir the dry ingredients into the wet ingredients until just combined. Spread the batter on the prepared baking sheet; bake until the cake pulls away from the pan, about 15 minutes. Let cool on the pan on a rack, 5 minutes. \n            \n\n              Dust a kitchen towel (not terry cloth) with confectioners' sugar. Invert the cake onto the towel and peel off the parchment. Trim the cake edges. Starting with a short end, roll up the cake around the towel; let cool completely on a rack. \n            \n\n              Make the filling: Whisk the cream cheese, 1/2 cup cream and the almond extract in a large bowl. Beat the remaining 1 cup cream and the confectioners' sugar with a mixer until soft peaks form; gradually fold into the cream cheese mixture. Chill until ready to use.\n            \n\n              Unroll the cooled cake. Spread with the filling, then gently reroll the cake and transfer to a platter. Dust with confectioners' sugar. \n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 1}, {"food": "potato flour", "quantity": 1.5}, {"food": "", "quantity": 2.0}, {"food": "onion powder", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "sugar", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.3333333333333333}, {"food": "eggs", "quantity": 3.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "sugar", "quantity": 1}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "ice cream swich", "quantity": 1.5}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "vanilla extract", "quantity": 0.5}], "title": "\nRed Velvet-Cherry Cake Roll\n"}, {"directions": "\n\n              Try this grown-up take on fruit punch: Combine 1 bottle red wine, 6 ounces brandy, 6 ounces raspberry or orange liqueur and the juice of 2 lemons in a large pitcher and refrigerate at least 2 hours or overnight. Serve over ice and garnish with raspberries and orange slices.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [], "title": "\nRed Wine Punch\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F and line a 12-cup muffin pan with paper liners. Set aside.\n            \n\n              For the cupcakes: Whisk together the flour, baking soda and salt in a medium bowl and set aside. Heat the milk in a small saucepan until hot, but not boiling, and pour the milk over the cocoa powder in a large bowl. Whisk the mixture until it is smooth and cools slightly. Add the sugar, oil, vanilla and egg to the milk mixture and whisk until smooth. Add the flour mixture, and stir, with a rubber spatula, until well combined (take care not to overmix). \n            \n\n              Divide the batter evenly among the prepared muffin cups. Bake until the tops spring back when pressed lightly, 20 to 22 minutes. Transfer the pan to a rack and let cool for 5 minutes, then transfer the cupcakes to the rack to cool a bit more, about 20 minutes.\n            \n\n              Meanwhile, make the wine syrup: Bring the wine and sugar to a boil over medium heat in a small saucepan. Reduce the wine to 1/2 cup, 12 to 15 minutes. Transfer the wine syrup to a small bowl. \n            \n\n              While the cupcakes are still slightly warm, poke the top of each 2 times with a fork and slowly drizzle in a generous teaspoon of the wine syrup. Set aside the remaining wine syrup. \n            \n\n              For the ganache: Pour the cream into the saucepan used for the wine syrup and bring it to a simmer. Put the chocolate in a medium bowl. Pour the cream over it and whisk until smooth. Add the remaining wine syrup and stir until combined. Let the ganache cool until thickened slightly and the consistency of heavy cream, about 3 minutes. \n            \n\n              Spoon a tablespoon of ganache on each cupcake and use the back of the spoon to spread it evenly. Place the cupcakes on a rack and allow the ganache to set, about 15 minutes.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "milk", "quantity": 0.75}, {"food": "onion powder", "quantity": 0.5}, {"food": "sugar", "quantity": 0.75}, {"food": "vegetable oil", "quantity": 0.75}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 2.0}, {"food": "sugar", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 0.25}], "title": "\nRed Wine-Chocolate Cupcakes\n"}, {"directions": "\n\n              Preheat the broiler. Place the bell peppers on a large baking sheet and broil, turning, until the bell peppers have blackened, about 5 minutes. Transfer to a bowl and cover with plastic wrap. Let stand until cooled.\n            \n\n              While the peppers cool, make the creamy garlic lime dip. Stir the sour cream, lime juice, cilantro, coriander, zest, garlic, 1/2 teaspoon salt and 1/4 teaspoon pepper in a small bowl until smooth. Stir in 1 to 2 tablespoons of water to adjust the consistency to your liking.\n            \n\n              Rub the skin off the bell peppers and remove the stem and seeds. Put in the bowl of a food processor or the carafe of a blender. Add the tomato, piquante peppers, onion, lime juice, cumin, 1/2 teaspoon salt and 1/4 teaspoon pepper. Pulse until chunky. Transfer to a serving bowl and season with the hot sauce, salt and pepper.\n            \n\n              Serve the blue corn tortilla chips with the red pepper sauce and white dip.\n            \n", "ingredients": [{"food": "ruby red grapefruit juice blend", "quantity": 2.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 0.3333333333333333}, {"food": "onion powder", "quantity": 0.25}, {"food": "lime juice", "quantity": 1.0}, {"food": "cumin seed", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "Worcestershire sauce", "quantity": 0.375}, {"food": "sour cream", "quantity": 1.5}, {"food": "lime juice", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "ground turkey", "quantity": 0.5}, {"food": "lime", "quantity": 0.5}, {"food": "garlic powder", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "corn bran", "quantity": 1}], "title": "\nRed and White Double Dippers with Blue Corn Chips\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Brush an 11-by-17-inch jelly roll pan or rimmed baking sheet with vegetable oil and line with parchment paper; brush the paper with oil and dust with flour, tapping out the excess.\n            \n\n              Make the cake: Whisk the flour, baking powder, baking soda and salt in a medium bowl. Whisk the granulated sugar, vegetable oil, milk, eggs and vanilla in a large bowl. Add the flour mixture in 2 batches, whisking until incorporated. Transfer half of the batter (about 1 1/2 cups) to a separate bowl. Tint one batch red and the other batch blue with the food coloring.\n            \n\n              Spread the red and blue batters across the width of the prepared pan in alternating stripes, making each stripe about 2 inches wide (don't worry if the stripes aren't perfectly straight). Bake until the top springs back when pressed, 12 to 15 minutes. Let cool about 3 minutes in the pan. Dust with confectioners' sugar and spread a clean kitchen towel (not terry cloth) on top. Place a cooling rack on the towel, then invert the cake onto the rack; peel off the parchment. Roll up the cake and towel together, starting at a short end. Let cool completely on the rack, about 1 1/2 hours.\n            \n\n              Make the frosting: Beat the butter and salt in a large bowl with a mixer on medium speed until creamy, about 1 minute. Add the marshmallow cream and vanilla; beat on medium-high speed until fluffy, 2 to 3 more minutes. Beat in the confectioners' sugar, then beat in the milk (the frosting should be spreadable).\n            \n\n              Gently unroll the cake (don't worry if the ends are still curled up). Spread with half of the frosting all the way to the edges. Reroll the cake (without the towel) and trim the ends. Cover with the remaining frosting.\n            \n\n              Photograph by Kate Mathis\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.5}, {"food": "potato flour", "quantity": 1.6666666666666665}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "sugar", "quantity": 1.25}, {"food": "milk", "quantity": 0.5}, {"food": "eggs", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "sugar", "quantity": 1}, {"food": "frosting", "quantity": 1}, {"food": "butter oil", "quantity": 3.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "ice cream swich", "quantity": 3.0}, {"food": "sugar", "quantity": 1.0}, {"food": "milk", "quantity": 0.25}], "title": "\nRed, White and Blue Cake Roll\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: a 10-inch springform pan and a wooden skewer\n\n              Position a rack in the middle of the oven and preheat to 325 degrees F.\n            \n\n              For the crust: Toss together the graham cracker crumbs, butter, sugar and salt in a medium bowl. Press into the bottom of a 10-inch springform pan. Bake until golden brown, 15 to 18 minutes. Cool completely. Wrap the bottom and sides of pan up with a large piece of foil and put in a large roasting pan.\n            \n\n              For the filling: Beat together the cream cheese and sugar, in a large bowl, with an electric mixer on medium speed for 1 minute. Add the sour cream, and beat until just combined. Add the heavy cream and beat until just combined. Mix in the eggs, by hand, 1 at time. Mix in the vanilla and lemon juice, by hand, until just combined. (Take care not to overmix, or the cheesecake will turn into a soufflé!). \n            \n\n              Ladle out 2 cups of cheesecake batter and divide between 2 bowls. Color 1 bowl with red food coloring and 1 with blue food coloring. Leave the remaining batter white. \n            \n\n              Use an ice cream scoop or large spoon, and drop scoopfuls of the batter onto the crust, alternating between the different colors until all the batter is gone. Use a long wooden skewer and drag it through the batter, making sure the skewer reaches down to the bottom of the pan, in 4 swipes, to marble the colors for a tie dye effect. Transfer the springform pan to the roasting pan. Add enough hot water to come about halfway up the side of the springform pan.\n            \n\n              Bake until the outside of the cake is set, but the center is still slightly loose, about 1 hour 20 minutes. Turn the oven off and leave the cheesecake in the oven for another hour. Remove the cheesecake from the roasting pan to a cooling rack. Run a knife around the edge and cool to room temperature. Cover and refrigerate at least 8 hours. \n            \n\n              Unmold the cheesecake and transfer to a serving plate or cake stand.\n            \n", "ingredients": [{"food": "crackers", "quantity": 2.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "whipped cream substitute", "quantity": 11.0}, {"food": "sugar", "quantity": 1.25}, {"food": "sour cream", "quantity": 16.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "eggs", "quantity": 4.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "barley flour or meal", "quantity": 0.5}], "title": "\nRed, White and Blue Cheesecake\n"}, {"directions": "\n\n              Combine the ginger, honey and 1 cup water in a small saucepan. Bring to a boil, remove from the heat and let sit until cooled to room temperature. Drain, discarding the ginger, and stir in the lime juice.\n            \n\n              Put the watermelon in a large bowl, and add the ginger-honey syrup. Cover and refrigerate to chill, at least 1 hour up to 4 hours, tossing the watermelon occasionally.\n            \n\n              Meanwhile, preheat the oven to 350 degrees F. Spread the coconut out on a baking sheet, and bake until lightly golden, 6 to 8 minutes; let cool.\n            \n\n              When ready to serve, drain most of the liquid off the watermelon. Add the blueberries and lime zest, and toss to combine. Sprinkle with the toasted coconut.\n            \n", "ingredients": [{"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "honey smoked ham", "quantity": 4.0}, {"food": "lime juice", "quantity": 1.0}, {"food": "watermelon seed krnls", "quantity": 8.0}, {"food": "coconut water", "quantity": 0.5}, {"food": "blueberries", "quantity": 1.0}], "title": "\nRed, White and Blue Fruit Salad\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: star-shaped cookie cutter\n\n              Spray two half baking sheets and a quarter baking sheet with cooking spray. Set aside in the refrigerator.\n            \n\n              For the strawberry layer: Combine the hot water, plain and strawberry gelatin. Once thoroughly combined, pour the strawberry layer into one of the half baking sheets in the refrigerator. After 15 minutes of cooling, add some strawberry slices, if desired. Allow the gelatin to cool until set, about 2 hours.\n            \n\n              For the white layer: Combine the hot water, sweetened and unsweetened coconut milk, whole milk and plain gelatin. Once thoroughly combined, pour the white layer into the other half baking sheet in the refrigerator. Allow to cool until set, about 2 hours.\n            \n\n              For the blue layer: Combine the hot water and the blue and plain gelatin. Once thoroughly combined, pour the blue layer into the quarter baking sheet in the refrigerator.\n            \n\n              Once the layers are set, remove them from the refrigerator.\n            \n\n              Turn the red layer out onto a parchment-lined platter or cutting board. Slice two-thirds of the white layer into strips and reserve the remaining third to punch out stars with a star-shaped cookie cutter. Top the red layer with the white stripes. With the widest side of the blue layer facing you, cut the layer in half from the top of the baking sheet to the bottom. Add one portion of the blue layer on top of the white stripes on the top left portion of the flag. Top the blue layer with the white stars. Using a piping bag fitted with a star tip, pipe out a whipped cream border and top with blueberries.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "coconut water", "quantity": 8.0}, {"food": "silk plain soy yogurt", "quantity": 5.0}, {"food": "silk strawberry soy yogurt", "quantity": 4.0}, {"food": "strawberries", "quantity": 1}, {"food": "coconut milk", "quantity": 3.0}, {"food": "coconut milk", "quantity": 3.0}, {"food": "whole milk", "quantity": 2.0}, {"food": "silk plain soy yogurt", "quantity": 8.0}, {"food": "coconut water", "quantity": 4.5}, {"food": "", "quantity": 4.0}, {"food": "silk plain soy yogurt", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1}, {"food": "", "quantity": 1}], "title": "\nRed, White and Blue Gelatin Flag\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: a disposable pastry bag; a small paintbrush or wooden skewer\n\n              Position oven racks in the bottom third of the oven and preheat to 250 degrees F. Line a baking sheet with parchment.\n            \n\n              Beat together the egg whites and salt, in a large bowl, with an electric mixer on medium-high speed until foamy. Add the cream of tartar and continue to beat until soft peaks form. While beating, add the sugar 1 tablespoon at a time. Continue to beat until stiff peaks form. \n            \n\n              Put the pastry bag in a large and tall deli or plastic container and fold the top over the container so you can see clearly into the bag and it stands upright. Dip the paintbrush or wooden skewer in to the red food coloring. Starting from the bottom of the bag, brush a thin stroke of food coloring from the tip to the top of the bag. Repeat on the opposite side of the bag with the blue food coloring. Fill the bag with the meringue. Try to spoon it directly into the center so as not to disturb the food coloring. Snip the bottom of the bag with scissors so you have a 3/4- to 1-inch opening. Pipe 1-inch-diameter mounds of meringue spaced 1-inch apart onto the prepared baking sheet.\n            \n\n              Bake until the meringues are no longer glossy and feel light and dry when picked up, about 1 hour. Open the oven for a few minutes, then turn it off and shut the door. Leave the meringues in the oven until they are completely dry inside, about 2 hours. The meringues can be stored in an airtight container at room temperature for up to 2 days. \n            \n\n              To decorate them, combine the white chocolate chips and coconut oil and in a large microwave safe bowl. Microwave on high for 1 to 2 minutes, stirring every 30 seconds, until melted.\n            \n\n              Carefully dip the bottom of each meringue into the melted white chocolate, letting any excess drip off. Dip in sprinkles or sanding sugar and place on a baking sheet lined with parchment. Let set completely, about 1 hour. \n            \n", "ingredients": [{"food": "egg substitute", "quantity": 2.0}, {"food": "salt", "quantity": 0.125}, {"food": "ice cream swich", "quantity": 0.25}, {"food": "sugar", "quantity": 1.0}, {"food": "", "quantity": 1}, {"food": "baking chocolate", "quantity": 11.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}], "title": "\nRed, White and Blue Meringues\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Put the potatoes in a medium pot and cover with cold water. Add 1 tablespoon of the vinegar and 1 tablespoon salt. Bring to a boil over medium-high heat and continue to boil until tender, about 15 minutes. Drain well and cool. Whisk the remaining 2 tablespoons vinegar with the Dijon mustard, 1/2 teaspoon salt, 1/4 teaspoon black pepper and the sugar in a small bowl. Pour in the olive oil and whisk until combined. Spread the potatoes in a single layer on a large serving plate and top with the pieces of hearts of palm. Scatter the piquillo peppers over top and drizzle with the dressing. Sprinkle with the scallion and salt and pepper to taste.\n            \n", "ingredients": [{"food": "mixed nuts", "quantity": 28.0}, {"food": "vinegar", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "sugar", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "hearts of palm", "quantity": 14.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}], "title": "\nRed, White and Blue Potato Salad\n"}, {"directions": "\n\n              For the blue layer: Pour the pomegranate juice into the blender. Add the bananas, blueberries, ice and honey and blend until smooth. Pour into the bottoms of four 8-ounce glasses and tap the glasses on the countertop to help even the layer. Freeze while preparing the next layer.\n            \n\n              For the white layer: Rinse out the blender and pour in the orange juice. Add the ice, yogurt and bananas and blend until smooth. Pour the white layer on top of the blue layer in the glasses, again tapping the glasses on the countertop, and then return to the freezer.\n            \n\n              For the red layer: Rinse the blender once more and pour in the pomegranate juice. Add the strawberries, bananas and ice and blend until smooth. Pour the red layer on top of the white layer. Keep in the freezer until ready to serve.\n            \n", "ingredients": [{"food": "pomegranate", "quantity": 4.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}, {"food": "blueberries", "quantity": 0.5}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "honey smoked ham", "quantity": 1.0}, {"food": "orange juice", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "silk plain soy yogurt", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "pomegranate", "quantity": 2.25}, {"food": "strawberries", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}, {"food": "ice cream swich", "quantity": 0.5}], "title": "\nRed, White and Blue Smoothie\n"}, {"directions": "\n\n              Toss the cabbage, onion, bacon, blueberries, mayonnaise, vinegar and sugar in a large bowl and toss to coat with the dressing. Cover and refrigerate 1 to 4 hours.\n            \n\n              Stir in the pecans and season with salt and pepper just before serving. Sprinkle with reserved the bacon, berries and nuts.\n            \n", "ingredients": [{"food": "swamp cabbage", "quantity": 1.5}, {"food": "onion powder", "quantity": 1.5}, {"food": "bacon", "quantity": 6.0}, {"food": "blueberries", "quantity": 0.5}, {"food": "mayonnaise dressing", "quantity": 0.5}, {"food": "vinegar", "quantity": 2.0}, {"food": "sugar", "quantity": 1.0}, {"food": "pecans", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}], "title": "\nRed, White and Blueberry Coleslaw\n"}, {"directions": "\n\n              Trim and quarter the strawberries and set aside. Combine the blueberries, blackberries, 1/2 cup granulated sugar, 1/3 cup water, lemon zest, juice and salt in a medium saucepot. Bring to a simmer over medium heat and continue to cook, stirring occasionally, until the berries break down and the sauce thickens, 15 to 20 minutes. Remove from the heat and cool. \n            \n\n              Place the cream cheese, 1/4 cup cream, the remaining 1/4 cup granulated sugar and the vanilla extract in a large bowl and beat on medium speed until smooth and fluffy. In a second large bowl, whip the remaining cream until stiff peaks form. Fold about one-quarter of the whipped cream into the cream cheese mixture until lightened, and then fold in the remaining whipped cream. \n            \n\n              To assemble the trifle, rip or cut the angel food cake into 2-inch pieces. Place half the cake pieces in the bottom of a 12-to-14-cup trifle dish or large bowl. Top with about half the blueberry sauce, half the cream and half the quartered strawberries. Repeat the layers with the remaining cake, berry sauce, cream and strawberries. Cover with plastic wrap and chill 8 hours or overnight. Before serving either dust with confectioners' sugar or heat the apple jelly in the microwave for 25 seconds to loosen, and then brush over the strawberries.\n            \n", "ingredients": [{"food": "strawberries", "quantity": 16.0}, {"food": "blueberries", "quantity": 6.0}, {"food": "blackberries", "quantity": 6.0}, {"food": "sugar", "quantity": 0.75}, {"food": "lemon juice", "quantity": 0.5}, {"food": "lemon juice", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "rice cake", "quantity": 1.0}, {"food": "sugar", "quantity": 1}, {"food": "apple", "quantity": 1.5}], "title": "\nRed, White and Blueberry Trifle\n"}, {"directions": "\n\n              In separate bowls, prepare two 17.5-ounce bags sugar cookie mix as the label directs for cut-out cookies; beat 3/4 teaspoon red gel food coloring into one batch and 3/4 teaspoon blue gel food coloring into the other. Form each batch into a 14-inch log, wrap in plastic wrap and freeze until firm, about 30 minutes. Slice the logs into 1/4-inch-thick rounds and bake as directed; let cool. To assemble, layer the cookies with whipped cream on a platter, alternating colors. Refrigerate up to 2 hours so the cookies soften (but don't bleed). Sprinkle with red sanding sugar.\n            \n\n              Photograph by Jeff Harris\n            \n", "ingredients": [], "title": "\nRed, White and Woohoo!\n"}, {"directions": "\n\n              Prepare a basic sugar cookie dough; roll out and cut into strips. Sprinkle with red sanding sugar and bake as usual.\n            \n\n              Photograph by Jonathan Kantor\n            \n", "ingredients": [], "title": "\nRed-Carpet Cookies\n"}, {"directions": "\n\n              Toppings: Red-cabbage slaw and crumbled bacon on red potato skins\n            \n\n              How to Make Classic Potato Skins:\n            \n\n              Pierce 4 large russet potatoes with a fork. Bake directly on the oven rack at 350 degrees until tender, about 1 hour. Let cool, then quarter lengthwise and scoop out the flesh, leaving a 1/4-inch shell. Brush both sides with melted butter and season with salt and pepper. Bake, skin-side up, at 450 degrees until crisp, about 15 minutes. Add your favorite team toppings. (For cheesy skins, flip the baked shells over before topping, sprinkle with 1 cup grated cheddar cheese and bake an extra 5 minutes.)\n            \n\n              Photograph by Karl Juengel/Studio D\n            \n", "ingredients": [], "title": "\nRed-Slaw Skins Potato Skins\n"}, {"directions": "\n\n              Turn summer drinks into firecrackers by coating the glass rims with Pop Rocks. Just dampen with lemon juice, then dip the rims in the candies on a plate. To get the red-white-and-blue effect, use Tropical Punch (blue) Pop Rocks, then fill the glasses with any red drink or cocktail; we mixed pomegranate and cranberry juice with seltzer.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [], "title": "\nRed-White-and-Blue Cocktails\n"}, {"directions": "\n\n              Boil 1/4 cup balsamic vinegar, 2 tablespoons brown sugar and the juice of 1 lemon in a saucepan until thickened, about 5 minutes. Whisk in 2/3 cup olive oil and season with salt and pepper. Combine torn frisee, romaine lettuce and red endive in a large bowl. Add sliced red onion, scallions, parsley and candied walnuts. Toss with the dressing.\n            \n\n              Photograph by Anna Williams\n            \n", "ingredients": [], "title": "\nRed-and-Green Salad\n"}, {"directions": "\n\n              Reserve about a third of the beans. Mash the rest of the beans in a medium bowl with a large fork. Set aside. \n            \n\n              Heat the oil in a medium skillet over medium-high heat. Add the onion, and cook until lightly browned, about 4 minutes. Add the garlic and continue to cook, stirring, until lightly browned. Add the spices and cook until fragrant about 1 minute. \n            \n\n              Add the mashed beans and half the broth; cook, stirring frequently, until slightly thickened, about 5 minutes. Add the reserved beans and the enough of the remaining broth to loosen up the beans. Simmer until the beans are thick but not pasty, about 2 minutes more. Season with salt and pepper to taste. Stir in the fresh coriander, if desired, and serve.\n            \n", "ingredients": [{"food": "fava beans", "quantity": 15.5}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "garlic powder", "quantity": 4.0}, {"food": "ground turkey", "quantity": 1.0}, {"food": "cumin seed", "quantity": 0.5}, {"food": "diced chicken", "quantity": 0.6666666666666666}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 1.0}], "title": "\nRefried Beans\n"}, {"directions": "\n\n              Heat 1/4 cup lard or vegetable oil in a large skillet over medium heat. Add 1/2 diced onion and cook, stirring, until soft, about 3 minutes. Add two 15-ounce cans black beans (drained), 1 cup chicken broth and 1/2 teaspoon dried Mexican oregano. Cook, lightly mashing the beans, until the liquid is absorbed, about 5 minutes. Add 1 more cup chicken broth and cook until slightly saucy, about 7 minutes. (Stir in a splash of water if the beans are too thick.) Season with salt and pepper and top with crumbled Cotija cheese.\n            \n\n              Photograph by Linda Xiao\n            \n", "ingredients": [], "title": "\nRefried Beans\n"}, {"directions": "\n\n              Cook 4 chopped bacon slices and 1 chopped onion in olive oil over medium heat, 7 minutes. Add 1/2 cup chopped cilantro, 2 minced garlic cloves, 1 minced seeded jalapeno and 1/2 teaspoon each ground cumin, dried oregano and kosher salt. Cook, stirring, 5 minutes. Add two 14.5-ounce cans pinto beans (drained and rinsed) and 2 1/2 cups water. Cook, mashing, 7 minutes. Stir in more cilantro and hot sauce.\n            \n", "ingredients": [], "title": "\nRefried Pinto Beans\n"}, {"directions": "\n\n              Combine 1 1/2 ounces vodka, 2 ounces apple cider, 1 pinch ground ginger, 1 pinch powdered chai tea mix (optional), 1 ounce merlot and a splash of lime juice in a shaker filled with ice. Shake vigorously, then strain into a martini glass. Garnish with an apple slice.\n            \n\n              Photograph by James Wojcik\n            \n", "ingredients": [], "title": "\nResolution Cocktail\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F. Combine the cream cheese, mayonnaise, ketchup, horseradish and relish in a food processor and puree until smooth; transfer to a large bowl. Stir in the Swiss cheese, corned beef, sauerkraut and chives.\n            \n\n              Spread the dip in a 1-quart baking dish and bake until browned and bubbling, about 15 minutes. Serve with bread.\n            \n\n              Photograph by Andrew Purcell\n            \n", "ingredients": [{"food": "macaroni cheese", "quantity": 1.0}, {"food": "mayonnaise dressing", "quantity": 0.5}, {"food": "", "quantity": 2.0}, {"food": "horseradish", "quantity": 1.0}, {"food": "pickle relish", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 2.0}, {"food": "frankfurter beef", "quantity": 2.0}, {"food": "sauerkraut", "quantity": 0.5}, {"food": "chives", "quantity": 0.25}, {"food": "garlic bread", "quantity": 1}], "title": "\nReuben Dip\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 400 degrees F. Line a baking sheet with parchment.\n            \n\n              Whisk together the mayonnaise, ketchup, horseradish, onion powder, Worcestershire sauce, hot sauce and a pinch of salt in a small bowl. Season with additional salt if needed. Set aside\n            \n\n              Stir the baking soda into 1/3 cup of super-hot tap water until dissolved. Set aside. \n            \n\n              Put the sauerkraut into a large kitchen towel and wring it out over the kitchen sink to remove any excess liquid. Set aside. \n            \n\n              Sprinkle the dough all over with the caraway seeds then roll into a 20-by-14-inch rectangle on a lightly floured work surface. Some of the caraway seeds will fall away from the dough, but a lot of the seeds should work in as you roll it out. Arrange the pastrami evenly on one half of the dough, starting on the shorter end and leaving a 1-inch border on the sides. Spread half the sauce over the pastrami. Separate the cheese pieces and shingle them over the sauce. Scatter the sauerkraut on top. Working from the short side, tightly roll up the dough into a log, jelly roll-style. Pinch the open ends together to seal, then tuck them underneath the log.\n            \n\n              Transfer the log, seam side-down, onto the prepared baking sheet and brush all over with the baking soda wash (you will not use all the wash). Bake, rotating the pan halfway through, until the bread is deep golden brown, 40 to 50 minutes.\n            \n\n              Let the bread cool for 10 minutes. Slice into 8 pieces and serve warm with the remaining sauce.\n            \n", "ingredients": [{"food": "mayonnaise dressing", "quantity": 0.5}, {"food": "", "quantity": 0.25}, {"food": "horseradish", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "Worcestershire sauce", "quantity": 0.5}, {"food": "Worcestershire sauce", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "sauerkraut", "quantity": 2.0}, {"food": "potato flour", "quantity": 1}, {"food": "seeds", "quantity": 2.0}, {"food": "pizza rolls", "quantity": 1.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 8.0}], "title": "\nReuben Garbage Bread\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F and line a baking sheet with parchment paper. Combine the sauerkraut and relish in a small bowl; set aside.\n            \n\n              Unroll the crescent dough and pinch the seams together with your fingers. Cut the dough in half lengthwise, then slice each half crosswise into 12 strips. Spread about 1 teaspoon of the sauerkraut-relish mixture on each strip of dough, leaving a 1/2-inch border on one short end. Sprinkle with the cheese. Place 1 frank on each strip of dough and roll the dough around the frank, pressing lightly to seal.\n            \n\n              Transfer to the baking sheet seam-side down; brush with the beaten egg and sprinkle with caraway seeds. Bake until the dough is golden brown, about 15 minutes. Serve with Thousand Island dressing and/or mustard.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "sauerkraut", "quantity": 0.5}, {"food": "pickle relish", "quantity": 3.0}, {"food": "smoked turkey roll", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 2.5}, {"food": "low fat big franks", "quantity": 24.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "seeds", "quantity": 1}, {"food": "dressing", "quantity": 1}], "title": "\nReuben Pigs in Blankets\n"}, {"directions": "\n\n              Cook 1 chopped onion, 1/2 cup chopped sauerkraut and 1 teaspoon caraway seeds in a saucepan with olive oil until browned, about 8 minutes. Stir in 2 tablespoons each mayonnaise and ketchup, 2 teaspoons sweet pickle relish, a dash of Worcestershire sauce and 1/2 cup grated Swiss cheese.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [], "title": "\nReuben Sauce\n"}, {"directions": "\n\n              Rinse the clams several times under cold running water. Transfer to a large pot and add 3 1/2 cups water. Bring to a simmer over medium heat, then cover and cook until the clams open, about 8 minutes. Remove the clams with a slotted spoon and transfer to a deep bowl as they open; cover with plastic wrap so they don't dry out. Strain the broth through a fine-mesh sieve into a large bowl. Wipe out the pot, then pour the strained broth back into the pot. \n            \n\n              Meanwhile, put the bacon in a large skillet and cover with about 2 inches of water. Bring to a simmer over medium heat and cook 10 minutes; drain, then return the bacon to the skillet. Add 1 tablespoon butter and cook until the bacon starts to brown, about 5 minutes. Transfer the bacon to the pot with the broth. Wipe out the skillet. Add the remaining 1 tablespoon butter, the onion and celery to the skillet and cook over medium heat until the onion is translucent, about 6 minutes.\n            \n\n              Add the onion and celery mixture to the broth along with the potatoes. Bring to a simmer over medium heat and cook until the potatoes are tender, 10 to 12 minutes. Remove from the heat. Stir in the Worcestershire sauce and 1/2 teaspoon white pepper. \n            \n\n              While the potatoes are cooking, remove the clams from their shells and roughly chop. \n            \n\n              Add the clams to the soup and cook until heated through, about 1 minute. Ladle the soup into bowls and top with chopped parsley.\n            \n\n              Per serving: Calories: 434; Total Fat: 23 grams; Saturated Fat: 9 grams; Protein: 21 grams; Total carbohydrates: 37 grams; Sugar: 2 grams; Fiber: 3 grams; Cholesterol: 65 milligrams; Sodium: 858 milligrams \n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [{"food": "", "quantity": 24.0}, {"food": "bacon", "quantity": 5.5}, {"food": "butter oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "sweet potatoes", "quantity": 1.5}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "martha white foods", "quantity": 1}, {"food": "parsley", "quantity": 1}], "title": "\nRhode Island Clam Chowder\n"}, {"directions": "\n\n              Combine the rhubarb, sugar, honey, butter and cinnamon in a large microwave-safe bowl. Cover with plastic wrap and pierce once or twice to allow steam to escape. Microwave until the rhubarb is tender, about 6 minutes. Carefully remove the plastic wrap and stir.\n            \n\n              Meanwhile, break the shredded wheat into smaller pieces in a bowl. Dust with confectioners' sugar and cinnamon.\n            \n\n              Spoon the rhubarb compote into bowls, top with ice cream and sprinkle with the shredded wheat.\n            \n\n              Photograph by Jonny Valiant\n            \n", "ingredients": [{"food": "butter oil", "quantity": 3.0}, {"food": "cinnamon", "quantity": 0.5}, {"food": "cereal bar", "quantity": 2.0}, {"food": "sugar", "quantity": 1}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "rhubarb", "quantity": 1.5}, {"food": "sugar", "quantity": 0.5}, {"food": "honey smoked ham", "quantity": 0.25}], "title": "\nRhubarb Compote\n"}, {"directions": "\n\n              Combine 1 cup flour, 1/3 cup oats, 3/4 cup sugar and a pinch of salt in a bowl. Stir in 6 tablespoons melted butter and 1/2 cup chopped hazelnuts; squeeze into large crumbles and place in the freezer. Toss 2 pounds chopped rhubarb, 1/3 cup sugar, 1/4 cup flour, 1/2 teaspoon vanilla extract, 1/2 teaspoon orange zest and 1/4 teaspoon salt in a 8-by-8-inch glass or ceramic baking dish. Scatter the crumble on top and bake in a preheated 375 degrees F oven until golden and bubbly, 45 minutes. Let cool for 15 minutes; serve with whipped cream.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [], "title": "\nRhubarb Crumble\n"}, {"directions": "\n\n              Mix 2 cups chopped rhubarb, 1/2 cup sugar, 1 teaspoon lemon juice and a splash of vanilla extract in a small skillet. Cook until the rhubarb is soft, 5 to 7 minutes. Stir in 1 cup sliced strawberries. Divide among bowls, top with Greek yogurt and sprinkle with chopped toasted almonds.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nRhubarb Crumble\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Fit the pie dough into a 9-inch pie plate, fluting the edges, and chill until set, about 15 minutes. Prick the bottom and sides with a fork, and then line the crust with aluminum foil. Fill with pie weights or dried beans and bake until the edges of the crust are just golden, 20 minutes. Remove the foil with the pie weights and continue to bake until the bottom of the crust is dry and lightly browned, another 10 to 15 minutes. Cool completely. \n            \n\n              Toss the rhubarb with 1/4 cup granulated sugar and the orange zest and juice until well combined. Transfer to the crust and spread to form an even layer. Place the pie on a rimmed baking sheet. Whisk the eggs with the cream, flour and remaining 1/2 cup granulated sugar until smooth, and then pour over the rhubarb. Bake until the pie is lightly browned, puffed and no longer wet in the center, about 1 hour 15 minutes. Cool completely on a wire rack. Before serving, lightly dust with confectioners' sugar.\n            \n", "ingredients": [{"food": "pie fillings", "quantity": 1.0}, {"food": "rhubarb", "quantity": 1.25}, {"food": "sugar", "quantity": 0.75}, {"food": "orange", "quantity": 0.5}, {"food": "orange juice", "quantity": 2.0}, {"food": "eggs", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 0.6666666666666666}, {"food": "potato flour", "quantity": 0.25}, {"food": "sugar", "quantity": 1}], "title": "\nRhubarb Custard Pie\n"}, {"directions": "\n\n              Trim about 2 inches from each end of the rhubarb and discard. Roughly chop the stalks and add to a small stock pot with 2 cups of the sugar and 1 1/2 cups water. Bring to a boil over high heat, stirring occasionally. Cover, leaving the lid slightly ajar, and boil until the rhubarb mostly falls apart, about 3 minutes, stirring once or twice. Remove from the heat and let steep, covered, for 5 minutes.\n            \n\n              Place 1/2 cup water in a medium bowl and sprinkle the gelatin on top. Strain the hot rhubarb mixture through a fine mesh strainer right into the gelatin, whisking gently. Press on the solids in the strainer to get as much liquid as possible from the rhubarb. Discard the solids.\n            \n\n              If there is a lot of foam and you prefer a clear surface, skim it with a spoon and discard it. Pour the mixture into eight 4-ounce jelly jars. Chill until set, at least 3 hours or overnight.\n            \n\n              When ready to serve, whip the cream, vanilla extract and the remaining 1 teaspoon sugar to very soft peaks and dollop it over the gelatin.\n            \n", "ingredients": [{"food": "rhubarb", "quantity": 4.0}, {"food": "sugar", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 0.5}], "title": "\nRhubarb Gelatin with Cream\n"}, {"directions": "\n\n              Chop 4 rhubarb stalks. Cook with 1 1/4 cups sugar and 1/2 cup sliced strawberries in a saucepan over medium heat until tender, about 10 minutes; strain and return the cooking liquid to the pan. Stir in 3 cups cold water and the juice of 1/2 lemon. Pour into a 9-by-13-inch baking dish, cover and freeze until solid, about 4 hours. Scrape with a fork.\n            \n\n              Photograph by Paul Sirisalee\n            \n", "ingredients": [], "title": "\nRhubarb-Strawberry Granita\n"}, {"directions": "\n\n              Make the compote: Combine the tarragon sprigs, granulated sugar and 1 3/4 cups water in a medium saucepan; bring to a boil and stir until the sugar dissolves. Add the rhubarb, reduce the heat to low and cook until softened but not falling apart, about 3 minutes. Strain the rhubarb over a bowl, reserving the liquid (keep the rhubarb in the strainer to drain completely while assembling the strudel).\n            \n\n              Make the strudels: Preheat the oven to 425 degrees F. Pulse the cream cheese, confectioners' sugar, flour and vanilla seeds in a food processor until just combined.\n            \n\n              Lay out 1 phyllo sheet on a clean dry surface (keep the remaining phyllo covered with a slightly damp kitchen towel). Brush lightly with clarified butter and sprinkle with 1 teaspoon chopped tarragon and 1/2 teaspoon granulated sugar. Layer another sheet of phyllo on top and top with more butter, tarragon and granulated sugar. Repeat the layering with the remaining phyllo; do not top the final sheet. Cut the stack of phyllo in half crosswise. Reserve the remaining clarified butter (about 1 tablespoon).\n            \n\n              Put each phyllo stack on a piece of parchment paper that's slightly larger than the stack. Position the stacks with the long sides facing you. Divide the cream cheese mixture between the stacks, spreading it in a 2-inch-wide strip along the edge closest to you; leave a 1-inch border at the bottom and sides. Spoon the rhubarb pieces over the cream cheese filling. Starting from the side closest to you, use the parchment to lift the phyllo and roll tightly around the filling to make 2 logs; arrange seam-side down. Transfer the strudels (on the parchment) to a baking sheet.\n            \n\n              Brush the strudels with the reserved clarified butter and sprinkle generously with granulated sugar. Bake until golden brown and crisp, 15 to 20 minutes. Meanwhile, bring the reserved rhubarb liquid to a boil in a saucepan. Reduce the heat and simmer, stirring occasionally, until syrupy, about 15 minutes.\n            \n\n              Let the strudels cool 10 minutes on the baking sheet. Slide the strudels (on the parchment) onto a rack; let cool 45 minutes. Sprinkle with confectioners' sugar and drizzle with the rhubarb syrup.\n            \n\n              How to clarify butter:\n            \n\n              Strudel recipes often call for clarified butter, which helps prevent the dough from getting soggy. To make it, melt the butter over medium-low heat until the milk solids separate and rise to the top, 3 to 5 minutes. Let cool, then skim off the white foam and discard. Spoon the remaining clarified (clear) butter into a bowl; discard the solids left at the bottom of the pan.\n            \n\n              Photograph by Ryan Liebe\n            \n", "ingredients": [{"food": "", "quantity": 2.0}, {"food": "sugar", "quantity": 0.5}, {"food": "rhubarb", "quantity": 1.5}, {"food": "macaroni cheese", "quantity": 6.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "potato flour", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "phyllo dough", "quantity": 7.0}, {"food": "butter oil", "quantity": 1.25}, {"food": "", "quantity": 2.0}, {"food": "sugar", "quantity": 1.0}], "title": "\nRhubarb-Tarragon Strudels\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Lay the steak flat on a board; tie kitchen twine tightly around the sides (including the bone) to help the steak keep its shape during cooking. \n            \n\n              Grind the mushrooms in a spice grinder or blender; transfer to a bowl and mix with the garlic, balsamic vinegar, brown sugar, 1 tablespoon Worcestershire sauce, 1 1/2 tablespoons rosemary, the red pepper flakes and 2 teaspoons salt. Cut 8 deep slits about 1 inch apart all over the steak; fill each slit with some of the mushroom mixture, then rub the rest all over the meat. Transfer the steak to a plate, cover with plastic wrap and refrigerate 2 to 4 hours. Remove from the refrigerator about 1 hour before grilling. \n            \n\n              Meanwhile, combine the butter, scallions, parsley, the remaining 1 tablespoon Worcestershire sauce and 1/2 tablespoon rosemary, and 1 teaspoon salt in a bowl. Cover and refrigerate until ready to use. \n            \n\n              Preheat a grill to medium high, then prepare for indirect heat: For gas, turn off the burners on one side. For charcoal, push the coals to one side. Brush the steak with the olive oil, then place on the cooler side of the grill (indirect heat). Cover and cook, turning occasionally, until a thermometer inserted into the thickest part registers 110 degrees F to 120 degrees F, 20 to 30 minutes. Move the steak to the hotter side of the grill (direct heat) and cook until the thermometer registers 125 degrees F, 2 to 3 more minutes per side. Transfer to a cutting board and let rest 15 minutes, spreading with some of the herb butter. \n            \n\n              Meanwhile, grill the peppers over direct heat, turning, brushing with the lemon juice and seasoning with salt, until charred, 8 to 10 minutes. Top the steak with more herb butter and serve with the peppers.\n            \n\n              Photograph by Yunhee Kim\n            \n", "ingredients": [{"food": "low fat big franks", "quantity": 1.0}, {"food": "mushrooms", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "rosemary", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 4.0}, {"food": "", "quantity": 2.0}, {"food": "parsley", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "peppers", "quantity": 8.0}, {"food": "", "quantity": 1.0}], "title": "\nRib-Eye Steak With Herb Butter and Charred Peppers\n"}, {"directions": "\n\nChocolate Dough:\n\n\n              For the vanilla dough: Mix the 2 sugars and the salt together in a medium bowl. In another small bowl, whisk the egg and mint extract and set aside. With a hand held mixer beat the butter until smooth in a large bowl. While mixing, gradually add the sugar mixture, and continue beating until lightly colored and fluffy, about 1 to 2 minutes. Stop mixing and scrape down the sides of the bowl. Add the egg mixture and beat until smooth. Gradually add the flour, mixing slowly until blended.\n            \n\n              Turn the dough out of the bowl, divide in half. Place the halves between 2 pieces of lightly floured parchment or waxed paper. Roll into a 10 by 12 by 1/4 inch rectangle. Slide the sheets of dough/parchment sheets onto a baking sheet, and refrigerate until firm, about 2 hours or overnight.\n            \n\n              For the chocolate dough: Whisk the sugar, cocoa, salt in a medium bowl. With a hand held mixer beat the butter until smooth in a large bowl. While mixing, add the cocoa mixture, and continue beating until lightly colored and fluffy, 1 to 2 minutes. Stop mixing and scrape down the sides of the bowl. Add the egg and beat until smooth. Gradually add the flour, mixing slowly until blended.\n            \n\n              Turn the dough out of the bowl, divide in half. Place the halves between 2 pieces of lightly floured parchment or waxed paper. Roll into a 10 by 12 by 1/4 inch rectangle. Slide the sheets of dough/parchment sheets onto a baking sheet, and refrigerate until firm, about 2 hours or overnight.\n            \n\n              For a spiral cookie: Put 1 of the chocolate doughs on the workspace and remove the top sheet of parchment. Brush dough lightly with cold water. Place a sheet of vanilla dough on the workspace, and remove top sheet of paper. Using the bottom piece of the paper to lift the dough, place the vanilla dough on top of the chocolate dough. Take care to line up the edges of the 2 doughs and trim as needed. Lightly press to smooth and seal the doughs together. Remove the top piece of paper. Brush the surface of the dough lightly with cold water. Position the sandwiched doughs with the long edge facing you. Using the edge of the paper as a guide, roll the doughs into a tight cylinder, 2 inches wide. Wrap in plastic and refrigerate for 1 hour. Repeat with remaining 2 sheets of dough.\n            \n\n              Evenly position racks in the oven, and preheat to 325 degrees F.\n            \n\n              Slice the dough crosswise into 1/4-inch thick cookies. Lay about 1/2-inch apart on parchment-lined baking sheets. Bake until just golden - not too dark you'll lose the definition of the spiral, about 14 to 16 minutes.\n            \n\nFor a ribbon cookie:\n\n\n              Roll and layer the two doughs into 15 by 18-inch rectangles, and 1/4-inch thick in the same way as the Spiral Cookies. Put 1 of the chocolate doughs on the work space and remove the top sheet of parchment. Brush lightly with a little cold water. Place 1 of vanilla doughs on the work space. Remove top sheet of paper, and use the bottom piece of the paper to lift the dough onto the chocolate dough. Take care to lining up the edges of the dough. Lightly press to smooth and seal the doughs together. Remove the top parchment.\n            \n\n              Trim the edges on the layered doughs with a pizza cutter using a ruler or other straight edge as a guide. Working with the short edge facing you, cut the layered dough in half vertically. Set 1 piece on top of the other and then turn the dough, to have the long side facing you. Cut the dough in half again and set 1 piece on top of the other. Wrap in plastic wrap, and refrigerate for 2 hours before slicing.\n            \n\n              Trim any uneven edges with a sharp knife. Slice blocks into 1/8-inch thick rectangles and bake until the white dough is just beginning to brown, about 16 to 18 minutes.\n            \n\n              Copyright (c) 2004 Television Food Network, G.P., All Rights Reserved.\n            \n", "ingredients": [{"food": "sugar", "quantity": 0.5}, {"food": "sugar", "quantity": 2.0}, {"food": "salt", "quantity": 0.25}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "sugar", "quantity": 1.25}, {"food": "onion powder", "quantity": 0.75}, {"food": "salt", "quantity": 0.25}, {"food": "", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "potato flour", "quantity": 1.5}], "title": "\nRibbon or Swirl Cookies\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Bring a large pot of salted water to a boil. Add the spaghetti and cook according to package directions for al dente.\n            \n\n              While the pasta cooks, trim the top and bottom off of each squash. Peel the squash in ribbons into a colander, using a vegetable peeler, turning the squash as you peel. Stop peeling the squash when you only have the center core of seeds left. Discard the core and seeds.\n            \n\n              Reserve 1/4 cup of the pasta water, and then drain the pasta over the squash ribbons. Put in a medium bowl and toss to evenly distribute the pasta with the squash ribbons.\n            \n\n              Toss the shrimp with 1/2 teaspoon kosher salt and some pepper. Heat 1 tablespoon oil in a large skillet over medium-high heat. Add the shrimp, spread into a single layer and cook without stirring, until just turning pink around the edges, about 2 minutes. Stir the shrimp, add the tomatoes, garlic and pepper flakes and continue to cook until the tomatoes have softened and the garlic has toasted, about 1 minute. Add the pasta and squash ribbons, broth and the remaining 1 tablespoon olive oil. Cook, tossing, until warmed through and most of the liquid has been absorbed. Add the pasta water a bit at a time, if needed, if the noodles seem dry.\n            \n\n              Season with additional salt and pepper. Divide among 4 bowls and top with the chives.\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "whole milk", "quantity": 8.0}, {"food": "yellow rice", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "shrimp", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "silk black cherry soy yogurt", "quantity": 1.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "chives", "quantity": 2.0}], "title": "\nRibbony Shrimp and Pasta Scampi\n"}, {"directions": "\n\n              Make the sauce: Combine the garlic, chili powder, cayenne, allspice, 1/2 teaspoon salt and 1 teaspoon black pepper in a bowl. Whisk the ketchup, 1 cup water, the vinegar, mustard, molasses, brown sugar and Worcestershire sauce in a separate bowl. Heat the vegetable oil in a medium saucepan over medium-high heat. Add the garlic mixture and cook, stirring, until the oil turns brick red, about 1 minute. Add the ketchup mixture and bring to a gentle simmer; cook, whisking occasionally, 30 minutes.\n            \n\n              Make the ribs: Soak 1 heaping cup hickory, mesquite or apple-wood chips in water, at least 30 minutes. Prepare a grill for indirect cooking over medium-low heat (about 250 degrees F): On a charcoal grill, bank the coals to one side; on a gas grill, turn on only one side of the burners. Cover the grate on the cooler side of the grill with aluminum foil. Close the grill lid. Position the ribs on a cutting board, meat-side down. Slip a small knife between the bone and membrane, then gently pull off the membrane. Sprinkle the racks with 1 teaspoon each salt and black pepper on both sides. Drain the wood chips. For a charcoal grill, scatter the chips directly over the hot coals; for a gas grill, put the chips in a smoker box and position over direct heat. Put the ribs meat-side up on the foil on the cooler side of the grill. Close the grill lid; bring the temperature back up and cook the ribs, undisturbed, 3 hours. (For a charcoal grill, adjust the vents, or add more hot, ashed-over coals as needed to maintain consistent heat.) Remove the ribs and close the lid. Wrap each rack tightly in foil, then return to the cooler side of the grill, meat-side down; close the lid and grill 2 more hours. Remove the ribs and carefully unwrap. Return to the cooler side of the grill, meat-side up; cook, basting generously with the sauce halfway through, until the meat is tender, about 1 more hour. Remove the racks and let rest a few minutes before slicing. Serve with the remaining sauce. Photograph by Con Poulos\n            \n", "ingredients": [{"food": "garlic powder", "quantity": 4.0}, {"food": "chili powder", "quantity": 2.0}, {"food": "pepper", "quantity": 0.25}, {"food": "allspice", "quantity": 0.25}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 1.5}, {"food": "vinegar", "quantity": 0.5}, {"food": "mustard spinach", "quantity": 0.25}, {"food": "molasses", "quantity": 0.25}, {"food": "sugar", "quantity": 0.25}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "pork skins", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nRibs With Kansas City Barbecue Sauce\n"}, {"directions": "\n\n              Put the rice in a medium saucepan with a cover. Stir in the water or broth, salt, and pepper. Smooth the rice to make an even surface, cover and heat over low to medium-low heat until all the liquid has been absorbed and rice is tender, about 15 to 20 minutes.\n            \n\n              Copyright (c) 2004 Television Food Network, G.P., All Rights Reserved.\n            \n", "ingredients": [{"food": "crisped rice bar", "quantity": 2.0}, {"food": "diced chicken", "quantity": 3.0}, {"food": "salt", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nRice\n"}, {"directions": "\nSpecial equipment: Decorative cookie cutters\n\n              Slice the sides of the peppers off in 4 pieces. Place the pepper pieces skin-side up and press down to flatten slightly. Use your favorite small cookie cutters to cut out as many shapes as possible. (Use the bottom of a measuring cup to help push the cutters through the pepper).\n            \n\n              Place the peas in a strainer and rinse briefly under warm water just to remove their chill. Blot dry.\n            \n\n              Toss the rice, vinegar, oil, 1/2 teaspoon salt and few grinds of pepper together in a large bowl. Evenly divide the rice among 4 lunch containers with lids. Top each with some of the pepper shapes, some of the peas and 1 teaspoon hoisin sauce. Pack 2 tablespoons sesame snack sticks separately with each serving.\n            \n", "ingredients": [{"food": "peppers", "quantity": 2.0}, {"food": "pigeon peas", "quantity": 0.25}, {"food": "crisped rice bar", "quantity": 4.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "Worcestershire sauce", "quantity": 4.0}, {"food": "sesame meal", "quantity": 0.5}], "title": "\nRice Bowl with Veggie Flowers and Hoisin\n"}, {"directions": "\n\n              Put the broccoli in a large microwave-safe dish; add 2 tablespoons water, cover with plastic wrap and microwave until bright green, about 2 minutes. Drain and set aside.\n            \n\n              Heat 1 tablespoon vegetable oil in a large nonstick skillet over high heat. Add the mushrooms in a single layer and cook, undisturbed, until browned around the edges, about 4 minutes. Stir in the broccoli. Cook, stirring occasionally, until the broccoli is warmed through, about 2 minutes. Add the scallions, edamame, water chestnuts, bean sprouts, snow peas, teriyaki sauce and Sriracha. Continue to cook, stirring, until warmed through, about 4 minutes.\n            \n\n              Divide the rice and vegetables among bowls. Wipe the skillet clean and heat the remaining 1 tablespoon vegetable oil over medium-high heat. Crack in the eggs and cook until the whites are set, about 2 minutes. Add a fried egg to each rice bowl; top with more Sriracha.\n            \n", "ingredients": [{"food": "broccoli raab", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "frozen yogurt", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "brussels sprouts", "quantity": 1.0}, {"food": "pigeon peas", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 0.25}, {"food": "", "quantity": 1.0}, {"food": "crisped rice bar", "quantity": 3.0}, {"food": "eggs", "quantity": 4.0}], "title": "\nRice Bowls with Fried Eggs\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Combine the macaroni, salt and 2 cups water in a rice cooker. Set the rice cooker on the standard white rice cycle and cook for 30 minutes, or until the cooking cycle is almost complete and most of the water is absorbed.\n            \n\n              Stir in the milk, Cheddar, processed cheese product, mustard and black pepper. Close the lid, turn the cooker to the warm setting, and let cook, stirring occasionally so the bottom doesn't burn, until the cheese is melted and the milk is well incorporated, about 10 minutes.\n            \n", "ingredients": [{"food": "macaroni cheese", "quantity": 2.0}, {"food": "salt", "quantity": 1.0}, {"food": "milk", "quantity": 12.0}, {"food": "", "quantity": 0.75}, {"food": "cheese product", "quantity": 0.75}, {"food": "onion powder", "quantity": 0.5}, {"food": "black bean mango", "quantity": 0.5}], "title": "\nRice Cooker Mac and Cheese\n"}, {"directions": "\n\n              Make the caramel: Toast the sesame seeds in a skillet over medium heat until golden. Transfer to a dish. Remove the peel from the orange in wide strips, then squeeze the orange juice into a separate dish; set aside.\n            \n\n              Cook the sugar in a skillet over medium heat, swirling the pan, until deep amber. Whisk in the butter, cream and salt until dissolved. Add the orange peel and juice. Cook, whisking, until the sauce thickens, 5 to 10 minutes. Remove from the heat. Add the sesame seeds. (You can refrigerate the sauce, covered, up to 1 day; reheat before serving.)\n            \n\n              Make the fritters: Bring 4 cups milk, the salt and cinnamon to a simmer in a saucepan over medium-high heat. Add the rice, reduce the heat to medium, and cook, stirring, until tender, 20 to 25 minutes. Add the condensed milk and 2 tablespoons sugar; cook, stirring, until thick, 5 to 10 more minutes. Stir in the vanilla and let cool completely.\n            \n\n              Roll tablespoonfuls of the rice mixture into balls. Put on a parchment paper-lined baking sheet; cover and chill until ready to fry.\n            \n\n              Make the batter: Whisk the flour, baking powder and the remaining 2 tablespoons sugar in a bowl. Whisk the egg and the remaining 3/4 cup milk in a liquid measuring cup; gradually whisk into the flour mixture until smooth.\n            \n\n              Heat 2 inches vegetable oil in a wide saucepan until a deep-fry thermometer registers 350degrees F. Working in batches, dip the rice balls in the batter using a fork, then fry until golden, turning once, about 8 minutes per batch. (Return the oil to 350degrees F between batches.) Drain on paper towels. Drizzle with the caramel.\n            \n\n              Photograph by Yunhee Kim\n            \n", "ingredients": [{"food": "sesame seeds", "quantity": 0.3333333333333333}, {"food": "orange", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "butter oil", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "hearts of palm", "quantity": 1}, {"food": "whole milk", "quantity": 4.75}, {"food": "hearts of palm", "quantity": 1}, {"food": "cinnamon", "quantity": 0.5}, {"food": "crisped rice bar", "quantity": 1.0}, {"food": "milk", "quantity": 0.5}, {"food": "sugar", "quantity": 0.25}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "potato flour", "quantity": 11.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1}], "title": "\nRice Fritters With Sesame Caramel\n"}, {"directions": "\n\n              A stocking full of coal might not be such a bad gift after all: These lumps are Rice Krispies Treats! To make some, prepare a half batch of the treats as the box directs, then shape into small irregular lumps while still warm. Microwave 16 ounces chopped dark chocolate in 30-second intervals until melted. Dip the treats in the melted chocolate and place on a parchment-lined baking sheet. Let set slightly, then roll in black cocoa powder or finely ground chocolate wafer cookies.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [], "title": "\nRice Krispies Treat Coals\n"}, {"directions": "\n\n              Bring a large pot of water to a boil. Meanwhile, combine the sugar and 2 tablespoons hot water in a large bowl and stir until dissolved. Stir in the lime juice, garlic, chile and fish sauce; transfer 2 tablespoons of the dressing to a medium bowl and whisk in the vegetable oil. Add the shrimp and toss to coat; set aside.\n            \n\n              Add the rice noodles to the boiling water and cook as the label directs; drain, rinse with cold water and shake off the excess liquid. Add the noodles to the bowl with the remaining dressing; add the lettuce, carrots, cucumber and herbs and toss to coat.\n            \n\n              Heat a grill pan over medium-high heat. Grill the shrimp until charred and cooked through, 2 to 3 minutes per side. Arrange over the noodles; serve with lime wedges.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [{"food": "carrots", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}, {"food": "", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "sugar", "quantity": 3.0}, {"food": "lime juice", "quantity": 0.3333333333333333}, {"food": "garlic powder", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "seeds", "quantity": 1}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "shrimp", "quantity": 12.0}, {"food": "rice noodles", "quantity": 1.0}], "title": "\nRice Noodle Salad with Shrimp\n"}, {"directions": "\n\n              Cook the rice noodles as the label directs; drain and rinse under cold water to cool, then snip into smaller pieces with kitchen shears. Meanwhile, make the dressing: Whisk 1/4 cup fish sauce, the juice of 1 lime, 2 tablespoons vegetable oil, the jalapeno, sugar, half of the garlic and 1/2 cup water in a small bowl; set aside. Preheat a grill or grill pan to medium high. Combine the zest and juice of the remaining lime and the remaining garlic, 1 tablespoon vegetable oil and 2 teaspoons fish sauce in a medium bowl. Add the shrimp and toss to coat. Grill the shrimp until lightly charred and opaque, about 2 minutes per side. Toss the noodles, romaine, carrots, herbs and bean sprouts in a large bowl. Gradually add enough of the dressing to coat; toss. Divide among bowls and top with the shrimp. Drizzle with the dressing.\n            \n\n              Photograph by Johnny Miller\n            \n", "ingredients": [{"food": "rice noodles", "quantity": 8.0}, {"food": "Worcestershire sauce", "quantity": 0.25}, {"food": "", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}, {"food": "sugar", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "shrimp", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "carrots", "quantity": 2.0}, {"food": "mixed nuts", "quantity": 2.5}, {"food": "brussels sprouts", "quantity": 1.0}], "title": "\nRice Noodle-Shrimp Salad\n"}, {"directions": "\n\n              Cook the noodles as the label directs, then drain and rinse under cold water. Meanwhile, season the pork generously with salt and pepper; set aside. Whisk the chicken broth and cornstarch in a medium bowl; set aside.\n            \n\n              Heat a large nonstick skillet over high heat. Add 1 tablespoon vegetable oil, then add the pork and stir-fry until lightly browned, about 5 minutes; transfer to a bowl. Add the remaining 1 tablespoon vegetable oil to the pan, then add the scallion whites, ginger and garlic; reduce the heat to medium and cook, stirring, 2 minutes.\n            \n\n              Add the vegetables to the skillet and cook, stirring occasionally, until they start softening, about 2 minutes. Add the broth mixture and 1 teaspoon salt; bring to a boil. Cook, stirring occasionally, until the sauce thickens slightly and the vegetables are crisp-tender, about 3 minutes.\n            \n\n              Return the pork to the skillet along with the noodles and stir to warm through. Remove from the heat and stir in the scallion greens, herbs and lime juice.\n            \n", "ingredients": [{"food": "pork skins", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 1.5}, {"food": "cornstarch", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "ginger", "quantity": 1.0}, {"food": "garlic powder", "quantity": 6.0}, {"food": "vegetables", "quantity": 3.0}, {"food": "basil", "quantity": 0.3333333333333333}, {"food": "", "quantity": 1.0}], "title": "\nRice Noodles with Pork and Ginger Vegetables\n"}]