[{"directions": "\n\n              Position a rack in the lower third of the oven and heat oven to 325 degrees F. Line an 8 by-8-inch square baking pan with foil so it hangs over the edges by about 1 inch.\n            \n\n              For the crust: Lightly butter the foil with some of the melted butter. Stir the rest of the butter together with the crumbs, sugar, and salt in a medium bowl. Press the crumb mixture evenly over the bottom of the pan. Bake until golden brown, about 20 minutes.\n            \n\n              Meanwhile, make the brownie. Put the butter and chocolate in a medium microwave-safe bowl. Melt in the microwave on 75 percent power for 2 minutes. Stir, and microwave again until completely melted, about 2 minutes more. Alternatively, put the butter and chocolate in a heatproof bowl. Bring a saucepan filled with 1 inch or so of water to a very slow simmer; set the bowl on the pan without touching the water. Stir occasionally until melted. Stir the light brown and white sugars, vanilla and salt into the melted chocolate. Add the eggs and beat vigorously to make a thick and glossy batter. Add the flour and stir until just incorporated.\n            \n\n              Pour batter into the prepared pan. Bake until the top is crispy and a toothpick inserted into the middle comes out mostly clean, with a few crumbs, about 40 to 45 minutes.\n            \n\n              Remove from the oven and carefully position a rack about 6 inches from the broiler and preheat on low. Layer marshmallows across the top and toast under the broiler until golden, (keep an eye on it, it can go quick), about 2 minutes. Cool on a rack, gently removing the brownies from the pan using the aluminum flaps. Carefully separate any marshmallow from the foil and fold away. Cut into 12 (2-inch) squares.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 6.0}, {"food": "cracker barrel", "quantity": 1.5}, {"food": "sugar", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 8.0}, {"food": "baking chocolate", "quantity": 4.0}, {"food": "sugar", "quantity": 1.0}, {"food": "sugar", "quantity": 0.75}, {"food": "vanilla extract", "quantity": 1.5}, {"food": "salt", "quantity": 0.5}, {"food": "eggs", "quantity": 4.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "", "quantity": 4.0}], "title": "\nS'more Brownies\n"}, {"directions": "\n\n              Preheat the broiler.\n            \n\n              Twist the tops off the cookies. Arrange the cookie bottoms, cream-side up, on a baking sheet. Put a piece of chocolate on the cream filling and then top with a marshmallow, laying on its side. \n            \n\n              Broil, watching closely, until the marshmallows are golden, about 30 seconds. Sandwich each with the remaining cookie tops. Eat while they're melted and gooey.\n            \n", "ingredients": [{"food": "chocolate chip cookies", "quantity": 12.0}, {"food": "", "quantity": 12.0}, {"food": "baking chocolate", "quantity": 12.0}], "title": "\nS'moreos\n"}, {"directions": "\n\n              Line a baking sheet with parchment. Heat the chocolate in a medium microwave-safe bowl in the microwave at 75 percent power until soft, about 2 minutes. Stir the chocolate and microwave again until melted, up to 2 minutes more. (Alternatively, put the chocolate in a heatproof bowl. Bring a saucepan filled with an inch or so of water to a very slow simmer; set the bowl over, but not touching, the water, and stir occasionally until melted and smooth.)\n            \n\n              Position the oven rack 3 inches below the heating element of the broiler and preheat the oven to broil. Place the marshmallows on a rimmed baking sheet so they are not overlapping, and broil until the tops just begin to toast, about 10 seconds, turning the pan for even browning. (Alternatively, you can use a kitchen torch to char the marshmallows.) Allow to cool at room temperature for 10 minutes.\n            \n\n              Fold half the marshmallows and graham crackers into the chocolate, and stir to coat. (Some of the marshmallows may melt, but that's OK.) Pour the chocolate onto the prepared baking sheet, and spread evenly with an offset spatula into an 8 1/2-by-11 inch rectangle. Poke the rest of the marshmallows and the graham cracker pieces into the chocolate in a random yet attractive pattern. (This part may be messy, but stretching the marshmallows into the bark will look cool.) Lightly press down the toppings. Allow the bark to set in the refrigerator for 1 hour. Break into pieces to serve.\n            \n", "ingredients": [{"food": "", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "crackers", "quantity": 6.5}], "title": "\nS'mores Bark\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Position the oven racks in the top and bottom thirds of the oven and preheat to 350 degrees F. Line 2 baking sheets with parchment.\n            \n\n              Beat the peanut butter, granulated sugar, light brown sugar and salt, in a large bowl, with an electric mixer on medium-high speed until light and fluffy, about 5 minutes. Beat in the vanilla and egg. \n            \n\n              Put some granulated sugar in a small bowl. Shape scant tablespoons of the dough into balls and roll each ball in the sugar to coat. Evenly space the balls on the prepared baking sheets. Press each ball down with the tines of a fork to flatten it slightly. \n            \n\n              Bake until the bottoms are golden brown, about 10 minutes. Remove from the oven and turn the broiler on. \n            \n\n              Top each cookie with a marshmallow, sticky-side-down, and put 1 baking sheet at a time under the broiler until lightly golden, about 30 seconds. While the marshmallow is still hot, press a chocolate candy into it. Repeat with the remaining baking sheet. Let the cookies cool for a few minutes on the baking sheets, then transfer to a rack to cool completely. The cookies can be stored in an airtight container at room temperature for up to 3 days.\n            \n", "ingredients": [{"food": "peanut butter ", "quantity": 1.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "salt", "quantity": 0.25}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 12.0}, {"food": "baking chocolate", "quantity": 24.0}], "title": "\nS'mores Blossom Cookies\n"}, {"directions": "\n\nFor the cake:\n\n\n              Make the ganache: Heat the heavy cream, chocolate and salt in a heatproof bowl set over a saucepan of simmering water (do not let the bowl touch the water), stirring occasionally, until the chocolate melts and the ganache is smooth. Stir in the vanilla. Remove the bowl from the pan and set aside until the ganache is cool and thick but still pourable, about 1 hour.\n            \n\n              Meanwhile, make the filling: Preheat the oven to 350 degrees F. Toss the graham cracker crumbs, melted butter and salt in a bowl until combined. Spread out on a baking sheet. Bake, stirring occasionally, until toasted, 8 to 10 minutes; let cool. Assemble the cake as close to serving time as possible: Using a long serrated knife, carefully slice each cake layer in half horizontally. Place 1 cake half on a platter. Using a lightly oiled offset spatula or spoon, spread one-third of the marshmallow cream on top, stopping about 1 inch from the edge (if the marshmallow cream is difficult to spread, microwave 10 to 15 seconds to soften). Sprinkle one-third of the graham cracker mixture over the marshmallow cream. Repeat to make 4 layers, ending with cake; reserve a few tablespoons of the graham cracker mixture for topping. Pour the ganache over the cake, letting it drip down the sides. Sprinkle with the reserved graham cracker mixture. Serve immediately. \n            \n\nBasic Chocolate Cake\n\n\n              Preheat the oven to 350 degrees F. Coat two 9-inch-round cake pans with cooking spray and line the bottoms with parchment paper.\n            \n\n              Whisk the cocoa powder and 1 1/2 cups boiling water in a medium bowl until smooth; set aside. Whisk the flour, sugar, baking powder, baking soda and salt in a large bowl until combined. Add the eggs, vegetable oil, sour cream and vanilla and beat with a mixer on medium speed until smooth, about 1 minute. Reduce the mixer speed to low; beat in the cocoa mixture in a steady stream until just combined, then finish mixing with a rubber spatula. (The batter will be thin.)\n            \n\n              Divide the batter between the prepared pans and tap the pans against the counter to help the batter settle. Bake until a toothpick inserted into the middle comes out clean, 30 to 40 minutes. Transfer to racks and let cool 10 minutes, then run a knife around the edge of the pans and turn the cakes out onto the racks to cool completely. Remove the parchment. Trim the tops of the cakes with a long serrated knife to make them level, if desired.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "ice cream swich", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 4.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "crackers", "quantity": 8.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "vegetable oil", "quantity": 1}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "baked beans", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "onion powder", "quantity": 1.0}, {"food": "potato flour", "quantity": 2.5}, {"food": "sugar", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "eggs", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 0.75}, {"food": "sour cream", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 2.0}], "title": "\nS'mores Cake\n"}, {"directions": "\n\n              Grease a 1/2 dry measuring cup with butter and line a 12-cup muffin tray with cupcake liners. Or grease the inside of the cups as well if you're not using liners.\n            \n\n              Melt the butter in a large pot over medium heat. Add all but 1 cup of the marshmallows and cook, stirring occasionally, until the marshmallows melt completely, about 5 minutes. Remove from the heat and stir in the vanilla and a pinch of salt. Add the cereal and stir with a rubber spatula, making sure to scrape up the bottom, until the cereal is completely coated. Let the filling cool off for a few minutes and then quickly fold in the reserved 1 cup marshmallows and the chocolate bars.\n            \n\n              Use the prepared measuring cup to scoop the mixture into the cups of the prepared muffin tray. Pat the domes together gently to help the treats hold their shape. Let sit at room temperature until firm, about 30 minutes.\n            \n\n              Store at room temperature in an airtight container for up to 3 days.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 4.0}, {"food": "", "quantity": 10.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "cereal bar", "quantity": 7.0}, {"food": "baking chocolate", "quantity": 12.0}], "title": "\nS'mores Cereal Treats\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 350 degrees F. Line an 8-inch square baking dish with aluminum foil or parchment, leaving a 2-inch overhang on the ends of the pan for lifting out the finished bars.\n            \n\n              Stir together the ground grahams, flour, sugar and salt in a small bowl. Cream the butter, egg and vanilla in a medium bowl with an electric mixer on low speed until creamy and combined; you are not trying to beat a great amount of air into the mixture. Add the graham mixture and continue to beat on low speed until just combined and large crumbles form.\n            \n\n              Place about two-thirds of the mixture in the prepared pan and firmly press down. Reserve a few pieces of the chocolate for garnish (about 1/2-ounce), and then scatter the rest of the chocolate pieces over the base. Drop spoonfuls of the marshmallow creme over the chocolate, stretching the creme so it covers more of the base. Drop the remaining cookie batter in small clusters over the chocolate and creme so the creme is mostly covered.\n            \n\n              Bake until the dough is golden brown and the cookie in the center of the pan feels firm, about 40 minutes. The marshmallow creme will puff through the crumble and brown, and it will deflate as it cools. Cool in the pan at least 15 minutes.\n            \n\n              Using the foil overhang, lift the crumble bars out of the pan. Melt the reserved pieces of chocolate in the microwave in 30-second intervals until smooth, and then drizzle over the cookies. Cut into sixteen 2-by-2-inch squares. Serve warm or at room temperature.\n            \n", "ingredients": [{"food": "crackers", "quantity": 8.0}, {"food": "potato flour", "quantity": 1.5}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 1.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 4.0}, {"food": "", "quantity": 1.0}], "title": "\nS'mores Cookie Crumble Bars\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              For the cupcakes: Preheat the oven to 350 degrees F. Line one 12-cup standard muffin tin with paper cupcake liners.\n            \n\n              In a small bowl, whisk the flour, ground graham crackers, baking powder and salt. Set aside.\n            \n\n              In a stand mixer fitted with the paddle attachment, beat the butter and brown sugar on medium speed until combined. Increase the speed to medium-high and continue to beat, stopping once or twice to scrape down the sides of the bowl, until light and fluffy, 3 to 5 minutes. Add the eggs and vanilla and beat until combined. Add the flour mixture and milk, alternating, starting and ending with the flour mixture, until just combined.\n            \n\n              Divide the batter between the muffin cups, filling each about two-thirds full. Bake until golden brown, or a toothpick inserted in the center comes out clean and the top springs back to the touch, about 25 minutes. Cool in the tin 5 minutes, and then transfer to a wire rack to cool completely.\n            \n\n              For the filling: While the cupcakes cool, prepare the filling: Combine the chocolate, cream and corn syrup in a medium bowl and microwave in 30-second intervals on high, stirring, until smooth. Set aside until cooled and thickened slightly, about 30 minutes.\n            \n\n              For the meringue frosting: Bring 1 inch of water to a simmer in a saucepan that can hold a heatproof stand mixer's bowl above the water. Combine the egg whites, granulated sugar and cream of tartar in the stand mixer bowl. Set the bowl above the simmering water and whisk until the sugar is dissolved and the egg whites are warm to the touch, turn white and are beginning to get fluffy. Transfer the bowl to the stand mixer, fitted with a whisk attachment, and whip on high speed until the meringue is cooled, fluffy and very thick. Beat in the vanilla.\n            \n\n              To assemble: Place the chocolate filling in a pastry bag or re-sealable plastic bag fitted with a small round tip (about 1/8-inch diameter) and snip the end. Pierce the center of each cupcake with the pastry tip and gently squeeze in the chocolate filling until it begins to come out of the top of the cupcake. Repeat with the remaining cupcakes.\n            \n\n              Pipe or swirl the meringue frosting onto each cupcake. If desired, brown the meringue with a kitchen torch or place briefly under the broiler. Garnish with a chocolate square.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 0.75}, {"food": "crackers", "quantity": 0.75}, {"food": "baking chocolate", "quantity": 1.25}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 1.5}, {"food": "sugar", "quantity": 0.5}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "milk", "quantity": 0.6666666666666666}, {"food": "", "quantity": 1}, {"food": "baking chocolate", "quantity": 8.0}, {"food": "ice cream swich", "quantity": 0.3333333333333333}, {"food": "silk light vanilla", "quantity": 1.0}, {"food": "", "quantity": 1}, {"food": "egg substitute", "quantity": 4.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "ice cream swich", "quantity": 0.125}, {"food": "", "quantity": 1}], "title": "\nS'mores Cupcakes\n"}, {"directions": "\n\n              Combine the chocolate chips, heavy cream, corn syrup, butter and 1/8 teaspoon salt in an 8-inch cast iron skillet (see Cook's Note). Put over medium heat. Stir periodically as the mixture comes to a gentle simmer. Simmer for 6 minutes, stirring frequently, until the sauce is smooth and slightly thickened. Turn down the heat if the sauce comes to a full boil. Remove from the heat and let cool at least 15 minutes.\n            \n\n              Preheat the broiler.\n            \n\n              Cover the fudge sauce with a single dense layer of marshmallows. Place under the broiler and broil until the marshmallows are toasty brown, 2 to 3 minutes (watch carefully as they may brown more quickly depending on your broiler.) Serve right away with dippers.\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 4.0}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "silk light vanilla", "quantity": 2.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "hearts of palm", "quantity": 1}, {"food": "potato chips", "quantity": 1}], "title": "\nS'mores Dip\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Position an oven rack in the center of the oven, and preheat to 325 degrees F. Whisk together the butter, brown sugar, honey, vanilla and salt in a large bowl. Add the oats and cereal, and toss until evenly coated. Spread out on a rimmed baking sheet.\n            \n\n              Bake the oat mixture until golden and toasted, 25 to 30 minutes, stirring about halfway through. Let cool completely on the baking sheet. Stir in the marshmallows and chocolate chips. (The granola can be stored in an airtight container at room temperature for up to 5 days.)\n            \n", "ingredients": [{"food": "butter oil", "quantity": 4.0}, {"food": "sugar", "quantity": 3.0}, {"food": "honey smoked ham", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "oats", "quantity": 1.75}, {"food": "cereal bar", "quantity": 1.5}, {"food": "", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}], "title": "\nS'mores Granola\n"}, {"directions": "\n\n              Preheat the broiler. Make the ganache: Put the chocolate in a small bowl. Bring 1/2 cup heavy cream to a simmer in a small saucepan; pour over the chocolate and let sit 5 minutes. Stir until smooth; set aside to cool.\n            \n\n              Butter a baking sheet, then arrange 15 marshmallows on the baking sheet and broil until toasted and bubbling, 30 seconds to 1 minute; set aside to cool. Combine 1 cup heavy cream, the cocoa powder and confectioners' sugar in a large bowl and beat with a mixer on medium speed until stiff peaks form, 1 to 2 minutes. Combine the remaining 1 cup heavy cream and the broiled marshmallows in a medium bowl; beat with the mixer on medium speed until stiff peaks form, 1 to 2 minutes. (It's OK if some small pieces of marshmallow remain in the whipped cream.)\n            \n\n              Line a 9-by-5-inch loaf pan with plastic wrap, leaving a 4-inch overhang on the long sides. Line the bottom of the pan with a single layer of graham crackers, breaking to fit as needed. Spread with half of the marshmallow whipped cream. Drizzle with 2 tablespoons of the chocolate ganache, then top with another layer of graham crackers. Spread half of the chocolate whipped cream over the graham crackers, drizzle with 2 tablespoons ganache, then top with a layer of graham crackers. Spread the remaining marshmallow whipped cream on top, drizzle with 2 tablespoons ganache, then top with a layer of graham crackers. Spread the remaining chocolate whipped cream on top, drizzle with 2 tablespoons ganache and top with a final layer of graham crackers.\n            \n\n              Fold the overhanging plastic wrap over the graham crackers and press gently. Refrigerate at least 6 hours or overnight. Place the remaining graham crackers (about 1 1/2) in a resealable plastic bag and crush with a rolling pin until finely ground. Set aside. Refrigerate the remaining ganache.\n            \n\n              About 1 hour before serving, preheat the broiler. Warm the reserved ganache in the microwave until pourable. Butter a baking sheet. Cut the remaining 9 marshmallows in half (parallel to the flat sides) and arrange cut-side down on the baking sheet in a tight 3-by-6 rectangle (the marshmallows should be touching). Broil until toasted and bubbling, 30 seconds to 1 minute. Let the marshmallows and ganache cool, about 1 hour.\n            \n\n              Invert the cake onto a platter and discard the plastic wrap. Press the reserved graham cracker crumbs onto the sides of the cake. Pour the ganache on top of the cake and spread in a thin layer, letting some drip down the sides. Remove the toasted marshmallows in one piece from the baking sheet with a large metal spatula and place on top of the cake.\n            \n\n              Photograph by Johnny Miller\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 4.0}, {"food": "ice cream swich", "quantity": 2.5}, {"food": "baking chocolate", "quantity": 1}, {"food": "", "quantity": 24.0}, {"food": "onion powder", "quantity": 3.0}, {"food": "sugar", "quantity": 3.0}, {"food": "baking chocolate", "quantity": 16.0}], "title": "\nS'mores Icebox Cake\n"}, {"directions": "\nSpecial equipment: A 10-inch springform pan\n\n              For the crust: Adjust an oven rack to the middle position and preheat the oven to 325 degrees F.\n            \n\n              Put the graham crackers in a food processor and pulse until fine crumbs, about 2 1/2 cups.\n            \n\n              Brush a 10-inch spring form pan with some of the butter. Add the graham cracker crumbs the remaining butter, 1/4 cup of the sugar and a pinch of salt to a medium bowl and stir to combine. Press the crumb mixture into the bottom and 1 inch up the side of the pan. Use the back of a measuring cup or drinking glass to pack the crust firmly and evenly in to the edges of the pan. Bake until the crust is lightly crisp and set, 15 to 20 minutes. Cool completely, then set the pan on top of a large sheet of aluminum foil and wrap the foil around the bottom of the pan and up the sides. Place the springform in a roasting pan.\n            \n\n              For the filling: Bring a large pot of water to a boil. Whip the cream cheese in the bowl of a stand mixer fitted with a paddle attachment until smooth. Add the remaining sugar and beat until just light and fluffy, scraping down the sides of the bowl and the paddle attachment as needed, about 2 minutes. Add the sweet potato puree, sour cream, eggs, vanilla, ground cinnamon and salt and beat until just combined. Scrape the filling into the cooled crust.\n            \n\n              Carefully pour boiling water into the roasting pan so that it goes half-way up the sides of the springform pan, being careful not to get any of the water in the springform pan. Bake until the edges of the cheesecake are set but the center still jiggles when the pan is tapped, about 2 hours. Turn off the oven and open the oven door for 1 minute to let out some heat. Close the oven door and leave the cheesecake in the oven for 1 hour more. Carefully remove the cheesecake from the roasting pan, remove the foil and cool on a wire rack. Run a thin knife or spatula around the edges of the cake to release it from the sides, (this also helps reduce cracks in the top of the cake as it chills). Cover the pan with plastic wrap and refrigerate the cheesecake 8 hours or overnight.\n            \n\n              For the s'more topping: Once the cheesecake has chilled completely, put the semi-sweet chocolate chips in a medium bowl. Heat the heavy cream in a small saucepan over medium heat until it just comes to a simmer, about 2 to 3 minutes. Pour the hot cream over the chocolate chips and let stand for 1 minute, then stir the cream and chocolate together until completely smooth. Set aside to cool to room temperature.\n            \n\n              Position a rack in the center of the oven and preheat the broiler to high. Pile the miniature marshmallows on top of the cheesecake in as even of a layer as possible (it's okay if some marshmallows overlap). Place the cheesecake on a baking sheet, then broil until the tops of the marshmallows are lightly golden brown, about 1 minute. Keep the oven door slightly open and rotate the pan as needed to get even browning.\n            \n\n              Run a thin knife or spatula between the cake and the pan to release it from the sides. Unlock the pan and remove the ring. Spray both sides of a sharp knife with non-stick cooking spray and slice the cake into 10 even slices, spraying the knife between each slice to keep the gooey marshmallows from sticking to the knife. Drizzle each piece of cheesecake with the cooled chocolate sauce and serve.\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 18.0}, {"food": "butter oil", "quantity": 12.0}, {"food": "sugar", "quantity": 0.25}, {"food": "hearts of palm", "quantity": 1}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "sugar", "quantity": 2.0}, {"food": "sweet potato puffs", "quantity": 15.0}, {"food": "sour cream", "quantity": 0.25}, {"food": "eggs", "quantity": 6.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "cinnamon", "quantity": 1.5}, {"food": "salt", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "", "quantity": 3.0}, {"food": "", "quantity": 1}], "title": "\nS'mores Sweet Potato Cheesecake\n"}, {"directions": "\n\n              Make the cheese: Line a colander with a double layer of damp cheesecloth; put in the sink. Bring the milk to a simmer in a wide nonreactive pot over medium heat, stirring occasionally with a wooden spoon. Remove from the heat and stir in the yogurt, lemon juice and 2 teaspoons salt. Continue to stir gently until large curds form and separate from the whey, 1 to 2 minutes. Strain through the cheesecloth-lined colander, discarding the whey. Gather the ends of the cheesecloth and twist to squeeze out any excess whey (run the sides of the bundle under cool water if it's too hot to handle). Tie the ends of the cheesecloth around a wooden spoon handle and lay the spoon over the colander, letting the bundle dangle; let drain, 10 minutes. \n            \n\n              Untie the bundle and twist the cheesecloth again, squeezing out any more whey. Lay the bundle on its side on a plate. Top with another plate and weigh it down with a large can. Refrigerate until a firm cake forms, about 1 hour; unwrap and refrigerate in an airtight container until ready to use, or up to 2 days. \n            \n\n              Fry the cheese: Cut the cheese into 3/4-inch cubes. Toss in the flour until well coated, shaking off any excess. Heat about 1/2 inch vegetable oil in a medium skillet over medium-high heat until shimmering. Carefully add the cheese and fry, turning occasionally, until golden brown, 2 to 4 minutes. Remove with a slotted spoon and drain on paper towels. Season lightly with salt and set aside. \n            \n\n              Make the spinach: Bring a large pot of generously salted water to a boil. Working in batches, cook the spinach until just tender, about 30 seconds. Remove with a slotted spoon and transfer to a bowl of salted ice water. Drain and squeeze dry, then chop and set aside. \n            \n\n              Pulse the ginger, garlic, jalapeno, coriander, cumin, turmeric and 1/2 teaspoon salt in a food processor until finely chopped. Whisk the yogurt, 1/4 cup water and 1 teaspoon salt in a small bowl. \n            \n\n              Heat 2 tablespoons butter and the vegetable oil in a wide pot over medium-high heat. Add the onion and cook, stirring, until deep golden brown, about 10 minutes. Add the ginger mixture and cook, stirring, until toasted, about 5 minutes (add a splash of water if the mixture is sticking). Reduce the heat to medium low; add 1/2 cup water and scrape up any browned bits, then add the cooked spinach and stir until heated through, about 4 minutes. Stir in the yogurt mixture and simmer gently until slightly thickened, about 5 minutes. Add the fried cheese and the remaining 2 tablespoons butter and cook, stirring, until heated through, about 1 minute. Season with salt. Photograph by Anna Williams\n            \n", "ingredients": [{"food": "whole milk", "quantity": 6.0}, {"food": "silk banana-strawberry soy yogurt", "quantity": 1.0}, {"food": "lemon juice", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "potato flour", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "ginger", "quantity": 1.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "pepper", "quantity": 0.5}, {"food": "ground turkey", "quantity": 2.0}, {"food": "cumin seed", "quantity": 1.0}, {"food": "turmeric", "quantity": 0.25}, {"food": "silk banana-strawberry soy yogurt", "quantity": 0.75}, {"food": "butter oil", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}], "title": "\nSaag Paneer\n"}, {"directions": "\n\n              Combine the heavy cream and saffron in a small saucepan. Bring to a bare simmer over medium heat, then remove from the heat and transfer to a bowl; let stand, stirring often, 10 minutes. Transfer to the refrigerator and let cool, stirring occasionally, about 20 minutes; stir in the vanilla. Combine the raisins and sherry in a small bowl and microwave 45 seconds; set aside.\n            \n\n              Preheat the oven to 400 degrees F and line a baking sheet with parchment paper. Whisk the flour, granulated sugar, baking powder and salt in a large bowl. Work in the butter with your fingers until the mixture looks like coarse meal. Add the raisin mixture, then add the saffron cream, reserving 1 tablespoon (with a few of the threads) for brushing. Mix with a wooden spoon to make a soft dough.\n            \n\n              Turn the dough out onto the prepared baking sheet and form into a 7-inch round, about 3/4 inch thick. Cut into 8 wedges and pull them about 1 inch apart. Brush with the reserved saffron cream and sprinkle with the coarse sugar.\n            \n\n              Bake until the scones are puffed and golden brown around the edges, 14 to 16 minutes. Transfer to a rack and let cool slightly. Serve with butter.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "ice cream swich", "quantity": 1.0}, {"food": "saffron", "quantity": 0.25}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 3.0}, {"food": "sweet potatoes", "quantity": 2.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "sugar", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 2.5}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 5.0}, {"food": "sugar", "quantity": 1.0}], "title": "\nSaffron Cream Scones\n"}, {"directions": "\n\n              Sprinkle the saffron into 1/4 cup hot water; let sit 15 minutes. Meanwhile, combine 2 cups water, the sugar and a pinch of salt in a small saucepan and bring to a boil. Add the orange zest and carrot, reduce the heat to medium low and simmer until tender, about 4 minutes. Drain and transfer to a bowl; set aside.\n            \n\n              Heat 2 tablespoons butter in a large pot over medium heat. Add the onion, cinnamon stick, cardamom, allspice, cumin and a pinch of salt and cook, stirring occasionally, until the onion is translucent, about 8 minutes. Add the rice and 3/4 teaspoon salt and stir to coat. Add 3 cups water, increase the heat to medium high and simmer until the water has mostly evaporated, about 4 minutes. Cover the pot with foil and the lid, reduce the heat to low and cook until the water is completely absorbed, about 12 minutes. Remove from the heat and let stand 5 minutes.\n            \n\n              Meanwhile, melt 1 tablespoon butter in a medium skillet over medium-high heat. Add the pistachios and almonds and cook until just lightly golden, about 1 minute. Remove from the heat and add the dried cranberries and apricots, and 1 tablespoon of the prepared saffron water; stir to combine, then transfer to a bowl and set aside for topping.\n            \n\n              Uncover the rice and fluff with a fork; discard the cinnamon stick and cardamom pods. Transfer about half of the rice to a serving bowl. Add the remaining saffron water, 1 tablespoon butter and the reserved orange peel and carrot to the rice in the pot and stir gently. Add the yellow rice to the white rice and gently toss; sprinkle with the pistachio mixture and parsley.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "saffron", "quantity": 0.5}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "salt", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "carrot juice", "quantity": 1.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "drumstick pods", "quantity": 3.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "hearts of palm", "quantity": 1}, {"food": "crisped rice bar", "quantity": 2.0}, {"food": "", "quantity": 0.3333333333333333}, {"food": "almonds", "quantity": 0.3333333333333333}, {"food": "cranberries", "quantity": 0.3333333333333333}, {"food": "apricots", "quantity": 0.25}, {"food": "parsley", "quantity": 2.0}], "title": "\nSaffron Jewel Rice\n"}, {"directions": "\n\n              Preheat the oven to 450 degrees F. Heat the olive oil in a large ovenproof skillet over medium heat. Add the saffron, coriander, garlic, shallot and 1 teaspoon salt and cook, stirring, until the shallot is translucent and the oil turns yellow, about 5 minutes. Add the cauliflower, lemon juice and 1/3 cup water. Increase the heat to medium high and cook, stirring occasionally, until the cauliflower turns yellow and the water has mostly evaporated, about 5 minutes.\n            \n\n              Transfer the skillet to the oven. Roast, stirring halfway through, until the cauliflower is tender and golden, about 15 minutes. Season with salt and sprinkle with parsley.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.25}, {"food": "saffron", "quantity": 0.5}, {"food": "seeds", "quantity": 0.25}, {"food": "garlic powder", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "cauliflower", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "parsley", "quantity": 1}], "title": "\nSaffron Roasted Cauliflower\n"}, {"directions": "\n\n              Preheat the broiler. (If possible, position the broiler rack 3 inches from the heat.) Mix the breadcrumbs, 1 tablespoon olive oil, the parsley and a pinch of salt in a small bowl. Soak the saffron in a separate small bowl with 1 tablespoon water.\n            \n\n              Heat 1 tablespoon olive oil in a large nonstick ovenproof skillet (preferably cast iron) over medium-high heat. Add the scallops, season with salt and sear until golden, about 2 minutes. Flip and cook 1 more minute; transfer to a plate (do not wipe out the skillet).\n            \n\n              Heat the remaining 1 tablespoon olive oil in the skillet. Add the onion and carrots, season with salt and cook until the onion is soft, about 4 minutes. Add the garlic and paprika and stir until toasted, about 1 minute. Add the wine, scrape up any browned bits and cook until the liquid is almost evaporated, about 1 minute. Stir in 1 1/2 cups water, the saffron and soaking water, and any juices from the plate of scallops. Bring to a simmer and cook until about 1/4 inch of liquid remains, 8 to 10 minutes. Season with salt.\n            \n\n              Remove the skillet from the heat and stir in the butter until melted. Return the scallops to the skillet, transfer to the broiler and cook, rotating the skillet as needed, until the scallops are firm, 1 to 2 minutes. Sprinkle the scallops with the breadcrumb mixture and continue to broil until browned, 1 to 2 more minutes, rotating as needed.\n            \n\n              Photographs by Con Poulos\n            \n", "ingredients": [{"food": "", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "parsley", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "hearts of palm", "quantity": 1}, {"food": "", "quantity": 1.5}, {"food": "onion powder", "quantity": 1.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "smoked turkey roll", "quantity": 0.25}, {"food": "martha white foods", "quantity": 0.25}, {"food": "butter oil", "quantity": 2.0}], "title": "\nSaffron Scallop Gratin\n"}, {"directions": "\n\n              Cook a pinch each of saffron and red pepper flakes in a skillet with 2 tablespoons olive oil over medium heat, 1 minute. Add 1/3 cup piquillo peppers and cook 3 minutes. Puree with 1 tablespoon lemon juice. Season with salt.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [], "title": "\nSaffron-Pepper Sauce\n"}, {"directions": "\n\n              Make the syrup: Combine the tea and honey in a small saucepan over medium-low heat. Reduce until syrupy, about 10 minutes, then let cool.\n            \n\n              Make the cocktail: Combine 1/2 ounce tea syrup, 2 sage leaves, the Peychaud's bitters and orange juice in a cocktail shaker. Gently muddle the sage with a muddler or the handle of a wooden spoon. Add the rye and Averna and fill the shaker three-quarters of the way with ice. Give it a short shake, then strain into a martini glass and garnish with the remaining sage leaf.\n            \n\n              Photograph by Jonathan Kantor\n            \n", "ingredients": [{"food": "black bean mango", "quantity": 1.0}, {"food": "honey smoked ham", "quantity": 3.0}, {"food": "chrysanthemum leaves", "quantity": 3.0}, {"food": "", "quantity": 2.0}, {"food": "orange juice", "quantity": 0.75}, {"food": "rye grain", "quantity": 1.5}, {"food": "", "quantity": 0.5}], "title": "\nSage Advice\n"}, {"directions": "\n\n              Heat 1 1/2 cups each sugar and water in a saucepan until the sugar dissolves; let cool. Mix 2 cups of the sugar syrup with 1 1/2 cups lime juice, 1/2 cup lemon juice and 2 cups water in a pitcher; divide among ice-filled glasses. Add a sprig of sage to each glass.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [], "title": "\nSage Limeade\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat oven to 325 degrees F.\n            \n\n              Put the stuffing cubes in a large bowl and set aside. Butter a 3-quart casserole dish.\n            \n\n              Melt 2 tablespoons of butter in a large skillet over medium-high heat. Add the sausage and break up with a wooden spoon. Cook until it loses most of its pink color, but not so much that it's dry, about 5 minutes. Add the sausage and pan drippings to the stuffing cubes. Melt the remaining butter in the pan. Add the onion, apple, celery, and salt. Cook until the vegetables get soft, about 5 minutes. Add the broth and parsley and bring to a boil.\n            \n\n              Pour the vegetable mixture over the stuffing cubes and toss until evenly moistened. Mix in the walnuts and eggs. Loosely pack the dressing in the prepared pan and cook uncovered until the top forms a crust, about 40 minutes. Drizzle about 2 tablespoons of turkey pan drippings or melted butter over the top. Cook until the top is crisp and golden, about 20 minutes more. Set immediately or warm.\n            \n", "ingredients": [{"food": "bread stuffing", "quantity": 16.0}, {"food": "butter oil", "quantity": 6.0}, {"food": "sage", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "apples", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "diced chicken", "quantity": 3.0}, {"food": "parsley", "quantity": 0.25}, {"food": "", "quantity": 0.5}, {"food": "eggs", "quantity": 2.0}], "title": "\nSage, Sausage and Apple Dressing\n"}, {"directions": "\n\n              Peel and halve 3 medium russet potatoes. Put in a microwave-safe bowl, cover with plastic wrap and make a small hole in the plastic with a knife. Microwave until tender, 12 to 15 minutes; let sit, covered, 2 minutes. Mash the potatoes with 1 to 1 1/4 cups hot milk, and salt to taste. Melt 3 tablespoons butter in a small skillet over medium heat and cook until golden brown; add 8 to 10 sage leaves and cook 30 more seconds. Pour over the potatoes.\n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [], "title": "\nSage-Butter Mashed Potatoes\n"}, {"directions": "\n\n              Combine 1/4 cup balsamic vinegar, 2 teaspoons honey and a bay leaf in a saucepan over medium-high heat; cook until syrupy, 5 minutes. Melt 6 tablespoons butter in a large skillet over medium heat, then add 1/3 cup sage leaves and 1 cup chopped walnuts; cook 3 minutes. Add 1 cup pasta-cooking water and cook until reduced by half, 2 minutes. Toss with 1 pound cooked tortellini, some grated parmesan and salt. Drizzle with the balsamic syrup.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [], "title": "\nSage-Walnut Butter\n"}, {"directions": "\n\n              Fill a cocktail shaker with ice. Add the passion fruit juice and sake. Cover and shake vigorously to combine and chill. Strain into a large chilled martini glass. Add the grenadine. Stir and serve.\n            \n\n              Copyright 2002 Television Food Network, G.P. All rights reserved\n            \n", "ingredients": [{"food": "fruit juice smoothie", "quantity": 0.5}, {"food": "", "quantity": 0.5}, {"food": "", "quantity": 1.0}, {"food": "orange juice", "quantity": 1.0}], "title": "\nSake Passion\n"}, {"directions": "\n\n              Whisk 1/4 cup each buttermilk and crumbled blue cheese, 3 tablespoons reduced-fat sour cream, 2 teaspoons lemon juice, a dash of hot sauce, and salt and pepper to taste in a large bowl. Add 10 cups mixed salad greens and toss. Season with salt and pepper.\n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [], "title": "\nSalad With Blue Cheese Dressing\n"}, {"directions": "\n\n              Thread the carrots, cucumber, lettuce and tomatoes onto 4 long wooden skewers, alternating the vegetables. Refrigerate; serve with the dressing.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "pineapple chunks", "quantity": 0.5}, {"food": "grape juice", "quantity": 1.0}, {"food": "dressing", "quantity": 1}], "title": "\nSalad on a Stick\n"}, {"directions": "\n\n              Cut 2 Persian cucumbers into 1/2-inch rounds. Cut 1/2 head iceberg lettuce into small chunks. Skewer the cucumbers, lettuce and cherry tomatoes onto 10 to 12 wooden skewers. Drizzle with ranch dressing.\n            \n\n              Photograph by Ryan Liebe\n            \n", "ingredients": [], "title": "\nSalad on a Stick\n"}, {"directions": "\n\n              Make the dressing: Whisk the mayonnaise, buttermilk, vinegar, onion powder, chives, parsley, garlic, 1/2 teaspoon salt and a few grinds of pepper in a small bowl; set aside.\n            \n\n              Make the salad: Put the red onion in a bowl and cover with cold water; let soak 10 minutes, then drain.\n            \n\n              Combine the lettuce in a large bowl and add the radishes, carrots, cucumbers, bell pepper and red onion. Toss with the dressing and season with salt.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "mayonnaise dressing", "quantity": 0.6666666666666666}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.6666666666666666}, {"food": "vinegar", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "chives", "quantity": 2.0}, {"food": "parsley", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "onion powder", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "lettuce", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 6.0}, {"food": "carrots", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "salt", "quantity": 1}], "title": "\nSalad with Buttermilk Ranch Dressing\n"}, {"directions": "\n\n              Dissolve 2 teaspoons sugar and 1 1/2 teaspoons kosher salt in 1 cup hot water. Add 1 cup quartered strawberries, 1/4 cup red wine vinegar and 1 thinly sliced shallot; let sit 10 minutes. Drain, reserving 1 tablespoon liquid. Toss 1 head each torn red leaf and butter lettuce with 2 tablespoons olive oil, the reserved liquid and the berries and shallot; season with salt and pepper. Top with toasted pine nuts.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [], "title": "\nSalad with Pickled Strawberries\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F. Whisk the eggs, milk, 3/4 teaspoon salt and a few grinds of pepper in a large bowl until combined; stir in the cheese and set aside.\n            \n\n              Heat the olive oil in a 10-inch ovenproof nonstick skillet over medium-high heat. Add the broccoli rabe and garlic and cook, stirring occasionally, until the broccoli rabe is wilted, about 5 minutes. Stir in the pickled peppers and remove from the heat; let cool slightly, then add to the egg mixture and stir.\n            \n\n              Wipe out the skillet and return to medium-high heat. Arrange the salami pieces in the skillet in a circle, overlapping slightly, so they cover the bottom. Pour in the egg mixture and cook, without stirring, until the edges start setting, about 1 minute. Transfer the skillet to the oven and bake until the frittata is set and lightly browned, 25 to 30 minutes. Let cool 5 minutes in the skillet, then invert onto a platter or cutting board. Serve warm or at room temperature.\n            \n\n              Photograph by Kana Okada\n            \n", "ingredients": [{"food": "eggs", "quantity": 12.0}, {"food": "milk", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "broccoli raab", "quantity": 0.5}, {"food": "garlic powder", "quantity": 2.0}, {"food": "sweet potatoes", "quantity": 1.0}, {"food": "sliced salami", "quantity": 2.0}], "title": "\nSalami-Broccoli Rabe Frittata\n"}, {"directions": "\n\n              Place a baking sheet upside down in the oven and preheat to 400 degrees F. Beat the eggs, parsley and lemon zest in a small bowl. Pour half of the egg mixture into a medium bowl and stir in the mozzarella. Reserve the remaining egg mixture for brushing on the crust.\n            \n\n              Turn another baking sheet upside down; line with parchment paper and brush with olive oil. Unroll the dough on the parchment paper and pat into a 9-by-12-inch rectangle. Spread the mozzarella mixture over one half of the dough, leaving a 1-inch border along the edge. Top with the salami, followed by the pickled vegetables and provolone. Fold the other half of the dough over to cover the filling. Crimp and roll the edges to seal, then pierce the top of the dough in a few places with a knife.\n            \n\n              Slide the calzone with the parchment paper onto the hot baking sheet; bake 15 minutes. Remove from the oven and brush with the remaining egg mixture, then continue to bake until the crust is golden, 5 to 10 more minutes. Let rest 5 minutes, then cut into wedges.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "eggs", "quantity": 2.0}, {"food": "parsley", "quantity": 0.25}, {"food": "lemon juice", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 1}, {"food": "pizza rolls", "quantity": 1.0}, {"food": "salami", "quantity": 0.25}, {"food": "mixed nuts", "quantity": 1.5}, {"food": "macaroni cheese", "quantity": 0.25}], "title": "\nSalami-Mozzarella Calzone\n"}, {"directions": "\n\n              Put the potatoes in a medium saucepan and cover with cold water; season with salt. Bring to a boil and cook until tender, 25 minutes.\n            \n\n              Meanwhile, combine the ground meat, panko, egg, onion, thyme, Worcestershire sauce, 1 teaspoon salt and a few grinds of pepper in a bowl; mix with your hands. Form into four 1/2-inch-thick oval patties.\n            \n\n              Heat 1 tablespoon butter in a large nonstick skillet over medium-high heat. Add the patties; cook until browned, 3 minutes per side. Scatter the carrots and celery around the patties; cook until they start softening, 3 minutes. Reduce the heat to medium. Add the broth, cover and simmer until the patties are cooked through, 5 minutes. Remove the patties and increase the heat to high. Cook until the broth is slightly reduced, 2 minutes, then add 1 tablespoon butter and swirl until melted.\n            \n\n              Drain the potatoes; mash with the half-and-half, the remaining 2 tablespoons butter, and salt and pepper to taste. Serve with the patties and vegetables.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "cheesecake mix", "quantity": 1.25}, {"food": "", "quantity": 0.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "thyme", "quantity": 1.5}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "pepper", "quantity": 1}, {"food": "butter oil", "quantity": 4.0}, {"food": "carrots", "quantity": 1.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "diced chicken", "quantity": 1.25}, {"food": "", "quantity": 3.0}], "title": "\nSalisbury Meatloaf and Potatoes\n"}, {"directions": "\n\n              Gently mix the beef, egg, onion, cracker crumbs, sage, 1/2 teaspoon salt and a few grinds of pepper in a large bowl using your hands. Divide into 4 equal portions and shape into oval patties, about 1/2 inch thick.\n            \n\n              Heat 1 tablespoon butter in a large skillet over medium-high heat. Brown the patties, about 4 minutes per side. Transfer to a plate.\n            \n\n              Add 1 tablespoon butter to the skillet and cook the mushrooms until slightly browned, about 2 minutes. Stir in the Worcestershire sauce, and salt and pepper to taste, scraping up any browned bits. Sprinkle in the flour and stir, then stir in 2 1/2 cups hot water and simmer until the sauce begins to thicken, about 2 minutes. Add the remaining 1 tablespoon butter, swirling to combine.\n            \n\n              Return the patties and any juices from the plate to the skillet. Simmer until the sauce thickens and the patties are cooked through, about 2 minutes. Sprinkle with parsley and season with salt and pepper. Serve with noodles, if desired.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "frankfurter beef", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.5833333333333333}, {"food": "crackers", "quantity": 7.25}, {"food": "sage", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 3.0}, {"food": "mixed nuts", "quantity": 8.0}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "potato flour", "quantity": 3.0}, {"food": "parsley", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1}], "title": "\nSalisbury Steak With Mushrooms\n"}, {"directions": "\n\n              Dice 3/4 pound wild salmon; puree half with 2 scallions. Mix with the remaining diced salmon, 1/4 cup breadcrumbs and 4 ounces chopped smoked salmon. Shape into 2 patties; make an indentation in the centers. Heat a cast-iron skillet over medium-high heat; sprinkle the skillet with salt. Cook burgers 4 to 5 minutes per side. Serve on sesame buns with sauteed spinach and mayonnaise mixed with mustard.\n            \n", "ingredients": [], "title": "\nSalmon Burger\n"}, {"directions": "\n\n              Toss the sliced onion, cabbage, rice vinegar, 1/2 teaspoon salt and a few grinds of pepper in a large bowl.\n            \n\n              Mix the salmon with the diced onion, eggs, panko, 1/4 cup dill, 2 tablespoons crème fraîche, 1/2 teaspoon salt and a few grinds of pepper in a medium bowl. Form into four 1/2-inch-thick patties. Mix 1/4 cup creme fraiche with the remaining 1 tablespoon dill in a small bowl.\n            \n\n              Heat 2 tablespoons olive oil in a large nonstick skillet over high heat. Add the salmon patties and cook until browned and firm, 2 to 3 minutes per side.\n            \n\n              Add the apple to the cabbage mixture. Fold in the remaining 1/4 cup creme fraiche and 2 tablespoons olive oil; season with salt and pepper. Serve the salmon burgers on the buns; top with the dill creme fraiche. Serve with the slaw.\n            \n", "ingredients": [{"food": "ruby red grapefruit juice blend", "quantity": 1.5}, {"food": "swamp cabbage", "quantity": 0.5}, {"food": "vinegar", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "", "quantity": 0.5}, {"food": "dill seed", "quantity": 0.25}, {"food": "sour cream", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "apple", "quantity": 1.0}, {"food": "potato flour", "quantity": 4.0}], "title": "\nSalmon Burgers with Green Apple Slaw\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Mix the salmon, corn, egg, 3 tablespoons each breadcrumbs and tartar sauce, the roasted red peppers, parsley, lemon zest and 3/4 teaspoon Old Bay in a bowl. Gently form into eight 3/4-inch-thick patties and freeze until just firm, about 5 minutes.\n            \n\n              Meanwhile, make the dressing: Whisk the remaining 2 tablespoons tartar sauce, the lemon juice, 1 tablespoon water, the remaining 1/4 teaspoon Old Bay, and pepper to taste in a large bowl.\n            \n\n              Put the remaining 5 tablespoons breadcrumbs in a shallow bowl. Press the salmon cakes in the breadcrumbs to coat both sides. Heat the olive oil in a large ovenproof nonstick skillet over medium-high heat. Add the salmon cakes and cook until golden brown, 3 to 4 minutes per side. Transfer the skillet to the oven and bake until the cakes are heated through, 6 to 8 more minutes.\n            \n\n              Add the greens to the bowl with the dressing and toss. Serve the salmon cakes with the salad, more tartar sauce and lemon wedges.\n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [{"food": "salmon", "quantity": 3.0}, {"food": "corn bran", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "Worcestershire sauce", "quantity": 5.0}, {"food": "ruby red grapefruit juice blend", "quantity": 2.0}, {"food": "parsley", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "mixed nuts", "quantity": 8.0}], "title": "\nSalmon Cakes With Salad\n"}, {"directions": "\n\n              Put the clam juice in a medium microwave-safe bowl and microwave until very hot, about 5 minutes.\n            \n\n              Meanwhile, scatter the potatoes, carrots, celery, onion and garlic in a 6-quart slow cooker. Tie the dill, parsley, thyme, bay leaves and lemon zest together with twine and add to the slow cooker. Pour in the hot clam juice; cover and cook on high, 3 1/2 hours.\n            \n\n              Season the salmon with 1 1/2 teaspoons salt and 1/2 teaspoon pepper. Stir the heavy cream into the vegetables in the slow cooker, then partially submerge the salmon in the liquid. Cover and cook 30 more minutes.\n            \n\n              Discard the herb bundle; season the chowder with salt and pepper. Serve topped with chives and dill.\n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [{"food": "grape juice", "quantity": 3.0}, {"food": "sweet potatoes", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "garlic powder", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 12.0}, {"food": "parsley", "quantity": 12.0}, {"food": "thyme", "quantity": 6.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "wild rice", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "dessert topping", "quantity": 1}], "title": "\nSalmon Chowder with Dill\n"}, {"directions": "\n\n              Mix the yogurt, mustard and dill in a small bowl.\n            \n\n              Heat 1 1/2 tablespoons olive oil in a large nonstick skillet over medium-high heat. Add the hash browns, sprinkle with 1/4 teaspoon each salt and pepper, and cook until browned, about 12 minutes. Transfer to a bowl.\n            \n\n              Heat the remaining 1/2 tablespoon olive oil in the skillet, then add the onion, bell peppers and 1/4 teaspoon salt; cook until golden, about 8 minutes. Add the salmon and cook, stirring occasionally, until just cooked through, about 3 minutes. Return the hash browns to the skillet to heat through, then remove from the heat and stir in 3 tablespoons of the yogurt mixture. Season with salt and pepper.\n            \n\n              Stir 1 tablespoon water into the remaining yogurt mixture and toss with the arugula in a medium bowl. Serve the salmon hash with the arugula salad, and lemon wedges, if desired.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "silk plain soy yogurt", "quantity": 0.25}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "dill seed", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "frozen yogurt", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "onion powder", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 2.0}, {"food": "salmon", "quantity": 1.25}, {"food": "arugula", "quantity": 8.0}, {"food": "", "quantity": 1}], "title": "\nSalmon Hash\n"}, {"directions": "\nSpecial equipment: Wooden skewers, soaked\n\n              Strip the peel from the grapefruit with a vegetable peeler, taking care not to include the bitter white pith. Warm the grapefruit peel, ginger, and olive oil in a small saucepan over medium heat. As soon as the oil starts to bubble, after about 2 minutes, remove from heat. Set the oil aside to steep for 30 minutes. Strain and reserve the oil.\n            \n\n              Meanwhile, rinse the quinoa in a bowl and drain. Put the quinoa in a small saucepan with the water and 1/2 teaspoon salt. Boil over high heat, and then reduce heat to maintain a gentle simmer and cook, uncovered, for 15 minutes. Set aside off the heat, undisturbed, for 5 minutes. Transfer the quinoa to a bowl and fluff with a fork. Cool.\n            \n\n              Segment the grapefruit over a bowl, reserving the segments and juice separately. Whisk 3 tablespoons of the grapefruit juice with the vinegar, honey, and salt to taste in a medium bowl. Gradually whisk in 3 tablespoons of the reserved grapefruit oil, starting with a few drops and then adding the rest in a stream to make a slightly thick dressing. Season with pepper to taste.\n            \n\n              Toss quinoa with the dressing, chiles, scallions, and cilantro. Season with salt and pepper, to taste.\n            \n\n              Preheat a stovetop or outdoor grill to high heat. Thread the salmon cubes onto the skewers. Brush with the remaining 1 tablespoon grapefruit oil, and season with salt and pepper. Grill the skewers, turning as each side browns but the salmon is still moist, about 3 minutes.\n            \n\n              Toss the grapefruit segment into the salad, divide among 4 plates, and top with the salmon kebobs. Serve warm or at room temperature.\n            \n", "ingredients": [{"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "luncheon slices", "quantity": 8.0}, {"food": "olive loaf", "quantity": 0.25}, {"food": "quinoa", "quantity": 0.75}, {"food": "coconut water", "quantity": 1.5}, {"food": "seasoning mix", "quantity": 0.5}, {"food": "vinegar", "quantity": 1.0}, {"food": "honey smoked ham", "quantity": 2.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "martha white foods", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "salmon", "quantity": 1.5}], "title": "\nSalmon Kebobs with Quinoa and Grapefruit Salad\n"}, {"directions": "\n\n              Put the potatoes in a saucepan and cover with cold water. Bring to a boil and cook until tender, about 20 minutes. Drain and let cool, then thinly slice.\n            \n\n              Meanwhile, put the green beans in a microwave-safe bowl and add a splash of water. Cover with plastic wrap and microwave until tender, 6 to 8 minutes. Drain and pat dry; set aside.\n            \n\n              Make the dressing: Whisk the yogurt, vinegar and olive oil in a medium bowl; season with 1/4 teaspoon salt and a few grinds of pepper. Toss the romaine with 1 tablespoon of the dressing in a large bowl.\n            \n\n              Divide the romaine among bowls. Arrange the red onion, green beans, salmon, olives, potatoes, tomatoes and white beans on top. Drizzle with the remaining dressing. Season with salt and pepper.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 1.0}, {"food": "fava beans", "quantity": 8.0}, {"food": "silk plain soy yogurt", "quantity": 0.25}, {"food": "vinegar", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "lettuce", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "wild rice", "quantity": 1.0}, {"food": "olives", "quantity": 0.25}, {"food": "silk black cherry soy yogurt", "quantity": 1.0}, {"food": "fava beans", "quantity": 1.0}], "title": "\nSalmon Nicoise Salad\n"}, {"directions": "\n\n              Prepare the salmon: Cook the shallot with the olive oil in a skillet over medium heat, 2 to 3 minutes. Season the salmon with salt and pepper; add to the skillet. Add the wine, cover and cook over low heat until opaque, 3 to 4 minutes per side. Transfer the salmon to a plate and let the pan juices simmer, 2 minutes. Let cool.\n            \n\n              Pulse the smoked salmon and butter in a food processor to make a coarse paste. Flake in the cooked salmon; add the pan juices, lemon juice, nutmeg and 1/4 teaspoon salt. Pulse until incorporated. Spoon into a bowl, cover and chill at least 1 hour.\n            \n\n              Make the salad: Toss the tomatoes, sugar and a pinch of salt in a bowl. In a separate bowl, whisk the vinegar, mustard and 1/2 teaspoon salt, then whisk in the olive oil. Whisk in the cream, tarragon and chives. Toss in the tomatoes and season with salt and pepper. Serve with the salmon rillettes and bread.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "salmon", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "martha white foods", "quantity": 2.0}, {"food": "smoked turkey roll", "quantity": 0.25}, {"food": "butter oil", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "nutmeg", "quantity": 0.25}, {"food": "grape juice", "quantity": 1.0}, {"food": "sugar", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "vinegar", "quantity": 1.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "ice cream swich", "quantity": 0.25}, {"food": "", "quantity": 2.0}, {"food": "chives", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "garlic bread", "quantity": 1}], "title": "\nSalmon Rillettes With Tomato Salad\n"}, {"directions": "\n\n              Position racks in the upper and lower thirds of the oven; preheat to 425 degrees F. Toss the fries with 1 tablespoon olive oil on a baking sheet and sprinkle with the spiced salt. Bake on the lower oven rack, tossing halfway through, until golden, about 25 minutes.\n            \n\n              Meanwhile, make the tartar sauce: Mix the mayonnaise, pickle and brine, scallions, parsley and a pinch of kosher salt in a small bowl.\n            \n\n              Season the salmon with kosher salt and pepper. Heat the remaining 1 tablespoon olive oil in a large ovenproof nonstick skillet over high heat. Reduce the heat to medium; add the salmon and cook until golden brown on the bottom, 5 minutes. Transfer the skillet to the upper oven rack; bake until the salmon is just opaque, about 3 minutes.\n            \n\n              Spread some tartar sauce on the rolls. Sandwich with the salmon (cut into pieces, if needed), lettuce and tomatoes. Serve with the fries and more tartar sauce for dipping.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "french toast", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "seasoning mix", "quantity": 1.5}, {"food": "mayonnaise dressing", "quantity": 0.75}, {"food": "pickle loaf", "quantity": 1.0}, {"food": "", "quantity": 3.0}, {"food": "parsley", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "wild rice", "quantity": 4.0}, {"food": "pepper", "quantity": 1}, {"food": "onion powder", "quantity": 4.0}, {"food": "chrysanthemum leaves", "quantity": 1}], "title": "\nSalmon Sandwiches with Fries\n"}, {"directions": "\nSpecial equipment: Serves: 6; Calories: 422; Total Fat: 23 grams; Saturated Fat: 4 grams; Protein: 40 grams; Total carbohydrates: 15 grams; Sugar: 2 grams; Fiber: 6 grams; Cholesterol: 77 milligrams; Sodium: 270 milligrams\n\n              Heat the olive oil in a skillet over medium heat. Add the garlic; cook, stirring, until golden. Using a slotted spoon, transfer the garlic to paper towels. Reserve the oil. \n            \n\n              Fill a pot with cold water. Add the juice of 2 lemons, then add the 2 lemon halves to the pot. Cut off the top inch of an artichoke with a serrated knife. Cut off the stem and snap off the tough outer leaves. Using a paring knife, cut away the tough green parts around the base, then halve the artichoke lengthwise and add to the pot. Repeat with the remaining artichokes. Add 1/4 teaspoon salt and 1 tablespoon of the reserved garlic oil to the pot and bring to a simmer over medium-high heat. Simmer 4 minutes, then drain. Discard the lemon halves. \n            \n\n              Position racks in the upper and lower thirds of the oven and preheat to 400 degrees F. Thinly slice the remaining lemon. Pat the artichokes dry; toss in a large baking dish with the onion, lemon slices, 2 tablespoons of the reserved garlic oil, 3/4 teaspoon salt, and pepper to taste. Spread in a single layer and roast on the upper oven rack, stirring once or twice, until tender and lightly charred, about 35 minutes. \n            \n\n              Meanwhile, brush another large baking dish with 1 tablespoon of the reserved garlic oil. Add the salmon, skin-side down, and rub with any remaining garlic oil. Sprinkle with the fennel seeds, red pepper flakes, 1 teaspoon salt and 1/4 teaspoon pepper. Roast the salmon on the lower oven rack until just cooked through, 15 to 20 minutes. Cut into 6 pieces and divide among plates. Serve with the roasted artichoke mixture. Top with the parsley and fried garlic. \n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "garlic powder", "quantity": 6.0}, {"food": "lemons", "quantity": 3.0}, {"food": "", "quantity": 16.0}, {"food": "salt", "quantity": 1}, {"food": "onion powder", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "fennel seed", "quantity": 1.25}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "parsley", "quantity": 3.0}], "title": "\nSalmon With Baby Artichokes\n"}, {"directions": "\n\n              Heat 2 tablespoons olive oil in a medium saucepan over medium heat. Add the ginger, garlic, shallot, curry powder and 1/2 teaspoon paprika; cook, stirring often, until the shallot is soft, about 3 minutes. Add the bell pepper and cook until slightly softened, 2 minutes. Add the lentils, 1/2 teaspoon salt and 2 1/2 cups water; increase the heat to medium high and bring to a simmer. Partially cover and cook, stirring often and adjusting the heat to maintain a simmer, until the lentils are tender, about 15 minutes. Uncover and simmer until thick, 5 to 10 more minutes. Add lemon juice and salt to taste. \n            \n\n              Preheat the broiler. Put the salmon on a foil-lined baking sheet, skin-side down. Sprinkle with 1/2 teaspoon salt and the remaining 1 teaspoon paprika and broil until just cooked through, 6 to 8 minutes. \n            \n\n              Toss the arugula with the remaining 1 tablespoon olive oil, and salt and lemon juice to taste. Serve with the lentils and salmon. \n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "ginger", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "curry powder", "quantity": 0.75}, {"food": "hot pockets ham cheese stuffed swich", "quantity": 1.5}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 1.0}, {"food": "vegetarian fillets", "quantity": 4.0}, {"food": "arugula", "quantity": 5.0}], "title": "\nSalmon With Curried Lentils\n"}, {"directions": "\n\n              Preheat the broiler. Line a broiler pan with foil and lightly brush with olive oil. Whisk 2 tablespoons olive oil, 1 teaspoon vinegar, the honey, red pepper flakes and 1 teaspoon salt in a small bowl. Put the salmon, skin-side down, on the prepared pan and brush the tops and sides with the honey glaze. Broil until golden brown and just cooked through, 4 to 6 minutes. \n            \n\n              Meanwhile, put the garlic on a cutting board and sprinkle with a generous pinch of salt, then mash into a paste with the flat side of a large knife. Heat the remaining 3 tablespoons olive oil and 1 tablespoon vinegar, the olives and garlic paste in a small saucepan over medium-high heat until bubbling, about 3 minutes. Transfer the mixture to a bowl and add the tomatoes, celery and mint. Season with salt and toss to combine. Serve with the salmon. Per serving: Calories 433; Fat 26 g (Saturated 4 g); Cholesterol 97 mg; Sodium 982 mg; Carbohydrate 10 g; Fiber 1 g; Protein 38 g \n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 5.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "honey smoked ham", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "vegetarian fillets", "quantity": 4.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "olives", "quantity": 0.5}, {"food": "pineapple chunks", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "", "quantity": 0.25}], "title": "\nSalmon With Warm Tomato-Olive Salad\n"}, {"directions": "\n\n              Position a rack in the top third of the oven and preheat to 425 degrees F. Line a rimmed baking sheet with parchment paper.\n            \n\n              Toss the panko, Parmesan, parsley, 1/2 teaspoon salt and 1/4 teaspoon black pepper together in a small bowl. Arrange the tomatoes in the center of the prepared baking sheet, cut-side up (trim a small slice from the bottom of each tomato if they will not stand upright) and spoon the panko mixture evenly over each. Spray the breadcrumbs lightly with cooking spray. Lay the zucchini halves cut-side up on one side of the tomatoes. Drizzle zucchini with 1 tablespoon of the olive oil and sprinkle with salt and pepper. Roast until the vegetables begin to soften and the panko topping begins to brown, about 18 minutes.\n            \n\n              Remove the baking sheet from the oven and place the salmon fillet on the other side of the tomatoes. Drizzle the salmon with the remaining 1 tablespoon olive oil and sprinkle with salt and pepper. Roast until the zucchini and tomatoes are completely tender and browned in spots, and the salmon is cooked through but moist, about 12 minutes more. Divide salmon and vegetables between two plates and serve.\n            \n", "ingredients": [{"food": "", "quantity": 0.25}, {"food": "", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 0.25}, {"food": "black bean mango", "quantity": 1}, {"food": "plum", "quantity": 2.0}, {"food": "", "quantity": 1}, {"food": "", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "salmon", "quantity": 12.0}], "title": "\nSalmon and Zucchini Sheet Pan Dinner\n"}, {"directions": "\n\n              Season the salmon with salt and pepper. Heat 1 teaspoon olive oil in a large nonstick skillet over medium-high heat. Add the salmon skin-side down and cook until almost cooked through and the skin is dark golden and crisp, about 8 minutes. Flip the salmon and remove the skillet from the heat; let sit until just cooked through, about 5 minutes.\n            \n\n              Meanwhile, heat the remaining 1 teaspoon olive oil in a medium saucepan over medium heat. Add the onion and cook, stirring often, until softened, about 5 minutes. Add the peas, chicken broth, olives, raisins, pepitas, hot sauce, 1/2 teaspoon salt and a few grinds of pepper. Increase the heat to high and bring to a boil, then stir in the couscous. Remove from the heat, cover and let sit 5 minutes.\n            \n\n              Fluff the couscous with a fork. Serve the salmon with the couscous and lime wedges.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "wild rice", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "pigeon peas", "quantity": 0.5}, {"food": "diced chicken", "quantity": 0.75}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.3333333333333333}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.25}, {"food": "pumpkin flowers", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "couscous", "quantity": 0.5}, {"food": "", "quantity": 1}], "title": "\nSalmon with Couscous and Peas\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the carrots and cabbage and cook until tender, 6 to 7 minutes. Drain and return to the pot. Add the butter and stir until melted; season with salt and pepper. Cover to keep warm and set aside. Meanwhile, mix the sour cream, mustard and vinegar in a small bowl; set aside.\n            \n\n              Heat the vegetable oil in a large nonstick skillet over medium-high heat. Season the salmon with 1/2 teaspoon salt and a few grinds of pepper; add to the skillet, skin-side down, and cook until the skin is golden brown and crisp, about 4 minutes. Flip and cook until just cooked through, 1 to 2 more minutes.\n            \n\n              Stir the dill into the vegetable mixture. Serve with the salmon, mustard sour cream and lemon wedges.\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "swamp cabbage", "quantity": 6.25}, {"food": "butter oil", "quantity": 3.0}, {"food": "pepper", "quantity": 1}, {"food": "sour cream", "quantity": 0.25}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.5}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "wild rice", "quantity": 4.0}, {"food": "dill seed", "quantity": 1.0}, {"food": "", "quantity": 1}], "title": "\nSalmon with Dill Carrots and Cabbage\n"}, {"directions": "\n\n              Heat 1/4 cup olive oil in a skillet over medium heat. Add the leeks and carrots and cook until tender, 5 minutes. Add the garlic and tomato paste and cook 1 minute. Increase the heat to high; add 4 cups water, the cinnamon stick and lentils. Bring to a boil, then reduce the heat to medium-high, cover and simmer until tender, 20 minutes.\n            \n\n              Meanwhile, remove the Swiss chard stems; reserve 3 leaves and chop the rest. Place the whole leaves over the lentils, cover and wilt, 1 minute. Remove the chard and cover the lentils. Season the salmon with salt and pepper and wrap a wilted chard leaf around each fillet.\n            \n\n              Reserve about 1 cup lentils for Warm Beet and Lentil Salad. Stir the honey and lemon juice into the remaining lentils and season with salt and pepper. Stir in the chopped chard. Place the wrapped salmon on top of the lentils, drizzle with olive oil and season with salt and pepper. Cover and cook over medium-high heat until the fish is just cooked through, 6 minutes.\n            \n\n              Remove the salmon and cut into pieces. (If the lentils are dry, add a splash of water.) Divide lentils among bowls and top with salmon.\n            \n\n              Turn leftover lentils into Warm Beet and Lentil Salad With Goat Cheese.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.25}, {"food": "martha white foods", "quantity": 2.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "barley flour or meal", "quantity": 0.5}, {"food": "chard", "quantity": 1.0}, {"food": "vegetarian fillets", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "honey smoked ham", "quantity": 1.0}, {"food": "", "quantity": 1.0}], "title": "\nSalmon with Lentils\n"}, {"directions": "\n\n              Position a rack in the upper third of the oven and preheat to 425 degrees F. Toss the squash with 1 tablespoon olive oil on a baking sheet; season with 1/2 teaspoon salt and a few grinds of pepper. Roast until tender and golden around the edges, 15 to 20 minutes.\n            \n\n              Meanwhile, season the salmon with 1/2 teaspoon each salt and pepper and sprinkle with 2 tablespoons herbs. Refrigerate until ready to roast. Toss the tomatoes in a bowl with the scallions, the remaining 2 tablespoons herbs and 1 tablespoon olive oil, and 1/2 teaspoon salt; set aside.\n            \n\n              Remove the squash from the oven and push to one side of the baking sheet. Put the salmon on the other side, herb-side up. Return to the oven and roast until the salmon is cooked through and the squash is browned, about 7 minutes. Serve the salmon and squash with the tomato salad.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [{"food": "yellow rice", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "wild rice", "quantity": 4.0}, {"food": "mixed nuts", "quantity": 0.25}, {"food": "barley flour or meal", "quantity": 1.25}, {"food": "", "quantity": 4.0}], "title": "\nSalmon with Summer Vegetables\n"}, {"directions": "\n\n              Preheat the broiler. Cook the rice as the label directs; set aside. Meanwhile, finely grate the ginger, garlic and the zest of 1 lime into a large bowl. Stir in the juice of 1 1/2 limes and the fish sauce. Add the bell peppers, red onion, jalapeno, 3/4 cup cilantro and a pinch each of salt and pepper; toss. Let sit, tossing occasionally, until ready to serve. Cut the remaining 1/2 lime into wedges; set aside.\n            \n\n              Line a baking sheet with foil. Cut the salmon in half lengthwise, then crosswise to make 4 equal squares; season with salt and pepper. Transfer to the prepared baking sheet and broil until just cooked through, 5 to 8 minutes.\n            \n\n              Divide the rice among four plates. Transfer the salmon to the plates, leaving the skin behind; top with the vegetable mixture. Sprinkle with the remaining 1/4 cup cilantro and the peanuts. Serve with the lime wedges.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "crisped rice bar", "quantity": 1.0}, {"food": "ginger", "quantity": 1.5}, {"food": "garlic powder", "quantity": 1.0}, {"food": "limes", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 1.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}, {"food": "", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.25}, {"food": "peanuts", "quantity": 0.25}], "title": "\nSalmon with Thai Vegetables and Black Rice\n"}, {"directions": "\n\n              Combine the cider, apples, 2 shallots, 2 tablespoons vinegar, 1 teaspoon curry powder, and salt and pepper to taste in a saucepan and bring to a boil. Cook until the liquid evaporates, about 12 minutes; let cool slightly. Stir in 2 tablespoons chopped cilantro.\n            \n\n              Meanwhile, pulse three-quarters of the salmon in a food processor until finely ground. Add the remaining salmon; pulse until chopped. Transfer to a bowl; stir in the panko, mayonnaise and the remaining shallot, 2 tablespoons cilantro, 1 tablespoon vinegar and 2 teaspoons curry powder. Add salt and pepper. Form into four 1/2-inch-thick patties.\n            \n\n              Melt the butter in a large nonstick skillet over medium-high heat. Add the patties and cook until browned and cooked through, 2 to 3 minutes per side. Butter the buns and sandwich with the salmon burgers, mayonnaise, the apple relish and more cilantro. Serve with chips.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "apple", "quantity": 1.0}, {"food": "apples", "quantity": 2.0}, {"food": "onion powder", "quantity": 3.0}, {"food": "vinegar", "quantity": 3.0}, {"food": "curry powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 0.25}, {"food": "pineapple chunks", "quantity": 1.25}, {"food": "", "quantity": 0.5}, {"food": "mayonnaise dressing", "quantity": 2.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "potato flour", "quantity": 4.0}, {"food": "potato chips", "quantity": 1}], "title": "\nSalmon-Apple Burgers\n"}, {"directions": "\n\n              Cut 1 carrot and 1 black radish into matchsticks. Roll up a few pieces of each in 1/2-inch-wide strips of smoked salmon. Wrap thin strips of nori (seaweed sheets, found in the Asian-food section) around the salmon, moistening with wasabi or mayonnaise to seal. For dipping, mix 1/4 cup soy sauce with 2 teaspoons each orange juice and water, and some orange zest.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [], "title": "\nSalmon-Carrot Sushi\n"}, {"directions": "\n\n              Spread softened cream cheese on white bread. Sandwich with smoked salmon and sliced cucumber. Trim the crusts and cut into pieces.\n            \n", "ingredients": [], "title": "\nSalmon-Cucumber Tea Sandwich\n"}, {"directions": "\n\n              Cook the bacon in a large saucepan over medium heat until crisp, about 5 minutes. Stir in the shallots and half of the dill and cook until the shallots are soft, about 3 minutes.\n            \n\n              Add the potatoes, carrots, 4 cups water and 1 teaspoon salt. Increase the heat to medium high, cover and bring to a simmer. Cook until the potatoes and carrots are almost tender, about 6 minutes. Add the mushrooms and Brussels sprouts and cook until all of the vegetables are tender, about 6 more minutes. Meanwhile, whisk the egg yolks, half-and-half and wine in a small bowl.\n            \n\n              Reduce the heat to medium low, add the salmon and cook until opaque, 2 to 3 minutes. Gently stir in the egg mixture and cook until the soup thickens slightly, 1 to 2 minutes. Season with salt and pepper. Divide among bowls and top with the remaining dill.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "bacon", "quantity": 4.0}, {"food": "shallots", "quantity": 6.0}, {"food": "dill seed", "quantity": 0.3333333333333333}, {"food": "sweet potatoes", "quantity": 3.0}, {"food": "diced chicken", "quantity": 6.0}, {"food": "salt", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "brussels sprouts", "quantity": 10.0}, {"food": "egg substitute", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "lemon juice", "quantity": 3.0}, {"food": "salmon", "quantity": 0.75}, {"food": "pepper", "quantity": 1}], "title": "\nSalmon-Vegetable Chowder\n"}, {"directions": "\n\n              In a small bowl, mix together the tomatoes, onion, jalapeno, coriander. Season with salt and pepper. Cover with plastic wrap and set aside for 1 hour. Serve with Tortilla Chips.\n            \n\nTortilla Chips\n\n\n              Pour the oil into a large heavy-bottomed pot to a depth of about 2 inches. Place a deep-frying thermometer in the pot. Heat the oil over medium heat to 360 degrees F.\n            \n\n              Meanwhile, stack the tortillas, and cut the pile into sixths to make chips.\n            \n\n              Raise the heat to high. Working in batches, fry the chips, turning them with a skimmer or slotted spoon, until golden brown, about 2 minutes. Using a slotted spoon, transfer the chips to a paper towel-lined pan to drain. (Return the oil to the proper temperature between batches.) Cool and season with salt. Serve.\n            \n", "ingredients": [{"food": "tomatoes", "quantity": 4.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "barley flour or meal", "quantity": 1.0}, {"food": "", "quantity": 0.25}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "vegetable oil", "quantity": 1}, {"food": "corn bran", "quantity": 6.0}, {"food": "salt", "quantity": 1}], "title": "\nSalsa and Chips\n"}, {"directions": "\n\n              MARINATE THE STEAK: Combine 1 cup of the salsa, the garlic, 2 tablespoons of the oil, the Worcestershire, and lime juice in a resealable plastic bag and add the steak. Shake to evenly disperse and marinate for at least 30 minutes at room temperature or up to 2 hours in the refrigerator.\n            \n\n              SET UP: Preheat the oven to 300 degrees F. Wrap the tortillas in aluminum foil and keep warm in the oven.\n            \n\n              SEAR THE STEAKS: Heat a large skillet over medium-high heat. Remove the steaks from the bag, allowing the large salsa bits and extra marinade to drip off, and pat with paper towels to dry slightly. Sprinkle with 1 teaspoon salt and a couple turns of pepper. Pour the remaining 2 tablespoons oil into the skillet and cook the steaks on one side until browned, about 4 minutes. Flip and cook until charred and medium-rare, about 3 more minutes. Let rest on a cutting board before slicing.\n            \n\n              MASH THE BEANS: Add the beans with their liquid to the same skillet and cook until the liquid has reduced by half, 4 to 6 minutes. Mash with a potato masher until smooth.\n            \n\n              ASSEMBLE THE TACOS: Slice the steak against the grain into 2- to 3-inch-long pieces. Spread the center of each tortilla with 1 tablespoon of the beans. Arrange a few slices of steak on top of each with some of the remaining salsa and some cilantro. Serve the extra beans on the side.\n            \n", "ingredients": [{"food": "ruby red grapefruit juice blend", "quantity": 1.5}, {"food": "garlic powder", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "lime juice", "quantity": 1.0}, {"food": "", "quantity": 1.25}, {"food": "potato flour", "quantity": 12.0}, {"food": "black bean mango", "quantity": 1}, {"food": "fava beans", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 0.5}], "title": "\nSalsa-Marinated Skirt Steak Soft Tacos with Refried White Beans\n"}, {"directions": "\n\n              Mix 1/2 cup salsa, 2 smashed avocados, 2 tablespoons each lime juice and chopped cilantro, and salt to taste. Serve with tortilla chips.\n            \n", "ingredients": [], "title": "\nSalsamole\n"}, {"directions": "\n\n              Soak the cod in cold water in the refrigerator for 24 hours, changing the water 4 times.\n            \n\n              Drain the cod. Put in a saucepan, cover with water and bring to a bare simmer; drain, then repeat with fresh water. Drain again, then add the milk and cream to the pan. Bring to a simmer over medium-low heat and cook until the fish is flaky, about 15 minutes. Reserve 1/2 cup of the milk mixture, then drain and coarsely flake the fish.\n            \n\n              Put the potatoes in a saucepan and cover with cold water. Bring to a simmer over medium heat and cook until tender, about 20 minutes; drain. Let cool slightly, then press through a ricer or a food mill. Meanwhile, combine the olive oil, garlic, thyme and cloves in a small saucepan; cook over low heat, 5 minutes. Strain the flavored oil and set aside.\n            \n\n              Put the cod, half of the flavored oil, the reserved milk mixture, the lemon juice and 1/2 cup hot water in a food processor; pulse until smooth. Add the potatoes and the remaining flavored oil and pulse to combine; season with pepper. Transfer to a bowl and drizzle with olive oil. Serve warm with crackers.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "salt", "quantity": 0.75}, {"food": "whole milk", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 0.6666666666666666}, {"food": "garlic powder", "quantity": 4.0}, {"food": "thyme", "quantity": 2.0}, {"food": "cloves", "quantity": 4.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "barley flour or meal", "quantity": 1}], "title": "\nSalt Cod Dip\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: a candy thermometer\n\n              Line an 8-inch square baking dish with parchment paper, leaving some paper hanging over the edges of the dish. Spray the parchment and the exposed sides of the dish with cooking spray.\n            \n\n              Combine the cream, butter and 1 1/2 teaspoons salt in a small pot over medium heat until the butter melts; remove from the heat and set aside. \n            \n\n              Combine the sugar, corn syrup and 1/4 cup water in a large saucepan over medium heat and cook, swirling occasionally, until the syrup is medium-amber colored and registers 310 to 320 degrees F on a candy thermometer. \n            \n\n              Remove from the heat and slowly whisk in the cream mixture. Return to medium heat and cook until the caramel reaches 245 degrees F. Remove from the heat and whisk in the vanilla and 2 teaspoons peppercorns. Pour the caramel into the prepared dish and tap it against the counter a few times to help get rid of air bubbles. Sprinkle the top with the remaining 1/2 teaspoon salt and 2 teaspoons peppercorns. Let cool to room temperature.\n            \n\n              Cover the baking dish and let set completely, 4 hours or up to overnight. Lift the caramel out of the pan using the parchment paper overhang and transfer on the paper to a cutting board. Cut the caramels into candies with a very sharp knife. (If the caramels stick to your knife, spray your knife with nonstick cooking spray.) Cut squares of wax paper a little bigger than your caramels. Wrap each caramel in a piece of wax paper and twist the ends closed. Caramels will keep at room temperature for about 2 weeks.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "salt", "quantity": 2.0}, {"food": "sugar", "quantity": 1.5}, {"food": "corn bran", "quantity": 0.25}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "mixed nuts", "quantity": 4.0}], "title": "\nSalt and Pepper Caramels\n"}, {"directions": "\n\n              Position racks in the upper and lower thirds of the oven and preheat to 450 degrees F. Rinse the fish inside and out and pat dry with paper towels. Season inside and out with pepper. Finely chop 2 tablespoons parsley and set aside. Divide the remaining parsley between the fish cavities.\n            \n\n              Toast the fennel seeds in a dry medium skillet over medium heat until golden, about 4 minutes. Grind the toasted fennel seeds in a spice grinder or with a mortar and pestle; transfer all but 1 tablespoon to an extra-large bowl. Add the salt and lemon zest, then stir in the egg whites until the mixture is the consistency of wet sand.\n            \n\n              Pat a thin layer of the salt mixture, slightly larger than the shape of the fish, on each of 2 rimmed baking sheets. Put the fish on top of each salt pile, then cover completely with the remaining salt mixture, following the shape of the fish and patting down the salt mixture. Before the fish is fully encased, mark the thickest part of each fish behind the neck with a paring knife and make a small hole in the salt mixture (this is where you?ll insert a thermometer).\n            \n\n              Bake the fish until the crusts are golden and a thermometer inserted into the marked spots registers 140 degrees F, 40 to 50 minutes. Remove from the oven and let stand 15 minutes.\n            \n\n              Meanwhile, make the relish: Mix the olives with the olive oil, lemon juice, reserved 2 tablespoons parsley and 1 tablespoon ground fennel, 1 tablespoon water, 1/4 teaspoon salt and a few grinds of pepper. Set aside until ready to serve.\n            \n\n              To remove the salt, crack the crusts all the way around the fish with a paring knife; discard the crusts. Slide a spatula under each end of the fish and transfer to a platter or cutting board. To serve, remove the top fillet of each fish with a butter knife or spoon; discard the skin. Pull off the bone; discard the bone and head. Remove the skin from the bottom fillet. Serve with the lemon-olive relish.\n            \n\n              Photograph by Ryan Liebe\n            \n", "ingredients": [{"food": "sea bass", "quantity": 2.0}, {"food": "pepper", "quantity": 1}, {"food": "parsley", "quantity": 1.0}, {"food": "fennel seed", "quantity": 0.5}, {"food": "salt", "quantity": 2.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "egg substitute", "quantity": 3.0}, {"food": "sweet potatoes", "quantity": 0.3333333333333333}, {"food": "vegetable oil", "quantity": 0.5}], "title": "\nSalt-Baked Fish with Lemon-Olive Relish\n"}, {"directions": "\n\n              Put the potatoes and 1/2 cup salt in a large saucepan. Cover by about 1 inch with cold water. Bring to a boil, lower the heat and simmer until the potatoes are fork tender, 5 to 8 minutes. Drain the potatoes and return to the pot. Set aside to dry so the salt crystalizes, about 5 minutes. Keep warm.\n            \n\n              Divide the potatoes among 4 plates. Drizzle with some Ranch Dressing and sprinkle with some bacon and scallions.\n            \n\nRanch Dressing:\n\n\n              Smash the garlic on a cutting board, sprinkle with 1/2 teaspoon salt, and, with the side of a large knife, mash and smear the mixture to a coarse paste. Scrape the paste into a small bowl and add the mayonnaise, buttermilk, chives, parsley, vinegar, scallion and black pepper to taste. Whisk well to make a creamy dressing. Use immediately or refrigerate in a tightly sealed container for up to 3 days.\n            \n", "ingredients": [{"food": "mixed nuts", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "bacon", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "garlic powder", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "mayonnaise dressing", "quantity": 1.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.3333333333333333}, {"food": "chives", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "silk light vanilla", "quantity": 1.0}], "title": "\nSalt-Crusted Baby Potatoes with Ranch, Bacon and Scallions\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Put a 1/4-inch layer of salt in the bottom of a small baking dish. Place the beets on top of the salt, making sure they are not touching each other. Cover the beets with the remaining salt (save some for seasoning) and bake until fork-tender, about 1 hour, 15 minutes. Remove the beets from the salt and let cool to room temperature.\n            \n\n              Meanwhile, make the dressing: Puree the goat cheese, creme fraiche, olive oil, vinegar and shallot in a blender until smooth. Season with salt and pepper. Refrigerate until ready to use.\n            \n\n              Heat the vegetable oil in a small skillet over medium heat until shimmering. Add the sage leaves and fry until crisp, 5 to 10 seconds. Transfer with a slotted spoon to a paper towel-lined plate to drain; season lightly with salt.\n            \n\n              Peel the beets (the skins will slip right off) and slice into thin rounds using a mandoline or sharp knife. Divide the beet slices among plates. Spoon some of the goat cheese dressing on top. Put the arugula in a bowl, drizzle with the lemon juice and olive oil, season with salt and toss. Add the arugula salad to the plates; drizzle with more goat cheese dressing, if desired. Top with the pine nuts and fried sage.\n            \n\n              Photograph by Yunhee Kim\n            \n", "ingredients": [{"food": "salt", "quantity": 1.0}, {"food": "beets", "quantity": 4.0}, {"food": "macaroni cheese", "quantity": 0.5}, {"food": "", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 4.0}, {"food": "arugula", "quantity": 2.0}, {"food": "", "quantity": 0.5}, {"food": "pine nuts", "quantity": 0.25}], "title": "\nSalt-Roasted Beet Carpaccio\n"}, {"directions": "\n\n              Combine the crushed chips with the flour, 1/2 teaspoon salt and the cayenne pepper in a shallow bowl. Whisk the eggs, tartar sauce and 3 tablespoons water in another shallow bowl. One at a time, dredge each fish strip in the potato chip mixture, turning to coat, then dip in the egg mixture and dredge again in the potato chip mixture. Place on a baking sheet until ready to fry. Fill a large skillet about halfway with vegetable oil and heat over medium-high heat until a deep-fry thermometer registers 350 degrees F. Working in batches, fry the fish, turning, until golden brown and crisp, 5 to 8 minutes. (Let the oil return to 350 degrees F between batches.) Drain on paper towels and season with salt. Serve with lemon wedges and/or vinegar.\n            \n\n              Photograph by Johnny Miller\n            \n", "ingredients": [{"food": "potato chips", "quantity": 1.0}, {"food": "potato flour", "quantity": 0.3333333333333333}, {"food": "salt", "quantity": 1}, {"food": "hearts of palm", "quantity": 1}, {"food": "eggs", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "pollock", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "vinegar", "quantity": 1}], "title": "\nSalt-and-Vinegar Fish Sticks\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F and line a 9-by-13-inch baking dish with foil, leaving a 2-inch overhang on all sides; butter the foil. Combine 2 tablespoons butter, 1/4 cup brown sugar and the heavy cream in a small saucepan. Bring to a simmer over medium heat, stirring occasionally; continue to cook, stirring frequently, until slightly thickened, 3 to 4 minutes. Remove from the heat and stir in the scotch and 1 teaspoon vanilla; set aside to cool.\n            \n\n              Melt the remaining 2 sticks butter in a large saucepan; let cool slightly. Stir in the remaining 1 1/2 cups brown sugar, the eggs and the remaining 2 teaspoons vanilla, then stir in the flour, baking soda and fine salt.\n            \n\n              Spread the batter in the prepared pan and pour the butterscotch sauce on top. Gently swirl the sauce into the batter using a knife. Bake until a toothpick inserted into the center comes out clean, 30 to 35 minutes. Sprinkle with flaky sea salt and let cool completely in the pan. Lift the blondies out of the pan using the foil overhang. Cut into pieces.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 2.0}, {"food": "sugar", "quantity": 1.75}, {"food": "ice cream swich", "quantity": 0.3333333333333333}, {"food": "", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "potato flour", "quantity": 2.5}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 0.25}, {"food": "sea lion", "quantity": 1}], "title": "\nSalted Butterscotch Blondies\n"}, {"directions": "\n\n              Freeze the candy bars until hard, at least 1 hour; cut into 1/4-inch pieces and keep frozen until ready to use.\n            \n\n              Whisk the flour, baking soda, baking powder and fine salt in a medium bowl. Beat the butter, brown sugar and granulated sugar in a large bowl with a mixer on medium speed until light and creamy, about 3 minutes. Add the egg and vanilla and beat until combined. Reduce the mixer speed to low and gradually beat in the flour mixture until incorporated. Stir in the frozen chocolate pieces.\n            \n\n              Line 2 baking sheets with parchment paper. Arrange scoops of dough (about 2 tablespoons per cookie) about 2 inches apart on the baking sheets. Refrigerate until cold, at least 1 hour or overnight.\n            \n\n              Position racks in the upper and lower thirds of the oven and preheat to 375 degrees F. Sprinkle the cookies with sea salt. Bake, switching the pans halfway through, until light golden, 10 to 12 minutes. Let cool completely on the baking sheets.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 2.0}, {"food": "potato flour", "quantity": 1.75}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "sugar", "quantity": 0.25}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "sea lion", "quantity": 1}], "title": "\nSalted Caramel Chocolate Chip Cookies\n"}, {"directions": "\nSpecial equipment: 3 sheets of stiff paper or 2 manila folders (split at the seam), scissors, a ruler and a pencil; a base for the house (you can find these at crafts stores or make one with stiff pieces of cardboard wrapped in aluminum foil); 3 small cans (for propping up the walls); 2 piping bags, one fitted with a small plain tip and the other fitted with a large plain tip; a silicone brush\n\n              For the gingerbread: Sift together the flour, ginger, cinnamon, baking soda, nutmeg, salt and cloves into a large bowl. Set aside.\n            \n\n              Combine the butter, shortening, brown sugar and granulated sugar in the bowl of a stand mixer fitted with the paddle attachment. Beat on medium speed until light and fluffy, about 1 minute. Add the molasses, vanilla and egg and beat on medium until smooth, about 1 minute. Add the sifted flour mixture and mix on low speed until combined into a smooth dough, about 1 minute. Form the dough into a flat square, wrap in plastic wrap and refrigerate until just firm, at least 2 hours and up to overnight.\n            \n\n              Meanwhile, make templates for the gingerbread house. Gather 3 sheets of stiff paper or 2 manila folders (split at the seam), scissors, a ruler and a pencil. For the side panels, draw and cut out a rectangle that measures 4 by 7 inches. For the front and back panels of a house with a peaked roof, draw and cut out a template that is 6 inches wide at the base, 4 inches to the roofline and 4 1/2 inches slanted to a peak. The template for the roof panels should measure 4 1/2 by 8 inches.\n            \n\n              Preheat the oven to 300 degrees F. Line 3 baking sheets with parchment paper. \n            \n\n              Unwrap the dough and cut into 3 equal pieces (a pizza wheel is handy for this). Working with 1 piece of dough at a time and keeping the other pieces refrigerated, roll the dough into a rectangle 1/8 to 1/4 inch thick. Using the template, cut out the side panels and remove the scraps around the cutouts. Repeat with the remaining 2 pieces of dough, cutting out the front and back panels and 2 roof panels. If the dough gets too soft while rolling, return it to the refrigerator for 15 minutes before proceeding. (Discard the dough scraps or reroll to make cookies.) Chill the dough pieces on the prepared baking sheets for 15 minutes.  \n            \n\n              Bake the dough pieces until crisp almost all the way through (the very center will still be a little soft), 30 to 35 minutes. Cool in the pans 10 minutes on a rack, then remove the house pieces to the rack to cool completely. \n            \n\n              For the royal icing: Combine the confectioners' sugar and meringue powder in a large bowl. Add the vanilla and 5 tablespoons water and beat on medium-high speed with an electric mixer, scraping down the sides of the bowl as necessary, until the icing forms thick and glossy peaks, about 2 minutes, adding up to 1 tablespoon more water if needed. Divide the icing between the 2 prepared piping bags (one fitted with a small plain tip and the other fitted with a large plain tip). \n            \n\n              Decorate the side panels: Using the piping bag fitted with a small tip, pipe a pea-size dot of icing onto the back of 1 of the peppermint hard candies and attach it to the top center of 1 of the side panels. Pipe icing onto the backs of 4 of the fig bar pieces and attach them to the panels as evenly spaced windows shutters. Pipe icing to draw 2 windows between the shutters. Line the frames with pretzel sticks, breaking them to fit. Pipe a pea-size dot of icing onto the backs of 9 of the butterscotch candies and press them along the bottom of the panel. Repeat this process on the remaining side panel. Let the panels rest until set, 30 minutes to 1 hour.\n            \n\n              Decorate the front panel: Using the piping bag fitted with a small tip, pipe a double line of icing across the front panel where the roof starts to incline; press on about 11 French toast cereal pieces. Pipe a small dot of icing onto the back of 1 of the red sprinkle-coated gummy candies and attach it to the front panel just above the line of cereal. To make a flower, pipe a small dot of icing on the cut sides of 8 of the toasted-marshmallow jelly bean pieces and attach them in a ring around the red gummy. Pipe icing to draw a door; attach the caramel jelly bean with a dot of icing to make a doorknob. Pipe icing onto the backs of the gummy gingerbread people and place 1 on either side of the door. Pipe icing to draw 2 windows; line the frames with pretzel sticks, breaking them to fit. Let the panel rest until set, 30 minutes to 1 hour.\n            \n\n              Decorate the back panel: Using the piping bag fitted with a small tip, pipe a double line of icing across the back panel where the roof starts to incline; press on the remaining French toast cereal as needed. Pipe a small dot of icing onto the back of the remaining red sprinkle-coated gummy candy and attach it just above the line of cereal. To make a flower, pipe a small dot of icing on the cut sides of the remaining 8 toasted-marshmallow jelly bean pieces and attach them in a ring around the red gummy. Create a decorative trim by piping a pea-size dot of icing onto the backs of the caramel-coated pretzels and pressing them along the bottom of the panel. Pipe icing to form 2 windows; line the frames with pretzel sticks, breaking them to fit. Let the panel rest until set, 30 minutes to 1 hour.\n            \n\n              Decorate the roof panels: Using the piping bag fitted with a large tip, pipe short lines of icing onto the backs of a few pieces of the frosted shredded wheat cereal and attach them to 1 of the roof panels in a row. Repeat until both roof panels are completely covered. Let the panels rest until set, 30 minutes to 1 hour.\n            \n\n              For the caramel: Spread the sugar in a medium skillet (see Cook's Note). Sprinkle with the lemon juice and 1/4 cup water. Set the skillet over medium-low heat and cook, stirring occasionally, until the sugar melts, about 2 to 3 minutes. Once the sugar has melted, stop stirring and cook, swirling the contents occasionally, until the sugar syrup is a deep amber color, about 12 to 15 minutes.\n            \n\n              Assemble the walls: Carefully place the skillet of hot caramel by your work surface (you will use it like glue to attach the panels to the base and to one another). Dip the bottom of the front panel in the caramel and place it on the foil-wrapped base. Use a silicone brush to brush a line of caramel along the inside of the panel at the base to reinforce it. Prop up the panel with a can. Brush more caramel up 1 edge of the front panel so you can attach the side of the house. Dip 1 side of a side panel in the caramel and place it perpendicular to the front panel, forming a corner. Brush the inside of the panel along the base with more caramel to reinforce it. Prop up the side piece with a can. Repeat with the second side panel and the back panel. Sprinkle the seams of the house with sea salt. \n            \n\n              Attach the roof: Once the walls are set enough to hold the roof panels and while the caramel in the skillet is still warm, remove the cans. Then brush the warm caramel onto the back of a roof panel along the edges (where the roof will attach to the walls); press the panel onto the house and hold it in place until the caramel sets, about 30 seconds. Repeat with the other roof panel. Use the piping bag fitted with a large tip to pipe icing along the seams of the roof to reinforce it.\n            \n\n              Landscape the yard: Using the piping bag fitted with a large tip, pipe a rectangular walkway in front of the house; line the edges with pecan halves and pave the middle with crushed sesame candy. Pipe icing snowdrifts around the walkway and the base of the house; sprinkle with popcorn, pressing it gently into the icing so it sticks.\n            \n\n              Using the piping bag fitted with a large tip, pipe more icing along the top seam of the roof; line with a row of the fluted gummy caramels. Let the house rest until dry.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 3.0}, {"food": "ginger", "quantity": 1.0}, {"food": "cinnamon", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "nutmeg", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "cloves", "quantity": 0.25}, {"food": "butter oil", "quantity": 4.0}, {"food": "shortening confectionery", "quantity": 4.0}, {"food": "sugar", "quantity": 0.5}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "molasses", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "onion powder", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "peppermint", "quantity": 2.0}, {"food": "chocolate chip cookies", "quantity": 4.0}, {"food": "turkey sticks", "quantity": 1}, {"food": "", "quantity": 18.0}, {"food": "french toast", "quantity": 22.0}, {"food": "ruby red grapefruit juice blend", "quantity": 2.0}, {"food": "fava beans", "quantity": 8.0}, {"food": "black bean mango", "quantity": 1.0}, {"food": "", "quantity": 2.0}, {"food": "pretzels", "quantity": 6.0}, {"food": "cereal bar", "quantity": 70.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 7.0}, {"food": "sesame meal", "quantity": 2.0}, {"food": "", "quantity": 1}, {"food": "", "quantity": 9.0}, {"food": "sugar", "quantity": 1.5}, {"food": "lemon juice", "quantity": 0.5}], "title": "\nSalted Caramel Gingerbread House\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Cut a 24-by-6-inch strip of parchment paper. Butter the side of an 8-inch springform pan, then line the side with the parchment; the paper will extend above the rim of the pan so you can build a tall cake. Cover the bottom of the pan with half of the pizzelle cookies, breaking them into smaller pieces as needed to cover the surface. Spread 1/4 cup fudge sauce over the cookies. Pack about half of the vanilla-caramel and chocolate ice cream into the pan, alternating scoops of each flavor, until the bottom is covered. Drizzle with 1/4 cup dulce de leche and sprinkle with 1/4 teaspoon sea salt. Top with the remaining pizzelle cookies, pressing gently to pack in the ice cream and create an even surface. Spread 1/4 cup fudge sauce over the pizzelle cookies. Top with scoops of the remaining vanilla-caramel and chocolate ice cream. Drizzle with the remaining 1/4 cup each dulce de leche and fudge sauce and sprinkle with the remaining 1/4 teaspoon sea salt. Arrange the ice cream cones, point-side up, on top. Freeze until firm, at least 6 hours or overnight. Remove the side of the springform pan and the parchment. Press the toffee bits into the side of the cake. Serve immediately or freeze for up to 2 days.\n            \n\n               Photograph by Kana Okada\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1}, {"food": "chocolate chip cookies", "quantity": 14.0}, {"food": "Worcestershire sauce", "quantity": 0.75}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "dulce de leche", "quantity": 0.5}, {"food": "sea lion", "quantity": 0.5}, {"food": "sugar", "quantity": 5.0}, {"food": "tender bits", "quantity": 0.25}], "title": "\nSalted Caramel Ice Cream Cone Cake\n"}, {"directions": "\n\n              Blend the ice cream, dulce de leche, tequila and 3 ice cubes in a blender on medium speed until thick and smooth. Divide among small glasses. Top with whipped cream, sea salt and/or candied orange peel.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [{"food": "ice cream swich", "quantity": 1.0}, {"food": "dulce de leche", "quantity": 0.3333333333333333}, {"food": "barley flour or meal", "quantity": 1.0}, {"food": "orange peel", "quantity": 1}], "title": "\nSalted Caramel Milkshake\n"}, {"directions": "\n\n              Preheat the oven to 325 degrees F. Heat the heavy cream, milk, vanilla and salt in a small saucepan over medium heat until just starting to bubble. Remove from the heat and cover to keep warm.\n            \n\n              Make the caramel: Combine the sugar and 1/4 cup water in another small saucepan over medium heat, stirring just until the sugar dissolves. Cook, swirling the pan occasionally but not stirring, until amber, about 10 minutes. Brush any sugar crystals off the side of the pan with a wet pastry brush. Remove from the heat and carefully whisk in the warm cream mixture (the mixture will bubble). Add the chocolate and stir until smooth.\n            \n\n              Whisk the egg yolks in a medium bowl. Whisk about half of the caramel into the yolks, then add the remaining caramel and whisk until smooth. Strain through a fine-mesh sieve into a large liquid measuring cup.\n            \n\n              Divide the mixture among six 6-ounce ramekins. Set the ramekins in a large baking dish, then add enough hot water to come about halfway up the sides of the ramekins. Cover the pan tightly with foil and bake until the pots de creme are set around the edges but still jiggle in the center, 45 to 50 minutes.\n            \n\n              Remove the ramekins from the water and let cool to room temperature. Cover with plastic wrap and refrigerate until cold, at least 2 hours or overnight. Sprinkle with salt.\n            \n\n              Photograph by Kana Okada\n            \n", "ingredients": [{"food": "ice cream swich", "quantity": 2.0}, {"food": "whole milk", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "sea lion", "quantity": 0.5}, {"food": "sugar", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "egg substitute", "quantity": 6.0}], "title": "\nSalted Caramel Pots de Creme\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Butter a 9-by-13-inch baking dish, then line with parchment paper, leaving an overhang on 2 sides; butter the parchment.\n            \n\n              Beat 2 1/2 sticks butter, the granulated sugar and 1 teaspoon vanilla in a large bowl with a mixer on medium-high speed until light and fluffy, 3 to 5 minutes. Reduce the mixer speed to low; add the flour and beat until just incorporated.\n            \n\n              Transfer the dough to the prepared baking dish and set a piece of plastic wrap directly on the surface. Press into an even layer, then peel off the plastic. Bake until golden brown, 30 to 35 minutes. Transfer to a rack to cool slightly, then remove from the pan using the parchment. Cut into triangles.\n            \n\n              Make the caramel: Combine the remaining 1/2 stick butter, the brown sugar, corn syrup, heavy cream, espresso powder and kosher salt in a small saucepan over medium heat. Cook, stirring occasionally, until a candy thermometer registers 235 degrees F, about 6 minutes. Remove from the heat and stir in the remaining 1 teaspoon vanilla and the vinegar. Let cool 5 minutes, then drizzle over the shortbread. Sprinkle with sea salt.\n            \n\n              Photograph by Andrew Purcell\n            \n", "ingredients": [{"food": "butter oil", "quantity": 3.0}, {"food": "sugar", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "potato flour", "quantity": 2.5}, {"food": "sugar", "quantity": 0.5}, {"food": "silk light vanilla", "quantity": 3.0}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "salt", "quantity": 0.25}, {"food": "vinegar", "quantity": 0.5}, {"food": "sea lion", "quantity": 1}], "title": "\nSalted Caramel Shortbread\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Make the snickerdoodle cookies: Line 2 baking sheets with parchment paper. Whisk together the flour, cream of tartar and kosher salt in a medium bowl until evenly combined. Whisk 1 cup of the sugar, the butter, vanilla and egg together in a large bowl until well combined. Pour in the flour mixture and stir with a spoon until the dough just combines.\n            \n\n              Stir together the remaining 1/4 cup sugar and the cinnamon in a small bowl. Using a 1/2-ounce ice cream scoop or a tablespoon, portion and roll the dough into 30 (1-inch) balls. Roll each ball in the cinnamon-sugar to coat, and then transfer to the prepared baking sheets, spacing the balls 2 inches apart. Using the end of a wooden spoon or your index finger, press each dough ball in the center to create a deep divot. Refrigerate the dough balls on the baking sheets for 30 minutes.\n            \n\n              Preheat the oven to 400 degrees F. Bake the cookies, rotating the baking sheets front to back and top to bottom halfway through, until light golden brown on the bottom, about 12 minutes. Let the cookies cool for 1 minute on the baking sheets, and then transfer them to a wire rack to cool completely.\n            \n\n              Make the salted caramel filling: Pour the sugar in a small saucepan and place over medium heat. Cook the sugar, stirring occasionally, until it turns liquid and deep amber brown. Remove the pan from the heat and stir in the butter until smooth. Add the cream and kosher salt and stir until incorporated. Fill the divot in each cookie with the hot caramel and sprinkle with sea salt. Let the caramel cool for 30 minutes to set before serving.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.25}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "sugar", "quantity": 1.25}, {"food": "butter oil", "quantity": 1.5}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "cinnamon", "quantity": 4.0}, {"food": "sugar", "quantity": 0.25}, {"food": "butter oil", "quantity": 1.5}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "salt", "quantity": 0.125}, {"food": "sea lion", "quantity": 1}], "title": "\nSalted Caramel Snickerdoodles\n"}, {"directions": "\n\n              Make the caramel: Combine the granulated sugar, 1/3 cup water and the salt in a large skillet over medium heat, stirring just until the sugar dissolves. Cook, gently swirling the skillet occasionally but not stirring, until amber, 8 to 10 minutes. Brush any sugar crystals off the side of the skillet with a wet pastry brush. Remove from the heat and whisk in 3 tablespoons butter and the vinegar (the mixture will bubble).\n            \n\n              Add the apples and cook, stirring occasionally, until soft, about 12 minutes. Strain the apples and transfer to a bowl; set the caramel aside. Toss 1 tablespoon gingersnap crumbs and the cinnamon with the apples; let cool completely.\n            \n\n              Melt the remaining 5 tablespoons butter in a small saucepan over medium-low heat. Let cool, then skim off the foam and discard. Spoon the melted butter into a bowl, leaving any solids in the pan.\n            \n\n              Position a rack in the lower third of the oven and preheat to 375 degrees F. Line a baking sheet with parchment paper. Place a sheet of phyllo on a clean kitchen towel or piece of parchment with a long side in front of you. (Keep the remaining phyllo covered with a damp towel.) Lightly brush the phyllo with some of the melted butter and sprinkle with granulated sugar. Layer another sheet of phyllo on top; brush with more butter and sprinkle with more sugar. Repeat with the remaining 4 sheets of phyllo. Sprinkle the remaining 2 tablespoons gingersnap crumbs on top.\n            \n\n              Spoon the apple filling onto the phyllo in a strip along the bottom edge, leaving a 1-inch border. Use the towel or parchment to help roll the phyllo into a log, starting at the bottom edge. Place seam-side down on the prepared baking sheet. Brush with more butter and sprinkle with more granulated sugar. Make a few slits on top with a knife to vent. Bake until golden brown, 30 to 35 minutes.\n            \n\n              Beat the heavy cream in a bowl with a mixer on medium speed until soft peaks form, then gently fold in some of the reserved caramel (you may need to whisk the caramel first to loosen). Dust the strudel with confectioners' sugar and cut into pieces. Serve with the caramel whipped cream and more caramel; sprinkle with salt.\n            \n\n              Photograph by Kana Okada\n            \n", "ingredients": [{"food": "sugar", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 1.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "apples", "quantity": 2.0}, {"food": "", "quantity": 3.0}, {"food": "cinnamon", "quantity": 0.5}, {"food": "phyllo dough", "quantity": 6.0}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "sugar", "quantity": 1}], "title": "\nSalted Caramel-Apple Strudel\n"}, {"directions": "\n\n              Make the caramel: Combine the sugar and 1/4 cup water in a medium saucepan over medium heat, stirring just until the sugar dissolves. Cook, gently swirling the pan but not stirring, until amber, about 10 minutes. Brush any sugar crystals off the side of the pan with a wet pastry brush. Remove from the heat and carefully whisk in the butter, heavy cream, bourbon, lemon juice and kosher salt (the mixture will bubble). Pour into a bowl and set aside.\n            \n\n              Make the bread pudding: Preheat the oven to 350 degrees F and butter a 9-by-13-inch baking dish. Spread the bread cubes on a rimmed baking sheet and bake until dry and golden, about 20 minutes. Let cool completely.\n            \n\n              Whisk the eggs, sugar and kosher salt in a large bowl, then whisk in the milk, heavy cream and vanilla until smooth. Fold in the toasted bread and the banana slices. Transfer half of the mixture to the prepared baking dish and spread in an even layer. Drizzle with 1/2 cup of the caramel, then top with the remaining bread mixture. Cover with plastic wrap and refrigerate at least 1 hour or overnight. Cover and refrigerate the remaining caramel until ready to serve.\n            \n\n              Preheat the oven to 350 degrees F. Sprinkle the bread pudding with sea salt and bake until golden brown and set, about 1 hour, 15 minutes. Warm the remaining caramel and drizzle on top.\n            \n\n              Photograph by Kana Okada\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "sugar", "quantity": 1.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "salt", "quantity": 0.75}, {"food": "garlic bread", "quantity": 1}, {"food": "baking chocolate", "quantity": 1}, {"food": "barbecue loaf", "quantity": 1.0}, {"food": "eggs", "quantity": 5.0}, {"food": "sugar", "quantity": 0.75}, {"food": "salt", "quantity": 0.5}, {"food": "whole milk", "quantity": 4.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "bananas", "quantity": 3.5}, {"food": "salt", "quantity": 1}], "title": "\nSalted Caramel-Banana Bread Pudding\n"}, {"directions": "\n\n              Cook 1 1/2 cups sugar and 1/2 cup water in a saucepan over medium-high heat, swirling the pan but not stirring, until dark amber, about 12 minutes. Remove from the heat and whisk in 1 cup heavy cream, 1 teaspoon vanilla and 1/2 teaspoon sea salt. Whisk in 2 tablespoons bourbon. Let cool completely; transfer to jars and refrigerate. (Makes about 2 cups.)\n            \n\n              Photograph by Jeff Harris\n            \n", "ingredients": [], "title": "\nSalted Caramel-Bourbon Sauce\n"}, {"directions": "\n\n              Make the caramel: Combine the sugar, 1/3 cup water and the kosher salt in a medium saucepan over medium heat, stirring just until the sugar dissolves. Cook, gently swirling the pan occasionally but not stirring, until amber, 8 to 10 minutes. Brush any sugar crystals off the side of the pan with a wet pastry brush. Remove from the heat and carefully whisk in the butter (the mixture will bubble). Pour into a 9-inch-round cake pan, tilting the pan to coat the bottom; set aside.\n            \n\n              Slice off the top and bottom of the oranges. Place the oranges cut-side down and cut off the peel and white pith with a chef's knife, following the curve of the fruit. Cut along both sides of each membrane to remove the segments. Set the segments aside, discarding any seeds.\n            \n\n              Make the cake: Preheat the oven to 350 degrees F. Spread the almonds on a baking sheet and roast until golden brown, 8 to 10 minutes. Let cool, then transfer to a food processor and pulse until finely ground. Transfer to a medium bowl; add the flour, baking powder, baking soda and kosher salt and whisk to combine.\n            \n\n              Beat the butter and sugar in a large bowl with a mixer on medium-high speed until fluffy, about 5 minutes. Beat in the eggs one at a time, scraping down the bowl as needed. Beat in the orange zest. Reduce the mixer speed to low; beat in the flour mixture in 3 batches, alternating with the sour cream, beginning and ending with flour, until just smooth.\n            \n\n              Arrange the orange segments in the cake pan in concentric circles. Add the batter and smooth the top. Bake until golden brown and a toothpick inserted into the center comes out clean, 40 to 45 minutes. (Tent with foil if the top gets too dark.) Transfer to a rack and let cool slightly, then run a knife around the edge of the cake and invert onto a platter. Let cool completely. Sprinkle with sea salt.\n            \n\n              Photograph by Kana Okada\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 1.0}, {"food": "", "quantity": 4.0}, {"food": "rice cake", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}, {"food": "potato flour", "quantity": 1.25}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "butter oil", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "orange", "quantity": 1.0}, {"food": "sour cream", "quantity": 0.5}, {"food": "salt", "quantity": 1}], "title": "\nSalted Caramel-Orange Upside-Down Cake\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Make the crust: Lightly coat a 9-inch fluted tart pan with a removable bottom with cooking spray. Spread the pecans on a baking sheet and roast until golden brown, 8 to 10 minutes; let cool. Transfer 1/2 cup of the pecans to a food processor; add the flour, sugar and kosher salt and pulse until the nuts are finely ground. Add the butter and pulse until it is in pea-size bits. Pulse in the egg yolk and vanilla until large clumps form.\n            \n\n              Transfer the dough to the prepared pan and press it into the bottom and up the sides. Prick the bottom all over with a fork, then freeze until firm, about 20 minutes.\n            \n\n              Line the crust with foil and fill with pie weights or dried beans. Bake until set, about 25 minutes, then remove the foil and weights and continue baking until golden, 10 to 15 more minutes. Transfer to a rack and let cool completely.\n            \n\n              Make the caramel for the filling: Combine the sugar, 1/4 cup water and the kosher salt in a medium saucepan over medium heat, stirring just until the sugar dissolves. Cook, swirling the pan but not stirring, until amber, 8 to 10 minutes. Brush any sugar crystals off the side of the pan with a wet pastry brush. Remove from the heat and carefully whisk in the heavy cream, butter and vanilla (the mixture will bubble). Return to medium heat and simmer, whisking constantly, until thick enough to coat a spoon, 3 to 4 minutes. Let cool 5 minutes.\n            \n\n              Gently whisk the eggs and flour in a large bowl, then whisk in the caramel. Place the crust on a baking sheet, arrange the remaining 1 1/4 cups pecans in the bottom and add the filling. Bake until set around the edge, 30 to 35 minutes. Transfer to a rack to cool.\n            \n\n              Put the chocolate in a microwave-safe bowl and microwave in 30-second intervals, stirring, until smooth. Drizzle over the tart and sprinkle with sea salt. Let the chocolate set before slicing.\n            \n\n              Photograph by Kana Okada\n            \n", "ingredients": [{"food": "pie crust", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "pecans", "quantity": 1.75}, {"food": "potato flour", "quantity": 1.0}, {"food": "sugar", "quantity": 0.25}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 6.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "", "quantity": 1}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "butter oil", "quantity": 4.0}, {"food": "eggs", "quantity": 2.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 1}], "title": "\nSalted Caramel-Pecan Tart\n"}, {"directions": "\n\n              Put 1/4 cup pretzels in a resealable plastic bag and crush into coarse crumbs with a rolling pin.\n            \n\n              Beat the butter and sugar in a large bowl with a mixer on medium-high speed until light and fluffy, 3 to 5 minutes. Whisk the egg yolks, honey, vanilla and fine salt in a medium bowl, then add to the butter mixture and beat until incorporated, scraping down the bowl as needed. Reduce the mixer speed to low; add the flour and pretzel crumbs and beat until just combined.\n            \n\n              Put the remaining 1 1/4 cups pretzels in the resealable bag and roughly crush with the rolling pin; spread on a rimmed baking sheet. Drop tablespoonfuls of dough on top and roll into balls, pressing so the pretzels adhere. Refrigerate until firm, about 30 minutes.\n            \n\n              Position racks in the upper and lower thirds of the oven and preheat to 325 degrees F. Line 2 baking sheets with parchment paper. Arrange the cookies about 1 1/2 inches apart on the prepared baking sheets; make a deep indentation in each with your thumb. Bake, switching the position of the pans halfway through, until lightly golden, 15 to 18 minutes. Re-indent with the back of a teaspoon, if necessary. Let cool 3 minutes on the baking sheets, then transfer to racks to cool completely. Fill each indentation with dulce de leche and sprinkle with sea salt.\n            \n\n              Photograph by Johnny Miller\n            \n", "ingredients": [{"food": "turkey sticks", "quantity": 1.5}, {"food": "butter oil", "quantity": 2.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "egg substitute", "quantity": 2.0}, {"food": "honey smoked ham", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "salt", "quantity": 0.5}, {"food": "potato flour", "quantity": 1.75}, {"food": "dulce de leche", "quantity": 0.5}, {"food": "sea lion", "quantity": 1}], "title": "\nSalted Caramel-Pretzel Thumbprints\n"}, {"directions": "\n\n              Spread dulce de leche on small butter crackers. Sandwich with vanilla ice cream.\n            \n\n              Photograph by Jonathan Kantor\n            \n", "ingredients": [], "title": "\nSalted Caramels\n"}, {"directions": "\n\n              Make the chocolate syrup: Combine the sugar and 1/3 cup water in a small saucepan. Bring to a simmer over medium heat, then whisk in the cocoa powder until smooth. Remove from the heat and stir in the vanilla. Let cool completely.\n            \n\n              Spoon about 2 1/2 tablespoons of the chocolate syrup into each glass. Add 1 1/2 cups milk and a generous pinch of salt. Stir until the syrup and salt dissolve.\n            \n\n              Photograph by Steve Giralt\n            \n", "ingredients": [{"food": "sugar", "quantity": 0.5}, {"food": "onion powder", "quantity": 0.3333333333333333}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "milk", "quantity": 6.0}, {"food": "salt", "quantity": 1}], "title": "\nSalted Chocolate Milk\n"}, {"directions": "\n\n              Position a rack in the middle of the oven and preheat to 350 degrees F. Line a 9-inch-square baking pan with aluminum foil, leaving a 2-inch overhang on all sides. Lightly spray the foil with cooking spray.\n            \n\n              Pulse 1 cup pretzel pieces in a food processor until finely ground (you should have about 1/2 cup crumbs). Transfer to a bowl. Whisk in the flour, baking powder and salt.\n            \n\n              Melt the butter in a saucepan over medium heat. Remove from the heat and stir in the brown sugar. Let cool slightly, then stir in the eggs and vanilla. Stir the pretzel crumb mixture into the butter mixture in two additions.\n            \n\n              Spread the batter in the prepared pan. Scatter the remaining 1/2 cup pretzel pieces on top. Bake until golden and a toothpick inserted into the center comes out clean with a few crumbs, 25 to 30 minutes. Let cool completely in the pan on a rack, then lift the foil to remove the bars from the pan and transfer to a baking sheet.\n            \n\n              Preheat the broiler. Press the marshmallow halves, cut-side down, in even rows on top of the bars. Broil, rotating the baking sheet as needed, until the marshmallows are golden brown, 1 to 2 minutes; let cool.\n            \n\n              Put the peanut butter chips and 1/2 teaspoon vegetable oil in a microwave-safe bowl and microwave in 30-second intervals, stirring, until melted and smooth. Repeat with the chocolate chips and the remaining 1/2 teaspoon vegetable oil in another bowl. Drizzle the melted peanut butter and chocolate mixtures over the bars. Let harden at room temperature or chill to set before cutting.\n            \n", "ingredients": [{"food": "pan dulce", "quantity": 1}, {"food": "", "quantity": 1.5}, {"food": "potato flour", "quantity": 1.25}, {"food": "baking chocolate", "quantity": 1.5}, {"food": "salt", "quantity": 1.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 1.5}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "", "quantity": 8.0}, {"food": "peanut butter ", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.25}], "title": "\nSalted Pretzel-Marshmallow Bars\n"}, {"directions": "\n\n              Position a rack in the middle of the oven and preheat to 350 degrees F. Line a 9-inch-square baking pan with aluminum foil, leaving a 2-inch overhang on all sides. Lightly spray the foil with cooking spray.\n            \n\n              Pulse 1 cup pretzel pieces in a food processor until finely ground (you should have about 1/2 cup crumbs). Transfer to a bowl. Whisk in the flour, baking powder and salt.\n            \n\n              Melt the butter in a saucepan over medium heat. Remove from the heat and stir in the brown sugar. Let cool slightly, then stir in the eggs and vanilla. Stir the pretzel crumb mixture into the butter mixture in two additions.\n            \n\n              Spread the batter in the prepared pan. Scatter the remaining 1/2 cup pretzel pieces on top. Bake until golden and a toothpick inserted into the center comes out clean with a few crumbs, 25 to 30 minutes. Let cool completely in the pan on a rack, then lift the foil to remove the bars from the pan and transfer to a baking sheet.\n            \n\n              Preheat the broiler. Press the marshmallow halves, cut-side down, in even rows on top of the bars. Broil, rotating the baking sheet as needed, until the marshmallows are golden brown, 1 to 2 minutes; let cool.\n            \n\n              Put the peanut butter chips and 1/2 teaspoon vegetable oil in a microwave-safe bowl and microwave in 30-second intervals, stirring, until melted and smooth. Repeat with the chocolate chips and the remaining 1/2 teaspoon vegetable oil in another bowl. Drizzle the melted peanut butter and chocolate mixtures over the bars. Let harden at room temperature or chill to set before cutting.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "pan dulce", "quantity": 1}, {"food": "", "quantity": 1.5}, {"food": "potato flour", "quantity": 1.25}, {"food": "baking chocolate", "quantity": 1.5}, {"food": "salt", "quantity": 1.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 1.5}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "", "quantity": 8.0}, {"food": "peanut butter ", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.25}], "title": "\nSalted Pretzel-Marshmallow Bars\n"}, {"directions": "\n\n              Put the cooked rice in a medium bowl. Heat the sesame oil in a large pot over medium-high heat until shimmering. Add the minced garlic and cook, stirring often, until the garlic is toasted and golden brown, 1 minute. Remove the pot from the heat and pour the garlic and sesame oil over the rice. Set the pot aside. Season the rice with 1/4 teaspoon salt and stir with a fork until combined, breaking up any lumps.\n            \n\n              Stuff the cavity of each hen with 1/2 cup of the rice mixture. Overlap the skin flaps to enclose the rice inside the hens, fold the legs closed and tie with kitchen twine.\n            \n\n              Place the hens breast-side down in the reserved pot and add the chicken broth, 2 cups water, shallots, ginger, scallion whites, smashed garlic cloves, sugar and 1 teaspoon salt. Bring to a boil over high heat, skimming the foam that rises to the top. Partially cover the pot and reduce the heat to maintain a steady simmer. Cook for 15 minutes, then use a spatula and a spoon to gently turn the hens breast-side up, being careful not to break the skin (they will float). Continue to simmer, partially-covered, until the hen breasts are firm and a thermometer inserted into the thickest part of the thigh registers 165 degrees F, 15 to 20 minutes more.  \n            \n\n              Meanwhile, make the sauces. Combine the soy sauce and vinegar in a small bowl and set aside. Combine the sesame oil, sesame seeds, 1/4 teaspoon salt and 1/4 teaspoon pepper in another small bowl and set aside.   \n            \n\n              Using a slotted spoon and tongs, remove the hens from the liquid, place them on a cutting board and remove the kitchen twine. Slice along the top of the breastbone to cut each hen into 2 halves, keeping the rice inside the cavity. Strain the broth through a sieve. Place each hen half in a wide, shallow bowl (rice side down) and divide the soup among the bowls. Garnish the soup with scallion greens and serve with the sesame sauce, soy-vinegar sauce, kimchi and seaweed.\n            \n", "ingredients": [{"food": "crisped rice bar", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "cloves", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "game meat bison", "quantity": 1.5}, {"food": "fat free chicken breast ", "quantity": 4.0}, {"food": "shallots", "quantity": 4.0}, {"food": "hearts of palm", "quantity": 3.0}, {"food": "meat drippings ", "quantity": 6.0}, {"food": "meat drippings ", "quantity": 1.0}, {"food": "soy sauce", "quantity": 3.0}, {"food": "meat drippings ", "quantity": 1.0}, {"food": "sesame seeds", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "meat drippings ", "quantity": 0.25}, {"food": "seaweed", "quantity": 1.0}, {"food": "meat drippings ", "quantity": 1.0}], "title": "\nSamgyetang (Korean Soup)\n"}, {"directions": "\n\n              For the crust: Put 20 cookies in a resealable plastic bag and crush into fine crumbs (a few larger crumbs are fine) with a rolling pin. Add the coconut oil to the bag, seal and use your hands to mix the oil into the cookies. Press the mixture into the bottom and up the sides of a 9-inch pie plate to make a crust. Refrigerate while you make the filling.\n            \n\n              For the cheesecake: Sprinkle the gelatin over 2 tablespoons water in a small microwave-safe bowl and set aside to soften, about 5 minutes. Microwave the dissolved gelatin, stirring every 10 seconds, until melted. \n            \n\n              Combine the cream cheese, buttermilk, brown sugar, vanilla, salt and melted gelatin in the food processor and process until smooth and the sugar has dissolved. Rub a little of the mixture between your fingers, if it is still gritty then continue to process. \n            \n\n              Pour the cream cheese mixture into the crust and spread evenly with an offset spatula. Wrap the pan loosely with plastic wrap and refrigerate until the cheesecake layer is set, about 2 hours.\n            \n\n              For the topping: Put the chocolate chips in a small microwave-safe bowl. When you are ready to assemble the pie, microwave the dulce de leche in a second small microwave-safe bowl until it is loose enough to drizzle, 30 seconds to 1 minute. Microwave the heavy cream in a third small microwave-safe bowl until hot but not boiling, about 30 seconds. Pour the hot cream over the chocolate and allow to sit for 1 minute. Stir until completely smooth. The sauce will thicken as it cools slightly. Use a serrated knife to cut the remaining cookies in half cross-wise. Drizzle the chocolate sauce and caramel sauce on the cheesecake. Decorate with the cookies halves. \n            \n", "ingredients": [{"food": "chocolate chip cookies", "quantity": 30.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "", "quantity": 0.25}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 1.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "dulce de leche", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "ice cream swich", "quantity": 3.0}], "title": "\nSamoa No-Bake Cheesecake Pie\n"}, {"directions": "\n\n              Position a rack in the middle of the oven and preheat to 350 degrees. Grease a 12-cup muffin pan with butter.\n            \n\n              Pulse the flour, 1/4 cup coconut, brown sugar and salt in a food processor until combined. Add the cold butter and pulse until the mixture resembles wet sand with pea-sized pieces, about 5 times. Put 1 heaping tablespoon of the mixture in each muffin cup and press to make even rounds. Bake until the crusts are golden, about 20 minutes.\n            \n\n              Remove the pan from the oven and sprinkle the chocolate evenly over each crust. Turn off the oven; return the pan to the oven to melt the chocolate, about 3 minutes. Sprinkle each crust with 1 tablespoon of the remaining coconut. Cool slightly, then freeze crusts in the pan until set, about 15 minutes.\n            \n\n              With a thin spatula, gently remove each crust from the muffin pan. Top with a small scoop of coconut ice cream, drizzle with dulce de leche and garnish with more coconut.\n            \n\n              Photograph by Tina Rupp\n            \n", "ingredients": [{"food": "butter oil", "quantity": 3.0}, {"food": "potato flour", "quantity": 0.3333333333333333}, {"food": "coconut water", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 5.0}, {"food": "salt", "quantity": 0.25}, {"food": "dulce de leche", "quantity": 0.75}, {"food": "ice cream swich", "quantity": 1.0}], "title": "\nSamoa Tartlets\n"}, {"directions": "\n\n              Make the stew base. Heat a large stew pot or Dutch oven over medium heat with the olive oil. Add the onions and saute until tender, about 5 minutes. Add the garlic, season with salt and pepper to taste, and cook 2 minutes more. Stir in the tomato paste and cook for 1 minute. Add the wine, and use a wooden spoon to scrape up any browned bits in the pot. Simmer the wine until reduced by about half. Add the tomatoes, peppers, parsley, thyme, and bay leaf and cook for 5 minutes. Add the stock or broths; bring to a boil, then adjust the heat to maintain a gentle simmer. Cook the base, with a cover slightly ajar, for 30 minutes. (The base may be prepared ahead up to this point, refrigerated for 1 day or frozen for 1 month). \n            \n\n              Finish the Cioppino. Bring the base to a simmer. Add the basil and the clams, and cook covered, over high heat, for 5 minutes, or just until the clams open. Add the crab and cook for 1 minute. Add the mussels, shrimp, squid, and scallops. Cook, stirring frequently, until the mussels open, the shrimp curl, and squid and scallops are just firm, about 3 minutes. Serve in large heated bowls with plenty of crusty bread. \n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "onion powder", "quantity": 1.5}, {"food": "garlic powder", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "pasta with tomato sauce", "quantity": 0.25}, {"food": "martha white foods", "quantity": 1.0}, {"food": "tomatoes", "quantity": 2.5}, {"food": "diced chicken", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "corier leaf", "quantity": 1.0}, {"food": "fish broth", "quantity": 3.0}, {"food": "chrysanthemum leaves", "quantity": 0.25}, {"food": "little links", "quantity": 12.0}, {"food": "crab", "quantity": 1.0}, {"food": "", "quantity": 12.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "onion rings", "quantity": 0.5}, {"food": "fish oil", "quantity": 0.5}, {"food": "garlic bread", "quantity": 1}], "title": "\nSan Francisco Cioppino\n"}, {"directions": "\n\n              Remove a wide, 2-inch-long strip of zest from 1 orange with a paring knife. Finely grate the zest of the other orange and set aside. Peel and segment both oranges, cover and refrigerate.\n            \n\n              Combine the wine, 5 tablespoons sugar, the honey, cinnamon stick and orange zest strip in a small saucepan. Simmer over medium-low heat until reduced to 1 1/2 cups, about 40 minutes. Discard the cinnamon and zest and cool the wine reduction completely. Set aside 1/2 cup for serving.\n            \n\n              Combine the milk with the remaining 2 tablespoons sugar in a medium saucepan. Sprinkle in the gelatin and let stand, undisturbed,\n            \n\n              until the gelatin softens, about 4 minutes. Cook over medium heat, stirring occasionally, until the gelatin and sugar are just dissolved (do not boil); let cool. Whisk in 1 cup of the wine reduction, the grated orange zest and yogurt until smooth. Pour into six 6-ounce ramekins or jars, cover and refrigerate until set, at least 3 hours or overnight.\n            \n\n              Just before serving, core and finely dice the apple, then toss with the reserved orange segments. Dip the bottom of each ramekin in warm water to loosen. Invert each panna cotta onto a plate, drizzle with the reserved wine reduction and top with the fruit.\n            \n\n              Photograph by Ngoc Minh Ngo\n            \n", "ingredients": [{"food": "oranges", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 3.0}, {"food": "sugar", "quantity": 7.0}, {"food": "honey smoked ham", "quantity": 2.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "whole milk", "quantity": 1.0}, {"food": "", "quantity": 1.25}, {"food": "silk plain soy yogurt", "quantity": 2.0}, {"food": "apple", "quantity": 1.0}], "title": "\nSangria Panna Cotta\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: 2 ice cube trays\n\n              Fill 2 ice cube trays with the red wine and freeze until solid, at least 6 hours and preferably overnight.\n            \n\n              Combine the brandy, orange liqueur and sugar in a small container with a lid. Refrigerate until ready to make the sangria. \n            \n\n              Combine the frozen berries, red wine ice cubes and chilled brandy mixture in a blender. Blend on high until combined, thick and slushy. Pour into a pitcher and serve.\n            \n", "ingredients": [{"food": "ruby red grapefruit juice blend", "quantity": 750.0}, {"food": "", "quantity": 0.25}, {"food": "", "quantity": 0.25}, {"food": "sugar", "quantity": 0.25}, {"food": "mixed nuts", "quantity": 10.0}], "title": "\nSangria Slushie\n"}, {"directions": "\n\n              Place half of the lime wedges and one-third of the pineapple chunks in a medium bowl. Mix 1/2 cup of the pineapple juice with 3/4 cup water and pour over the limes and pineapple chunks. Freeze until firm, about 4 hours. \n            \n\n              Make a simple syrup by mixing the sugar with 3/4 cup water in a small saucepan. Bring the mixture to a boil, stirring to dissolve the sugar. Cool before using. \n            \n\n              Mix the wine, the remaining pineapple juice, the tequila, lime juice, simple syrup, orange juice and triple sec in a punch bowl. Remove the pineapple-lime iceberg from the bowl and float in the punch. Add the remaining lime wedges and pineapple chunks. Pour in the club soda just before serving. Serve over ice in glasses. \n            \n\n              Make ahead tip: This can be made the day before. Just add the limes, pineapple and the club soda right before serving.\n            \n\n              Copyright 2013 Television Food Network, G.P. All rights reserved\n            \n\n              From Food Network Kitchens\n            \n", "ingredients": [{"food": "limes", "quantity": 4.0}, {"food": "pineapple chunks", "quantity": 1.0}, {"food": "grape juice", "quantity": 46.0}, {"food": "sugar", "quantity": 0.75}, {"food": "martha white foods", "quantity": 750.0}, {"food": "", "quantity": 2.0}, {"food": "lime juice", "quantity": 1.0}, {"food": "orange juice", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 1.0}], "title": "\nSangrita with a Pineapple-Lime Iceberg\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Heat the milk in a small saucepan until it just begins to simmer, then remove from the heat and let cool to 115 degrees F. Stir in the yeast and let stand until the mixture is foamy, about 10 minutes.\n            \n\n              Pour the yeast mixture into the bowl of stand mixer fitted with a dough hook. Add the sugar, butter and 2 of the eggs and stir until smooth. Add the flour and salt and mix on medium-low speed until the dough comes together. Increase the speed to medium high and knead until the dough is smooth and elastic, about 8 minutes. Transfer the dough to a lightly greased large bowl, cover with plastic wrap and let stand until the dough doubles in size, about 1 hour.\n            \n\n              Preheat the oven to 350 degrees F and line a rimless baking sheet with parchment.\n            \n\n              Turn the dough out onto a lightly floured work surface. Pinch off 1 golf ball-size piece of dough and roll it into a ball for the pompom of Santa's hat. Pinch off 1 ping pong ball-size piece of dough and roll it into a ball for Santa's nose. Cut off a 1-inch-wide, 9-inch-long, 1/4-inch-thick strip and roll it into a smooth log for the brim of Santa's hat. Cut another piece of dough into a roughly 2-inch-wide, 5-inch-long, 1/4-inch-thick strip of dough. Snip evenly from the bottom (but not all the way up) and spread the strips out slightly to form a mustache.\n            \n\n              Roll out the remaining dough into an elongated diamond with the top triangle of the diamond double the length of the bottom triangle. Position the diamond on the prepared baking sheet with the top of the longer triangle hanging over the edge. Working on the shorter triangle, use scissors or a knife to cut 1/2-inch-wide strips of dough up toward the middle, stopping at the imaginary line where the top and bottom triangles meet. Pick up each strip of the beard and twist it, if you like, lying the twists down next to each other naturally so they look like a beard.\n            \n\n              Fold over the overhanging corner of dough so that it fits back within the edge of the baking sheet and position it slightly to the right to form the tip of Santa's hat. Position the dough log across the top triangle where the tip of Santa's hat ends and tuck the ends under the sides of the triangle; this is the brim of Santa's hat. Position the golf ball-size ball of dough over the tip and against the brim and press lightly to adhere for the pompom of Santa's hat. Arrange the mustache at the top of the beard, then position the ping pong ball-size ball of dough above the mustache to make Santa's nose.\n            \n\n              Beat the remaining egg with the cream in a bowl to make an egg wash. Using a pastry brush, brush the entire surface of the dough, including the pompom and brim of the hat but not the body of the hat, with the plain egg wash, making sure to get into all the crevices of the shapes. Add the food coloring to the egg wash, stir to combine, then carefully brush the body of the hat with the red egg wash, being careful not to let it stain the pompom or brim.\n            \n\n              Bake until the bread is golden brown and cooked through, about 20 minutes. Remove from the oven and immediately set the chocolate chips proportionally on either side and slightly above Santa's nose to form his eyes. Let the bread cool for 10 minutes on the baking sheet, and then transfer to a wire rack. Using cut pieces of parchment paper or foil to shield Santa's nose, face and the body of his hat, dust the beard, brim and pompom with confectioners' sugar. Remove the paper and serve the bread while still warm with butter.\n            \n", "ingredients": [{"food": "whole milk", "quantity": 0.75}, {"food": "yeast extract spread", "quantity": 2.25}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "butter oil", "quantity": 4.0}, {"food": "eggs", "quantity": 3.0}, {"food": "potato flour", "quantity": 4.0}, {"food": "salt", "quantity": 1.5}, {"food": "whole milk", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 20.0}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "sugar", "quantity": 1}], "title": "\nSanta Bread\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: a piping bag or a resealable plastic bag\n\n              Line a 9-inch square pan with foil, leaving a 2-inch overhang on two sides. Lightly coat the foil and a wooden spoon with cooking spray.\n            \n\n              For the cheesecake squares: Melt the butter in a medium saucepan over medium heat. Add the marshmallows, honey, 1/2 teaspoon vanilla and a pinch of salt, and stir with the wooden spoon until the marshmallows have completely melted, 4 to 5 minutes. Add the rice cereal, and stir until the mixture is fully combined. Transfer the mixture to the prepared pan, and press into an even layer while warm. Let sit at room temperature until firm, about 20 minutes.\n            \n\n              Combine the gelatin with 2 tablespoons water in a small microwave-safe bowl, and set aside to soften, about 5 minutes. Beat the cream cheese on medium-high speed with an electric mixer until completely smooth, about 1 minute. Scrape down the sides of the bowl. Add the the sour cream, sugar, lemon juice, remaining 1/2 teaspoon vanilla and a pinch of salt, and beat on medium-high speed until smooth, about 1 minute.\n            \n\n              Microwave the gelatin in 10-second increments, stirring as needed, until it dissolves, 30 to 50 seconds. Pour the gelatin into the cream cheese mixture, and beat on medium-high speed until incorporated, about 30 seconds.\n            \n\n              Pour the cream cheese mixture over the cooled crispy treat layer, and spread out evenly with an offset spatula or butter knife. Wrap the pan loosely with plastic wrap, and refrigerate until the cheesecake layer is set, about 2 hours or up to overnight. \n            \n\n              For the frosting: Whisk together the butter and cream cheese by hand in a medium bowl. Add the sugar and vanilla and whisk until smooth and creamy. \n            \n\n              Cut the cheesecake bites into twenty-five 1 3/4-inch squares. Transfer the frosting to a piping bag or resealable plastic bag. Cut a 1/4-inch hole in the corner of the piping bag. Pipe a circle of frosting on the top of each square, about the diameter of the base of a strawberry. Place a strawberry cut side-down on top of each frosting circle, pushing down gently so that the frosting comes up around the bottom of the strawberry and resembles the base of a Santa hat. Pipe a ball of frosting on the tip of each strawberry for a pom-pom.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "butter oil", "quantity": 3.0}, {"food": "", "quantity": 5.0}, {"food": "honey smoked ham", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "crisped rice bar", "quantity": 4.0}, {"food": "", "quantity": 0.25}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "sour cream", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "strawberries", "quantity": 25.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 2.0}, {"food": "sugar", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 0.25}], "title": "\nSanta Hat Crispy-Treat Cheesecake Squares\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: an 8-inch cast iron skillet, 3 pastry bags, a small no. 13 star pastry tip, a small no. 3 round pastry tip and a small no. 4 round pastry tip\n\n              Preheat the oven to 350 degrees F and generously butter an 8-inch cast iron skillet.\n            \n\n              Prepare the sugar cookie dough according to the package directions. Evenly press half of the cookie dough into the prepared skillet all the way to the edge. (Reserve the remaining dough for another use.) Bake until the top just turns golden and a toothpick inserted in the middle of the cookie comes out clean, 11 to 13 minutes. Cool in the skillet for 30 minutes. Carefully remove the cookie with a large offset spatula and place it on a cutting board.\n            \n\n              Cut the cookie: Heat up a small, sharp knife by submerging it in boiling water for 3 minutes. Wipe the knife dry and gently cut the cookie into 8 wedges making sure the pieces stay together in a circle. Take it slow when cutting or the cookie could crumble. Let the cookie cool completely on the cutting board.\n            \n\n              Meanwhile, make the royal icing: Whisk together the confectioners' sugar and meringue powder in a large bowl. Add 2 tablespoons water and beat with an electric mixer on medium-high speed until soft glossy peaks form, 3 to 4 minutes (you may need to add up to 1 teaspoon more water).\n            \n\n              Transfer a quarter of the icing to a pastry bag fitted with a small no. 13 star pastry tip.\n            \n\n              Color the remaining icing red using the food coloring. Transfer 1/4 cup of the red icing to a small bowl and add water, 1/4 teaspoon at a time, to thin it out (when you drizzle the icing with a spoon, the lines should disappear within 5 seconds). This will be your filling icing. Transfer to a pastry bag fitted with a small no. 3 round pastry tip. Transfer the remaining thick red icing to a pastry bag fitted with a small no. 4 round pastry tip.\n            \n\n              Decorate the cookie: Using the thick red icing with the no. 4 tip, pipe a 2-inch circle in the center of the cookie.\n            \n\n              With the same icing, pipe eight 1-inch circles overlapping the 8 cut lines, positioning them about 1 inch in from the edge of the cookie. Each cookie wedge should have 2 half circles on it.\n            \n\n              Fill in all the circles with the filling icing with the no. 3 tip. Sprinkle each circle with red sanding sugar to coat. If excess sanding sugar gets on the cookie, fan it away or brush it off with a small pastry brush. (Your Santas are taking shape: the wedges in the large center circle are hats; the smaller circles are mittens.)\n            \n\n              Place a dragee on the tip of each cookie wedge to form a small white circle in the middle of the red center circle. (These are the pom-poms on the Santa hats.)\n            \n\n              Pipe a white icing border around the center red circle. (This will be the bottom of the hats.)\n            \n\n              Working on one cookie wedge at a time and starting at the white border, pipe a white ?V? that fits snuggly between the 2 red half circles. Repeat with the remaining cookie wedges. You should have a white 8-point star surrounding the middle red circle. (You've just made 8 Santa beards.)\n            \n\n              Pipe a small dot of thick red icing with the no. 4 tip in the middle of each \"V.\" (Now each Santa has a nose.)\n            \n\n              Finish by piping a white border around the edge of the cookie. (This is the bottom of each Santa's coat.)\n            \n\n              Let the icing dry before serving, about 30 minutes.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1}, {"food": "cheesecake mix", "quantity": 17.0}, {"food": "sugar", "quantity": 8.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "", "quantity": 1}, {"food": "sugar", "quantity": 1}, {"food": "", "quantity": 8.0}], "title": "\nSanta Skillet Cookie\n"}, {"directions": "\n\n              Combine the sardines, celery, red onion, mayonnaise, dill, lemon juice, lemon zest, mustard, 1/4 teaspoon salt, and pepper to taste in a large bowl. Mash well with a fork. \n            \n\n              Sandwich the sardine salad between the bread slices along with the lettuce, tomato, cucumber and sprouts. \n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [{"food": "", "quantity": 3.0}, {"food": "celery seed", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "mayonnaise dressing", "quantity": 0.25}, {"food": "dill seed", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "garlic bread", "quantity": 8.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1}], "title": "\nSardine Salad Sandwich\n"}, {"directions": "\n\n              Heat the oil in a large heavy skillet over medium heat. Add the sausage and cook, stirring occasionally, until brown, about 7 minutes. Push to one side of the skillet and increase the heat to high. Add the tomatoes, stirring to break them up a bit, and cook until the edges brown and the oil turns red, about 6 minutes. Stir the sausage and tomatoes together.\n            \n\n              Add the garlic, bay leaves, fennel seeds and red pepper flakes to the skillet, then scatter the saffron over the mixture. Cook, stirring, about 2 minutes. Add the parsley, 1 cup basil and 1 teaspoon salt. Reduce the heat to medium and cook, stirring occasionally, about 15 minutes.\n            \n\n              Remove and discard the bay leaves.\n            \n\n              Meanwhile, cook the spaghetti in a large pot of salted boiling water until al dente. Drain, reserving 1/2 cup pasta water. Add the spaghetti, cooking liquid and reserved tomato juice to the sausage sauce and toss, about 3 minutes. Top with the pecorino and the remaining 1/2 cup basil.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.25}, {"food": "sweet potatoes", "quantity": 1.5}, {"food": "grape juice", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "fennel seed", "quantity": 0.5}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "saffron", "quantity": 0.5}, {"food": "parsley", "quantity": 0.25}, {"food": "chrysanthemum leaves", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "spaghetti", "quantity": 0.75}, {"food": "macaroni cheese", "quantity": 1.0}], "title": "\nSardinian Spaghetti\n"}, {"directions": "\n\n              Preheat oven to 425 degrees F. Beat the egg with the water and set aside.\n            \n\n              Cut the kielbasa into 8 (3-inch) long pieces and set aside.\n            \n\n              On a lightly floured surface roll the pastry sheets into 12 by 12-inch squares. Cut the sheets into 8 equal squares. Brush 1 square with water around the edges and wrap a sausage up in the pastry. (First fold the 2 long sides over the sausage, then fold the ends up and over. Press edges firmly to seal.) Place seam side down on a parchment-lined sheet pan.\n            \n\n              Brush the tops and sides of the packages with egg wash and bake until browned and shinny, about 25 minutes. Transfer to a rack and cool for 20 minutes, before serving. They can be served warm or at room temperature with assorted mustards.\n            \n\n              Copyright 2003 Television Food Network, G.P. All rights reserved\n            \n", "ingredients": [{"food": "egg substitute", "quantity": 2.0}, {"food": "coconut water", "quantity": 1.0}, {"food": "kielbasa", "quantity": 1.5}, {"food": "danish pastry", "quantity": 1}, {"food": "puff pastry", "quantity": 2.0}, {"food": "", "quantity": 1}], "title": "\nSaucisson En Croute\n"}, {"directions": "\n\n              Combine 2 cups broth, the wine, vinegar, 1 chopped onion, the crushed garlic, thyme sprigs, bay leaves, juniper berries, peppercorns and cloves in a medium saucepan over medium heat. Bring to a boil, then simmer for 5 minutes. Cool to room temperature. Place the beef in a large resealable plastic bag and pour in the marinade. Seal the bag and refrigerate for 2 to 3 days, turning daily.\n            \n\n              Preheat the oven to 350. Remove the meat from the marinade and pat dry; season with salt. Strain the marinade, discarding the solids. Heat a large ovenproof pot over medium heat and add the olive oil. Add the meat and brown on all sides, 10 to 12 minutes, then transfer to a plate. Add the carrots, celery and the remaining onion to the pot and cook until slightly softened, 5 minutes. Stir in the chopped garlic and chopped thyme and cook 1 minute. Sprinkle in the flour and cook 1 to 2 minutes. Stir in the strained marinade and the remaining 1 cup broth and bring to a simmer. Return the meat to the pot, cover and cook in the oven until tender, 2 hours 30 minutes.\n            \n\n              Remove the meat and transfer to a plate. Bring the sauce to a simmer over medium heat. Whisk in the gingersnaps and simmer until thickened; season with salt and pepper. Thinly slice the meat; serve with spaetzle, the vegetables and sauce and sour cream, if desired. Top with parsley.\n            \n\n              Photograph by Kate Mathis\n            \n", "ingredients": [{"food": "frankfurter beef", "quantity": 3.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "onions", "quantity": 2.0}, {"food": "cloves", "quantity": 5.0}, {"food": "chrysanthemum leaves", "quantity": 10.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1.0}, {"food": "cloves", "quantity": 0.5}, {"food": "roast beef", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "pineapple chunks", "quantity": 2.0}, {"food": "pineapple chunks", "quantity": 2.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "chocolate chip cookies", "quantity": 2.0}, {"food": "pepper", "quantity": 1}, {"food": "", "quantity": 152.0}, {"food": "ice cream swich", "quantity": 1}, {"food": "parsley", "quantity": 1}], "title": "\nSauerbraten\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F.\n            \n\n              Pulse the chick peas, onion, garlic, cumin, 1 teaspoon salt, and 1/2 teaspoon pepper in a food processor until finely chopped. Sprinkle with the flour, baking powder, then pulse until just combined. Transfer to a medium mixing bowl and add the sausage, stirring together with your hands. Cover and move to the refrigerator to chill for 30 minutes.\n            \n\n              Once chilled, divide the mixture into tablespoons, rolling into 1-inch sized balls with wet hands. Heat the olive oil in a large pan over medium heat. In two batches, add the falafel balls and cook until lightly browned, about a minute and a half per side. Transfer to a baking sheet and bake in the oven until cooked through, about 10 minutes.\n            \n\n              Whisk together the yogurt, lime juice, 1/2 teaspoon salt, and 1/4 teaspoon pepper. Divide the lettuce between 4 serving plates, then drizzle with some of yogurt sauce. Divide falafel between plates and serve with hot sauce.\n            \n", "ingredients": [{"food": "pork turkey sausage", "quantity": 9.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "chickpeas", "quantity": 15.0}, {"food": "onion powder", "quantity": 1.1666666666666665}, {"food": "garlic powder", "quantity": 2.0}, {"food": "cumin seed", "quantity": 1.0}, {"food": "potato flour", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "silk banana-strawberry soy yogurt", "quantity": 1.0}, {"food": "lime juice", "quantity": 2.0}, {"food": "hearts of palm", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 1}], "title": "\nSausage Falafel with Romaine and Yogurt Sauce\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Bring a large pot of salted water to a boil. Add the noodles, and cook according to the package directions. Strain into a colander, and toss with some oil. Drape the noodles over and around the side of the colander to cool.\n            \n\n              Meanwhile, heat 3 tablespoons oil in a large nonstick skillet over medium-high heat. Add the sausage and scallion whites, and cook, stirring and breaking the meat up into bite-size pieces (not crumbs), until the sausage is browned and cooked through, about 8 minutes. Sprinkle the flour over the cooked sausage, and stir until it is completely absorbed. Add 2 cups milk, and stir until it starts to thicken. Stir in the remaining 2 cups milk, bring to a simmer and stir until the sauce is thick enough to coat the back of a spoon, about 2 minutes. Stir in 2 teaspoons salt, 1 1/2 teaspoons pepper and the nutmeg. Remove the sauce from the heat, and let cool.\n            \n\n              Mix together the mozzarella, Cheddar and Parmesan in a medium bowl.\n            \n\n              Oil a 9- by 13-inch baking dish. Spread about 4 tablespoons of the sauce (without big pieces of sausage) over the bottom. Arrange 4 slightly overlapping noodles to fully cover the bottom of the dish. Spread 1/3 of the remaining sauce over the noodles. Spread 1/2 the spinach in an even layer. Sprinkle with about 1/3 of the scallion greens, 1/4 teaspoon salt, a few grinds of pepper and 1/3 of the cheese mixture. Continue layering with 4 more noodles, 1/2 of the remaining sauce, the remaining spinach, 1/2 of the remaining scallion greens, 1/4 teaspoon salt, a few grinds of pepper and 1/2 of the remaining cheese. Finish the lasagna with the remaining noodles, sauce and cheese. Cover the top with plastic wrap, and refrigerate overnight. Do the same with the remaining scallion greens.\n            \n\n              Preheat the oven to 350 degrees F. Remove the plastic wrap from the baking dish, and cover with foil. Bake until the cheese is melted and bubbly, about 45 minutes. Uncover the dish, and continue to bake until the lasagna is slightly browned, 10 to 15 minutes. Top with the remaining scallions, the parsley and a sprinkle of black pepper. Let sit for at least 15 minutes, then slice and serve.\n            \n", "ingredients": [{"food": "black bean mango", "quantity": 1}, {"food": "lasagna", "quantity": 8.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "breakfast tart", "quantity": 2.0}, {"food": "turnip greens", "quantity": 1.5}, {"food": "potato flour", "quantity": 0.5}, {"food": "whole milk", "quantity": 4.0}, {"food": "nutmeg", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 2.0}, {"food": "martha white foods", "quantity": 8.0}, {"food": "", "quantity": 0.5}, {"food": "mustard spinach", "quantity": 10.0}, {"food": "chrysanthemum leaves", "quantity": 0.25}], "title": "\nSausage Gravy Breakfast Lasagna\n"}, {"directions": "\n\n              1. Preheat the oven to 350 degrees F. In a small pot bring the tomatoes, wine, whole basil sprigs, garlic, red pepper flakes, and salt and pepper, to taste, to a simmer; cook until slightly thickened, 10 minutes; set aside.\n            \n\n              2. Meanwhile, puree the cottage cheese in the bowl of a food processor until smooth. add the ricotta, spinach, 1/4 cup chopped basil, scallions, nutmeg, and salt and pepper and pulse until just combined; set aside.\n            \n\n              3. Coat a large nonstick skillet with nonstick cooking spray set over medium heat. Cook the sausage and onion, breaking it up with a wooden spoon into small pieces, until the meat is browned and the onion tender, 10 minutes.\n            \n\n              4. Assemble the lasagna: Mist a 9-inch by 13-inch baking dish with nonstick cooking spray. Spread 1/2 cup tomato sauce on the bottom of the prepared baking dish. Top with 3 noodles, half the ricotta mixture, half the sausage and 1/2 cup shredded mozzarella cheese. Repeat layers with sauce, noodles, remaining ricotta and sausage and 1/2 cup mozzarella cheese. Top with remaining noodles and sauce. Cover with aluminum foil and bake until the noodles are tender and the sauce is bubbling around the edges of the pan, 1 hour.\n            \n\n              5. Uncover, sprinkle with remaining mozzarella cheese and continue to bake until melted, 10 minutes. Let stand 15 minutes. Sprinkle with remaining 1/4 cup basil. Serve.\n            \n", "ingredients": [{"food": "tomatoes", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "garlic powder", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1}, {"food": "black bean mango", "quantity": 1}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "", "quantity": 2.0}, {"food": "nutmeg", "quantity": 0.25}, {"food": "pork turkey sausage", "quantity": 8.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "lasagna", "quantity": 9.0}, {"food": "", "quantity": 1.5}], "title": "\nSausage Lasagna\n"}, {"directions": "\n\n              Make the meatballs: Mix the sausage and parsley in a bowl with your hands until combined. Dampen your hands and form the meat into 3/4-inch balls (you should have about 40). Heat the olive oil in a large pot over high heat. Working in batches, add the meatballs and cook, turning, until browned, about 7 minutes. Transfer to a plate using a slotted spoon.\n            \n\n              Reduce the heat to medium high and add the soppressata, onion, celery, carrots and garlic. Cook, stirring occasionally, until the vegetables are slightly softened, about 6 minutes. Add the tomato paste and basil and cook, stirring, 3 minutes. Stir in the wine, tomato puree and 3 cups water. Reduce the heat to medium low and return the meatballs to the pot. Simmer, stirring occasionally, until the sauce thickens, 1 hour, 20 minutes.\n            \n\n              Prepare the lasagna: Whisk the ricotta, eggs and parmesan in a medium bowl. Fill a large bowl with hot water. Working in batches, soak the noodles until just pliable, about 5 minutes. Lay out on a clean kitchen towel and pat dry.\n            \n\n              Preheat the oven to 400 degrees F. Butter the bottom and sides of a deep 10-by-13-inch baking dish. Lay 6 noodles in the bottom of the dish so they go partway up the sides and overlap slightly. Spread half of the ricotta mixture over the noodles, then top with half of the meatballs and 1 1/2 cups sauce. Sprinkle with half each of the mozzarella and pecorino. Repeat the layers (noodles, ricotta mixture, meatballs, sauce, mozzarella and pecorino). Top with the remaining 6 noodles and cover with the remaining sauce.\n            \n\n              Tightly cover the dish with foil and bake until bubbly, about 30 minutes. Uncover and bake until browned, about 15 more minutes. Let stand 20 minutes before serving.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 1.5}, {"food": "parsley", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "celery seed", "quantity": 2.0}, {"food": "carrots", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "pasta with tomato sauce", "quantity": 3.0}, {"food": "basil", "quantity": 0.25}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "pasta with tomato sauce", "quantity": 3.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "eggs", "quantity": 3.0}, {"food": "parmesan cheese", "quantity": 1.0}, {"food": "lasagna", "quantity": 18.0}, {"food": "baking chocolate", "quantity": 1}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "macaroni cheese", "quantity": 0.5}], "title": "\nSausage Meatball Lasagna\n"}, {"directions": "\n\n              Bring a medium saucepan filled two-thirds full with water to a boil. Add the wheat berries, and cook until the grains have plumped and are tender but still chewy, 55 minutes to 1 hour; strain. (The wheat berries can be cooked and refrigerated up to 2 days in advance.)\n            \n\n              Squeeze the sausage out of the casings, divide into 20 pieces and roll into Ping-Pong-ball-sized meatballs.\n            \n\n              Heat 1 tablespoon of oil in a large nonstick skillet over medium-high heat. Add the meatballs, and cook, undisturbed, until golden brown and crispy on the bottom, about 3 minutes. Flip and cook the other side until brown and crispy, about 3 minutes more. Remove the skillet from the heat, and transfer the meatballs to a plate. They should be about 3/4 of the way cooked. Wipe out the skillet.\n            \n\n              Put the remaining 1 tablespoon oil, garlic, 1/2 teaspoon salt and crushed red pepper in the skillet, and set over medium heat. Once the oil starts to shimmer, stir until the garlic is lightly golden, about 30 seconds. Add the tomato paste, and stir until the oil turns yellow, about 30 seconds. Add the tomatoes and their juices, the basil and 1/2 cup water, and bring to a boil. Lower the heat to medium-low, and simmer gently for 5 minutes. Add the meatballs, and continue to simmer until the sauce thickens and the meatballs are cooked through, 5 to 7 minutes more.\n            \n\n              Stir in the wheat berries, and transfer to a serving dish. Sprinkle with the Parmesan and basil, and serve hot.\n            \n", "ingredients": [{"food": "wheat flour", "quantity": 1.0}, {"food": "pork turkey sausage", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "ruby red grapefruit juice blend", "quantity": 1}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "plum", "quantity": 15.0}, {"food": "chrysanthemum leaves", "quantity": 1}, {"food": "", "quantity": 2.0}], "title": "\nSausage Meatballs Marinara with Khorasan Wheat\n"}, {"directions": "\n\n              Roll out 1 puff pastry sheet into a 10-inch square; cut into 1/4-inch strips. Wrap a few strips around each of 12 frozen fully cooked breakfast sausage patties. Bake at 400 degrees F until golden, about 15 minutes. Dot with ketchup to make eyes.\n            \n\n              Photograph by Ralph Smith\n            \n", "ingredients": [], "title": "\nSausage Mummies\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F. Spray a baking sheet with nonstick cooking spray and keep nearby.\n            \n\n              Heat the oil in a large nonstick skillet over medium-high heat. Add the mushrooms, onion, and salt. Cook, stirring occasionally, over medium heat, until the mushroom mixture is very tender, about 8 minutes. Remove from the heat. Stir in the turkey, cream cheese, and Cheddar until well blended.\n            \n\n              Place 1 sheet of phyllo with the short side facing you on a work surface. (Cover remaining phyllo with plastic wrap to keep from drying out.) Spray the phyllo sheet with nonstick cooking spray. Then fold it in half lengthwise and spray again. Place 1 heaping tablespoon filling in the center of the bottom end of the phyllo. Fold in the sides, then roll up from the bottom to completely enclose the filling (it should look like an egg roll). Place the roll, seam-side down, on the baking sheet. Repeat with remaining phyllo sheets, nonstick cooking spray, and filling to make a total of 16 rolls.\n            \n\n              Spray the rolls generously with nonstick cooking spray and bake until the rolls until lightly golden, about 20 minutes.\n            \n\n              Food Network Kitchens created this lightened-up recipe from a user submission. Click here to see the original recipe.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "mushrooms", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "pork turkey sausage", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 2.0}, {"food": "", "quantity": 0.5}, {"food": "phyllo dough", "quantity": 16.0}], "title": "\nSausage Phyllo Rolls\n"}, {"directions": "\nSpecial equipment: heavy-duty aluminum foil\n\n              Preheat the oven to 375 degrees F. Put an oven rack in the lowest position with a 6-inch clearance above. Cut six 6-inch squares of heavy-duty foil and six 1-inch squares of heavy-duty foil. Using the larger foil squares, wrap each sugar cone, molding to the shape of the cone to cover completely and tucking in excess. Spray the outside of the foil generously with cooking spray and set aside.\n            \n\n              Brush the 6 tortillas on both sides using 2 tablespoons of oil. Sprinkle 1 teaspoon of Parmesan over each side of each tortilla. Curl a tortilla into a cone shape with a closed point and a 3-inch-diameter top and secure the seam with a toothpick. Trim the top of the cone with scissors to make an even edge. Slip the sugar cone inside the tortilla cone to help hold its shape and put it on a large baking sheet. Repeat with the remaining tortillas, oil, cheese, and cones.\n            \n\n              Bake for 5 minutes, then wrap the tip of each cone with the small foil squares to keep the tips from burning. Return to the oven until the cones are lightly browned and crisp and hold their shape, 5 to 7 minutes more. Remove the foil tips, and gently remove the foil cone inserts and toothpicks. Discard the toothpicks. Unwrap and reserve the sugar cones for another use. If the tortilla cones are still soft, return them, empty, to the oven, to cook until crisp, 1 to 2 minutes more. \n            \n\n              Meanwhile make the sausage filling. Add 2 teaspoons oil to a medium pan over medium-high heat, then add the sausage and peppers. Cook, stirring often and breaking the meat apart, for 1 minute. Continue to cook undisturbed to allow the sausage to brown, 1 more minute. Scrape up the browned bits and cook, stirring occasionally, until the meat is cooked through and browned, about 4 minutes more. Add the pizza sauce and cook until heated through, 1 minute. Set aside and keep warm until ready to use. \n            \n\n              Cover the top of a deep pot with heavy-duty foil, wrapping it taut over the top. Using the tip of a knife, cut six 1-inch Xs in the foil spaced evenly apart. When the cones are cool enough to handle, place one cone in each of the slits. \n            \n\n              Sprinkle a pinch of the mozzarella inside each cone. Add 1 tablespoon of sauce, followed by a pinch of cheese, another tablespoon sauce and another tablespoon of cheese in each cone. Repeat with the remaining cones. Bake the pizza cones on the lowest rack of the oven until the cheese is melted and the sauce is hot, about 5 minutes. Serve immediately with crushed red pepper, oregano and torn basil leaves.\n            \n", "ingredients": [{"food": "ice cream cones", "quantity": 6.0}, {"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 6.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "", "quantity": 4.0}, {"food": "sweet potatoes", "quantity": 8.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "whole milk", "quantity": 1.5}, {"food": "ruby red grapefruit juice blend", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 1}], "title": "\nSausage Pizza Cones\n"}, {"directions": "\n\n              In a large pot melt 2 sticks butter in water. When melted add dry cornbread stuffing stirring to incorporate liquid, set aside.\n            \n\n              In a large saute pan set over medium-high heat melt 1 tablespoon butter and add sausage. With a wooden spoon break up sausage and saute until lightly browned and cooked through. Transfer sausage to paper towels to drain. In the same pan melt remaining butter and saute onions with the garlic, celery, thyme, and sage until onions are translucent and celery is crisp tender. Add walnuts and saute for 1 minute. Add apples and saute for one minute more. Remove from heat. Combine cornbread stuffing with sauteed ingredients and stuff turkey. Roast turkey as usual.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 2.0}, {"food": "coconut water", "quantity": 2.0}, {"food": "cheesecake mix", "quantity": 2.0}, {"food": "pork sausage links", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "walnuts", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "low fat fried chicken", "quantity": 2.0}], "title": "\nSausage and Apple Stuffing\n"}, {"directions": "\n\n              Heat 1 tablespoon olive oil in a large ovenproof skillet over medium-high heat; add the sausage and cook, stirring occasionally, until browned, about 5 minutes. Transfer to a plate using a slotted spoon. Reduce the heat to medium low and add the garlic to the skillet. Cook, stirring often, until lightly browned, about 2 minutes. Add the carrots, fennel, onion, 2 tablespoons water, 1/2 tablespoon thyme and 1/2 teaspoon each salt and pepper. Cook, stirring occasionally, until the vegetables soften, 15 minutes.\n            \n\n              Preheat the broiler. Combine the panko with the remaining 1 tablespoon olive oil, 1/2 tablespoon thyme and 1/4 teaspoon each salt and pepper; set aside. Return the sausage to the skillet along with the beans and their liquid, the tomatoes and 1/2 cup water. Bring to a boil, then reduce the heat to medium and gently simmer until the liquid is slightly reduced, about 5 minutes. Sprinkle the panko mixture evenly over the stew and broil until golden, about 4 minutes.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "sweet potatoes", "quantity": 1.0}, {"food": "garlic powder", "quantity": 6.0}, {"food": "carrots", "quantity": 2.0}, {"food": "fennel seed", "quantity": 0.5}, {"food": "onion powder", "quantity": 0.5}, {"food": "thyme", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 0.5}, {"food": "fava beans", "quantity": 1.0}, {"food": "silk black cherry soy yogurt", "quantity": 1.0}], "title": "\nSausage and Bean Stew\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F and line a rimmed baking sheet with parchment paper. Place the fennel on the prepared baking sheet and toss with with 1 tablespoon olive oil and 1/2 teaspoon salt. Move to one side of the baking sheet and roast until the fennel begins to soften, about 20 minutes.\n            \n\n              Remove from the oven and place the crumbled sausage in an even layer in the center of the baking sheet. In a medium bowl, toss the broccoli rabe with the sliced garlic, red pepper flakes, remaining 2 tablespoons of olive oil and 1/2 teaspoon salt and spread into an even layer on the empty side of the pan.\n            \n\n              Roast until the fennel and broccoli rabe are tender and charred in spots and the sausage is completely cooked through, about 15 minutes more. Toss vegetables and sausage with the accumulated juices on the tray before serving.\n            \n", "ingredients": [{"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "salt", "quantity": 1.0}, {"food": "pork sausage links", "quantity": 4.0}, {"food": "broccoli raab", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}], "title": "\nSausage and Broccoli Rabe Sheet Pan Dinner\n"}, {"directions": "\n\n              Put an inverted baking sheet on the lowest oven rack; preheat to 475 degrees F. Line another inverted baking sheet with parchment; drizzle with 2 tablespoons olive oil. Form the pizza dough into an 8-inch oval on the parchment; flip to coat with the oil. Drape with plastic wrap; set aside.\n            \n\n              Combine the tomatoes and basil in a bowl. Mix the ricotta, mozzarella and mint in another bowl; season with 1/2 teaspoon salt and a few grinds of pepper.\n            \n\n              Heat the remaining 1 tablespoon olive oil in a skillet over medium-high heat. Add the sausages and garlic; cook, breaking up the meat, 5 minutes. Remove to a plate using a slotted spoon. Add the broccolini and 1/2 cup water to the drippings in the skillet and cook 5 minutes.\n            \n\n              Stretch the dough to 11 by 14 inches on the parchment; spoon the ricotta mixture on top. Top with the tomatoes, sausage and broccolini. Slide the pizza (on the parchment) onto the hotbaking sheet. Bake until the crust is golden, 15 minutes. Transfer the pizza to a cutting board to slice.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "pizza rolls", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "basil", "quantity": 0.3333333333333333}, {"food": "macaroni cheese", "quantity": 1}, {"food": "macaroni cheese", "quantity": 2.0}, {"food": "", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "sweet potatoes", "quantity": 4.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "", "quantity": 1.0}], "title": "\nSausage and Broccolini Pizza\n"}, {"directions": "\n\n              Preheat the oven to 450 degrees F. Heat 1 tablespoon butter in a Dutch oven or ovenproof pot over high heat. Add the broccolini and stir-fry until just tender, 3 to 4 minutes. Transfer to a plate using a slotted spoon. Add the sausage, onion and carrot to the pot and cook, breaking up the meat, until browned, about 5 more minutes. Add the rice and garlic and cook, stirring, 1 more minute. Add the wine to the pot and cook until evaporated, about 2 minutes. Add the chicken broth, tomatoes and 1 cup water; cover and bring to a boil. Transfer the pot to the oven and bake until the rice is tender, about 15 minutes. Remove the pot from the oven. (Don't worry if the risotto seems wet; it will thicken when you add the cheese.) Vigorously stir in the remaining 2 tablespoons butter and the cheese until creamy, 1 to 2 minutes. Stir in the broccolini and divide among bowls.  \n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "butter oil", "quantity": 3.0}, {"food": "", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 12.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "carrot juice", "quantity": 1.0}, {"food": "crisped rice bar", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "martha white foods", "quantity": 0.3333333333333333}, {"food": "diced chicken", "quantity": 2.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 1.0}], "title": "\nSausage and Broccolini Risotto\n"}, {"directions": "\n\n              Heat the olive oil in a large pot over medium-high heat. Add the sausage and cook, turning, until browned, about 4 minutes. Add the onion, garlic and red pepper flakes and cook until the onion is soft, about 3 minutes.\n            \n\n              Stir in the orange juice concentrate, kale and 3 cups water. Add the tomatoes and break them into chunks with a spoon. Bring to a boil, then reduce the heat to medium low and simmer until thickened, about 30 minutes.\n            \n\n              Add the beans and clams. Return to a boil over high heat, cover and cook until the clams open, 10 to 12 minutes. Stir in the vinegar and serve with bread.\n            \n\n              Photograph by Kana Okada\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "sausage", "quantity": 8.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "orange juice", "quantity": 1.0}, {"food": "kale", "quantity": 0.5}, {"food": "whole milk", "quantity": 1.0}, {"food": "fava beans", "quantity": 1.0}, {"food": "", "quantity": 16.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "garlic bread", "quantity": 1}], "title": "\nSausage and Clam Soup\n"}, {"directions": "\n\n              Cook the polenta as the label directs; keep warm.\n            \n\n              Meanwhile, heat the olive oil in a large pot over medium heat. Add the garlic and broccoli rabe, season with salt and pepper and cook until the broccoli rabe is slightly tender, about 6 minutes. Transfer to a plate. Add the sausage to the pot and cook until just brown, breaking it up with a spoon, about 5 minutes. Add the tomatoes and cook until soft, about 2 minutes. Add the wine, bring to a boil and cook 3 minutes.\n            \n\n              Add the clams; cover and cook over medium-high heat until the clams open, 5 to 7 minutes (discard any that do not open). Return the broccoli rabe to the pot and season with salt and pepper. Divide the polenta among bowls and top with the sausage-clam mixture and cooking liquid. Sprinkle with parsley, if desired.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "escarole", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "sweet potatoes", "quantity": 0.75}, {"food": "grape juice", "quantity": 1.0}, {"food": "martha white foods", "quantity": 0.75}, {"food": "", "quantity": 16.0}, {"food": "parsley", "quantity": 1}], "title": "\nSausage and Clams With Polenta\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Lightly mist an 8-inch square baking dish with cooking spray. \n            \n\n              Heat the oil in a large nonstick skillet over medium heat; add the onion, garlic and sausage. Cook, breaking up the sausage with a spoon, until the onion is tender, about 10 minutes. Add the celery and fennel; cook, stirring occasionally, until vegetables are tender, 10 to 12 minutes. Transfer the mixture to a large bowl. \n            \n\n              Toss the vegetable mixture with the pear, herbs, reserved fennel fronds, walnuts and cornbread; season with salt and pepper. Gently toss the stuffing mixture with 1/2 cup broth to moisten (adding more to moisten if needed); transfer to the prepared baking dish. Lightly mist a piece of foil large enough to cover the dish. Pour 1/2 cup broth over the stuffing and cover with the foil. \n            \n\n              Bake for 30 minutes. Uncover the stuffing and bake until golden around edges, about 30 minutes more.\n            \n\nQuick and Healthy Cornbread:\n\n\n              Preheat the oven to 350 degrees F.\n            \n\n              Lightly mist an 8 by 8-inch baking pan with cooking spray. In a medium bowl, stir together the egg white, water and buttermilk; stir in the muffin mix and wheat germ until incorporated. Pour into the prepared pan and bake until a toothpick inserted in the center tests clean, 25 to 30 minutes.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "pork turkey sausage", "quantity": 6.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.25}, {"food": "pear nectar", "quantity": 1.0}, {"food": "sage", "quantity": 0.25}, {"food": "walnuts", "quantity": 0.25}, {"food": "", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "diced chicken", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "coconut water", "quantity": 0.5}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.25}, {"food": "blueberry muffin mix", "quantity": 1.0}, {"food": "wheat germ", "quantity": 0.25}], "title": "\nSausage and Cornbread Stuffing\n"}, {"directions": "\n\n              Adjust an oven rack to the middle position and preheat the oven to 375 degrees F.\n            \n\n              Lightly grease a 9-inch pie plate, including the lip, with butter. Gently roll each piece of biscuit dough out to about two times its original size. Stretch and press the biscuit dough, one piece at a time, into the pie plate, until you have covered the bottom and sides, pinching together the seams where pieces meet. Fork the bottom many times. Bake, until the sides are lightly browned and the bottom forms a crust, 6 to 8 minutes. Remove to a wire rack and let cool. Leave the oven on.\n            \n\n              Meanwhile, heat the butter in a large skillet over medium heat and add the sausage. Cook, stirring and breaking the sausage pieces up with a spoon, until browned and cooked through, about 6 minutes. Pour off any excess grease and add the half-and-half to the pan, scraping up any bits that may have stuck to the bottom of the pan. Remove from the heat.\n            \n\n              Whisk the egg and egg yolk together in a medium bowl and slowly add the half-and-half and sausage mix to the bowl in batches, whisking constantly, to incorporate. Stir in the scallions and season with 1/2 teaspoon salt and a generous 1/4 teaspoon black pepper. Scatter the cheese over the biscuit crust, pressing the cheese over any holes that may have formed during baking. Pour the sausage custard over the cheese and bake until the custard is set, 18 to 20 minutes. Serve hot.\n            \n", "ingredients": [{"food": "pie fillings", "quantity": 1.0}, {"food": "biscuit", "quantity": 4.0}, {"food": "breakfast tart", "quantity": 8.0}, {"food": "", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "macaroni cheese", "quantity": 2.5}], "title": "\nSausage and Gravy Pie with Biscuit Crust\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F and butter a 3-quart baking dish. Melt 6 tablespoons butter in a large pot or Dutch oven over medium-high heat. Add the sausage and cook, breaking up the meat with a wooden spoon, until lightly browned and cooked through, about 7 minutes.\n            \n\n              Add the celery, onions, thyme, rosemary, 1 teaspoon salt and a few grinds of pepper to the pot. Cook, stirring occasionally, until the vegetables are tender, about 5 minutes. Add the kale and cook, stirring, until just softened, about 3 minutes. Add the chicken broth and bring to a simmer, then remove from the heat and set aside.\n            \n\n              Whisk the eggs and parsley in a large bowl. Add the bread cubes and the sausage mixture; stir to combine. Fold in the provolone. Transfer the stuffing to the prepared baking dish. Cut the remaining 2 tablespoons butter into cubes and dot over the stuffing. Cover with foil and bake 30 minutes, then uncover and bake until golden brown, about 20 more minutes.\n            \n\n              Photograph by Chris Court\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 1.0}, {"food": "celery seed", "quantity": 4.0}, {"food": "onions", "quantity": 2.0}, {"food": "thyme", "quantity": 1.0}, {"food": "rosemary", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "kale", "quantity": 1.0}, {"food": "diced chicken", "quantity": 3.0}, {"food": "eggs", "quantity": 2.0}, {"food": "parsley", "quantity": 0.25}, {"food": "garlic bread", "quantity": 16.5}, {"food": "macaroni cheese", "quantity": 4.5}], "title": "\nSausage and Kale Stuffing\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Butter a 3-quart casserole dish.\n            \n\n              Heat 1 tablespoon butter in a large Dutch oven or heavy pot over medium heat. Add the sausage and cook until golden brown, about 6 minutes. Add the leeks and squash and season with 1 teaspoon each salt and pepper; cook until the leeks are soft, about 3 minutes. Add the kale, toss and cover until the kale wilts, about 4 minutes. Add the focaccia cubes and the remaining 3 tablespoons butter and toss until the butter melts.\n            \n\n              Whisk the egg and chicken broth in a bowl until smooth; stir in the diced parmesan and 1 teaspoon salt. Pour the broth mixture over the bread mixture; cook until the liquid is absorbed by the bread, about 1 minute.\n            \n\n              Transfer the bread mixture to the prepared casserole dish. Scatter the shredded cheese evenly on top and bake until golden and cooked through, about 40 minutes. Set aside for 5 minutes before serving.\n            \n\n              Photograph by: Anita Calero\n            \n", "ingredients": [{"food": "butter oil", "quantity": 4.0}, {"food": "sweet potatoes", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "diced chicken", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "parmesan cheese", "quantity": 1.25}], "title": "\nSausage and Kale Thanksgiving Dressing\n"}, {"directions": "\n\n              Soak the sauerkraut in a bowl of warm water. Cover the potatoes with water in a small saucepan and simmer over medium heat until tender, about 10 minutes. Drain and keep warm.\n            \n\n              Meanwhile, heat the vegetable oil in a large pot over medium-high heat. Prick the sausages with a fork and add to the pot along with the pork; cook until browned on one side, about 4 minutes. Turn the meats and add the onion, garlic, coriander, juniper berries, and salt and pepper to taste. Cook until the onion is golden brown, about 6 minutes. Add the apple and cook 2 more minutes.\n            \n\n              Drain the sauerkraut, then add to the pot along with the wine and 1 cup water. Cover and simmer 10 minutes, then uncover and cook until thickened, about 5 more minutes. Transfer the sauerkraut, meats and potatoes to a platter. Top with the parsley and serve with mustard.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "sauerkraut", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 8.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "pork turkey sausage", "quantity": 12.0}, {"food": "smoked turkey roll", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "seeds", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "apple", "quantity": 1.0}, {"food": "martha white foods", "quantity": 1.0}, {"food": "parsley", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 1}], "title": "\nSausage and Kraut\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: six 12-ounce ramekins\n\n              Preheat the oven to 350 degrees F. Grease six 12-ounce ramekins with 2 tablespoons of the butter and set aside on a rimmed baking sheet.\n            \n\n              Spread the brioche on a second rimmed baking sheet and bake, tossing halfway through, until lightly browned, about 15 minutes. \n            \n\n              Melt the remaining 2 tablespoons butter in a large skillet over medium-high heat. Add the sausage and squash and cook, breaking up the meat with the back of a spoon, until the sausage is browned and the squash is tender, about 8 minutes. Stir in the leeks, thyme, 1 teaspoon salt and 1/2 teaspoon pepper and continue to cook, stirring often, until the leeks are wilted and softened, about 5 minutes. \n            \n\n              Whisk together the chicken broth, cream, parsley, chives and eggs in a medium bowl. Add half the brioche to the ramekins. Divide the sausage mixture among the ramekins; top with 1 cup of the Gruyere and the remaining brioche. Pour the egg mixture over and sprinkle with the remaining 1 cup Gruyere.\n            \n\n              Set aside at room temperature for 15 minutes to allow the bread to absorb the egg mixture. Bake on the baking sheet until the custard is set and the bread pudding is puffed and golden, about 20 minutes. Sprinkle with chives before serving. \n            \n", "ingredients": [{"food": "butter oil", "quantity": 4.0}, {"food": "", "quantity": 8.5}, {"food": "sweet potatoes", "quantity": 8.0}, {"food": "squash", "quantity": 1.0}, {"food": "silk light vanilla", "quantity": 4.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "diced chicken", "quantity": 1.5}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 0.25}, {"food": "chives", "quantity": 3.0}, {"food": "eggs", "quantity": 4.0}, {"food": "", "quantity": 2.0}], "title": "\nSausage and Leek Savory Bread Pudding\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. In a medium pot heat 1 tablespoon of the oil over medium-high heat. Add the garlic and cook until fragrant, about 1 minute. Add the tomatoes with their juices, oregano, 3/4 teaspoon salt and 1/4 teaspoon pepper. Bring to a simmer and continue to cook until the tomatoes soften and the sauce thickens, 20 minutes, breaking up the tomatoes with a spoon as they soften. Reserve 2/3 cup of the sauce for assembling the lasagna and set the rest aside.\n            \n\n              Meanwhile, heat the remaining 1 tablespoon oil in a large skillet over medium-high heat and add the mushrooms. Cook until the mushrooms have released their liquid, 5 to 7 minutes. Add the sausage and continue to cook, breaking the sausage up with a spoon, until the sausage is browned and cooked through, another 10 minutes. Add the tomato sauce and stir to combine. \n            \n\n              Thinly slice about a quarter of the mozzarella and set aside; grate the rest on a box grater. Combine the grated cheese with the ricotta and the egg. Spread the reserved 2/3 cup tomato sauce in the bottom of a 9-by-13-inch baking dish. Top with 1 pasta sheet, a third of the ricotta mixture and a third of the meat sauce. Repeat with the remaining pasta, ricotta and meat sauce. Cover with foil and bake until the sauce is bubbling around the edges and the pasta is tender, about 45 minutes. Remove the foil, top with the sliced mozzarella and continue to bake until the cheese is melted, 15 minutes more. Let stand for 20 minutes and sprinkle with chopped parsley before serving with a green salad and some garlic bread.\n            \n", "ingredients": [{"food": "", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "plum", "quantity": 28.0}, {"food": "salt", "quantity": 1}, {"food": "mixed nuts", "quantity": 4.0}, {"food": "sweet potatoes", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 15.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "lasagna", "quantity": 3.0}, {"food": "parsley", "quantity": 2.0}, {"food": "garlic bread", "quantity": 1}], "title": "\nSausage and Mixed Mushroom Lasagna\n"}, {"directions": "\n\n              Heat the oil in a large skillet over medium high heat. Add the sausages and cook until well browned on all sides, about 10 minutes. Remove the sausages from the pan and set aside. Pour off all but 1 tablespoon of oil. Add the onions and cook, stirring, until golden, about 5 minutes. Stir in the tomato paste and cook for 1 minute more. Add the peppers, garlic, and season with salt and pepper to taste. Cook until the peppers are wilted, about 5 minutes. Return the sausages to the pan, cover, and cook over medium heat, stirring frequently, until the sausages are cooked through, about 12 minutes more. Stir in the vinegar. Divide the sausage and peppers evenly amongst the crusty rolls and serve.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "sweet potatoes", "quantity": 12.0}, {"food": "onion powder", "quantity": 1.25}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 2.5}, {"food": "yellow rice", "quantity": 2.5}, {"food": "peppers", "quantity": 2.5}, {"food": "garlic powder", "quantity": 4.0}, {"food": "black bean mango", "quantity": 1}, {"food": "vinegar", "quantity": 1.0}, {"food": "pizza rolls", "quantity": 6.0}], "title": "\nSausage and Peppers\n"}, {"directions": "\n\n              Toppings: Sauteed onions, green peppers and Italian sausage and fresh mozzarella\n            \n\n              How to Make Classic Potato Skins:\n            \n\n              Pierce 4 large russet potatoes with a fork. Bake directly on the oven rack at 350 degrees until tender, about 1 hour. Let cool, then quarter lengthwise and scoop out the flesh, leaving a 1/4-inch shell. Brush both sides with melted butter and season with salt and pepper. Bake, skin-side up, at 450 degrees until crisp, about 20 minutes. Add your favorite team toppings. (For cheesy skins, flip the baked shells over before topping, sprinkle with 1 cup grated cheddar cheese and bake an extra 5 minutes.)\n            \n\n              Photograph by Karl Juengel/Studio D\n            \n", "ingredients": [], "title": "\nSausage and Peppers Potato Skins\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F and line a rimmed baking sheet with parchment paper. Place the onions on the prepared baking sheet and toss with 1 tablespoon olive oil and some salt and pepper. Spread the onions in an even layer and roast for 5 minutes. Remove the pan from the oven and push the onions over to one side.\n            \n\n              Toss the orange and green bell peppers in a medium bowl with the remaining tablespoon olive oil and some salt and pepper. Place the seasoned peppers in the center of the baking sheet. Place the sausages in the empty area next to the peppers, spacing them evenly apart.\n            \n\n              Roast until the onions are translucent and tender, the peppers are soft and charred in spots, and the sausage is completely cooked through, about 25 minutes. (For even cooking, turn the vegetables halfway through cooking.)\n            \n\n              Cut the sausages into bite-size pieces and divide evenly between four hoagie rolls. Top with the peppers and onions.\n            \n", "ingredients": [{"food": "pork sausage links", "quantity": 6.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "pizza rolls", "quantity": 4.0}], "title": "\nSausage and Peppers Sheet Pan Dinner\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Cut the squash in half lengthwise using a serrated knife and remove the seeds with a spoon. Brush the flesh of both halves with 1 teaspoon oil and season with 1/2 teaspoon salt and a few grinds of pepper. Put the halves flesh-side down on a baking sheet and cook until tender, the flesh can easily be flaked with a fork and the edges just turn brown, about 45 minutes. Separate the strands of squash by scraping the flesh with a fork. Leave the scraped strands inside the squash.\n            \n\n              Meanwhile, heat the remaining oil in a large skillet over medium-high heat. Add the sausage and cook, breaking it up with a wooden spoon and taking care to keep some larger chunks, until it just starts to brown and crisp up, 5 to 6 minutes. Add the tomatoes, thyme, red pepper flakes and garlic and cook, stirring, until just fragrant, about 1 minute. Pour in the wine and cook until reduced by half, 2 to 3 minutes. Add the heavy cream and 1 teaspoon salt and bring to a boil. Lower the heat to medium and simmer until the sauce reduces by half, 3 to 4 minutes. Add the white beans and spinach to the skillet and cook, stirring frequently, until the spinach just wilts and is still vibrant green, 1 to 2 minutes. \n            \n\n              Divide the sausage mixture between the 2 squash halves and mix with the squash strands until well combined. Sprinkle each squash half with 1 tablespoon Parmesan and serve with more red pepper flakes, if using. \n            \n", "ingredients": [{"food": "spaghetti", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "sweet potatoes", "quantity": 8.0}, {"food": "silk black cherry soy yogurt", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "garlic powder", "quantity": 2.0}, {"food": "martha white foods", "quantity": 0.5}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "fava beans", "quantity": 15.0}, {"food": "mustard spinach", "quantity": 5.0}, {"food": "", "quantity": 2.0}], "title": "\nSausage and White Bean-Stuffed Spaghetti Squash\n"}, {"directions": "\n\n              Spread the onions over the bottom of a 5 1/2- to 6-quart slow cooker and top with the carrots, garlic, white beans, thyme bundle and sausage links. Mix the diced tomatoes with the broth and 3 cups water and pour over the sausages. Add the Parmesan rind if using.\n            \n\n              Cook on high for 4 to 5 hours or on low for 7 to 8 hours; the beans will be tender and begin to fall apart.\n            \n\n              Uncover the slow cooker, remove and discard the thyme bundle and Parmesan rind and transfer the sausage links to a cutting board. Stir the pasta into the stew and continue to cook, covered, until the pasta is cooked through, about 20 minutes.\n            \n\n              Turn off the heat. Cut the sausages into bite-size pieces and stir into the stew along with the parsley and vinegar. Season with salt and pepper. Serve with grated Parmesan on the side for sprinkling on top and crusty bread for soaking up the broth.\n            \n", "ingredients": [{"food": "onion powder", "quantity": 1.5}, {"food": "carrots", "quantity": 2.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "fava beans", "quantity": 8.0}, {"food": "hearts of palm", "quantity": 6.0}, {"food": "sweet potatoes", "quantity": 1.0}, {"food": "diced chicken", "quantity": 14.0}, {"food": "diced chicken", "quantity": 3.0}, {"food": "", "quantity": 4.0}, {"food": "italian veg medley pasta", "quantity": 0.5}, {"food": "parsley", "quantity": 2.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "garlic bread", "quantity": 1}], "title": "\nSausage, Bean and Pasta Stew\n"}, {"directions": "\n\n              Heat the oil in a medium pot over medium heat. Add the sausage and cook, breaking the meat up with a wooden spoon, until browned, about 4 minutes. Add the onions and celery and continue to cook, stirring, until the vegetables are softened, about 5 minutes. Add the beans, tomatoes, broth and 4 cups water and increase the heat to medium-high to bring to a simmer. Continue to simmer, adjusting the heat if necessary, until the vegetables are tender, about 10 minutes. \n            \n\n              Add the tortellini and continue to cook until they are tender, about 10 minutes. Season to taste with salt and pepper. Serve in bowls topped with a spoonful of pesto and a sprinkle of grated Parmesan.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 4.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "celery seed", "quantity": 1.6666666666666665}, {"food": "fava beans", "quantity": 15.0}, {"food": "diced chicken", "quantity": 15.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "hearts of palm", "quantity": 8.0}, {"food": "black bean mango", "quantity": 1}, {"food": "pesto pasta primavera", "quantity": 0.25}, {"food": "", "quantity": 1}], "title": "\nSausage, White Bean and Tortellini Soup\n"}, {"directions": "\n\n              Escarole and White Bean Soup: Cook 3 chopped garlic cloves and some red pepper flakes in olive oil. Add 3 cups chicken broth, 1 head chopped escarole and a parmesan rind; simmer 15 minutes. Add 1 can white beans, parmesan and salt.\n            \n\n              For Sausage-Bean Soup: Make Escarole and White Bean Soup; saute 4 chopped sweet Italian sausages with the garlic.\n            \n", "ingredients": [], "title": "\nSausage-Bean Soup\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Add the spaghetti and cook as the label directs. Reserve 2 cups cooking water, then drain.\n            \n\n              Meanwhile, heat the olive oil in a large skillet over medium-high heat. Crumble the sausage into the skillet and cook, breaking it up with a wooden spoon, until lightly browned and no longer pink, 4 to 5 minutes. Clear a space in the pan, add the garlic and cook until just golden, 2 to 3 minutes. Add the cauliflower and cook until the edges are browned, about 2 minutes. Add 1 cup of the reserved cooking water, cover and reduce the heat to medium. Cook until the cauliflower is tender, about 8 more minutes. Uncover and boil over high heat until the liquid is almost evaporated, about 2 more minutes.\n            \n\n              Add the spaghetti to the skillet along with the scallions. Drizzle with olive oil and season with salt. Toss for a minute or two to wilt the scallions and coat the pasta with the sauce, adding up to 1 cup cooking water, if needed, to loosen. Remove from the heat, sprinkle with the cheese and toss. Divide among shallow bowls and drizzle with more olive oil, if desired.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "spaghetti", "quantity": 12.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "pork turkey sausage", "quantity": 12.0}, {"food": "garlic powder", "quantity": 6.0}, {"food": "cauliflower", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "parmesan cheese", "quantity": 1.0}], "title": "\nSausage-Cauliflower Spaghetti\n"}, {"directions": "\n\n              Put the bacon in a medium saucepan and fill with water. Bring to a simmer over medium heat and cook 20 minutes; drain, rinse under cold water and pat dry. Combine the bacon, pork tenderloin, wine, garlic, parsley, sage, red pepper flakes, sugar, 1/4 teaspoon salt and 1/2 teaspoon pepper in a large bowl; toss to combine. Cover and refrigerate at least 1 hour and up to 4 hours. Transfer the pork mixture to a food processor and pulse until coarsely chopped. Transfer to a bowl and stir in the cheese. Form into 8 to 10 patties, about 2 inches wide and 1/2 inch thick. Put on a plate, cover and refrigerate at least 1 hour. Heat the vegetable oil in a large nonstick skillet over medium heat. Add the sausage patties and cook until browned on both sides, 8 to 10 minutes. Transfer to a plate and tent with foil to keep warm. Crack the eggs into the hot skillet, season with salt and pepper and fry until just set, 2 to 3 minutes. Serve with the sausage patties.\n            \n\n              Photograph by Anna Williams\n            \n", "ingredients": [{"food": "bacon", "quantity": 6.75}, {"food": "pork skins", "quantity": 1.5}, {"food": "martha white foods", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "parsley", "quantity": 1.0}, {"food": "sage", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "sugar", "quantity": 0.75}, {"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "eggs", "quantity": 6.0}], "title": "\nSausage-Provolone Patties With Fried Eggs\n"}, {"directions": "\n\n              Make the stuffed shells: Bring a large pot of salted water to a boil. Add the pasta shells and cook until just slightly softened but still firm, about 7 minutes. Drain and rinse under cold water. Drizzle with olive oil and toss; set aside. \n            \n\n              Heat the olive oil in a large nonstick skillet over medium-high heat. Add the onion and cook, stirring occasionally, until soft, about 4 minutes. Add the garlic and cook, stirring, 30 seconds. Add the sausage and cook, breaking it up with a wooden spoon, until browned, about 5 minutes. Add the spinach, 1/2 teaspoon salt, and pepper to taste and stir until heated through, about 2 more minutes. Remove from the heat and let cool completely. \n            \n\n              Combine the spinach mixture, ricotta, 1 cup mozzarella, the parmesan, parsley and 1 teaspoon salt in a bowl. Stuff each shell with about 2 tablespoons of the filling; set aside. \n            \n\n              Preheat the oven to 350 degrees F. Make the cheese sauce: Melt the butter with the garlic in a medium saucepan over medium heat. When the butter begins to foam, add the flour and whisk constantly until lightly golden, about 1 minute. Add the milk and cream, bring to a simmer and cook, whisking constantly, until the sauce is thick enough to coat a spoon, 2 to 3 minutes. Remove from the heat and whisk in the parmesan, 1/4 teaspoon salt, and nutmeg to taste. \n            \n\n              Brush a 9-by-13-inch baking dish with olive oil and pour in about two-thirds of the cheese sauce. Add the stuffed shells and top with the remaining cheese sauce. Cover with aluminum foil and bake 20 minutes. Uncover and top with the marinara sauce and the remaining 1 cup mozzarella; continue baking until the sauce is bubbly, 15 to 20 more minutes.  \n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "italian veg medley pasta", "quantity": 8.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "sausage", "quantity": 0.5}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 2.0}, {"food": "parmesan cheese", "quantity": 0.5}, {"food": "parsley", "quantity": 0.25}, {"food": "butter oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "whole milk", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "parmesan cheese", "quantity": 0.3333333333333333}, {"food": "salt", "quantity": 1}, {"food": "nutmeg", "quantity": 1}, {"food": "Worcestershire sauce", "quantity": 0.5}], "title": "\nSausage-Spinach Stuffed Shells\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Using a serrated knife, slice off the top quarter of each tomato and reserve the tops. Scoop out the pulp from inside each tomato and transfer it to a food processor. Add 2 tablespoons olive oil and the cayenne to the food processor and process until smooth; pour into a 9-by-13-inch baking dish.\n            \n\n              Heat the remaining 2 tablespoons olive oil in a large skillet over medium-high heat. Add the sausage, herbes de Provence, bell pepper, onion, diced celery and garlic. Cook, stirring, until the sausage browns, about 5 minutes. Transfer the sausage mixture and bread cubes to the food processor and pulse until chopped. Pack the tomatoes with the sausage-bread mixture so the stuffing is domed on top. Put the stuffed tomatoes in the baking dish on top of the sauce.\n            \n\n              Place the basil, walnuts, cheese and celery leaves in the food processor and chop. Sprinkle onto the tomatoes. Put the tomato tops, cut-side down, between the stuffed tomatoes. Bake until the stuffing is golden, about 20 minutes. Cover each tomato with a top and serve with the sauce.\n            \n\n              Photograph by Kana Okada\n            \n", "ingredients": [{"food": "pasta with tomato sauce", "quantity": 8.0}, {"food": "vegetable oil", "quantity": 4.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "sweet potatoes", "quantity": 0.75}, {"food": "dulce de leche", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "celery seed", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "garlic bread", "quantity": 2.5}, {"food": "basil", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "parmesan cheese", "quantity": 0.3333333333333333}], "title": "\nSausage-and-Basil-Stuffed Tomatoes\n"}, {"directions": "\n\n              Position an oven rack in the center of the oven, set a baking sheet on it and preheat to 400 degrees F.\n            \n\n              Toss the sausage links with the oil in a large bowl. Add the sausages to the hot baking sheet, and spread out in 1 layer. Roast, turning halfway through, until lightly browned in spots and cooked through, about 15 minutes. Let cool completely. Cut each sausage in half crosswise.\n            \n\n              Meanwhile, whisk together the flour, baking powder, sugar, baking soda and 1/4 teaspoon salt in a large bowl. Grate the frozen butter on the large holes of a box grater, and add to the bowl, along with the scallions. Add the buttermilk, and mix together gently with a fork. When a shaggy dough forms, turn it out onto a floured surface.\n            \n\n              Working quickly, roll the dough out into a 14-by-8-inch rectangle about 1/8 inch thick. Trim each side by about an inch, to yield a 12-by-6-inch rectangle with clean edges. Cut twelve 1-inch-wide strips, then cut those strips in half crosswise. (You should have 24 strips, each about 1 inch by 3 inches.)\n            \n\n              Wrap a biscuit strip around the belly of each sausage half, and place, seam-side down, at least 1 inch apart on a clean baking sheet. Sprinkle a small pinch of cracked black pepper on top of each one. (Refrigerate up to overnight if not baking right away.) Bake until golden brown, 15 to 18 minutes. Serve with maple syrup on the side.\n            \n", "ingredients": [{"food": "pork sausage links", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "potato flour", "quantity": 1.25}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 3.0}, {"food": "turnip greens", "quantity": 2.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1.0}, {"food": "syrup", "quantity": 1}], "title": "\nSausage-and-Biscuit Pigs in Blankets\n"}, {"directions": "\n\n              Butter an 8-inch-square baking dish; set aside. Put 3 tablespoons of the butter in a microwave-safe small bowl or liquid measure; microwave for 30 seconds to 1 minute to melt the butter.\n            \n\n              Whisk together the flour, baking powder, baking soda, 3 tablespoons of the sugar and 1/2 teaspoon salt in a large bowl. In a separate small bowl, whisk together the buttermilk, 2 eggs and the melted butter. Add the wet ingredients to the dry ingredients and stir until just combined.\n            \n\n              Heat a large nonstick skillet or griddle over medium heat. Melt a little of the remaining 1 tablespoon butter in the skillet. Working in batches, pour the batter by 1/4 cupfuls into the skillet and cook until the bottoms are golden brown and small bubbles appear on the tops, 2 to 3 minutes. Flip and cook until golden brown on the other sides, about 2 minutes. If the pancakes brown too quickly, reduce the heat to medium-low. Transfer the pancakes to a plate as finished. Repeat until all the batter is used, adding more butter to the skillet as necessary. (You should have at least 12 pancakes.)\n            \n\n              Whisk together the half-and-half, the remaining 5 eggs, the remaining 1 tablespoon sugar, the pepper and 1/4 teaspoon salt in a large bowl.\n            \n\n              Shingle half of the pancakes in the prepared baking dish. Scatter with half of the sausage, sprinkle with half of the cheese and scallions. Pour half the egg mixture evenly over the pancakes. Repeat with the remaining pancakes, sausage, cheese, scallions and egg mixture. Cover the dish with plastic wrap and refrigerate for at least 8 hours or up to overnight to allow the pancakes to soak in the custard.\n            \n\n              Preheat the oven to 350 degrees F. Remove the plastic wrap, cover the casserole loosely with foil and bake for 30 minutes. Uncover and continue to bake until golden brown, the custard is set and the center feels firm but springy, about 30 minutes more. Let cool 15 minutes before serving. Serve warm with maple syrup if you like.\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 4.0}, {"food": "potato flour", "quantity": 1.75}, {"food": "baking chocolate", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "sugar", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 1.75}, {"food": "eggs", "quantity": 7.0}, {"food": "", "quantity": 2.0}, {"food": "black bean mango", "quantity": 0.25}, {"food": "breakfast tart", "quantity": 8.0}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "syrup", "quantity": 1}], "title": "\nSausage-and-Cheese Pancake Breakfast Casserole\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Position an oven rack in the center of the oven, and preheat to 425 degrees F. Whisk the eggs, milk, flour, 2 tablespoons of the melted butter, 1/2 teaspoon salt and a few grinds of pepper in a bowl or measuring cup until smooth (a few lumps are fine); cover the batter, and refrigerate until needed.\n            \n\n              Cook the sausage in a large nonstick skillet over medium-high heat, breaking up any big chunks with the back of a wooden spoon, until browned and cooked through, about 5 minutes; transfer to a small bowl, and set aside. Lower the heat to medium, and add the remaining 1 tablespoon melted butter to the skillet. Once the butter is bubbling, add the mushrooms, parsley, shallots and some salt and pepper. Cook, stirring occasionally, until the mushrooms are lightly browned and softened, about 5 minutes. Stir in the sausage. Put the skillet in the oven to heat the mushroom-sausage mixture through, 2 minutes. Sprinkle the Gruyere evenly over the mixture, and carefully pour in the batter (make sure that the sausage and mushrooms are evenly distributed over the bottom of the pan). Bake until browned and puffed, 20 to 22 minutes. Serve immediately with salad.\n            \n", "ingredients": [{"food": "eggs", "quantity": 3.0}, {"food": "whole milk", "quantity": 0.5}, {"food": "potato flour", "quantity": 0.5}, {"food": "butter oil", "quantity": 3.0}, {"food": "black bean mango", "quantity": 1}, {"food": "meat drippings ", "quantity": 0.5}, {"food": "mushrooms", "quantity": 1.0}, {"food": "parsley", "quantity": 2.0}, {"food": "shallots", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "poultry salad swich spread", "quantity": 1}], "title": "\nSausage-and-Mushroom Dutch Baby\n"}, {"directions": "\n\n              Soak eight 8-inch skewers in water, at least 15 minutes. Preheat a grill or grill pan to medium high. Prepare the couscous as the label directs.\n            \n\n              Meanwhile, toss the bell peppers, sausage, onion and tomatoes in a bowl with 1 tablespoon olive oil; season with salt and pepper. Thread onto the skewers, alternating the sausage and vegetables. Grill, turning, until the vegetables are slightly softened and the sausage begins to brown, 6 to 7 minutes.\n            \n\n              Meanwhile, puree the parsley, cilantro and scallions in a blender with the remaining 2 tablespoons olive oil, the vinegar and 2 tablespoons water. Season with salt and pepper. Brush the skewers with some of the pesto and continue to cook, turning, until the tomatoes are tender and the sausage is charred, 6 to 7 more minutes.\n            \n\n              Toss the couscous with half of the remaining pesto and season with salt and pepper. Serve with the skewers and the remaining pesto, for dipping.\n            \n\n              Photography by Antonis Achilleos\n            \n", "ingredients": [{"food": "couscous", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 2.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "silk black cherry soy yogurt", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "parsley", "quantity": 0.25}, {"food": "", "quantity": 0.25}, {"food": "", "quantity": 4.0}, {"food": "vinegar", "quantity": 1.0}], "title": "\nSausage-and-Pepper Skewers\n"}, {"directions": "\n\n              Combine the ground beef, sausage, garlic, oregano, 1/4 teaspoon salt and a few grinds of pepper in a medium bowl; mix with your hands until just combined. Form into four 3/4-inch-thick patties; set aside.\n            \n\n              Preheat a grill pan or grill over medium heat. Toss the onion and bell peppers with the olive oil, 1/4 teaspoon salt and a few grinds of pepper in a bowl. Grill the vegetables, turning occasionally, until lightly browned and tender, about 7 minutes. Transfer to a plate and set aside.\n            \n\n              Brush the grill pan with olive oil. Add the burgers and cook until browned and cooked through, about 4 minutes per side, topping with the cheese and covering during the last 2 minutes.\n            \n\n              Serve the burgers on the buns and top with the onion-pepper mixture, basil and marinara sauce. Serve with chips.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "frankfurter beef", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 8.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "onion powder", "quantity": 1.5}, {"food": "", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "potato flour", "quantity": 4.0}, {"food": "chrysanthemum leaves", "quantity": 4.0}, {"food": "Worcestershire sauce", "quantity": 1}, {"food": "potato chips", "quantity": 1}], "title": "\nSausage-and-Peppers Burgers\n"}, {"directions": "\n\n              Preheat the oven to 450 degrees F. Pierce the sausages a few times with a fork and arrange on a baking sheet. Bake until lightly browned and cooked through, about 15 minutes. Let cool.\n            \n\n              Meanwhile, heat 1 tablespoon peanut oil in a large nonstick skillet over medium-high heat. Add the onion, bell peppers, garlic, 1/2 teaspoon salt and a few grinds of pepper; cook, stirring occasionally, until the vegetables are soft and lightly browned, about 7 minutes. Transfer to a plate to cool.\n            \n\n              Heat 2 inches of peanut oil in a large pot or Dutch oven over medium heat until a deep-fry thermometer registers 340 degrees F. Whisk the cornmeal, 1 cup flour, the sugar, baking powder, mustard powder, oregano, red pepper flakes and 1 teaspoon salt in a large bowl. Whisk the milk and eggs in a medium bowl. Add the milk mixture to the flour mixture along with the parsley and whisk to make a smooth batter. Stir the peppers and onions into the batter.\n            \n\n              Stick each sausage on an 8-inch wooden skewer. Put the remaining 1 cup flour in a shallow dish. Working in batches, dredge the sausages in the flour, turning to coat, then dip in the batter to coat, letting the excess drip off. Fry the sausages (sticks included) until golden brown, about 4 minutes. Remove to a paper towel-lined plate and sprinkle with salt. Serve with the marinara sauce.\n            \n\n              Photograph by Ryan Liebe\n            \n", "ingredients": [{"food": "", "quantity": 10.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "cornmeal", "quantity": 11.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "sugar", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "milk", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "parsley", "quantity": 0.5}, {"food": "Worcestershire sauce", "quantity": 1}], "title": "\nSausage-and-Peppers Corn Dogs\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Bring a large pot of salted water to a boil. Add the rice, reduce the heat and simmer, stirring once or twice, until the rice is tender, 12 to 15 minutes. Drain, shaking the colander to remove any excess water. Spread the rice on a rimmed baking sheet and let cool.\n            \n\n              Preheat the oven to 450 degrees F and place a baking sheet on the middle rack. Melt 2 tablespoons butter in a large skillet over medium-high heat. Add the onion and cook until soft, about 8 minutes. Add the sausage and cook, breaking it up with a wooden spoon, until browned, about 6 minutes. Tear the basil and add to the skillet along with the garlic and tomato paste. Increase the heat to high and cook, stirring, until the tomato paste browns, about 4 minutes. Stir in the chicken broth, scraping up any browned bits from the bottom of the skillet. Cook, stirring occasionally, until thickened, 15 to 20 minutes.\n            \n\n              Meanwhile, grease the bottom and sides of an 8-inch springform pan with the remaining 1 tablespoon butter. Coat the pan with the breadcrumbs, tapping to remove any excess. Put the eggs and all but 3 tablespoons of the pecorino cheese in a small bowl and beat with a fork. Put the cooled rice in a bowl; add the egg mixture and stir to combine.\n            \n\n              Transfer about two-thirds of the rice mixture to the prepared springform pan. Using moist fingers, pat the rice onto the bottom and up the sides of the pan, forming a 1/2-inch-thick layer. Place the provolone slices over the rice in the pan. Spoon about three-quarters of the sausage filling over the provolone, filling it to 1/2 inch from the top. Pat the remaining rice mixture on top to enclose the filling, then sprinkle with the remaining 3 tablespoons pecorino cheese. Put the pan on the hot baking sheet and bake until golden, about 20 minutes. Transfer to a rack and let cool, 5 minutes.\n            \n\n              Run a small knife around the edge of the pan to loosen the timbale, then remove the side of the pan. Slide a spatula under the timbale and transfer it to a platter. Thin the remaining sausage filling with a splash of water and reheat. Serve with the timbale.\n            \n\n              Photograph by Anna Williams\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "crisped rice bar", "quantity": 2.5}, {"food": "butter oil", "quantity": 3.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "pork turkey sausage", "quantity": 0.75}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "garlic powder", "quantity": 2.0}, {"food": "pasta with tomato sauce", "quantity": 0.25}, {"food": "diced chicken", "quantity": 3.0}, {"food": "", "quantity": 3.0}, {"food": "eggs", "quantity": 4.0}, {"food": "macaroni cheese", "quantity": 1.25}, {"food": "macaroni cheese", "quantity": 2.0}], "title": "\nSausage-and-Rice Timbale\n"}, {"directions": "\n\n              Heat the olive oil in a Dutch oven or heavy pot over medium heat. Add the onion and garlic; cook, stirring occasionally, until soft and glistening, about 6 minutes. Add the paprika and 1 teaspoon salt; cook until the oil turns deep red, about 1 minute. Add the flour and cook until just toasted, 30 more seconds. Immediately whisk in 4 cups water. Add the kielbasa, carrots, parsnips, potatoes and 1 1/2 teaspoons salt.\n            \n\n              Bring the soup to a boil, then reduce to a simmer; cover and cook until the vegetables are tender and the broth has thickened, about 20 minutes. Add the vinegar and season with pepper.\n            \n\n              Combine about half of the parsley with the sour cream in a small bowl and season with salt and pepper. Ladle the stew into bowls; top with the remaining parsley, a dollop of herbed sour cream and a sprinkle of paprika. Serve with bread.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "paprika", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "potato flour", "quantity": 3.0}, {"food": "pineapple chunks", "quantity": 6.0}, {"food": "pineapple chunks", "quantity": 3.0}, {"food": "parsnips", "quantity": 2.0}, {"food": "new engl br sausage", "quantity": 14.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "parsley", "quantity": 0.5}, {"food": "sour cream", "quantity": 0.75}, {"food": "garlic bread", "quantity": 1}], "title": "\nSausage-and-Vegetable Stew\n"}, {"directions": "\n\n              Heat the olive oil in a large skillet over medium heat. Add the sausages and cook, turning once, until golden, about 6 minutes. Add the garlic and cook, stirring, 1 minute. Add the wine, scraping up any browned bits from the bottom of the skillet. Add the grapes and spread the mixture into an even layer. Cover and continue to cook until the sausages are cooked through, about 10 minutes. Remove the sausages to a plate; cover with foil to keep warm.\n            \n\n              Increase the heat to high and continue cooking the grapes until they burst and the sauce is reduced, about 12 minutes. (Mash the grapes slightly with a fork if they¿re not bursting.) Remove from the heat and stir in the vinegar; season with salt and pepper.\n            \n\n              Meanwhile, bring the milk and 2 cups water to a boil in a medium saucepan. Whisk in the polenta and thyme. Reduce the heat to low and cook, whisking often, until the polenta thickens, 3 to 5 minutes. Remove from the heat and stir in the fontina until smooth; season with salt and pepper.\n            \n\n              Stir the parsley into the grape sauce and slice the sausages. Top the polenta with the sausages, grape sauce and more parsley.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "sweet potatoes", "quantity": 4.0}, {"food": "garlic powder", "quantity": 6.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "ruby red grapefruit juice blend", "quantity": 1.5}, {"food": "vinegar", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "whole milk", "quantity": 4.0}, {"food": "", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 4.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "parsley", "quantity": 3.0}], "title": "\nSausages and Grapes with Cheesy Polenta\n"}, {"directions": "\n\n              Snap off the woody ends of 2 bunches medium asparagus; discard. Slice the spears diagonally into 2-inch pieces. Heat 3 tablespoons olive oil in a skillet over medium heat; add the asparagus and cook until tender but still bright green, about 2 minutes. Season with salt and pepper. Remove from the heat and toss with the juice of 1 lemon. Top with 1/4 cup toasted sliced almonds, and lemon zest to taste.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [], "title": "\nSauteed Asparagus\n"}, {"directions": "\n\n              1. Slice the asparagus spears diagonally into 1 1/2-inch pieces. Cut the fennel in half and remove the tough inner core. Separate the layers and then cut each layer into long thin strips.\n            \n\n              2. Heat the olive oil in a large skillet over medium-high heat. Add the fennel and onion and cook until tender, about 5 minutes. Add the asparagus and garlic and cook, stirring often, until the vegetables are tender yet firm, about 8 minutes. Stir in the thyme and season with salt and pepper. Transfer to a serving dish and crumble the gorgonzola over top. Serve warm or at room temperature.\n            \n", "ingredients": [{"food": "asparagus", "quantity": 1.0}, {"food": "fennel seed", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 4.0}], "title": "\nSauteed Asparagus Fennel with Gorgonzola\n"}, {"directions": "\n\n              Heat the olive oil in a large skillet over medium heat. Add the garlic and cook, stirring, until fragrant, about 30 seconds. Add the asparagus, 1/4 teaspoon salt and some pepper and cook, stirring, until the asparagus is bright green and crisp-tender, 5 to 7 minutes. Add the olives, basil and 1/4 teaspoon salt and toss well. Serve.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "asparagus", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "olives", "quantity": 3.0}, {"food": "basil", "quantity": 2.0}], "title": "\nSauteed Asparagus with Olives and Basil\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Heat a medium saute pan coated with oil over medium heat until the oil shimmers. Add the beet greens and garlic, and toss until the greens are wilted and tender, 5 to 8 minutes. Add the red pepper flakes and lemon zest and juice, and toss. Season with salt and pepper.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1}, {"food": "beet greens", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "grape juice", "quantity": 0.5}, {"food": "salt", "quantity": 1}], "title": "\nSauteed Beet Greens\n"}, {"directions": "\n\n              Heat the olive oil, garlic, and pepper flakes in a large skillet of medium heat until fragrant and garlic begins to brown, about 30 seconds. Stir in broccoli and cook until the broccoli is bright green, about 3 minutes. Add the chicken broth and season with salt and pepper and cook until just tender, about 3 to 5 minutes. Serve.\n            \n\n              Copyright (c) 2004 Television Food Network, G.P., All Rights Reserved.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1}, {"food": "broccoli raab", "quantity": 1.0}, {"food": "diced chicken", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}], "title": "\nSauteed Broccoli\n"}, {"directions": "\n\n              Cut the broccoli into 1 1/2-inch florets and reserve the stalks. Peel the stalks and cut them into 1/4-inch-thick slices. In a large pot of salted water, cook the broccoli until crisp-tender. Drain and refresh the broccoli under cold running water.\n            \n\n              When ready to serve, heat the oil in a large skillet over medium heat. Add the garlic and saute until golden, about 3 minutes. Add the chili flakes and saute for 30 seconds more. Add the broccoli and saute over high heat, tossing until heated through, about 2 to 3 minutes. Season with salt. Serve immediately.\n            \n", "ingredients": [{"food": "broccoli raab", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "chili powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}], "title": "\nSauteed Broccoli\n"}, {"directions": "\n\n              Shred 1 pound Brussels sprouts in a food processor. Saute 4 thinly sliced shallots in 2 tablespoons butter over medium heat, 3 minutes. Season with salt and pepper. Add 2 tablespoons cider vinegar and 1 tablespoon sugar and cook, stirring, 2 minutes. Transfer to a plate and wipe out the skillet. Add 1 tablespoon butter to the skillet and increase the heat to medium high. Add the Brussels sprouts, and salt and pepper to taste; cook 5 minutes. Add 1/2 cup water and a pat of butter; cook 5 more minutes. Stir in the shallots.\n            \n\n              Serves 4 (side); Calories: 157; Total Fat: 10 grams; Saturated Fat: 6 grams; Protein: 4 grams; Total carbohydrates: 16 grams; Sugar: 6 grams; Fiber: 4 grams; Cholesterol: 25 milligrams; Sodium: 322 milligrams\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nSauteed Brussels Sprouts\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F.\n            \n\n              Heat a large skillet over medium-high heat; add the olive oil. Season the chicken with salt and pepper to taste. Lay the chicken skinned side down in the skillet and cook, turning once, until golden, about 4 minutes per side. Transfer the chicken to a baking dish or roasting pan and bake just until firm to the touch, about 10 minutes.\n            \n\n              Meanwhile, add the onion, garlic, thyme to the skillet and season with salt and pepper, to taste. Cook, stirring occasionally, until brown, about 5 minutes. Add the artichokes and peppers and cook until brown as well, about 3 minutes. Add the vermouth and stir with a wooden spoon to scrape up the browned bits from the bottom of the pan. Simmer until the vermouth is syrupy, then add the broth and bring the mixture to a full boil. Simmer until the sauce thickens, and season with salt and pepper. Whisk in the butter and add the parsley. Pour the sauce over the chicken, and serve.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 4.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "black bean mango", "quantity": 1}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "", "quantity": 1.5}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "", "quantity": 2.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 0.25}], "title": "\nSauteed Chicken Breast with Artichokes and Peppers\n"}]