[{"directions": "\n\n              Preheat a grill to medium high, then prepare for indirect grilling (for a charcoal grill, bank the coals to one side of the grill; for a gas grill, turn off half the burners). Let the steaks stand at room temperature, 30 minutes.\n            \n\n              Meanwhile, brush the grill grates with vegetable oil. Grill the tomato halves over direct heat until charred, 3 to 4 minutes per side. Let cool, then transfer to a mini food processor; pulse until slightly chunky. Add the butter, horseradish, tomato paste, paprika, garlic, 1 teaspoon salt and a few grinds of pepper. Process until smooth, scraping down the food processor occasionally. Transfer the tomato butter to a bowl and refrigerate until ready to use.\n            \n\n              Season the steaks with salt and pepper. Place on the cooler side of the grill. Cover and cook until a thermometer inserted sideways into the center registers 110 degrees F, about 8 minutes per side. Move the steaks to direct heat and cook, uncovered, until charred and the thermometer registers 125 degrees F for rare to medium rare, about 2 more minutes per side. Transfer to a cutting board or baking sheet; spread the tomato butter on the steaks and let rest 10 minutes before slicing.\n            \n\n              Photograph by Ryan Liebe\n            \n", "ingredients": [{"food": "barley flour or meal", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "plum", "quantity": 1.0}, {"food": "butter oil", "quantity": 6.0}, {"food": "horseradish", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "smoked turkey roll", "quantity": 0.5}, {"food": "garlic powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}], "title": "\nT-Bone Steak with Charred Tomato-Horseradish Butter\n"}, {"directions": "\n\n              Cook 1 cup bulgur as the label directs; cool. Mix with 1 diced peeled cucumber, 1 cup chopped parsley, 1/2 cup each chopped mint and scallions, 1/4 cup olive oil, 3 tablespoons lemon juice, 1 1/4 teaspoons salt, 1/2 teaspoon allspice and some pepper. Sprinkle with minced jalapeno and crumbled feta.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nTabbouleh\n"}, {"directions": "\n\n              Cook the bulgur as the label directs; cool. Transfer to a large bowl, then stir in the remaining ingredients; season to taste. \n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "bulgur", "quantity": 0.3333333333333333}, {"food": "chrysanthemum leaves", "quantity": 8.0}, {"food": "spearmint", "quantity": 1.0}, {"food": "", "quantity": 3.0}, {"food": "", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 0.25}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "radishes", "quantity": 4.0}, {"food": "lemon juice", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "salt", "quantity": 1}], "title": "\nTabouli Salad\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: heavy-duty aluminum foil\n\n              Preheat the oven to 375 degrees F. Put an oven rack in the lowest position with a 6-inch clearance above. Cut eight 6-inch squares of heavy-duty foil and eight 1-inch squares of heavy-duty foil. Using the larger foil squares, wrap each sugar cone, molding to the shape of the cone to cover completely and tucking in excess. Spray the outside of the foil generously with cooking spray and set aside.\n            \n\n              Add 1 teaspoon canola oil to a medium pan over medium-high heat, then add the onions. Cook, stirring often, until the onions are soft, about 4 minutes. Add the beef and garlic and cook, breaking the meat apart with a spoon, 2 minutes, then add the chili powder and 1 teaspoon salt and stir well to incorporate. Add the salsa and 1/3 cup of water and cook, breaking apart the meat and stirring, until the sauce is bubbly and the beef is browned, 4 minutes more. Remove from the heat and set aside.\n            \n\n              Brush both sides of each of the tortillas using the remaining 2 tablespoons oil. Wrap a tortilla around a sugar cone and secure the seam with a toothpick. Trim the top of the tortilla with scissors to make an even edge. Put it on a large baking sheet. Repeat with the remaining tortillas and cones.\n            \n\n              Bake for 5 minutes, then wrap the tip of each cone with the small foil squares to keep the tips from burning. Return to the oven until the cones are lightly browned and crisp and hold their shape, 5 to 7 minutes more. Remove the foil tips, and carefully remove the foil cone inserts and the toothpicks. Unwrap and reserve the sugar cones for another use. If the tortilla cones are still soft, return them, empty, to the oven, to cook until crisp, 1 to 2 minutes more. \n            \n\n              Meanwhile reheat the meat filling and set it out along with the cheese, avocado, cilantro, sour cream, jalapenos, tomatoes, salsa, hot sauce and lime wedges for a taco bar. Serve the cones hot from the oven, allowing each eater to build his or her own taco.\n            \n", "ingredients": [{"food": "ice cream cones", "quantity": 8.0}, {"food": "", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "ground turkey", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "chili powder", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 0.25}, {"food": "potato flour", "quantity": 6.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1}], "title": "\nTaco Cones\n"}, {"directions": "\n\n              Heat the oil in a large skillet over medium-high heat. Add the beef, and cook, stirring occasionally, until completely browned, 8 to 10 minutes. Pour off the excess grease, add the taco seasoning and stir until the beef is well coated. Add the tomato paste, and stir until it darkens to a dull brick red, about 30 seconds. Add 3/4 cup water, bring to a simmer and cook and until the mixture thickens, 2 to 3 minutes. Add the beans, and stir just to warm them through. Remove from the heat, and transfer to an 8-inch square baking dish.\n            \n\n              Top the beef-and-bean mixture with an even layer of sour cream, then a layer of Cheddar. Sprinkle the tomatoes, lettuce and black olives and jalapeno if using on top. Serve with tortilla chips.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "frankfurter beef", "quantity": 1.5}, {"food": "seasoning mix", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 2.0}, {"food": "fava beans", "quantity": 14.0}, {"food": "sour cream", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "lettuce", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "potato chips", "quantity": 1}], "title": "\nTaco Dip\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Position an oven rack in the middle of the oven and preheat the oven to 350 degrees F.\n            \n\n              Heat the oil in a large skillet over medium-high heat until shimmering but not smoking. Add the ground beef and sprinkle with the chili powder and 1 teaspoon salt. Cook, breaking apart chunks of meat with the back of a spoon, and stirring often, until meat is crumbled and browned, 5 to 6 minutes. Stir in the salsa and 1 cup of water, bring to a simmer and cook until slightly reduced, about 4 minutes. Remove from the heat and set aside. \n            \n\n              Spread a quarter of the meat sauce over the bottom of a 9- by 13-inch baking dish. Lay a third of the noodles over the sauce, overlapping slightly and breaking them to fit, if needed. Leave a 1/2-inch space around the edges of the baking dish. Top the noodles with another quarter of the meat sauce and a third of the mozzarella. Make another layer with a third of the noodles, a quarter of the meat sauce and a third of the mozzarella. Repeat, making a final layer with the remaining third of the pasta and quarter of the sauce, making sure that the top layer of noodles is completely covered in sauce. Top with the remaining third of the mozzarella.\n            \n\n              Cover loosely with foil and bake until the cheese is melted and bubbling and the noodles are tender when pierced with a knife, about 1 hour. Remove the foil and cook 15 minutes more. Let rest 10 minutes. Dollop with sour cream and sprinkle with lettuce, tomato, Cheddar and chips.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "frankfurter beef", "quantity": 1.0}, {"food": "chili powder", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 16.0}, {"food": "lasagna", "quantity": 1.0}, {"food": "", "quantity": 16.5}, {"food": "sour cream", "quantity": 0.5}, {"food": "lettuce", "quantity": 0.5}, {"food": "diced chicken", "quantity": 1.0}, {"food": "meat drippings ", "quantity": 0.5}, {"food": "tortilla", "quantity": 0.5}], "title": "\nTaco Lasagna\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Heat the vegetable oil in a large skillet over medium-high heat. Add the tortillas and cook, flipping a few times, until golden, about 3 minutes. Remove with tongs and transfer to a paper towel-lined plate to drain. Add the onion to the skillet and cook, stirring, until soft, about 3 minutes. Add the garlic and cayenne and cook 30 seconds. Add the pork and 1/4 teaspoon salt and cook, breaking up the meat, until browned, about 4 minutes. Stir in the tomatoes, chiles and corn. Bring to a simmer and cook until slightly thickened, about 3 minutes. Season with salt. Remove from the heat and stir in the cilantro. Arrange half of the tortillas in the bottom of a 9-to-10-inch pie plate. Top with half of the meat mixture, then half of the cheese. Repeat with the remaining tortillas, meat and cheese. Cover loosely with foil and bake until the cheese melts, about 10 minutes.  \n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "corn bran", "quantity": 8.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "pork skins", "quantity": 0.75}, {"food": "salt", "quantity": 1}, {"food": "tomatoes", "quantity": 1.0}, {"food": "", "quantity": 2.0}, {"food": "corn bran", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "reduced fat milk", "quantity": 1.0}], "title": "\nTaco Pie\n"}, {"directions": "\n\n              Place a pizza stone or upside-down baking sheet on the bottom rack of the oven and preheat to 450 degrees F. Roll out the pizza dough on a lightly floured work surface into an 11-inch round. Transfer to a parchment-covered pizza peel or another upside-down baking sheet. Brush the dough with olive oil, then spread the refried beans on top, leaving a 1/2-inch border. Spoon the salsa over the beans and sprinkle with the cheese. Scatter the scallions and jalapenos on top. Slide the pizza and parchment onto the hot stone and bake until the crust is crisp, 8 to 10 minutes. Let cool a few minutes. \n            \n\n              While the pizza is baking, combine the sour cream, half of the lime juice and 1 tablespoon water in a small bowl. In another bowl, toss the lettuce, tomato, and lime juice to taste; season with salt.\n            \n\n              Top the pizza with the salad, then drizzle with the sour cream mixture and sprinkle with the cilantro. Cut into slices. \n            \n\n              Per serving (based on 4 servings; not including optional toppings): Calories 564; Total Fat 24 grams; Saturated Fat 12 grams; Protein 23 grams; Total Carbohydrate 66 grams; Sugar: 9 grams; Fiber 4 grams; Cholesterol 51 milligrams; Sodium 1579 milligrams \n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [{"food": "pizza rolls", "quantity": 1.0}, {"food": "potato flour", "quantity": 1}, {"food": "vegetable oil", "quantity": 1}, {"food": "refried beans", "quantity": 0.75}, {"food": "", "quantity": 0.5}, {"food": "cheddar cheese", "quantity": 1.5}, {"food": "", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.25}, {"food": "sour cream", "quantity": 0.25}, {"food": "", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1}, {"food": "pasta with tomato sauce", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 0.25}], "title": "\nTaco Pizza\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Position an oven rack in the top third of the oven and preheat to 425 degrees F. Set a wire rack over a baking sheet and spray generously with cooking spray.\n            \n\n              Use your hands to mix the ground beef, taco seasoning and 1/2 teaspoon salt in a medium bowl until just combined. Drop heaping tablespoons of the meat mixture onto the rack (about 16 total), then use your hands to roll the portioned meat into balls. Press a tortilla chip into the top of each meatball, making sure that the meat goes mostly up the sides of the chip (be careful not to break the chips). Put 1 cheese cube in the middle of each chip.\n            \n\n              Bake, rotating the baking sheet once halfway, until the meat is just cooked through and the cheese is melted, about 8 minutes. Transfer the bites to a large platter, top with a dollop of sour cream and sprinkle with the lettuce and tomato. Serve with hot sauce.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "frankfurter beef", "quantity": 1.0}, {"food": "seasoning mix", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "corn bran", "quantity": 16.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "sour cream", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1}], "title": "\nTaco Salad Bites\n"}, {"directions": "\n\n              Heat the oil in a large Dutch oven or heavy-bottomed pot over medium-high heat. Add the scallion whites and cook, stirring occasionally, until fragrant and soft, about 2 minutes. Add the beef and cook, stirring to break it up into small crumbles, until cooked through, 8 to 10 minutes. Stir in the taco and ranch seasonings until well combined.\n            \n\n              Add the tomatoes, beans, corn and 1 teaspoon salt. Fill one of the bean cans with water and add it to the pot. Bring to a boil, then reduce the heat to medium and simmer, stirring occasionally, until the beans are warmed through, about 10 minutes. \n            \n\n              Serve in bowls with scallion greens, Cheddar, sour cream and pico de gallo. \n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "martha white foods", "quantity": 1.0}, {"food": "frankfurter beef", "quantity": 1.0}, {"food": "seasoning mix", "quantity": 1.0}, {"food": "dressing", "quantity": 1.0}, {"food": "diced chicken", "quantity": 10.0}, {"food": "fava beans", "quantity": 15.0}, {"food": "sunflower seed kernels", "quantity": 10.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "ice cream swich", "quantity": 1}, {"food": "dulce de leche", "quantity": 1}], "title": "\nTaco Soup\n"}, {"directions": "\n\n              Heat 2 tablespoons vegetable oil in a large nonstick skillet over medium-high heat. Working in batches, fry the tortilla strips, flipping, until golden, about 2 minutes. Transfer to a paper towel-lined plate using a slotted spoon. Sprinkle with 1/2 teaspoon taco seasoning.\n            \n\n              Add the remaining 1 tablespoon vegetable oil to the skillet. Add the red onion and cook, stirring occasionally, until just tender, about 3 minutes. Add the beef, garlic and the remaining 2 teaspoons taco seasoning. Cook, breaking up the beef with a spatula, until no longer pink, about 3 minutes. Add the tomatoes and pickled jalapenos with carrots and onions; cook until the tomatoes are slightly softened, about 3 minutes. Remove from the heat and stir in the cilantro.\n            \n\n              Mix the sour cream with the jalapeno brine in a small bowl. Divide the lettuce among bowls; top with the beef mixture, cheese, sour cream and tortilla strips.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "corn bran", "quantity": 4.0}, {"food": "seasoning mix", "quantity": 2.5}, {"food": "onion powder", "quantity": 0.5}, {"food": "frankfurter beef", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "silk black cherry soy yogurt", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 0.5}, {"food": "", "quantity": 0.25}, {"food": "sour cream", "quantity": 3.0}, {"food": "lettuce", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 0.75}], "title": "\nTaco Tuesday Salad\n"}, {"directions": "\n\n              Put the oil, onions, garlic, and spices in a medium skillet, season with salt and cook over medium to medium-low heat, stirring occasionally until tender, about 10 minutes. Increase the heat to medium-high, add the tomatoes, and their juices and boil to thicken, about 2 minutes. Stir in the beef and chicken broth, adjust the heat so the mixture simmers and cook until the beef is cooked through and the mixture thickens, about 15 minutes. Stir in cilantro, taste, and season with salt and pepper as desired. Transfer to a serving bowl and cover. \n            \n\n              To make the taco shells: Pour enough frying oil into a small skillet so its about 3/4 of an inch deep; heat over medium to medium-high. Holding 1 edge of a tortilla with tongs, lay the other half in the oil, keeping it flat with a spatula. Cook until crisp, 30 second to 1 minute. Flip the tortilla over and repeat with the other half, holding the first side of the tortilla at an angle to make an open shell, cook for about 1 minute more. Transfer to a paper towel-lined plate to drain. \n            \n\n              Put the fixings and meat in individual bowls and the taco shells on a platter. Serve encouraging your diners to build their own tacos, with meat in the shell with fixings on top.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "hot pockets ham cheese stuffed swich", "quantity": 1.0}, {"food": "chili powder", "quantity": 1.5}, {"food": "cumin seed", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "hearts of palm", "quantity": 4.25}, {"food": "frankfurter beef", "quantity": 0.75}, {"food": "diced chicken", "quantity": 0.3333333333333333}, {"food": "chrysanthemum leaves", "quantity": 0.25}, {"food": "shortening frying ", "quantity": 1}, {"food": "taco shells", "quantity": 5.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.25}, {"food": "diced chicken", "quantity": 3.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "cheddar cheese", "quantity": 1.5}, {"food": "ice cream swich", "quantity": 1}], "title": "\nTacos Picadillo (or if spelled Pecadillo it means \"little sin\")\n"}, {"directions": "\n\n              Whisk the flour, salt and baking soda in a medium bowl. Combine the tahini, brown sugar, vanilla and melted butter in a large bowl and mix with a wooden spoon until smooth. Stir in the eggs until incorporated, then stir in the flour mixture until just combined. Stir in the chocolate chunks. Cover and refrigerate until firm, about 1 hour.\n            \n\n              Position racks in the upper and lower thirds of the oven; preheat to 375 degrees F. Roll heaping tablespoonfuls of dough into balls and arrange about 3 inches apart on 2 ungreased baking sheets. Flatten slightly with your fingers. Bake, switching the pans halfway through, until the cookies are set and lightly browned around the edges, 14 to 16 minutes. Let cool 1 minute on the baking sheets, then transfer to racks to cool completely.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.5}, {"food": "salt", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "", "quantity": 1.0}, {"food": "sugar", "quantity": 1.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "eggs", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.5}], "title": "\nTahini Chocolate Chunk Cookies\n"}, {"directions": "\n\n              Fold 1 slice roast beef inside each of 2 soft tortillas and sprinkle with cheese. Pack in the biggest compartment of the lunch box. Pack other compartments with guacamole, salsa, sour cream and other favorite toppings. Seal and send off to school.\n            \n\nSpeedy Salsa:\n\n\n              Grate tomatoes on the largest holes of a box grater into a bowl all the way down to the skins. Discard the skins. Grate the onion into the tomato. Stir in olive oil. Season with salt, to taste. Serve with cilantro leaves on the side, or stirred in, if desired.\n            \n\nQuickie Guacamole:\n\n\n              Scoop the flesh from the shell with a spoon into a medium bowl. Squeeze the lime juice over the avocado and stir to coat evenly. Add the salt. Use a fork to stir and mash into a chunky guacamole. Stir in tomatoes or fruit, if desired.\n            \n", "ingredients": [{"food": "roast beef", "quantity": 4.0}, {"food": "potato flour", "quantity": 4.0}, {"food": "macaroni cheese", "quantity": 0.3333333333333333}, {"food": "barley flour or meal", "quantity": 0.25}, {"food": "barley flour or meal", "quantity": 0.25}, {"food": "silk plain soy yogurt", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 1}, {"food": "school lunch", "quantity": 1}, {"food": "tomatoes", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 0.25}, {"food": "avocado", "quantity": 1.0}, {"food": "lime", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "diced chicken", "quantity": 0.25}], "title": "\nTake-to-School Taco Bar\n"}, {"directions": "\n\n              Make the filling: Roast the poblanos directly over the flame of a gas burner or under the broiler, turning with tongs, until charred all over, about 10 minutes. Transfer to a bowl, cover with a plate and set aside until cool enough to handle, about 10 minutes. Scrape off the charred skin with a paring knife, then chop, discarding the stems and seeds; set aside.\n            \n\n              Heat 2 tablespoons vegetable oil in a large pot over medium-high heat. Add the ground pork, chorizo and 3/4 teaspoon kosher salt and cook, stirring and breaking up the meat with a wooden spoon, until browned, about 8 minutes; transfer to a bowl.\n            \n\n              Heat the remaining 1 tablespoon vegetable oil in the pot over medium-high heat. Add the onion, garlic and 1/2 teaspoon kosher salt and cook, stirring occasionally, until softened, about 5 minutes. Add the chili powder, chipotle powder, cinnamon and cloves and cook, stirring, until the spices are toasted, 1 minute. Return the meat to the pot and add the tomatoes, corn, Worcestershire sauce and the roasted poblanos. Bring to a boil, then reduce the heat to medium low and simmer 10 minutes; season with kosher salt and stir in the cilantro. Pour the mixture into a 3-quart baking dish.\n            \n\n              Preheat the oven to 375 degrees F. Make the topping: Whisk the cornmeal, flour, sugar, baking powder, baking soda and 1/2 teaspoon kosher salt in a bowl. Whisk the melted butter, buttermilk and eggs in another bowl. Stir the dry ingredients into the wet ingredients until incorporated; stir in the cheese.\n            \n\n              Dollop the cornbread mixture over the filling and smooth into an even layer with the back of a spoon. Bake until the filling is bubbling and the topping is golden brown, about 30 minutes. Let stand 10 minutes before serving.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "peppers", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "pork skins", "quantity": 1.5}, {"food": "chorizo", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "chili powder", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.5}, {"food": "cinnamon", "quantity": 0.5}, {"food": "cloves", "quantity": 0.25}, {"food": "diced chicken", "quantity": 2.0}, {"food": "sunflower seed kernels", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "", "quantity": 0.75}, {"food": "yellow rice", "quantity": 1.25}, {"food": "potato flour", "quantity": 0.75}, {"food": "sugar", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 6.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "cheddar cheese", "quantity": 1.5}], "title": "\nTamale Pie\n"}, {"directions": "\nSpecial equipment: 9-by-13-inch baking dish\n\n              Preheat the broiler. Halve the poblanos lengthwise and remove the stems and seeds. Place cut-side down on a baking sheet and broil until browned in spots, about 5 minutes. Transfer to a bowl, cover with plastic wrap and set aside 5 minutes. Peel off the skin, then roughly chop.\n            \n\n              Preheat the oven to 375 degrees F. Combine the lard, baking powder and 1 teaspoon salt in a large bowl and mix with a wooden spoon until combined. Whisk the masa harina, 2 cups hot water and the broth in a separate bowl; add to the lard mixture and mix until smooth.\n            \n\n              Heat the vegetable oil in a large skillet over medium-high heat. Add the scallions, garlic, chipotles, cumin and orange zest and cook, stirring, until the scallions are soft, about 2 minutes. Add the plantains, roasted poblanos and capers and season with salt.\n            \n\n              Gently stir the scallion mixture into the masa mixture. Line a 9-by-13-inch baking dish with the banana leaves, crossing one over the other, and add the filling. Fold the banana leaves over the filling, tucking them in to seal. Cover with aluminum foil and bake until the filling is set, about 1 hour, 15 minutes, uncovering halfway through.\n            \n\n              Photograph by Kana Okada\n            \n", "ingredients": [{"food": "peppers", "quantity": 3.0}, {"food": "lard", "quantity": 1.3333333333333333}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "corn flour", "quantity": 3.5}, {"food": "diced chicken", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "cumin seed", "quantity": 1.0}, {"food": "orange", "quantity": 0.5}, {"food": "plantains", "quantity": 2.0}, {"food": "capers", "quantity": 3.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}], "title": "\nTamale Stuffing\n"}, {"directions": "\n\n              Prepare the pork: Cut small slits all over the meat with a knife and put skin-side down in a roasting pan. Mix the lime juice and orange juice in a measuring cup. Transfer 1/4 cup juice mixture to a food processor; add the garlic, oregano, 1/2 teaspoon salt and 1/4 teaspoon pepper and pulse to make a paste. Rub over the pork and into the slits. Pour the remaining 3/4 cup juice over the pork; press the bay leaves on top. Cover and refrigerate 3 to 6 hours.\n            \n\n              Preheat the oven to 350 degrees F. Turn the pork skin-side up and roast until a thermometer inserted into the middle registers 160 degrees F, about 2 hours, 30 minutes. Cool completely before slicing. (Refrigerate leftover pork in an airtight container up to 1 week.)\n            \n\n              Make the sandwich: Cut the bread in half lengthwise. Layer the ham, 3 thin slices roast pork, the salami, cheese and pickles on the bottom half. Spread the mustard on the inside of the top half. Heat a nonstick skillet over medium heat. Butter the outside of the sandwich, then add to the pan and put a heavy skillet on top to weigh it down; cook until golden, 3 to 4 minutes per side (or cook in a sandwich press). Cut in half on the diagonal.\n            \n\n              In any Cuban sandwich, mojo-marinated pork is key. Look for bottled marinade in Latin markets, or try this recipe from Tampa's legendary Columbia Restaurant.\n            \n\n              Photograph by Steve Giralt\n            \n", "ingredients": [{"food": "pork skins", "quantity": 5.0}, {"food": "lime juice", "quantity": 0.5}, {"food": "orange juice", "quantity": 0.5}, {"food": "garlic powder", "quantity": 8.0}, {"food": "", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 4.0}, {"food": "garlic bread", "quantity": 1.0}, {"food": "ham", "quantity": 4.0}, {"food": "salami", "quantity": 3.0}, {"food": "macaroni cheese", "quantity": 2.0}, {"food": "luncheon slices", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "butter oil", "quantity": 1}], "title": "\nTampa Cuban Sandwich\n"}, {"directions": "\n\n              Sandwich the chicken breasts between two pieces of plastic wrap and pound them out until just under 1/2-inch thick all over. Whisk together 1 cup of the yogurt, 1 tablespoon of the lemon juice, 2 teaspoons of the curry powder, 1 teaspoon of the grated ginger, 1/2 teaspoon of the grated garlic and 2 teaspoons salt in a medium bowl. Transfer half of the yogurt marinade to another medium bowl. Cut 5 diagonal shallow slits on both sides of each chicken breast and place them in one of the bowls. Place the cauliflower florets in the other bowl. Toss both to coat, and then marinate at room temperature for 15 minutes.\n            \n\n              Melt the butter in a large saucepan set over medium heat. Add the rice, the remaining 1 teaspoon curry powder, 1 teaspoon ginger and 1 teaspoon garlic, and stir until fragrant and the rice is yellow, about 1 minute. Add the tomato paste and stir for about 30 seconds. Add 2 3/4 cups water, the lemon zest strips and 1 tablespoon salt. Bring to a boil, and then reduce the heat to low. Give the rice a quick stir to scrape up any bits stuck on the bottom. Cover and cook until the rice is tender and absorbs the liquid, 20 minutes. Remove from the heat, then fluff the rice with a fork and cover again for 5 minutes. Then remove and discard the lemon zest.\n            \n\n              Mix together 1 tablespoon of the cilantro, the cucumber, the remaining 1 cup yogurt, 1 tablespoon lemon juice and 1 teaspoon salt in a medium bowl.\n            \n\n              Preheat a broiler with a rack set 4 inches from the heating element. Line two small baking sheets or skillets with foil. Place the chicken on one baking sheet and the cauliflower on the other. Broil until the chicken is charred in spots, firm and has no visible pinkness inside, and the cauliflower is charred and tender, 10 to 12 minutes, flipping the chicken and tossing the cauliflower halfway through. Slice the chicken breasts and sprinkle lightly with salt.\n            \n\n              Divide the rice among four bowls. Top each with some chicken, cauliflower, cucumber-yogurt sauce, lemon wedges and the remaining chopped cilantro.\n            \n", "ingredients": [{"food": "", "quantity": 2.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "", "quantity": 1}, {"food": "diced chicken", "quantity": 2.0}, {"food": "silk plain soy yogurt", "quantity": 2.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "curry powder", "quantity": 3.0}, {"food": "ginger", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "cauliflower", "quantity": 4.0}, {"food": "butter oil", "quantity": 3.0}, {"food": "crisped rice bar", "quantity": 2.0}, {"food": "pasta with tomato sauce", "quantity": 0.25}, {"food": "lemon juice", "quantity": 4.0}], "title": "\nTandoori Chicken and Cauliflower Rice Bowl\n"}, {"directions": "\n\n              Cook's Note: If tamarind chutney is unavailable, you can substitute apple butter with a bit of lemon juice and cayenne stirred in.\n            \n\n              1. Melt the butter in a small skillet over medium heat and cook the onions, stirring occasionally, until soft, about 5 minutes. Add 1/4 teaspoon salt, the curry powder and two-thirds of the garlic and continue cooking, stirring, until fragrant, about 30 seconds. Transfer the mixture to a large bowl and let cool.\n            \n\n              2. Lightly oil a rimmed baking sheet. Add the beef, 1/4 cup of the yogurt, the breadcrumbs, tamarind chutney, paprika, cayenne , if using, 1 1/4 teaspoons salt and the eggs to the onion mixture. Combine the ingredients using your hands. Form into 1 1/4- inch balls, rolling them lightly between your hands to shape. Place on the oiled baking sheet, cover loosely with plastic wrap and refrigerate at least 30 minutes or overnight.\n            \n\n              3. Preheat the oven to 425 degrees F. Bake the meatballs until browned, about 20 minutes.\n            \n\n              4. Meanwhile, stir together the remaining 3/4 cup yogurt, remaining garlic, 1/2 teaspoon salt and cilantro in a small bowl. Arrange each meatball on top of a piece of lettuce on a platter. Top with grated cucumber and a bit of tamarind chutney and serve with the yogurt dipping sauce.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "curry powder", "quantity": 1.5}, {"food": "garlic powder", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "frankfurter beef", "quantity": 1.0}, {"food": "silk banana-strawberry soy yogurt", "quantity": 1.0}, {"food": "", "quantity": 2.0}, {"food": "tamarind nectar", "quantity": 2.0}, {"food": "paprika", "quantity": 1.0}, {"food": "", "quantity": 0.125}, {"food": "eggs", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "corier leaf", "quantity": 4.0}, {"food": "cucumber", "quantity": 0.25}], "title": "\nTandoori Meatballs with Cilantro Raita\n"}, {"directions": "\n\n              Mix 1/4 cup yogurt, 1 tablespoon olive oil and the tandoori paste in a large resealable plastic bag. Add the turkey and shake to coat. Set aside to marinate, 20 minutes.\n            \n\n              Meanwhile, pulse the ginger and garlic in a mini food processor to make a paste. Heat a large saucepan over medium heat. Add 1 tablespoon olive oil, then the ginger paste. Cook until the paste sizzles, 1 minute. Add the tomato paste and garam masala and stir until sizzling, 1 minute. Stir in the lentils. Add 1 cup water and season with 1/2 teaspoon salt. Bring to a simmer and cook until thickened, about 7 minutes. Stir in the kale and 3/4 cup cilantro; cook until the kale wilts, about 2 minutes. Keep warm over low heat.\n            \n\n              Heat a large skillet over medium-high heat. Add the remaining 1 tablespoon olive oil. Remove the turkey from the marinade, letting the excess drip off, and add to the skillet. Cook, turning once, until just cooked through, 4 to 5 minutes. Serve over the lentils and top with the remaining 1/4 cup each yogurt and cilantro.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "silk banana-strawberry soy yogurt", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "almond paste", "quantity": 2.0}, {"food": "smoked turkey roll", "quantity": 4.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "pasta with tomato sauce", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "lentils", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "kale", "quantity": 1.0}, {"food": "", "quantity": 1.0}], "title": "\nTandoori Turkey Cutlets with Lentils\n"}, {"directions": "\n\n              Pierce the steak with a fork several times on each side. Remove a 2-inch strip of zest from the tangerine, halve the fruit and squeeze the juice into a resealable plastic bag. Add the zest, scallions, soy sauce, sesame oil, sugar, ginger, garlic, pepper flakes and 1/4 cup water to the bag and mix well. Add the meat, seal the bag and turn to coat. Refrigerate overnight.\n            \n\n              Preheat the broiler with a broiler pan in place. Remove the steak from the bag and reserve the marinade. Pat the meat dry and place on the preheated broiler pan. Cook, without turning, until the meat is golden brown and a thermometer inserted in the thickest part registers 130 for medium-rare, about 10 minutes. Let rest 5 to 10 minutes before slicing; reserve the drippings.\n            \n\n              Meanwhile, boil the marinade in a small pot over medium-high heat until slightly thickened. Stir in the orange preserves and the drippings from the meat. Slice the meat against the grain and top with scallions. Serve with the sauce.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "low fat big franks", "quantity": 1.5}, {"food": "tangerine", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "soy sauce", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "sugar", "quantity": 2.0}, {"food": "ginger", "quantity": 2.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "orange", "quantity": 2.0}], "title": "\nTangerine Beef with Scallions\n"}, {"directions": "\n\n              In a serving pitcher, combine juice and bitters. Top with tonic water and serve over ice. Garnish with tangerine slices, if desired.\n            \n", "ingredients": [{"food": "tangerine juice", "quantity": 3.0}, {"food": "orange", "quantity": 1.5}, {"food": "coconut water", "quantity": 2.0}, {"food": "luncheon slices", "quantity": 1}], "title": "\nTangerine Tonic\n"}, {"directions": "\n\n              Combine the chopped celery, sugar and 2/3 cup water in a small saucepan. Bring to a simmer over medium heat and cook, stirring, until the sugar dissolves, 1 to 2 minutes. Let cool, about 30 minutes.\n            \n\n              Strain the celery syrup into a pitcher and add the gin, lemon juice and tangerine juice. Pour into ice-filled glasses and top with seltzer. Garnish each with a lemon slice and some celery leaves.\n            \n\n              Photograph by Ryan Liebe\n            \n", "ingredients": [{"food": "celery seed", "quantity": 2.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.5}, {"food": "tangerine juice", "quantity": 1.0}, {"food": "", "quantity": 1}], "title": "\nTangerine-Celery Collins\n"}, {"directions": "\n\n              Simmer 2 pounds carrots (cut into chunks) in a skillet with 1/4 cup cider vinegar, the juice of 6 tangerines and 2 teaspoons salt until the carrots are tender, 8 to 10 minutes. Season with pepper and stir in 2 tablespoons butter. Top with sliced scallions.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nTangerine-Glazed Carrots\n"}, {"directions": "\n\n              Position racks in the upper and lower thirds of the oven; preheat to 350 degrees F. Line 2 baking sheets with parchment paper. Whisk the flour, baking powder and salt in a medium bowl. Beat the granulated sugar and eggs in a large bowl with a mixer on high speed until pale and very thick, about 5 minutes. Add the ricotta, olive oil, 1 teaspoon tangerine zest and the vanilla and almond extracts; beat until combined. Reduce the mixer speed to low; beat in the flour mixture until just combined. The dough will be loose - similar to a thick cake batter.\n            \n\n              Drop tablespoonfuls of dough onto the prepared baking sheets, about 1 1/2 inches apart. Bake, switching the pans halfway through, until the cookies spring back when gently pressed, about 12 minutes. Let cool completely on the baking sheets.\n            \n\n              Make the glaze: Whisk the confectioners' sugar, the remaining 1/2 teaspoon tangerine zest and 2 tablespoons hot water until smooth, adding up to 1 more tablespoon hot water if needed. Spoon about 1/2 teaspoon of the glaze over each cookie and spread with the back of the spoon. Decorate with nonpareils. Let set, 30 minutes.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.75}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "salt", "quantity": 0.25}, {"food": "sugar", "quantity": 1.5}, {"food": "eggs", "quantity": 3.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "tangerine", "quantity": 1.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.25}, {"food": "sugar", "quantity": 1.6666666666666665}, {"food": "", "quantity": 1}], "title": "\nTangerine-Ricotta Drop Cookies\n"}, {"directions": "\n\n              Simmer 1 cup ketchup, 1/2 cup cider vinegar, 3 tablespoons each molasses and brown sugar, 1 tablespoon each dried mustard and soy sauce, 2 teaspoons Worcestershire sauce, 1 cup water, and kosher salt and pepper to taste until thickened, about 30 minutes. Preheat a grill to medium-high on one side. Season 4 bone-in, skin-on chicken breast halves with salt and pepper. Grill over direct heat until golden and crisp on both sides, about 5 minutes. Transfer to a bowl and toss with 1 cup of the sauce. Place on the cooler side of the grill; cover and cook, basting once, until the meat is glazed and reaches 165, 25 to 30 minutes.\n            \n\n              Photograph by Tina Rupp\n            \n", "ingredients": [], "title": "\nTangy Barbecue Chicken\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F.\n            \n\n              Trim the beet stems. Put the beets on a large piece of aluminum foil, drizzle with olive oil, and seal the foil to make a tight package. Transfer to small roasting pan. Roast the beets until they can be easily pierced with a knife, about 1 hour. When cool enough to handle, rub or peel off skins.\n            \n\n              Meanwhile, halve and very thinly slice the fennel (we love a mandolin for this). Soak in cold water to crisp. Segment the grapefruits over another bowl, reserving the juice. Cut the segments in half.\n            \n\n              Whisk 2 tablespoons of the reserved grapefruit juice with the mustard, vinegar, honey, and 1/2 teaspoon salt in a medium bowl. Gradually add the oil in a steady stream to make a creamy dressing. Season with pepper to taste.\n            \n\n              Thinly slice the beets with a knife or on a mandolin and toss in a bowl with 3 tablespoons dressing. Season with salt and pepper to taste and arrange on individual plates. Drain the fennel, dry well. Just before serving, toss the fennel, lettuce, grapefruit, and tarragon with dressing. Divide evenly and set on beets. Serve immediately.\n            \n", "ingredients": [{"food": "beets", "quantity": 1.25}, {"food": "fennel seed", "quantity": 1.0}, {"food": "", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "honey smoked ham", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "black bean mango", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 3.0}, {"food": "tender bits", "quantity": 6.0}], "title": "\nTangy Beet and Fennel Salad\n"}, {"directions": "\n\n              Make Classic Mash or Chunky Red Mash. Use 1 cup sour cream instead of milk; top with fresh dill.\n            \n\n              Classic Mash\n            \n\n              Cover 2 pounds whole russet or Yukon gold potatoes with cold salted water; simmer 45 minutes. Drain, peel and mash with 1/2 to 1 stick butter. Add 1 cup hot milk, and salt and pepper; mash until smooth and fluffy.\n            \n\n              Chunky Red Mash\n            \n\n              Cover 2 pounds whole red potatoes with cold salted water; simmer 40 minutes. Drain; do not peel. Smash with 1/2 to 1 stick butter, 3/4 cup hot milk, and salt and pepper.\n            \n\n              See all 50 easy mashed potato recipes\n            \n\n              Photograph by Kana Okada\n            \n", "ingredients": [], "title": "\nTangy Mashed Potatoes\n"}, {"directions": "\n\n              Preheat a grill to medium high. Soak the onion rings in a bowl of cold water. Meanwhile, combine the meatloaf mix with the diced onion, parsley, breadcrumbs, egg, paprika, 1 tablespoon each ketchup and duck sauce, 1 teaspoon salt and 1/2 teaspoon pepper. Gently form into four 1-inch-thick patties; make an indentation in the center of each.\n            \n\n              Brush the patties with the olive oil and grill until marked on the bottom, about 6 minutes. Meanwhile, mix the remaining ketchup and duck sauce in a small bowl for brushing; set aside a few tablespoons. Turn the patties, brush with the ketchup mixture and continue grilling until cooked through, about 5 more minutes. Toast the buns, if desired.\n            \n\n              Spread the buns with the reserved ketchup mixture. Drain the onion rings. Serve the patties on the buns; top with the onion, lettuce, tomato and pickles. Serve with sweet potato chips, if desired.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "", "quantity": 1.5}, {"food": "ground turkey", "quantity": 1.0}, {"food": "parsley", "quantity": 0.25}, {"food": "", "quantity": 0.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 1.0}, {"food": "", "quantity": 0.3333333333333333}, {"food": "Worcestershire sauce", "quantity": 0.3333333333333333}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "potato flour", "quantity": 4.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1}, {"food": "potato chips", "quantity": 1}], "title": "\nTangy Meatloaf Burgers\n"}, {"directions": "\n\n              Mix 2 teaspoons lemon zest, 1/4 cup molasses and 1/8 teaspoon cayenne with 1 cup steak sauce.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [], "title": "\nTangy Steak Sauce\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F.\n            \n\n              Heat a medium-large skillet over high heat. Add the olive oil. Season the chicken all over with salt and pepper, and lay the pieces in the pan rounded-side down first (the side that had the skin). Cook the chicken, turning only once, until golden brown on both sides, about 5 minutes. Transfer chicken to an oven-proof dish, reserving the skillet. Place the chicken to the oven and bake until an instant-read thermometer inserted into the thickest part of the chicken registers 170 to 75 degrees F, about 15 minutes.\n            \n\n              Meanwhile, pour the vermouth into the reserved skillet, scraping up any browned bits that cling to the pan with a wooden spoon, and cook over medium heat until the liquid reduces by about half. Add the chicken broth and continue to cook until slightly thickened.\n            \n\n              In a small bowl whisk a teaspoon or so of cold water with the cornstarch, then whisk the mixture into the broth and bring to a full boil. Remove from heat and add the zest, lemon juice, and tarragon. Season with salt and pepper, to taste.\n            \n\n              Remove the chicken from the oven. Pour any pan drippings from the chicken into the sauce and stir to combine. Divide the chicken pieces between 4 plates. Pour the sauce over the chicken and serve.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "black bean mango", "quantity": 1}, {"food": "martha white foods", "quantity": 2.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "coconut water", "quantity": 1.0}, {"food": "cornstarch", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 3.0}], "title": "\nTarragon Chicken with Lemon\n"}, {"directions": "\n\n              Make the vanilla sugar: Grind the sugar and vanilla seeds in a blender until powdery (like confectioners' sugar). Store in an airtight container for up to 1 month.\n            \n\n              Make the drink: Fill a tall glass with ice to chill it. Muddle the strawberries, 2 teaspoons vanilla sugar and 3 tarragon sprigs in a cocktail shaker. Add the bourbon and Pernod. Add ice, then cover and shake well. Dump the ice out of the glass. Refill with crushed ice, then strain the drink into the glass. Crush the remaining tarragon sprig with the flat side of a knife; add to the drink.\n            \n\n              Photograph courtesy Charles Masters\n            \n", "ingredients": [{"food": "sugar", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "strawberries", "quantity": 3.0}, {"food": "", "quantity": 4.0}, {"food": "", "quantity": 3.0}, {"food": "", "quantity": 0.25}], "title": "\nTarragon Julep\n"}, {"directions": "\n\n              In a small mixing bowl, stir together the mayonnaise, cornichons, parsley, tarragon, capers, scallion, lemon zest and juice. Add the hot sauce, if using. Refrigerate for 30 minutes for the flavors to come together. Serve.\n            \n", "ingredients": [{"food": "mayonnaise dressing", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "", "quantity": 0.25}, {"food": "capers", "quantity": 1.5}, {"food": "martha white foods", "quantity": 1.0}, {"food": "lemon juice", "quantity": 0.25}, {"food": "lemon juice", "quantity": 0.5}, {"food": "Worcestershire sauce", "quantity": 2.0}], "title": "\nTartar Sauce\n"}, {"directions": "\n\n              Line 2 baking sheets with parchment. Coarsely grate 2 sticks (1 cup) of the butter on the large holes of a box grater onto one of the prepared baking sheets. Toss the butter with a sprinkle of flour and arrange the butter in an even layer on the prepared sheet. Freeze until rock solid, about 30 minutes.\n            \n\n              Whisk together the flour and 1/2 teaspoon salt in a large bowl. Fold in the frozen butter pieces. Slowly drizzle in 1/2 cup ice water, whisking with a fork until small pieces form and the dough just starts to come together, being careful not to overwork it. Turn the dough out onto a floured surface and roll out into a 12-by-1/4-inch-thick circle. Transfer to the other prepared baking sheet and refrigerate until ready to use.\n            \n\n              Preheat the oven to 375 degrees F.\n            \n\n              Meanwhile, peel, core and halve the apples. Cut all but one of the apple halves in half again. Put the lemon juice in a large bowl and toss the apple pieces with the lemon juice; set aside. Cut the remaining 1 stick (8 tablespoons) butter into small cubes; set aside.\n            \n\n              Sprinkle the sugar over the bottom of a large ovenproof skillet and cook over medium heat, stirring frequently, until melted and amber brown, about 6 minutes. Remove the skillet from the heat and whisk in the cubed butter until melted and smooth (the sugar will start to bubble as the butter cools it down).\n            \n\n              Place the apple half in the center of the skillet rounded-side down. Arrange the remaining apple quarters rounded-side down in a tight circle around the center apple, making sure there is as little space between the apples as possible (any space left between apples will cause the tart to collapse when flipped out of the skillet).\n            \n\n              Place the pastry round on top and carefully tuck the edges down around the apples. Poke the pastry all over with a fork. Bake until the apples are cooked through and the pastry is golden brown, about 1 hour. Let cool for 5 minutes in the skillet; any longer will cause the caramel to harden and make it very hard to get the tart out of the skillet. Place a serving dish or cake stand upside down on top of the skillet. Using oven mitts, carefully flip the skillet over to invert the tart onto the serving dish. Slice and serve with vanilla ice cream.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 3.0}, {"food": "potato flour", "quantity": 1.75}, {"food": "salt", "quantity": 1}, {"food": "apples", "quantity": 6.0}, {"food": "", "quantity": 1.0}, {"food": "sugar", "quantity": 1.5}, {"food": "ice cream swich", "quantity": 1}], "title": "\nTarte Tatin\n"}, {"directions": "\n\n              Make the bread pudding: Preheat the oven to 325 degrees F. Scrape the icing off the Krimpets; reserve the icing. Cut each Krimpet into eighths and toss with the bread cubes in a large bowl. \n            \n\n              Whisk the eggs, egg yolks and granulated sugar in a bowl. Bring the heavy cream to a gentle simmer in a saucepan over medium heat. Slowly whisk the warm cream into the egg mixture until combined, whisking constantly. Add the vanilla and reserved Krimpet icing and whisk until smooth. \n            \n\n              Pour the egg mixture over the bread mixture and gently stir to coat. Transfer to a 9-by-13-inch baking dish; bake until a toothpick inserted into the middle comes out clean, 50 minutes to 1 hour. Transfer to a rack and let cool to room temperature.\n            \n\n              Meanwhile, make the icing: Bring the brown sugar, butter and scotch to a simmer in a small saucepan over medium heat; cook, stirring, 3 minutes. Add the heavy cream and vanilla and cook, stirring, until the sugar dissolves, about 2 more minutes. Remove from the heat and let cool completely. \n            \n\n              Transfer the icing mixture to a large bowl. Add the confectioners' sugar and beat with a mixer until smooth, about 1 minute. Spread on the bread pudding.\n            \n\n              Photograph by Kat Teutsch\n            \n", "ingredients": [{"food": "", "quantity": 24.0}, {"food": "garlic bread", "quantity": 8.5}, {"food": "eggs", "quantity": 10.0}, {"food": "sugar", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "sugar", "quantity": 1.5}, {"food": "butter oil", "quantity": 1.0}, {"food": "", "quantity": 0.25}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "sugar", "quantity": 2.0}], "title": "\nTastykake Bread Pudding\n"}, {"directions": "\n\n              Put the Tater Tots in a large microwave-safe bowl and microwave until slightly thawed, about 4 minutes. Let cool, then lightly mash with your hands. Stir in the egg and flour. Form the mixture into twelve 1 1/2-inch balls with damp hands.\n            \n\n              Make an indentation in the middle of each ball and stuff with a mozzarella cube; form the Tater Tot mixture around the cheese to cover.\n            \n\n              Combine the breadcrumbs and 1/2 teaspoon salt in a shallow dish. Heat 3 inches of vegetable oil in a large wide pot over medium-high heat until a deep-fry thermometer registers 350 degrees F. Working in batches, roll the balls in the breadcrumbs and fry until golden, about 8 minutes. Remove with a slotted spoon to a paper towel-lined plate to drain; season with salt. Serve with marinara sauce.\n            \n\n              Photograph by Mark Weinberg\n            \n", "ingredients": [{"food": "frozen yogurt", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "potato flour", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 2.0}, {"food": "", "quantity": 0.3333333333333333}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1}, {"food": "Worcestershire sauce", "quantity": 1}], "title": "\nTater Tot Arancini\n"}, {"directions": "\n\n              Make the cupcakes: Preheat the oven to 350 degrees F. Line two 24-cup mini muffin pans with paper liners. Melt the chocolate and butter in a heatproof bowl set over a saucepan of simmering water (do not let the bowl touch the water). Whisk until smooth, then remove the bowl; keep the water simmering in the saucepan. In another bowl, whisk the sugar, flour and salt; mix into the melted chocolate. Add the eggs, one at a time, then whisk in the vanilla until smooth.\n            \n\n              Divide the batter among the prepared cups, filling each three-quarters of the way. Bake until the cakes spring back when touched, 15 to 18 minutes. Remove from the pans and cool on a rack.\n            \n\n              Meanwhile, make the icing: Whisk the sugar, egg whites, lemon juice and salt by hand in the bowl of a stand mixer. Empty the tea bags and add the loose tea to the bowl, then set the bowl over the saucepan of simmering water and whisk until the mixture is hot and the sugar dissolves, about 2 minutes. Transfer the bowl to the stand mixer and beat with the whisk attachment on medium-high speed until the mixture holds stiff peaks, about 5 minutes. Transfer to a large resealable plastic bag, snip the corner and pipe the icing onto the cupcakes.\n            \n\n              Photograph by Stephanie Foley\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 6.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "sugar", "quantity": 1.5}, {"food": "potato flour", "quantity": 0.75}, {"food": "salt", "quantity": 0.5}, {"food": "eggs", "quantity": 4.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "sugar", "quantity": 1.0}, {"food": "egg substitute", "quantity": 4.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "tea", "quantity": 2.0}], "title": "\nTea Cakes with Earl Grey Icing\n"}, {"directions": "\n\n              Toast the Szechuan peppercorns in a dry skillet until fragrant, about 4 minutes. Cool slightly, and then crush in a spice grinder or mortar and pestle with the salt and five-spice powder until very fine. Rub seasoned salt all over the chicken thighs. Place in a bowl, cover with plastic wrap and refrigerate for at least 4 hours or preferably overnight.\n            \n\n              Bring the chicken to room temperature about 30 minutes before cooking.\n            \n\n              Line the bottom of a wok, skillet or heavy pot with a double layer of aluminum foil. Mix the rice, tea and brown sugar together and mound on the foil. Set a steamer on top, and evenly space the chicken on the rack. Cover and cook over high heat. Hot smoke the chicken until smokey-brown colored and cooked through, about 12 minutes.\n            \n\n              While the chicken cooks, whisk the Shao-sing wine or sherry, soy, ginger, and sesame together in a small saucepan. Bring to boil over high heat, remove from heat and steep for 5 minutes. Brush over cooked chicken.\n            \n\n              To serve: Dice the chicken into very small pieces. Toss with the scallions and peanuts in a medium bowl. Cut the lettuce leaves into 40 squares or triangular scoops. Place a drop of Sriracha on top of each lettuce cup, and top with about 2 teaspoons of the diced chicken. Squeeze lime juice over the top, and drizzle the remaining soy-ginger sauce over the chicken. Serve.\n            \n", "ingredients": [{"food": "", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "salt", "quantity": 2.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "crisped rice bar", "quantity": 0.25}, {"food": "black bean mango", "quantity": 3.0}, {"food": "sugar", "quantity": 2.0}, {"food": "barley flour or meal", "quantity": 0.25}, {"food": "soy sauce", "quantity": 2.0}, {"food": "ginger", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 5.0}, {"food": "peanuts", "quantity": 0.25}, {"food": "lettuce", "quantity": 0.5}, {"food": "Worcestershire sauce", "quantity": 1}, {"food": "", "quantity": 0.5}], "title": "\nTea Smoked Chicken\n"}, {"directions": "\n\nFlip:\n\n\n              To infuse the gin with tea: Put the gin and earl grey tea in a non-reactive container; stir to combine. Cover and set aside to steep for 1 hour. Strain without pressing down the leaves. The infused gin will keep, covered, for up to 3 weeks.\n            \n\n              Whisk the egg white powder and warm water in a small bowl until smooth and frothy. Fill a cocktail shaker two-thirds full of ice and add 1 1/2 ounces of the infused gin, lemon juice, simple syrup, and egg white mixture. Cover and shake vigorously until thoroughly mixed and chilled, about 30 seconds. (In general, the drink is ready by the time the shaker mists up.) Fill the bottom of a martini glass with maraschino syrup. Strain cocktail into the glass to float on top of syrup. Drop in the lemon twist. Drink.\n            \n\nSimple Syrup:\n\n\n              Put the sugar and water in a small saucepan. Cook over low heat, stirring, until the sugar dissolves. (Alternatively, heat in the microwave.) Let come to room temperature and store in a sealed container in the refrigerator for up to a month.\n            \n", "ingredients": [{"food": "", "quantity": 2.0}, {"food": "corier leaf", "quantity": 2.0}, {"food": "onion powder", "quantity": 2.0}, {"food": "coconut water", "quantity": 2.0}, {"food": "lemon juice", "quantity": 0.75}, {"food": "", "quantity": 1.0}, {"food": "syrup", "quantity": 0.75}, {"food": "lemon juice", "quantity": 1.0}, {"food": "fruit cocktail", "quantity": 1}, {"food": "sugar", "quantity": 1.0}, {"food": "coconut water", "quantity": 1.0}], "title": "\nTea Time Flip\n"}, {"directions": "\n\n              Pierce 4 large russet potatoes with a fork. Bake directly on the oven rack at 350 degrees F until tender, about 1 hour. Let cool, then quarter lengthwise and scoop out the flesh, leaving a 1/4-inch shell. Brush both sides with melted butter and season with salt and pepper. Bake, skin-side up, at 450 degrees F until crisp, about 15 minutes. Add your favorite team toppings. (For cheesy skins, flip the baked shells over before topping, sprinkle with 1 cup grated cheddar cheese and bake an extra 5 minutes.)\n            \n\n              Photograph by Karl Juengel/Studio D.\n            \n", "ingredients": [], "title": "\nTeam Potato Skins\n"}, {"directions": "\n\n              Pick up some plain cake doughnuts and decorate a dozen in your team's colors: Whisk 2 cups confectioners' sugar with 2 to 3 tablespoons milk until smooth; tint with food coloring. Spread on the doughnuts and top with sprinkles or drizzle with candy melts and let set.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [], "title": "\nTeam-Color Doughnuts\n"}, {"directions": "\nSpecial equipment: a large pastry bag a medium round pastry tip a medium star pastry tip a small handheld kitchen torch (optional)\n\n              Make the mousse: Gently bring the cream, chocolate and a pinch of salt to a simmer in a small saucepan over medium-low heat, stirring constantly, until all the chocolate is melted. Transfer the mixture to a large metal bowl, let cool to room temperature, then refrigerate to chill, about 15 minutes. Beat with an electric mixer on medium-high until light and airy and stiff peaks form. Transfer to a pastry bag fitted with a round pastry tip.\n            \n\n              Lay the cookies out on a baking sheet. Starting at the edge of each cookie but leaving just a small border, pipe spirals of mousse to cover the cookie.\n            \n\n              Make the meringue: Rinse and dry the pastry bag, and fit it with a star tip. Put the eggs whites, cream of tartar and a large pinch of salt in a large bowl, and beat with an electric mixer on medium-high until foamy. While continuing to beat, add the sugar, 1 tablespoon at a time, until it is all added and there are glossy, stiff peaks. Transfer the meringue to the pastry bag, and pipe in spirals as with the mousse, to completely cover the mousse.\n            \n\n              Preheat the broiler, and broil the pies until the meringue is lightly toasted, turning the baking sheet as needed (watch carefully, burning can happen quickly!). Or use a kitchen torch to toast the meringue. Serve right away, or refrigerate for up to 2 hours.\n            \n", "ingredients": [{"food": "ice cream swich", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "chocolate chip cookies", "quantity": 20.0}, {"food": "vanilla extract", "quantity": 0.25}, {"food": "egg substitute", "quantity": 3.0}, {"food": "ice cream swich", "quantity": 1}, {"food": "sugar", "quantity": 6.0}], "title": "\nTeeny-Tiny Chocolate Cream Pies\n"}, {"directions": "\n\n              Heat 1 1/2 inches peanut oil to 365 degrees F in a pot over medium-high heat. Whisk 1/2 cup each flour and cornstarch, 3/4 cup seltzer and 1/4 teaspoon kosher salt; toss with 1 pound green beans. Remove the beans from the batter and fry in batches, stirring, until golden, 2 minutes. Drain on paper towels. Serve with 1/4 cup soy sauce whisked with 2 tablespoons water, the juice of 1 lime and 1 minced scallion.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nTempura Green Beans\n"}, {"directions": "\n\n              Stir together the lemon juice, rice vinegar, soy sauce, sugar, chile, garlic and 1 tablespoon water in a small bowl. Set aside.\n            \n\n              Slice one cocktail frank almost all the way in half lengthwise, leaving the top quarter of the frank intact. Rotate 90 degrees and slice again so you have 4 strips attached to the unsliced top of the frank. Using a sharp paring knife, cut each of the 4 strips in half so you have 8 \"tentacles.\" Spread the tentacles and place upright on a microwave-safe plate. Repeat with the remaining cocktail franks, using 2 plates to lay out all the octopi. Microwave one plate at a time for about 30 seconds, or until the cocktail franks sizzle and the tentacles curl slightly. Let cool. The franks will keep the shape that they were microwaved in.\n            \n\n              Heat 1 1/2 inches of oil to 360 degrees F in a heavy-bottom pot or Dutch oven. Place the cornstarch in a shallow bowl. In a second bowl, whisk together the flour, seltzer, egg and 1/4 teaspoon salt until smooth. Add the ice cubes to keep the batter cold.\n            \n\n              Working in batches, dredge the octopi in the cornstarch, tapping off the excess, and then drag through the batter. Let the excess batter drip off so the tentacles stay defined. Carefully add to the hot oil, holding each octopus by one of the tentacles for the easiest dipping. Fry, turning, until golden brown, 3 to 4 minutes. Transfer to a paper-towel-lined plate to drain.\n            \n\n              Serve with the dipping sauce and sliced cucumbers.\n            \n", "ingredients": [{"food": "lemon juice", "quantity": 2.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "soy sauce", "quantity": 2.0}, {"food": "sugar", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "low fat big franks", "quantity": 24.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "cornstarch", "quantity": 0.5}, {"food": "potato flour", "quantity": 1.0}, {"food": "coconut water", "quantity": 0.75}, {"food": "egg substitute", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1}], "title": "\nTempura Octopus Hot Dog Bites\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Put the hot dogs in a food processor and pulse until coarsely chopped. Heat the oil in a large nonstick skillet over medium-high heat, add a third of the onions and cook, stirring, until soft and slightly golden brown, about 4 minutes. Add the garlic and stir for 30 seconds. Add the chopped hot dog and cook, stirring occasionally, until lightly golden brown, about 5 minutes. Remove from the heat and let cool completely. \n            \n\n              Preheat the broiler. Open the buns and arrange on a baking sheet. Broil until toasted on each side, 1 to 2 minutes per side. Cut into small pieces. \n            \n\n              Whisk together the mayonnaise and poppy seeds in a small bowl. Toss the cucumber and celery salt together in a small bowl. \n            \n\n              Layer the dip in a medium, 3-quart glass trifle bowl or your favorite small serving dish. Spread out the tomatoes on the bottom, then top, in even layers, with the peppers, toasted buns, a generous drizzle of mustard, the remaining onions, the hot dog mixture, the pickles, poppy seed sauce, relish and cucumber. Wrap and refrigerate until chilled, at least 1 hour or overnight. Garnish with another drizzle of mustard and serve with potato chips.\n            \n\n              Copyright 2013 Television Food Network, G.P. All rights reserved\n            \n\n              From Food Network Kitchens\n            \n", "ingredients": [{"food": "hot pockets ham cheese stuffed swich", "quantity": 10.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "hot pockets ham cheese stuffed swich", "quantity": 3.0}, {"food": "mayonnaise dressing", "quantity": 1.0}, {"food": "seeds", "quantity": 1.0}, {"food": "cucumber", "quantity": 1.0}, {"food": "celery seed", "quantity": 1.0}, {"food": "tomatoes", "quantity": 3.0}, {"food": "barley flour or meal", "quantity": 1.5}, {"food": "mustard spinach", "quantity": 14.0}, {"food": "dill seed", "quantity": 1.5}, {"food": "pickle relish", "quantity": 1.0}, {"food": "potato chips", "quantity": 1}], "title": "\nTen-Layer Chicago Dog Dip\n"}, {"directions": "\n\n              Puree the tomatoes, celery and broth in a blender until smooth. Season, to taste, with salt and pepper. Season with lemon juice and maple syrup. Stir in cream.\n            \n\n              Transfer to a microwave safe bowl. Heat in microwave on HIGH until warmed through, about 4 minutes. (Alternatively, heat the old-fashioned way in a pan.) Pour hot soup into an air-tight thermos. Pack in a lunch sack and send off to school.\n            \n", "ingredients": [{"food": "grape juice", "quantity": 1.0}, {"food": "celery seed", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "syrup", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 0.5833333333333333}], "title": "\nTen-Minute Tomato Soup\n"}, {"directions": "\n\n              Combine 4 ounces tequila, 2 ounces each lemon juice and sweet vermouth, 2 teaspoons honey and 4 dashes bitters in a shaker. Add ice, cover and shake. Strain into 2 martini glasses; garnish with lemon twists.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [], "title": "\nTequila Cocktails\n"}, {"directions": "\n\n              Shake 3 ounces pineapple juice, 1 1/2 ounces tequila, 3/4 ounce lime juice and 1/2 ounce triple sec in a shaker with ice. Strain into an ice-filled glass. Garnish with a lime twist.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [], "title": "\nTequila Oasis\n"}, {"directions": "\n\n              Fill a goblet or rocks glass with ice cubes. Add the tequila and a dash of Campari to give the drink a slight blush and balance the sweetness of the soda. Top off with the grapefruit soda. Skewer the fruit and stir into the cocktail. Drink.\n            \n\n              Serve with a plate of wedged pineapple, a small bowl of your favorite chili powder, and coarse salt, for dipping.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "barley flour or meal", "quantity": 1.0}, {"food": "", "quantity": 1}, {"food": "ruby red grapefruit juice blend", "quantity": 6.0}, {"food": "lime", "quantity": 1}], "title": "\nTequila Refresca\n"}, {"directions": "\n\n              Heat the chicken according to the package instructions. Let cool slightly, then cut into medium dice.\n            \n\n              Whisk together the lime juice, vegetable oil, sesame oil, 1/2 teaspoon salt and several grinds of pepper in a large bowl. Add the chicken, rice cakes, cilantro, mint, peanuts, scallions, carrot, cucumber and bell pepper and toss well to coat. \n            \n\n              Lay 12 of the lettuce leaves on a serving platter and double up each with one of the remaining leaves. Divide the chicken salad among the lettuce cups and top with some chili-garlic sauce, the sesame seeds and a squeeze of lime.\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 10.0}, {"food": "lime juice", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "crisped rice bar", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "peanuts", "quantity": 0.5}, {"food": "silk light vanilla", "quantity": 4.0}, {"food": "carrot juice", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}, {"food": "yellow rice", "quantity": 0.5}, {"food": "chrysanthemum leaves", "quantity": 24.0}, {"food": "Worcestershire sauce", "quantity": 1}, {"food": "sesame seeds", "quantity": 2.0}], "title": "\nTeriyaki Chicken Lettuce Cups\n"}, {"directions": "\n\n              Whisk the teriyaki sauce, peanut oil and 1/4 cup water in a large bowl until smooth. Add the spinach, snap peas, bell pepper, tomatoes, scallions, basil, chicken and cashews; toss to combine and season with salt and pepper.\n            \n\n              Warm the rice in the microwave. Serve topped with the chicken-vegetable salad.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [{"food": "Worcestershire sauce", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 4.0}, {"food": "sugar", "quantity": 8.0}, {"food": "orange", "quantity": 1.0}, {"food": "fruit cocktail", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "diced chicken", "quantity": 2.0}, {"food": "", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "crisped rice bar", "quantity": 2.0}], "title": "\nTeriyaki Chicken Rice Bowl\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Season the hens with salt and pepper and place skin-side up in a roasting pan. Roast until the skin is slightly crisp, about 25 minutes.\n            \n\n              Meanwhile, combine the soy sauce, hoisin sauce, vinegar, ginger, 1 chile pepper and 1/4 cup water in a pot. Cut half of the scallions into large pieces, and zest and juice half of the grapefruit; add to the pot. Simmer, stirring occasionally, until thick and syrupy, about 20 minutes. Brush the hens with a few tablespoons of the sauce and continue roasting until golden, about 8 more minutes.\n            \n\n              Peel and segment the remaining grapefruit half and place in a bowl. Thinly slice the remaining scallions and mince the remaining chile pepper; add to the bowl along with the bok choy, sesame oil, and salt and pepper to taste. Place half a hen on each plate. Stir any pan drippings into the remaining sauce and drizzle over the top. Serve with the bok choy salad and garnish with sesame seeds.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "game meat bison", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "soy sauce", "quantity": 0.75}, {"food": "Worcestershire sauce", "quantity": 0.25}, {"food": "vinegar", "quantity": 0.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "sesame seeds", "quantity": 2.0}], "title": "\nTeriyaki Hens with Bok Choy\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Cook the quinoa as the label directs. Meanwhile, whisk 1/3 cup each soy sauce and mirin with three-quarters of the garlic, the ginger and honey in a medium bowl. Add the salmon and turn to coat. Let marinate at room temperature, 15 minutes.\n            \n\n              Stir the scallions and the remaining 2 tablespoons soy sauce into the quinoa. Cover and set aside.\n            \n\n              Heat a large nonstick skillet over medium-high heat. Add 2 tablespoons vegetable oil. Add the bok choy and cook until the leaves start wilting, 3 to 4 minutes. Add the remaining garlic and the mushrooms and cook, stirring occasionally, until softened, about 5 minutes. Add the remaining 2 tablespoons mirin and the lemon zest; toss to coat. Transfer the vegetables to a bowl.\n            \n\n              Wipe out the skillet and increase the heat to high. Add the remaining 1 tablespoon vegetable oil. Add the salmon and about one-third of the marinade to the skillet (discard the remaining marinade). Cook until the salmon is golden brown and cooked through, 3 minutes per side. Top each serving of quinoa with the vegetables, salmon and more scallions. Serve with lemon wedges.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [{"food": "quinoa", "quantity": 1.0}, {"food": "soy sauce", "quantity": 0.3333333333333333}, {"food": "crisped rice bar", "quantity": 0.3333333333333333}, {"food": "garlic powder", "quantity": 4.0}, {"food": "ginger", "quantity": 1.0}, {"food": "honey smoked ham", "quantity": 2.0}, {"food": "salmon", "quantity": 1.5}, {"food": "silk light vanilla", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 6.0}, {"food": "", "quantity": 0.5}], "title": "\nTeriyaki Salmon Quinoa Bowls\n"}, {"directions": "\n\n              test\n            \n\n              Special equipment:\n            \n", "ingredients": [{"food": "", "quantity": 1}], "title": "\nTest\n"}, {"directions": "\n\n              Heat the olive oil in a large pot over medium heat. Add the onion and cook, stirring occasionally, until slightly softened, about 5 minutes. Add the garlic, cumin, 1/4 teaspoon salt and a few grinds of pepper; cook until lightly toasted, about 1 minute. Add the tomatoes, black beans, pinto beans and 6 cups water. Bring to a boil, then reduce the heat to medium and stir. Simmer until slightly thickened, about 15 minutes.\n            \n\n              Remove 1/2 cup of the bean mixture to a bowl using a slotted spoon; mash with a fork, then return to the pot along with the rice and 1/4 cup cilantro. Cook until the soup thickens, about 5 more minutes. Season with salt and pepper. Warm the tortillas in a dry skillet or wrap in damp paper towels and microwave; wrap in foil to keep warm.\n            \n\n              Top each serving of soup with the cheese and the remaining 1/4 cup cilantro. Serve with the warm tortillas.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "cumin seed", "quantity": 0.75}, {"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 1.0}, {"food": "fava beans", "quantity": 1.0}, {"food": "fava beans", "quantity": 1.0}, {"food": "crisped rice bar", "quantity": 1.5}, {"food": "", "quantity": 0.5}, {"food": "corn bran", "quantity": 8.0}, {"food": "cheddar cheese", "quantity": 0.5}], "title": "\nTex-Mex Bean Soup with Rice\n"}, {"directions": "\n\n              Combine the refried beans, frozen corn, poblanos, 1/4 cup cilantro, the cumin and chile powder in a medium bowl. Combine the salsa, tomatoes and the remaining 1/4 cup cilantro in a separate medium bowl. Toss the cheddar and muenster cheese in a third bowl; set aside.\n            \n\n              Spread about 1/2 cup of the salsa mixture in a thin layer in a 6-quart slow cooker. Top with about 6 tostada shells, breaking them as needed to cover the bottom. Spread half of the bean mixture over the tostada shells, then sprinkle with 1 1/2 cups of the cheese mixture and 1 cup of the salsa mixture. Repeat the layers (tostada shells, bean mixture, cheese, salsa mixture), then top with the remaining tostadas, cheese and salsa.\n            \n\n              Cover and cook on low, 4 hours. Uncover and let rest 15 minutes. Serve with the sliced avocados, sour cream, cilantro and pickled jalapenos.\n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [{"food": "refried beans", "quantity": 2.0}, {"food": "corn bran", "quantity": 2.0}, {"food": "peppers", "quantity": 2.0}, {"food": "dessert topping", "quantity": 0.5}, {"food": "cumin seed", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "cheddar cheese", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 2.0}, {"food": "tostada shells", "quantity": 18.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 1}], "title": "\nTex-Mex Casserole\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 400 degrees F.\n            \n\n              Put the chips in a food processor and pulse until they are finely ground; set aside. \n            \n\n              Slice the chicken breasts in half horizontally so you have 4 thin chicken cutlets. \n            \n\n              Set up a breading station with 3 shallow dishes: Stir together the flour, chili powder and 1/2 teaspoon salt in the first dish. Beat the eggs in the second dish and add the tortilla chips to the third dish. Coat a cutlet in the flour. Dip in the egg, letting any excess drip off and then press into the tortilla chips. Transfer to a plate and bread the remaining cutlets. \n            \n\n              Heat 1/4 cup of the oil in a large nonstick skillet over medium heat until a piece of the breading sizzles when added to the oil. Add 2 breaded cutlets to the oil, making sure they don't touch each other. Fry until golden brown on both sides, 3 to 4 minutes per side. Remove to a paper towel-lined plate. Add the remaining 1/4 cup oil to the skillet, heat and then fry the remaining cutlets. \n            \n\n              Evenly spread 1/2 cup salsa on the bottom of a 9-by-13-inch baking dish. Arrange the chicken in a single layer on top. Pour 1/4 cup of salsa on top of each piece of chicken. Shingle the cheese evenly over the chicken.\n            \n\n              Bake until the cheese is bubbling and golden brown, 25 to 30 minutes. \n            \n\n              Sprinkle with the jalapeno and cilantro.\n            \n", "ingredients": [{"food": "tortilla", "quantity": 4.0}, {"food": "diced chicken", "quantity": 8.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "chili powder", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "eggs", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "chunky soup", "quantity": 15.0}, {"food": "macaroni cheese", "quantity": 8.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}], "title": "\nTex-Mex Chicken Parmesan\n"}, {"directions": "\n\n              Pull back the husks from 4 ears of corn and remove the silk; sprinkle with 1 teaspoon chili powder. Cover with the husks and grill, turning, about 20 minutes. Fold back the husks and spread with a mixture of 1/2 cup mayonnaise and 1 teaspoon chili powder. Sprinkle with grated cheddar and crumbled bacon.\n            \n\n              Photograph by Kate Sears\n            \n", "ingredients": [], "title": "\nTex-Mex Corn\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F. Bring a large pot of salted water to a boil. Add the green beans and cook until crisp-tender, about 6 minutes. Drain, rinse under cold water and blot dry with paper towels.\n            \n\n              Melt the butter in a large pot or Dutch oven over medium heat. Add the poblanos and onion, season with salt and cook, stirring occasionally, until tender, about 7 minutes. Add the garlic and cook 1 minute. Add the flour and cook, stirring, until the vegetables are coated, about 1 minute.\n            \n\n              Whisk in the half-and-half, chicken broth, cayenne and 1/2 teaspoon salt. Increase the heat to medium high and bring to a boil, then reduce the heat to medium low and simmer, whisking occasionally, until thickened, about 5 minutes. Add the pepper jack and stir until melted, then add the green beans and stir to coat. Transfer to a 3-quart baking dish. (You can refrigerate the casserole, covered, for up to 4 hours.)\n            \n\n              Bake the casserole until bubbling, about 20 minutes. Meanwhile, pulse the tortilla chips with the chile powder in a food processor until coarsely ground. Sprinkle the Cotija cheese and ground tortilla chips over the casserole; bake until golden, about 5 more minutes.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "fava beans", "quantity": 2.0}, {"food": "butter oil", "quantity": 3.0}, {"food": "peppers", "quantity": 3.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "", "quantity": 1.5}, {"food": "diced chicken", "quantity": 1.5}, {"food": "hearts of palm", "quantity": 1}, {"food": "macaroni cheese", "quantity": 2.0}, {"food": "tortilla", "quantity": 4.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 0.5}], "title": "\nTex-Mex Green Bean Casserole\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Halve 6 jalapenos lengthwise; remove the seeds. Combine 1/2 cup shredded cheddar cheese with 1/4 cup refried beans, 2 tablespoons cream cheese, 1 teaspoon chili powder and 1/4 teaspoon kosher salt; divide among the pepper halves. Press the filling in crushed tortilla chips and place chip-side up on a parchment-lined baking sheet. Bake at 425 degrees F until the filling is bubbling, about 12 minutes. Top with sour cream and cilantro.\n            \n", "ingredients": [], "title": "\nTex-Mex Jalapenos\n"}, {"directions": "\n\n              Make Chunky Red Mash; add 1/2 pound grated Monterey Jack, 1/4 cup sliced scallions and 2 minced seeded jalapenos. Top with sour cream and more scallions and jalapenos.\n            \n\n              Chunky Red Mashed Potatoes Cover 2 pounds whole red potatoes with cold salted water; simmer 40 minutes. Drain; do not peel. Smash with 1/2 to 1 stick butter, 3/4 cup hot milk, and salt and pepper.\n            \n\n              See all 50 easy mashed potato recipes\n            \n\n              Photograph by Kana Okada\n            \n", "ingredients": [], "title": "\nTex-Mex Mashed Potatoes\n"}, {"directions": "\n\n              Toppings: Refried beans, crumbled chorizo, shredded monterey jack, hot sauce and pickled jalapenos\n            \n\n              How to Make Classic Potato Skins:\n            \n\n              Pierce 4 large russet potatoes with a fork. Bake directly on the oven rack at 350 degrees until tender, about 1 hour. Let cool, then quarter lengthwise and scoop out the flesh, leaving a 1/4-inch shell. Brush both sides with melted butter and season with salt and pepper. Bake, skin-side up, at 450 degrees until crisp, about 20 minutes. Add your favorite team toppings. (For cheesy skins, flip the baked shells over before topping, sprinkle with 1 cup grated cheddar cheese and bake an extra 5 minutes.)\n            \n\n              Photograph by Karl Juengel/Studio D\n            \n", "ingredients": [], "title": "\nTex-Mex Potato Skins\n"}, {"directions": "\n\n              Cook the rice as the label directs. Meanwhile, heat the olive oil in a medium saucepan over medium-high heat. Add the salsa and cumin and cook, stirring, until the salsa is soft, about 5 minutes. Add the black-eyed peas, plus the liquid from one of the cans and 1/4 cup water. Cook, stirring occasionally, until the beans are creamy and tender, about 12 minutes.\n            \n\n              Fluff the rice with a fork and divide among bowls. Add the spinach and cilantro to the black-eyed pea mixture and stir until wilted, about 1 minute; spoon evenly over the rice. Top each serving with a few avocado slices, some cheese and more salsa. Serve with sour cream or Greek yogurt, if desired.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "crisped rice bar", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "dessert topping", "quantity": 1.0}, {"food": "cumin seed", "quantity": 0.5}, {"food": "", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 3.0}, {"food": "", "quantity": 0.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "cheddar cheese", "quantity": 1.0}, {"food": "silk banana-strawberry soy yogurt", "quantity": 1}], "title": "\nTex-Mex Rice and Black-Eyed Peas\n"}, {"directions": "\n\n              Whisk 1/2 cup sour cream, 1 to 2 tablespoons lime juice, and 1/2 teaspoon each sugar and kosher salt in a large bowl. Toss with 1/2 head shredded iceberg lettuce, and 1/2 cup each chopped plum tomato, chopped cilantro, chopped scallion and shredded cheddar cheese.\n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [], "title": "\nTex-Mex Salad\n"}, {"directions": "\n\n              Whisk 2 tablespoons whole-grain mustard, 1 tablespoon lime juice, 1 teaspoon red wine vinegar, 3 tablespoons olive oil, and salt; add 1/4 cup chopped cilantro. Grill 4 ears corn; cut off the kernels and toss with 1 can drainedblack beans, 1 diced red bell pepper, 4 sliced radishes and 3 chopped scallions. Toss with the dressing; season with salt and pepper.\n            \n\n              SERVES: 4; Calories: 360; Total Fat 13 grams; Saturated Fat: 2 grams; Protein: 12 grams; Total carbohydrates: 53 grams; Sugar: 20 grams Fiber: 13 grams; Cholesterol: 0 milligrams; Sodium: 499 milligrams\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nTex-Mex Salad\n"}, {"directions": "\n\n              Heat 1 tablespoon vegetable oil in a Dutch oven or large wide pot over medium-high heat. Add the shrimp, 1 teaspoon chili powder and 1/4 teaspoon salt. Cook, stirring occasionally, until the shrimp are just cooked through, about 3 minutes; transfer to a bowl.\n            \n\n              Add the remaining 3 tablespoons vegetable oil and the pasta to the pot. Cook, stirring, until golden, 3 minutes; transfer to a separate bowl.\n            \n\n              Reduce the heat to medium and add the onion, bell pepper, 1/2 teaspoon salt and 1 to 2 tablespoons water to the pot. Cook, stirring, until the vegetables soften, about 3 minutes.\n            \n\n              Increase the heat to medium high; stir in 2 cups water, the tomatoes, toasted noodles and 1/2 teaspoon salt. Bring to a simmer, stirring to break up any clumps. Cover, reduce the heat to medium, and cook, stirring occasionally, until the noodles are tender and most of the water is absorbed, 10 to 12 minutes. Stir in the shrimp. Top each serving with sour cream, pickled jalapenos and cilantro.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.25}, {"food": "shrimp", "quantity": 1.0}, {"food": "chili powder", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "italian veg medley pasta", "quantity": 12.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1}], "title": "\nTex-Mex Shrimp and Noodles\n"}, {"directions": "\n\n              Preheat the oven to 450 degrees F and line a baking sheet with foil. Halve 2 zucchini lengthwise; scoop out the seeds, leaving a 1/4-inch-thick shell. Chop the scooped-out zucchini flesh and transfer to a bowl. Grate the remaining whole zucchini on the large holes of a box grater; add to the bowl along with 1 teaspoon salt. Set aside 10 minutes, then squeeze out the liquid.\n            \n\n              Heat the olive oil in a skillet over medium-high heat. Add the garlic, minced jalapeno, chile powder and grated zucchini mixture; cook until tender, 4 minutes. Let cool, then stir in the cheese. Spoon into the zucchini halves. Transfer to the baking sheet and bake until bubbling, 20 minutes.\n            \n\n              Combine the tomato, scallions and cilantro in a small bowl. Spoon over the zucchini, then top with pickled jalapenos.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [{"food": "", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "pepper", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "", "quantity": 3.0}, {"food": "", "quantity": 3.0}, {"food": "dessert topping", "quantity": 1}], "title": "\nTex-Mex Stuffed Zucchini\n"}, {"directions": "\nSpecial equipment: a pizza stone\n\n              Preheat the oven to 425 F with a pizza stone on the bottom rack.\n            \n\n              Divide the pizza dough in half. Line a pizza peel or turned-over baking sheet with parchment paper. Roll one half of the dough into a 12-inch round on the parchment. Layer the sliced Cheddar over the crust, leaving a 1-inch border all around. Brush the border with olive oil. Roll the remaining piece of dough on another sheet of parchment into a 12-inch round and place it on top of the first crust. Lightly roll over the dough with the rolling pin to seal the rounds together, then fold the edges up and pinch them in place to form a crust border. Transfer the dough on the parchment to the pizza stone and bake until just cooked through, 10 to 12 minutes.\n            \n\n              Meanwhile, heat the oil in a medium skillet over medium heat. Add the beef and cook, breaking it up with a wooden spoon, until no longer pink, about 4 minutes. Add the chili powder, cumin and 1/2 teaspoon salt and stir the spices into the beef. Clear a spot in the pan and add the tomato paste. Let toast for 1 minute, then stir into the beef. Add 1/2 cup water and simmer rapidly, stirring until the water has almost reduced away, about 2 minutes. Keep hot.\n            \n\n              Spread the beans on the crust, leaving a border. Spoon the meat over the top, then the pico de gallo. Mound the lettuce on the pizza and top with the grated Cheddar, avocado, sour cream and olives. Slice and serve immediately.\n            \n", "ingredients": [{"food": "pizza rolls", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 8.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "frankfurter beef", "quantity": 12.0}, {"food": "chili powder", "quantity": 2.0}, {"food": "cumin seed", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "refried beans", "quantity": 1.0}, {"food": "dulce de leche", "quantity": 0.5}, {"food": "lettuce", "quantity": 3.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "sour cream", "quantity": 0.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.25}], "title": "\nTex-Mex Stuffed-Crust Pizza\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Whisk the eggs in a large bowl with 1/4 cup water, 1/4 teaspoon salt and a few grinds of pepper. Stir in the crushed tortilla chips and let soak 5 minutes.\n            \n\n              Heat 1 tablespoon olive oil in a 10-inch nonstick ovenproof skillet over medium heat. Crumble in the chorizo and cook, stirring, until no longer pink, 3 to 4 minutes. Add the scallion whites and cook until softened, 1 to 2 minutes. Spread the chorizo evenly in the bottom of the skillet and pour the egg mixture on top. Top with the cheese and bake until the eggs are browned around the edges and a knife inserted into the center comes out clean, 12 to 14 minutes.\n            \n\n              Meanwhile, combine the lettuce, radishes, scallion greens and cilantro in a large bowl. Drizzle with the lime juice and the remaining 2 tablespoons olive oil; season with salt and pepper and toss. Slide the frittata onto a cutting board; sprinkle with cilantro. Slice into wedges and serve with the salsa and the salad.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "eggs", "quantity": 8.0}, {"food": "salt", "quantity": 1}, {"food": "tortilla", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "chorizo", "quantity": 8.0}, {"food": "martha white foods", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 0.5}, {"food": "hearts of palm", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "dessert topping", "quantity": 0.5}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 0.5}], "title": "\nTex-Mex Tortilla Chip Frittata\n"}, {"directions": "\n\n              Combine the turkey, garlic, paprika, 3/4 teaspoon salt and a few grinds of pepper in a medium bowl; mix with your hands until just combined. Form into four 1/2-inch-thick patties; set aside.\n            \n\n              Combine 1/2 avocado, the mayonnaise, lime juice and 1/4 teaspoon salt in a medium bowl; mash until smooth. Thinly slice the remaining 1/2 avocado and season with salt and pepper. Set aside for topping.\n            \n\n              Heat the vegetable oil in a large nonstick skillet over medium-high heat (or preheat a grill to medium high and oil the grates). Add the burgers and cook until browned, 3 to 4 minutes per side. Top each burger with a slice of cheese; cover and cook until the cheese melts, about 30 seconds.\n            \n\n              Meanwhile, split and toast the buns; spread the avocado mayonnaise on the cut sides. Serve the burgers on the buns with lettuce, the sliced avocado and tortilla chips.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "ground turkey", "quantity": 1.25}, {"food": "garlic powder", "quantity": 2.0}, {"food": "smoked turkey roll", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "avocado", "quantity": 1.0}, {"food": "mayonnaise dressing", "quantity": 3.0}, {"food": "", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "potato flour", "quantity": 4.0}, {"food": "tortilla", "quantity": 1}], "title": "\nTex-Mex Turkey Burgers with Avocado Mayonnaise\n"}, {"directions": "\n\n              Pulse 1/4 cup salt and the chile powder in a food processor until combined; let the powder settle before removing the lid, then transfer the chile salt to a small bowl and set aside.\n            \n\n              Wipe out the food processor and add the crema, cilantro and garlic. Add the grated zest and juice of 1 lime and puree until smooth. Transfer to a small bowl; cover with plastic wrap and refrigerate until ready to serve.\n            \n\n              Toss the mango and jicama sticks with the juice of 1 lime. Transfer to a platter along with the radishes, bell pepper and cucumber. Slice the remaining lime into wedges and add to the platter. Serve with the chile salt and cilantro crema.\n            \n\n              Photograph by David Malosh\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "onion powder", "quantity": 0.75}, {"food": "sour cream", "quantity": 0.5}, {"food": "", "quantity": 0.5}, {"food": "garlic powder", "quantity": 1.0}, {"food": "limes", "quantity": 3.0}, {"food": "mangoes", "quantity": 2.0}, {"food": "turkey sticks", "quantity": 1.0}, {"food": "radishes", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}], "title": "\nTex-Mex Veggie Platter\n"}, {"directions": "\n\n              For the rub: Mix the paprika, 1 tablespoon each of salt and black pepper, the brown sugar, and the cayenne. Rub spice mixture all over brisket, wrap tightly, and refrigerate overnight.\n            \n\n              Soak the wood chips in water for at least 30 minutes before grilling. Prepare an outdoor grill with a medium to medium-low fire for indirect grilling.\n            \n\n              For the sauce: Mix the tomato puree, beer, celery, onion, 1/2 cup of the vinegar, the brown sugar, mustard, bacon, garlic, chiles, bay leaves, chili powder, 1 tablespoon salt, and black pepper to taste in a large disposable aluminum pan. Put brisket in the sauce.\n            \n\n              Throw a handful of drained wood chips on the hot coals, put the pan over the cooler side of the grill, and cover so the vent holes are directly over the brisket. Baste meat every 30 minutes, turning occasionally and adding water to the pan as necessary to keep meat partially submerged, until the meat is tender and an instant-read thermometer inserted in the thickest part registers 200 degrees F, about 3 3/4 hours. Replenish the charcoal as needed to maintain a medium to medium-low fire.\n            \n\n              Transfer the brisket to a cutting board, tent with foil, and let rest for 20 minutes. Skim the fat from the braising sauce and stir in the remaining 1/4 cup cider vinegar and salt to taste. Reheat if necessary. Thinly slice brisket across the grain and arrange on a serving platter. Spoon some sauce over the meat and pass the rest at the table.\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 0.25}, {"food": "seasoning mix", "quantity": 1.0}, {"food": "seasoning mix", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "pepper", "quantity": 1.0}, {"food": "low fat big franks", "quantity": 1.0}, {"food": "potato chips", "quantity": 6.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "barley flour or meal", "quantity": 12.0}, {"food": "celery seed", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "vinegar", "quantity": 0.75}, {"food": "sugar", "quantity": 0.5}, {"food": "mustard spinach", "quantity": 0.25}, {"food": "bacon", "quantity": 5.0}, {"food": "garlic powder", "quantity": 10.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "", "quantity": 3.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "chili powder", "quantity": 2.0}, {"food": "seasoning mix", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "coconut water", "quantity": 4.0}], "title": "\nTexas BBQ Braised Beef Brisket\n"}, {"directions": "\n\n              Cook 3 slices chopped thick-cut bacon in a skillet over medium-high heat. Add 1 cup sliced celery, 4 chopped scallions, 3/4 teaspoon chili powder and 1/2 teaspoon kosher salt. Cook, stirring, 4 minutes. Add a 1-pound package frozen black-eyed peas and 3/4 cup water. Reduce the heat to medium and warm through, 5 minutes. Top with chopped parsley.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [], "title": "\nTexas Black-Eyed Peas\n"}, {"directions": "\n\n              Heat 1 tablespoon olive oil in a large Dutch oven over medium-high heat. Add half of the beef and cook, stirring, until browned, about 4 minutes; transfer to a plate. Add the remaining 1 tablespoon olive oil to the pot and brown the remaining beef, then return the first batch to the pot. Reduce the heat to medium and stir in the garlic.\n            \n\n               Combine the chili powder, cumin and flour in a small bowl. Sprinkle over the meat in the pot and stir until evenly coated. Crumble in the oregano with your fingers, then add 3 cans beef broth, 2 teaspoons salt and 1/4 teaspoon pepper; stir to combine. Bring to a boil, then reduce the heat to low; partially cover and simmer until the meat is just tender, about 1 hour, 30 minutes. \n            \n\n              Whisk the remaining 1 can broth with the masa harina in a bowl to make a creamy paste; stir into the chili. Continue simmering over low heat until the meat is almost falling apart, 30 minutes to 1 hour, adding up to 2 cups water if the chili gets too thick. Divide among bowls and top with onion and pickled jalapenos. \n            \n\n              Photograph by Kat Teutsch\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "frankfurter beef", "quantity": 6.75}, {"food": "garlic powder", "quantity": 6.0}, {"food": "chili powder", "quantity": 6.0}, {"food": "cumin seed", "quantity": 4.0}, {"food": "potato flour", "quantity": 0.5}, {"food": "", "quantity": 2.0}, {"food": "frankfurter beef", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "corn flour", "quantity": 0.5}, {"food": "onion powder", "quantity": 1}], "title": "\nTexas Bowl of Red\n"}, {"directions": "\n\n              Toppings: Chunky chili, grated longhorn cheddar, chopped onion, sour cream and hot sauce\n            \n\n              How to Make Classic Potato Skins:\n            \n\n              Pierce 4 large russet potatoes with a fork. Bake directly on the oven rack at 350 degrees until tender, about 1 hour. Let cool, then quarter lengthwise and scoop out the flesh, leaving a 1/4-inch shell. Brush both sides with melted butter and season with salt and pepper. Bake, skin-side up, at 450 degrees until crisp, about 15 minutes. Add your favorite team toppings. (For cheesy skins, flip the baked shells over before topping, sprinkle with 1 cup grated cheddar cheese and bake an extra 5 minutes.)\n            \n\n              Photograph by Karl Juengel/Studio D\n            \n", "ingredients": [], "title": "\nTexas Chili Potato Skins\n"}, {"directions": "\n\n              Combine the beef stock, ketchup, onion, bacon drippings, 1/4 teaspoon salt and 1/2 to 1 teaspoon pepper in a medium pot. Bring to a boil, then reduce the heat to medium low and simmer until the onion is tender, about 10 minutes. Remove from the heat and set aside to let the flavors develop, at least 1 hour. Reheat the sauce before serving.\n            \n\n               Photograph by Andrew Purcell\n            \n", "ingredients": [{"food": "frankfurter beef", "quantity": 1.5}, {"food": "", "quantity": 0.5}, {"food": "onion powder", "quantity": 0.5}, {"food": "meat drippings ", "quantity": 2.0}, {"food": "salt", "quantity": 1}], "title": "\nTexas-Style Barbecue Sauce\n"}, {"directions": "\n\n              Bring the coconut milk, 3/4 cup water and the lemongrass or ginger to a boil in a medium saucepan. Add the rice and return to a boil. Stir, then cover and reduce the heat to low. Simmer until the liquid is absorbed and the rice is tender, about 15 minutes. Remove from the heat and let sit, covered, 10 minutes. Fluff with a fork.\n            \n\n              Meanwhile, whisk 1/4 cup soy sauce, the lime juice and sugar in a small bowl. Toss the cucumbers with 1 tablespoon basil and the remaining 1 teaspoon soy sauce in a medium bowl. Set aside.\n            \n\n              Heat 1 tablespoon vegetable oil in a medium skillet over high heat.\n            \n\n              Add the beef and cook, breaking up the meat, until browned and cooked through, about 5 minutes. Transfer to a bowl; set aside.\n            \n\n              Reduce the heat to medium high. Add the remaining 1 tablespoon vegetable oil to the skillet. Add the bell pepper and cook, stirring occasionally, until golden, about 5 minutes. Add the garlic and cook until golden, 2 minutes. Increase the heat to high and return the beef and any accumulated juices to the skillet. Stir in the soy sauce mixture and cook until the liquid evaporates, 2 minutes. Add the remaining basil and cook, stirring, until just wilted, about 1 minute. Serve the beef and cucumber salad over the rice.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [{"food": "coconut milk", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "crisped rice bar", "quantity": 1.0}, {"food": "soy sauce", "quantity": 0.25}, {"food": "", "quantity": 2.0}, {"food": "sugar", "quantity": 1.0}, {"food": "", "quantity": 2.0}, {"food": "basil", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "frankfurter beef", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "garlic powder", "quantity": 3.0}], "title": "\nThai Basil Beef with Coconut Rice\n"}, {"directions": "\n\n              Mix sliced roast beef with shredded carrot, sliced red onion, mint and cilantro; toss with lime juice to taste, a dash of fish sauce and a pinch of sugar. Spoon into tortilla scoops; top with mozzarella, then bake 2 minutes. Top with peanut sauce and jalapenos.\n            \n\n              Photograph by Jonny Valiant\n            \n", "ingredients": [], "title": "\nThai Beef Nachos\n"}, {"directions": "\n\n              Heat the vegetable oil in a large pot over medium-high heat. Add the onion and cook, stirring occasionally, until softened and lightly browned, about 8 minutes. Add the garlic and curry paste and cook, stirring, 1 to 2 minutes. Add the chicken broth, coconut milk and fish sauce; cover and bring to a boil. \n            \n\n              Add the bell peppers and noodles and simmer, uncovered, until the noodles are al dente, about 3 minutes. Add the chicken and simmer until just cooked through, about 3 more minutes. Stir in the lime juice and cilantro. Add more fish sauce and lime juice, if desired.  \n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "almond paste", "quantity": 2.0}, {"food": "diced chicken", "quantity": 6.0}, {"food": "coconut milk", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 2.0}, {"food": "rice noodles", "quantity": 4.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "lime juice", "quantity": 1.0}, {"food": "", "quantity": 1.0}], "title": "\nThai Chicken Soup\n"}, {"directions": "\n\n              Preheat the oven to 450 degrees F. Place a rack in a roasting pan. Mix the butter, chopped garlic, curry paste, 3 teaspoons ginger, the zest of 2 limes and the juice of 1 lime in a bowl. \n            \n\n              Season the chicken with salt. Loosen the skin and rub the curry butter underneath. Place skin-side up on the rack and pour about 1/2 cup water into the pan. Roast until the chicken is cooked through and the skin is crisp, 20 to 25 minutes. \n            \n\n              Meanwhile, mix the crushed garlic with the remaining 1 teaspoon ginger, the zest of 1 lime and juice of 2 limes. Whisk in the vegetable oil. Shave the carrots into ribbons with a vegetable peeler and toss with the dressing. Add the cilantro and 1/2 teaspoon salt and toss. Serve the chicken with the carrot-ginger salad.  \n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "butter oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "ginger", "quantity": 4.0}, {"food": "grape juice", "quantity": 3.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "carrots", "quantity": 1.0}, {"food": "", "quantity": 2.0}], "title": "\nThai Chicken with Carrot-Ginger Salad\n"}, {"directions": "\n\n              Fill a cocktail shaker or small pitcher with ice. Add the rum, lemongrass syrup, and lime juice. Cover and shake vigorously, or stir, until combined and chilled, about 30 seconds. (In general, by the time the shaker mists up the drink is ready.) Strain into a chilled cocktail glass. Garnish with lime on the rim or the lemongrass spear in the drink. Serve.\n            \n\nFresh Lemongrass Syrup:\n\n\n              Place the lemongrass, water, and sugar into a saucepan and bring to a boil. Reduce heat, and simmer, partially covered, for 15 minutes. Strain the mixture and cool. Cover and refrigerate for up to a week.\n            \n\n              Yield: 2 cups\n            \n", "ingredients": [{"food": "coconut water", "quantity": 2.5}, {"food": "", "quantity": 1.5}, {"food": "lime juice", "quantity": 1.0}, {"food": "lime", "quantity": 1}, {"food": "", "quantity": 2.0}, {"food": "coconut water", "quantity": 2.0}, {"food": "sugar", "quantity": 1.0}], "title": "\nThai Coco Cocktail\n"}, {"directions": "\n\n              Cut off the corn kernels; set aside. Combine the cobs, 1 cup potatoes, 1/2 cup scallions, 1 tablespoon ginger, the garlic, peppercorns and 5 cups water in a pot. Smash the lemongrass, if using, and add to the pot. Bring to a boil, then simmer for 25 to 30 minutes.\n            \n\n              About 10 minutes before the broth is finished, melt the butter over medium-high heat in a separate pot. Add the remaining 1 cup potatoes, season with salt and cook until slightly soft, 5 minutes. Add the remaining 1 tablespoon ginger and the jalapeno; cook 1 minute. Add the corn kernels; cook until the vegetables are just tender, 3 to 4 minutes.\n            \n\n              Strain the broth, pressing out as much liquid as possible; discard the solids. Add 2 cups of the strained broth to the potatoes and corn; bring to a boil, cover and simmer for 10 minutes. Add the coconut milk, basil and mint; season with salt. Stir until simmering. Remove from the heat and add the radishes, cilantro and lime juice. Top with diced tomato and the remaining 1/4 cup scallions and serve with lime wedges.\n            \n\n              Per serving: Calories 407; Fat 32 g (Saturated 25 g); Cholesterol 30 mg \n            \n\n              Photograph by Antonis Achilleos \n            \n", "ingredients": [{"food": "corn bran", "quantity": 4.0}, {"food": "sweet potatoes", "quantity": 2.0}, {"food": "", "quantity": 0.75}, {"food": "ginger", "quantity": 2.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "black bean mango", "quantity": 8.0}, {"food": "", "quantity": 1.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "coconut milk", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 8.0}, {"food": "chrysanthemum leaves", "quantity": 8.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "", "quantity": 0.25}, {"food": "lime", "quantity": 0.5}, {"food": "diced chicken", "quantity": 1.0}], "title": "\nThai Corn Chowder\n"}, {"directions": "\n\n              Mix 1/2 cup mayonnaise, 1 tablespoon ketchup, 2 teaspoons red curry paste, 1/2 teaspoon fish sauce and the juice of 1 lime. Season with salt.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [], "title": "\nThai Curry Mayo\n"}, {"directions": "\n\n              Heat the vegetable oil in a large pot over medium-high heat. Add the celery, mushrooms and curry powder; cook, stirring, until the curry powder is toasted, 1 to 2 minutes. Add the chicken broth, coconut milk, 1 tablespoon fish sauce and 1 cup water and bring to a simmer.\n            \n\n              Add the green beans and bell pepper to the pot, reduce the heat to medium low and simmer until the vegetables are crisp-tender, about 3 minutes. Add the dumplings and cook until tender, about 4 minutes. Stir in the lime juice. Season the soup with salt and add more fish sauce to taste, if desired. Top with sliced scallions and serve with lime wedges.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "curry powder", "quantity": 1.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "coconut milk", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "fava beans", "quantity": 4.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "turkey pot pie", "quantity": 1.0}, {"food": "lime", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "dessert topping", "quantity": 1}], "title": "\nThai Dumpling Soup\n"}, {"directions": "\n\n              Rub the fish with 1 tablespoon curry paste and the lime zest in a bowl. Cover and refrigerate while you cook the vegetables.\n            \n\n              Heat the vegetable oil in a large saucepan over medium-high heat. Add the onion, bell peppers, half of the jalapeno and a pinch of salt. Cook, stirring, until the vegetables are just crisp-tender, about 2 minutes. Add the remaining 1 tablespoon curry paste and cook, stirring, until lightly browned, about 1 minute.\n            \n\n              Add the squash, coconut milk and 2 cups water to the saucepan and stir to combine. Bring to a boil, then cover, reduce the heat to medium low and simmer until the squash is almost tender, 12 to 15 minutes. Add the fish, cover and simmer until just opaque, about 8 minutes. Stir in the cilantro and season with salt. Serve over rice; top with the remaining jalapeno.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "vegetarian fillets", "quantity": 1.5}, {"food": "almond paste", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "squash", "quantity": 1.0}, {"food": "coconut milk", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "crisped rice bar", "quantity": 3.0}], "title": "\nThai Fish Curry\n"}, {"directions": "\n\n              Heat a grill to medium high. Bring a medium pot of water to a boil. Add the noodles and cook as the label directs. Drain and rinse under cold water. Set aside in a colander to drain thoroughly.\n            \n\n              Whisk the lime juice, 3 tablespoons water, the sugar, sambal oelek and fish sauce in a large bowl. Add the cucumber, onion, watermelon and noodles. Season with salt and pepper and toss; set aside.\n            \n\n              Season the steak with salt and pepper. Brush the grill with vegetable oil. Grill the steak until marked, about 3 minutes per side for medium rare. Transfer to a cutting board and let rest 5 minutes, then thinly slice.\n            \n\n              Add all but a few tablespoons cilantro to the noodle salad and toss. Top with the steak and the remaining cilantro.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "rice noodles", "quantity": 0.5}, {"food": "lime juice", "quantity": 0.25}, {"food": "sugar", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "watermelon seed krnls", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 1.5}, {"food": "vegetable oil", "quantity": 1}, {"food": "", "quantity": 0.5}], "title": "\nThai Noodle-Steak Salad\n"}, {"directions": "\n\n              Whisk together the peanut sauce, 2 tablespoons water, the soy sauce, hot pepper flakes and lime juice in a large serving bowl. Set aside. \n            \n\n              Bring a large pot of water to a boil. Stir in the noodles, edamame and bell peppers and cook according to the noodle package directions, or about 4 minutes. Drain the noodles and vegetables. Rinse under cold water to cool; drain well. Transfer to the bowl with the peanut sauce and toss to evenly combine. \n            \n\n              Top with the cilantro leaves and sprinkle with sesame seeds. Serve at room temperature topped with lime wedges for squeezing.\n            \n", "ingredients": [{"food": "Worcestershire sauce", "quantity": 0.3333333333333333}, {"food": "soy sauce", "quantity": 1.0}, {"food": "hot pockets ham cheese stuffed swich", "quantity": 0.5}, {"food": "", "quantity": 1.0}, {"food": "buckwheat", "quantity": 8.0}, {"food": "frozen yogurt", "quantity": 6.0}, {"food": "ruby red grapefruit juice blend", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 0.25}, {"food": "sesame seeds", "quantity": 1.5}, {"food": "", "quantity": 1}], "title": "\nThai Peanut Noodles with Confetti\n"}, {"directions": "\n\n              Mix 1/4 cup lime juice and 1 tablespoon each fish sauce and olive oil; season with salt and sugar. Toss half of the dressing with shaved carrots, sliced red onion and cilantro. Lightly mix 6 ounces ground pork with a big pinch of kosher salt. Form into a ball, then shape into a 3/4-inch-thick patty; make an indentation in the center. Preheat a grill to high; brush the grates and burger with canola oil. Season the patty with salt and grill about 4 minutes per side, basting with the remaining dressing. Serve on a roll with mayonnaise, chili sauce and the slaw.\n            \n", "ingredients": [], "title": "\nThai Pork Burger\n"}, {"directions": "\n\n              Place the pork in the freezer about 10 minutes to make it easier to slice. Soak the noodles in very hot water until just tender, about 10 minutes; drain. Snip the noodles with scissors into shorter lengths. Cut the frozen pork crosswise into 1/4-inch-wide strips.\n            \n\n              Puree the cilantro, lime zest and juice, ginger, garlic, jalapenos, shallots, fish sauce, brown sugar and 1 tablespoon water in a food processor until smooth, scraping down the processor as needed.\n            \n\n              Heat 3 tablespoons peanut oil in a large skillet over high heat. Add half the cilantro mixture and stir-fry 1 minute. Add the pork and stir-fry until no longer pink, 2 to 3 minutes. Transfer the pork with a slotted spoon to a plate. Add the remaining 1 tablespoon peanut oil to the skillet; add the green beans and stir-fry until tender, 4 to 5 minutes. Add the noodles, pork and 2 tablespoons of the remaining cilantro mixture. Cook, tossing with tongs, until heated through, about 2 minutes. Stir in the remaining cilantro mixture to taste.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "low fat big franks", "quantity": 1.0}, {"food": "rice noodles", "quantity": 8.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "grape juice", "quantity": 1.0}, {"food": "luncheon slices", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 3.0}, {"food": "shallots", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 3.0}, {"food": "sugar", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 4.0}, {"food": "fava beans", "quantity": 0.25}], "title": "\nThai Pork and Noodles\n"}, {"directions": "\n\n              Preheat the broiler to high. Line a broiler pan with foil and lightly oil.\n            \n\n              Skim 2 tablespoons cream from the top of the coconut milk (reserve the milk to flavor rice as a side dish, if desired). Fry the coconut cream in a small skillet over medium heat until glossy, about 2 minutes. Stir in the curry paste and cook until fragrant, 2 minutes. Spread the mixture over the fish in the broiler pan; broil until browned and just cooked through, about 15 minutes. Cut the fish into 4 pieces.\n            \n\n              Whisk the lime juice, sugar, 2 tablespoons water and fish sauce in a bowl until the sugar dissolves. Stir in the chili sauce and garlic.\n            \n\n              Arrange the lettuce, watercress, cucumber, scallions, pepper, herbs, nuts and lime wedges with 4 pieces of fish on a platter; drizzle with the Thai salad dressing.\n            \n\n              Photograph by Antonis Achiellos\n            \n", "ingredients": [{"food": "coconut milk", "quantity": 13.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "", "quantity": 1.25}, {"food": "lime juice", "quantity": 0.3333333333333333}, {"food": "sugar", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "watercress", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "barley flour or meal", "quantity": 1.0}, {"food": "barley flour or meal", "quantity": 1.0}], "title": "\nThai Red Curry Mahi Mahi Salad\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              In a small bowl, combine the soy sauce, water, fish sauce, and sugar; set aside. Heat the oil in a large non-stick skillet over medium-high heat. Add the garlic, ginger, and chile flakes, and cook until fragrant, about 30 seconds. Add the shrimp and stir-fry until pink but still translucent in the middle, about 2 minutes. Transfer the shrimp to a medium bowl with a slotted spoon. Add the onion, pepper, and chile to the skillet, and stir-fry until lightly browned, about 2 minutes. Return the shrimp to the pan along with the soy sauce mixture. Bring to a boil, and stir-fry until the sauce glazes the shrimp, about 1 minute more. Add the tomatoes and stir until coated with sauce, about 15 seconds. Remove pan from the heat, stir in the basil, mint, and lime juice. Transfer to a serving dish, serve immediately.\n            \n", "ingredients": [{"food": "soy sauce", "quantity": 2.0}, {"food": "coconut water", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "sugar", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "ginger", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "shrimp", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "yellow rice", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "silk black cherry soy yogurt", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 0.75}, {"food": "chrysanthemum leaves", "quantity": 0.25}, {"food": "lime juice", "quantity": 2.0}, {"food": "crisped rice bar", "quantity": 1}], "title": "\nThai Shrimp Stir-fry with Tomatoes and Basil\n"}, {"directions": "\n\n              Heat 1 tablespoon vegetable oil in a medium nonstick skillet over medium-high heat. Season the steak all over with salt and pepper; cook about 3 minutes per side for medium rare. Transfer to a cutting board and let rest. Reserve the skillet.\n            \n\n              Put the noodles in a bowl; cover with warm water and soak 5 minutes. Meanwhile, heat 1 tablespoon vegetable oil in a large Dutch oven or pot over medium-high heat. Add the ginger, chopped jalapeno, scallion whites, 1 teaspoon salt and a few grinds of pepper. Cook, stirring, until softened, about 2 minutes. Add the chicken broth and 3 cups water; bring to a boil. Reduce the heat to medium low; simmer 10 minutes.\n            \n\n              Meanwhile, wipe out the reserved skillet; heat the remaining 2 tablespoons vegetable oil over medium-high heat. Drain the noodles, pat dry and toss with 1/4 teaspoon salt. Add to the skillet to form a pancake; cook, undisturbed, until slightly golden, 5 minutes. Flip; cook until crisp, 3 more minutes. Transfer to a cutting board; cut into 4 wedges. Slice the steak against the grain.\n            \n\n              Add the snow peas, carrots and half of the cilantro to the soup; simmer until tender, 3 minutes. Divide the soup, steak and fried noodles among bowls. Top with the scallion greens, sliced jalapeno, fried shallots and the remaining cilantro.\n            \n\n              Photographs by Charles Masters\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.25}, {"food": "", "quantity": 12.0}, {"food": "salt", "quantity": 1}, {"food": "rice noodles", "quantity": 4.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "pigeon peas", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "", "quantity": 0.5}, {"food": "fried chicken", "quantity": 0.5}], "title": "\nThai Steak Soup\n"}, {"directions": "\n\n              MAKE THE FILLING: Heat the oil in a large skillet over medium-high heat. Add the garlic, ginger, scallion whites, and seafood seasoning. Cook until the vegetables start to brown, about 5 minutes. Add the turkey and cook, breaking up with a wooden spoon, until golden, about 5 minutes. Stir in the fish sauce and scallion greens and cook until the liquid is almost completely absorbed, about 5 minutes. Stir in the pineapple, cilantro, and lime juice. Remove from the heat.\n            \n\n              SERVE: Spoon the filling over the hot cooked rice and serve with lime wedges and lettuce leaves to make lettuce wraps.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "ginger", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "seasoning mix", "quantity": 1.0}, {"food": "ground turkey", "quantity": 1.5}, {"food": "Worcestershire sauce", "quantity": 0.25}, {"food": "diced chicken", "quantity": 1.5}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "", "quantity": 2.0}, {"food": "crisped rice bar", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 1.0}], "title": "\nThai Turkey Lettuce Wraps\n"}, {"directions": "\n\n              Whisk the lime juice, vegetable oil, curry paste, fish sauce and garlic in a large bowl. Add the shrimp; toss to coat. Refrigerate at least 30 minutes or up to 1 hour. Meanwhile, soak ten 8-inch bamboo skewers in water at least 30 minutes; drain. Thread the shrimp onto the skewers, rubbing any excess marinade on the shrimp; set aside.\n            \n\n              Preheat a grill to medium high. Puree the coconut milk, 2 cups basil, the jalapeno and a pinch of salt in a blender, about 30 seconds. (Do not over-blend or the coconut milk might separate.) Set aside.\n            \n\n              Melt the butter in a medium saucepan over medium-high heat. Add the scallion whites and cook, stirring occasionally, until softened, about 2 minutes. Add the rice, 1/2 cup water, the coconut milk-basil puree and 1/2 teaspoon salt. Bring to a simmer, stirring and scraping the bottom of the pot with a wooden spoon to prevent the rice from sticking. Reduce the heat to low. Cover and cook until the rice is tender and the liquid is absorbed, 15 to 17 minutes. Remove from the heat and keep covered.\n            \n\n              Meanwhile, brush the grill grates with vegetable oil. Grill the shrimp skewers until well marked and just cooked through, 2 to 3 minutes per side. Fluff the rice with a fork, stir in the scallion greens and season with salt. Combine the bean sprouts, peanuts and remaining 2 cups basil. Top the lettuce leaves with the bean sprout mixture and shrimp skewers. Serve with the rice and lime wedges.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "lime juice", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "ruby red grapefruit juice blend", "quantity": 3.0}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "shrimp", "quantity": 1.5}, {"food": "coconut milk", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 4.0}, {"food": "pepper", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "crisped rice bar", "quantity": 1.5}, {"food": "brussels sprouts", "quantity": 2.0}, {"food": "peanuts", "quantity": 0.5}, {"food": "chrysanthemum leaves", "quantity": 1}], "title": "\nThai-Style Basil Shrimp with Basil-Coconut Rice\n"}, {"directions": "\n\n              Preheat a grill for cooking over medium heat. Whisk together the ginger, 2 tablespoons coconut milk, 1/4 cup fish sauce, 2 tablespoons honey, juice of 1 lime, half the minced garlic, 1 teaspoon salt and a few grinds of pepper in a large bowl. Pierce the skin of the drumsticks all over with the tip of a knife or fork. Toss the drumsticks with the marinade to coat and set aside.\n            \n\n              Meanwhile, heat the canola oil in a small saucepan over medium heat and add the remaining garlic. Cook, stirring often, until the garlic is golden, about 30 seconds. Remove from the heat and whisk in the remaining 1/2 cup coconut milk, 1 teaspoon fish sauce, 1 tablespoon honey and juice of 2 limes. Whisk in the peanut butter and 1 tablespoon water. Stir until well combined and season with 1/4 teaspoon salt. Set aside.\n            \n\n              Grill the drumsticks, turning halfway through and basting twice with the marinade, until they are charred and crisp, 8 minutes. (Discard the remaining marinade.) Reduce the heat to low, then cover and cook until the drumsticks are tender, crisp and cooked through, 25 to 30 minutes. Remove the drumsticks to a bowl. Add half of the peanut sauce and toss to coat. Sprinkle with the cilantro leaves and serve with the lime wedges and remaining peanut sauce on the side.\n            \n", "ingredients": [{"food": "ginger", "quantity": 3.0}, {"food": "coconut milk", "quantity": 0.5}, {"food": "Worcestershire sauce", "quantity": 0.25}, {"food": "honey smoked ham", "quantity": 3.0}, {"food": "", "quantity": 3.0}, {"food": "garlic powder", "quantity": 6.0}, {"food": "black bean mango", "quantity": 1}, {"food": "diced chicken", "quantity": 8.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "peanut butter ", "quantity": 0.3333333333333333}, {"food": "chrysanthemum leaves", "quantity": 0.25}, {"food": "", "quantity": 1}], "title": "\nThai-Style Satay Drumsticks\n"}, {"directions": "\n\n              Cut the pineapple into bite size wedges or slices.\n            \n\n              Put the salt, cayenne pepper, mint, cilantro, and limes into small bowls. Squeeze a bit of lime juice onto the fruit. Then lightly dip the pineapple into a little salt and as much cayenne as you like and finish with the mint and cilantro.\n            \n", "ingredients": [{"food": "pineapple chunks", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "pepper", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "", "quantity": 1}], "title": "\nThai-style Pineapple Snack\n"}, {"directions": "\nSpecial equipment: 4 1/2-inch round biscuit cutter\n\n              Preheat the oven to 350 degrees F and line a baking sheet with parchment paper.\n            \n\n              Roll out the pie crusts with a rolling pin on a lightly floured surface to 1/8 inch thick. Cut out rounds of dough with a 4 1/2-inch round biscuit cutter and transfer them to the prepared baking sheet. Gather and reroll the scraps if necessary; you should have a total of 12 rounds. \n            \n\n              Spread 1 teaspoon sweet potato in an even layer over half of each round, leaving a 1/4-inch border around the edge. Top each with 2 teaspoons stuffing, then 2 teaspoons turkey, and finally 1 teaspoon cranberry sauce. (You may redistribute some of the filling among the rounds so all the piles are even.) Whisk together the egg and milk in a small bowl to make an egg wash. Brush the egg wash around the edges of each dough round.\n            \n\n              Fold over each dough round to cover the filling, creating 12 half-moon shapes. With your fingers, press the edges together to seal, and then press with a fork to seal securely. \n            \n\n              Brush the top of each hand pie with the remaining egg wash. Make 3 small slits with a small paring knife on the top of each pie to let the steam escape. Bake until the dough is cooked through and golden brown, about 30 minutes. Serve warm with extra cranberry sauce and gravy on the side for dipping.\n            \n", "ingredients": [{"food": "pie crust", "quantity": 14.0}, {"food": "potato flour", "quantity": 1}, {"food": "sweet potatoes", "quantity": 0.25}, {"food": "bread stuffing", "quantity": 0.5}, {"food": "diced chicken", "quantity": 0.75}, {"food": "Worcestershire sauce", "quantity": 0.25}, {"food": "egg substitute", "quantity": 1.0}, {"food": "whole milk", "quantity": 1.0}, {"food": "gravy", "quantity": 1}], "title": "\nThanksgiving Leftovers Hand Pies\n"}, {"directions": "\n\n              In a small saucepan, combine the milk, 3 tablespoons butter, and sugar. Place over medium-high heat and cook, stirring, until the butter has melted. Remove from the heat and cool to about 110 degrees F. Scatter the yeast over the surface of the liquid and set aside until foamy, about 10 minutes.\n            \n\n              Meanwhile, in large bowl, whisk together the flour and salt and set aside.\n            \n\n              Pour the milk and yeast mixture into the bowl of flour and mix until a soft, ragged mixture is formed. Transfer the flour mixture to a well-floured work surface and knead by hand until a soft, elastic dough is formed, about 10 minutes. Transfer the dough to a lightly oiled bowl, cover with a kitchen towel and place in a warm spot, until puffed and doubled in size, about 2 hours.\n            \n\n              Place a rack in the center of the oven and preheat to 400 degrees F. Transfer the dough to the work surface and, using your hands, gently flatten into a disc. Divide the dough into 12 equal pieces. Using your hands, round each dough piece into a ball.\n            \n\n              Butter a buttered 9 by 13 by 2-inch baking dish. Place the balls of dough, seam side-down, in 3 rows of 4 each. Cover with a kitchen towel and place in a warm spot until they've risen almost to the top of the baking dish, about 2 to 2 1/2 hours.\n            \n\n              Melt the remaining 4 tablespoons butter and liberally brush the rolls with it. Bake until golden brown, about 25 minutes.\n            \n\n              Remove the rolls from the oven and let cool slightly. Transfer the rolls to a cooling rack to cool completely before serving.\n            \n", "ingredients": [{"food": "milk", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 7.0}, {"food": "sugar", "quantity": 3.0}, {"food": "yeast extract spread", "quantity": 0.25}, {"food": "potato flour", "quantity": 5.0}, {"food": "salt", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1}], "title": "\nThanksgiving Rolls\n"}, {"directions": "\nSpecial equipment: an instant-read thermometer and a fat separator\n\n              For the turkey breast: Prepare the turkey breasts for brining 1 day in advance. Bring 1 gallon of water to a boil in a large pot and whisk in the full jar of turkey brine mix. Cook, stirring, until the brine mix is dissolved then remove from the heat. Add 2 gallons of ice and stir until dissolved and the liquid is cool to the touch. Put the turkey breasts in the brine, cover and refrigerate for 12 to 24 hours.\n            \n\n              Remove the turkey breasts from the brine and place in a colander. Rinse thoroughly, then transfer to a paper-towel-lined baking sheet. Dry both turkey breasts with paper towels and use your fingers to create a pocket between the breast meat and skin. Coat each breast with the softened butter, being sure to push the butter into the pocket underneath the skin. \n            \n\n              Preheat the oven to 350 degrees F. Drizzle 3 tablespoons of the oil onto a baking sheet.\n            \n\n              Put the carrots, garlic, celery, lemon and onion on the baking sheet. Sprinkle generously with salt and pepper. Toss the vegetables to coat with the oil and spread in an even layer. Put the rosemary, thyme and sage on top of the vegetables and season with 1 tablespoon of the poultry seasoning. Put both turkey breasts on top skin-side up and season with the remaining poultry seasoning. Drizzle the remaining 1 tablespoon oil over the turkey breasts and roast until the skin is crisp and an instant-read thermometer inserted in the thickest part of the breasts reads 165 degrees F, about 1 hour. \n            \n\n              Allow the roasted turkey to rest on the baking sheet for 15 to 20 minutes. Transfer to a cutting board. Pour the juices remaining in the baking sheet into a fat separator for use in the turkey gravy. \n            \n\n              For the biscuits: Separate the dough into biscuits and arrange them on a parchment-lined baking sheet. Brush the top of each biscuit with melted butter and sprinkle each with 1 tablespoon grated Cheddar. Bake according to the package directions until golden brown. Set aside and keep warm. \n            \n\n              For the home fries: Put the frozen potato chunks on a baking sheet. Drizzle with the oil and sprinkle with salt and pepper. Toss to coat the potatoes and roast according to the package directions until golden brown and crispy. Set aside and keep warm. \n            \n\n              For the turkey gravy: Put the turkey gravy in a small saucepan over medium heat. Whisk in the chicken stock and the defatted liquid from the baking sheet. Cook about 3 minutes. Add the Cheddar and cook, stirring, until melted and smooth, about 2 minutes more. Stir in the dried sage and a pinch of black pepper. Set aside and keep warm. \n            \n\n              For the cranberry relish: Stir together the cranberry sauce, lemon zest, cinnamon, a pinch of salt and 1/4 teaspoon pepper in a medium bowl. \n            \n\n              To assemble the sandwiches: Slice the turkey breasts into 1/4- to 3/8-inch-thick slices and halve each biscuit. Melt the butter in a large nonstick skillet over medium-low heat. Working in batches, fry the eggs until the whites are set and the yolks are runny, about 3 minutes each. Sprinkle each egg with a pinch of salt and black pepper.\n            \n\n              Place a heaping tablespoon of cranberry sauce on the bottom half of each biscuit. Top the cranberry sauce with 1/3 cup home fries. Top the home fries with 3 slices of roasted turkey breast. Drizzle each sandwich with 2 tablespoons of warm gravy and top with more cranberry sauce. Gently place a fried egg on top of each and sprinkle with the parsley. Top each sandwich with the top half of the biscuits and serve immediately.\n            \n", "ingredients": [{"food": "smoked turkey roll", "quantity": 11.0}, {"food": "smoked turkey roll", "quantity": 3.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 4.0}, {"food": "carrots", "quantity": 4.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "celery seed", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "rosemary", "quantity": 4.0}, {"food": "thyme", "quantity": 4.0}, {"food": "sage", "quantity": 2.0}, {"food": "poultry seasoning", "quantity": 2.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 16.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "", "quantity": 0.5}, {"food": "potato flour", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "smoked turkey roll", "quantity": 12.0}, {"food": "diced chicken", "quantity": 0.25}, {"food": "meat drippings ", "quantity": 0.3333333333333333}, {"food": "sage", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "Worcestershire sauce", "quantity": 14.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "butter oil", "quantity": 2.0}, {"food": "eggs", "quantity": 8.0}, {"food": "black bean mango", "quantity": 1}, {"food": "parsley", "quantity": 0.25}], "title": "\nThanksgiving Turkey Biscuit Sandwiches\n"}, {"directions": "\n\n              1. In a large sauce pan, combine wild rice, 4 cups of stock and salt, to taste. Bring to a boil over high heat. Reduce heat to maintain a gentle simmer, cover, and cook until tender, about 1 hour. Drain and transfer rice to a large bowl. \n            \n\n              2. In a medium skillet, heat 1 tablespoon butter over medium heat and add sausage meat. Cook, breaking it up with a wooden spoon, until it is lightly browned, about 10 minutes. Drain off excess fat, and stir sausage into rice. \n            \n\n              3. Heat 2 tablespoons of butter in skillet over medium-low heat. Add onions, and cook until golden, about 15 minutes. Add thyme and cook 2 minutes more. Stir into rice mixture. \n            \n\n              4. Preheat oven to 350 degrees F. Melt remaining butter in skillet over medium heat and add mushrooms. Cook until wilted and lightly browned, about 10 minutes. Stir into rice with parsley and the remaining 3/4 cup of stock. Season with salt and pepper, to taste. Transfer to a 9- by 13-inch casserole dish, cover with foil, and bake until heated through about 30 minutes. \n            \n", "ingredients": [{"food": "wild rice", "quantity": 1.3333333333333333}, {"food": "barley flour or meal", "quantity": 4.75}, {"food": "black bean mango", "quantity": 1}, {"food": "butter oil", "quantity": 5.0}, {"food": "pork turkey sausage", "quantity": 12.0}, {"food": "mushrooms", "quantity": 12.25}, {"food": "chrysanthemum leaves", "quantity": 3.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}], "title": "\nThanksgiving Wild Rice\n"}, {"directions": "\n\n              In a large sauce pan, combine the wild rice, 4 cups of the stock and salt to taste. Bring to a boil over high heat. Reduce the heat to maintain a gentle simmer, cover, and cook until tender, about 60 minutes. Drain and transfer the rice to a large bowl. In a medium saute pan, heat 1 tablespoon of the butter over medium heat and add the sausage meat. Cook, breaking it up with a wooden spoon, until it loses its raw color, about 10 minutes. Drain off excess fat, and stir the sausage meat with the rice. In the same pan, heat 2 tablespoons of the butter over medium-low heat, add the onions, and cook until golden, about 15 minutes. Add the thyme and cook 2 minutes more. Stir the onion mixture with the rice. Preheat the oven to 350 degrees F. Melt the remaining butter in the same pan, over medium heat, and add the mushrooms. Cook until wilted and lightly browned, about 10 minutes. Add to the rice. Add the parsley and 3/4 cup of stock. Season the rice mixture with salt and pepper to taste. Transfer the mixture to a 9- x 13-inch casserole dish, cover with foil, and bake until heated through about 30 minutes. Serve.\n            \n\n              Copyright 2001 Television Food Network, G.P. All rights reserved. \n            \n", "ingredients": [{"food": "wild rice", "quantity": 1.3333333333333333}, {"food": "barley flour or meal", "quantity": 4.75}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 5.0}, {"food": "pork turkey sausage", "quantity": 12.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "mushrooms", "quantity": 12.25}, {"food": "chrysanthemum leaves", "quantity": 3.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nThanksgiving Wild Rice\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: 2 half-sheet pans (about 18 by 13 inches each) and a small oven-proof ceramic baking dish\n\n              Position the oven racks in the upper and lower thirds of the oven and preheat to 375 degrees F. Butter half of a sheet pan crosswise with 1 tablespoon of the softened butter.\n            \n\n              Melt 4 tablespoons butter in a large nonstick skillet over medium heat. Add the celery and onion and cook, stirring occasionally, until softened, about 5 minutes. Add the chicken broth, chestnuts, sage, thyme, 3/4 teaspoon salt and a few grinds of pepper and bring to a simmer. Turn off the heat and set aside. \n            \n\n              Whisk the egg in a large bowl, add the bread cubes and the vegetable mixture and stir to combine. Transfer the stuffing mixture to the buttered half of the prepared sheet pan, spreading it in an even layer over just the buttered part of the pan. Dot the stuffing with 2 tablespoons butter cut into small cubes.\n            \n\n               Generously sprinkle the turkey breasts on both sides with salt and pepper and put them skin-side up on the other half of the sheet pan next to the stuffing. Rub the skin with 2 tablespoons of the butter.\n            \n\n              Combine the Brussels sprouts, bacon, olive oil, 3/4 teaspoon salt and a few grinds of pepper in a large bowl. Toss to coat and spread out over half of the second sheet pan. Prick the sweet potatoes all over with a fork and arrange them on the other half of the sheet pan next to the Brussels sprouts. Combine the cranberries, sugar and orange zest in a small ovenproof ceramic baking dish, then cover with foil and put on the sheet pan next to the sweet potatoes.\n            \n\n              Put the sheet pan with the turkey and stuffing on the rack in the upper third of the oven, and put the second sheet pan on the rack in the lower third. Cook 30 minutes, then remove both pans from the oven. Stir the Brussels sprouts and cranberry sauce once or twice, mashing the cranberries with the side of the spoon. Tent the stuffing with foil if it has started to brown too quickly. Rotate the pans but return them to their same racks. Continue cooking until the turkey skin is golden brown and crisp, and an instant-read thermometer inserted into the thickest part of the breast reads 160 degrees F, 20 to 30 minutes more. At this point the potatoes should be tender, the stuffing browned in some areas, the Brussels sprouts browned and tender, and the cranberries softened and bubbling. (If the sweet potatoes are undercooked, take them off the pan and put them back in the oven directly on the rack to continue cooking until tender, up to 10 minutes more.)\n            \n\n              Transfer the turkey breasts to a cutting board to rest at least 10 minutes before slicing. Remove the foil from the cranberry sauce and set aside to cool. Use a fork to combine the remaining 2 tablespoons butter and the brown sugar in a small bowl. Split the sweet potatoes, fluff with a fork and stir in the butter and brown sugar mixture; sprinkle with salt. Top with the marshmallows and return to the pan with the Brussels sprouts. Put the dinner rolls on the same pan and return to the oven to warm the marshmallows and rolls, 3 to 5 minutes. Carve the turkey breasts and return them to the sheet pan with the stuffing to serve. Serve with gravy.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.0}, {"food": "celery seed", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.5}, {"food": "chestnuts", "quantity": 1.0}, {"food": "sage", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "egg substitute", "quantity": 1.0}, {"food": "garlic bread", "quantity": 8.5}, {"food": "turkey breast", "quantity": 6.0}, {"food": "brussels sprouts", "quantity": 1.5}, {"food": "bacon", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "sweet potatoes", "quantity": 4.0}, {"food": "cranberries", "quantity": 8.0}, {"food": "sugar", "quantity": 0.5}, {"food": "orange", "quantity": 0.5}, {"food": "sugar", "quantity": 1.0}, {"food": "", "quantity": 0.3333333333333333}, {"food": "pizza rolls", "quantity": 4.0}, {"food": "", "quantity": 1}], "title": "\nThanksgiving on 2 Sheet Pans\n"}, {"directions": "\n\n              Combine 2 cups water with the sugar, peppercorns, allspice and ginger in a small pot. Bring to a simmer over medium-high heat, stirring to dissolve the sugar. Simmer until slightly reduced and a bit syrupy, about 25 minutes. Remove from the heat, cool and then strain. You will have about 1 1/4 cups syrup. \n            \n\n              Mix the ginger syrup and lime juice together. Fill each pint glass halfway with ice and add 2 to 4 tablespoons of ginger syrup, depending on how gingery you want it, to each glass. Pour a bottle of beer over the syrup, and then slowly pour a tablespoonful of dark rum over the top so it floats. Garnish each glass with a lime wedge.\n            \n", "ingredients": [{"food": "sugar", "quantity": 1.0}, {"food": "black bean mango", "quantity": 0.75}, {"food": "allspice", "quantity": 12.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 6.0}, {"food": "lime juice", "quantity": 6.0}, {"food": "", "quantity": 1}, {"food": "", "quantity": 12.0}, {"food": "", "quantity": 6.0}, {"food": "", "quantity": 1}], "title": "\nThe Dark and Shandy\n"}, {"directions": "\n\n              Preheat the oven as directed on the ham package and follow the instructions for baking the ham. Remove the ham from the oven about 30 minutes before the end of the warming time.\n            \n\n              Meanwhile, combine the jam, mustard, and orange zest and juice in a small saucepan over low heat. Cook, stirring, just until the jam melts (do not boil). Spoon half of the glaze over the ham and bake for the remaining 30 minutes.\n            \n\n              Remove the ham from the oven and spoon the remaining glaze on top. Transfer to a cutting board and carve.\n            \n\n              Photograph by Yunhee Kim\n            \n", "ingredients": [{"food": "ham", "quantity": 1.0}, {"food": "jam", "quantity": 1.0}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "orange juice", "quantity": 0.3333333333333333}], "title": "\nThe Deen Brothers' Fig-and-Orange-Glazed Ham\n"}, {"directions": "\n\n              Preheat the broiler and brush a baking sheet with some vegetable oil. Let the ice cream sit at room temperature until soft. Chill a medium stainless steel bowl in the freezer.\n            \n\n              Scatter 2 cups of the marshmallows on the prepared baking sheet and broil, rotating the pan as needed, until very dark and toasted, 3 to 4 minutes. Let cool. Scrape up the marshmallows, transfer them to a cutting board and roughly chop (lightly oil the blade of your knife to help keep the marshmallows from sticking). Transfer the soft ice cream to the frozen bowl, add the chopped marshmallows and stir to combine. Transfer the ice cream to a resealable container and freeze until solid, about 3 hours. The ice cream can be made up to a day ahead.\n            \n\n              Put the chocolate, corn syrup, vanilla and a pinch of salt in a medium bowl. Heat the cream in a microwave-safe bowl in the microwave until very hot, about 1 minute. Pour over the chocolate and let sit for 2 minutes. Stir until all the chocolate is melted and smooth. Pour into a small baking dish and refrigerate until set, about 25 minutes (the chocolate mixture should still be soft and scoopable). The chocolate mixture can be made up to a day ahead.\n            \n\n              Lay the graham crackers out on a baking sheet in a single layer. Spoon a teaspoon of the chocolate mixture onto each graham cracker and gently spread it out to the edges, being careful not to break the cookies.\n            \n\n              Let the ice cream soften slightly at room temperature. Top a graham cracker with about 1/4 cup of the ice cream. Sandwich with a second graham cracker, chocolate-side down, and press some of the remaining untoasted marshmallows into the sides to decorate. Repeat with the remaining graham crackers and immediately freeze until solid, about 1 hour. Once frozen solid, wrap individually and freeze for up to 1 week.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1}, {"food": "ice cream swich", "quantity": 2.5}, {"food": "", "quantity": 4.0}, {"food": "baking chocolate", "quantity": 3.0}, {"food": "silk light vanilla", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "ice cream swich", "quantity": 0.3333333333333333}, {"food": "crackers", "quantity": 9.0}], "title": "\nThe Frozen S'more\n"}, {"directions": "\n\n              Mix the mayonnaise, apple jelly and chives in a large bowl until smooth. Pulse the ham in a food processor until finely chopped but not mushy. Toss the chopped ham, celery, celery leaves and pecans with the mayonnaise mixture until combined.\n            \n\n              Lay 4 slices bread on a clean surface. Layer 2 to 3 slices havarti on each, then top with a scoop of ham salad and 2 lettuce leaves. Close with the remaining 4 slices bread. Cut each sandwich in half.\n            \n\n              Photograph by Lisa Shin\n            \n", "ingredients": [{"food": "mayonnaise dressing", "quantity": 0.5}, {"food": "apple", "quantity": 2.0}, {"food": "barley flour or meal", "quantity": 2.0}, {"food": "ham", "quantity": 0.75}, {"food": "celery seed", "quantity": 1.0}, {"food": "pecans", "quantity": 0.5}, {"food": "garlic bread", "quantity": 8.0}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "chrysanthemum leaves", "quantity": 8.0}], "title": "\nThe Hammy Down\n"}, {"directions": "\n\n              Make the syrup: Combine the sugar and 1/2 cup water in a saucepan over medium heat; cook, stirring, until the sugar dissolves. Remove from the heat and let cool. Transfer the syrup to a food processor or blender, add the ginger and puree until smooth. Let sit 2 to 3 hours, then strain the syrup through a fine-mesh strainer lined with cheesecloth.\n            \n\n              Make the drink: Combine the brandy, vinegar, orange liqueur, honey and about 1 tablespoon of the ginger syrup in a cocktail shaker filled with ice. Shake well, then strain into a rocks glass filled with ice. Garnish with star anise, if desired.\n            \n\n              Photograph by James Wojcik\n            \n", "ingredients": [{"food": "sugar", "quantity": 0.5}, {"food": "diced chicken", "quantity": 1.0}, {"food": "apple", "quantity": 1.5}, {"food": "vinegar", "quantity": 0.75}, {"food": "orange", "quantity": 0.5}, {"food": "honey smoked ham", "quantity": 1.0}, {"food": "anise seed", "quantity": 1}], "title": "\nThe Keats\n"}, {"directions": "\n\n              Stir together the bourbon, sweet vermouth and Aperol. Pour into 4 rocks glasses filled with ice. Garnish with a maraschino cherry.\n            \n", "ingredients": [{"food": "rye grain", "quantity": 10.0}, {"food": "", "quantity": 3.25}, {"food": "", "quantity": 2.25}, {"food": "", "quantity": 1}, {"food": "maraschino cherries", "quantity": 4.0}], "title": "\nThe Little Italy (Manhattan with Aperol)\n"}, {"directions": "\n\n              Position a rack in the center of the oven and preheat to 350 degrees F. Line a 9-by-13-inch glass baking dish with foil leaving a 2-inch overhang on two sides. Grease the foil and dish with 1 tablespoon butter.\n            \n\n              To make the crust, pulse the zest with 1/3 cup of the sugar in a food processor until the sugar is yellow and sandy, 1 to 2 minutes. Add 1 1/2 cups of the flour, the butter, cornstarch and salt and pulse until the dough comes together, about 1 minute. Press the dough evenly into the bottom of the prepared pan. Bake until the crust is golden at the edges and pale golden in the center, about 30 minutes. Transfer to a wire rack.\n            \n\n              Reduce the oven temperature to 300 degrees F. To make the filling, whisk the eggs and egg yolks with the remaining 1 2/3 cups sugar and the remaining 1/2 cup flour in a bowl until smooth. Whisk in 1 cup lemon juice. \n            \n\n              Pour the filling over the warm crust and return to the oven. Bake until the filling is just set, about 30 minutes. \n            \n\n              Cool the lemon bars on a wire rack, 30 minutes, then refrigerate uncovered until firm, at least 1 hour. Lift the bars out of the pan using the foil. Peel off the foil and cut into 24 bars. Dust with confectioners' sugar. Place a piece of gummy lemon candy on top of each square and serve. \n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.5}, {"food": "lemon juice", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "cornstarch", "quantity": 3.0}, {"food": "salt", "quantity": 0.25}, {"food": "eggs", "quantity": 4.0}, {"food": "sugar", "quantity": 1}, {"food": "luncheon slices", "quantity": 8.0}], "title": "\nThe Most-Lemony Lemon Bar of All Time\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: an ice cream maker\n\n              Pour the rose, strawberries, sugar and lemon juice in a blender and puree until smooth. Pour into an ice cream maker and churn on the coldest setting until thick and slushy, 45 minutes to 1 hour (see Cook's Note). Pour into wine glasses and garnish with strawberries.\n            \n", "ingredients": [{"food": "rose hips", "quantity": 750.0}, {"food": "strawberries", "quantity": 2.0}, {"food": "sugar", "quantity": 0.5}, {"food": "lemon juice", "quantity": 0.3333333333333333}], "title": "\nThe New Frose\n"}, {"directions": "\n\n              Oven method (great for a crowd of six or fewer): Put a rimmed baking sheet on the middle rack of the oven and preheat to 450 degrees F. Make one sandwich per person: Sandwich 2 slices of cheese between 2 slices of bread. Spread or brush the outside of the sandwich with 1 tablespoon of fat. Place on the preheated baking sheet and cook until the cheese starts to melt, about 5 minutes. Flip the sandwich and bake until golden brown, an additional 5 minutes.\n            \n\n              Panini press method (for crispy crunchy sandwich that needs minimal attention): Sandwich 2 slices of cheese between 2 slices of bread. Preheat a panini press to medium heat. Spread or brush the outside of the sandwich with 1 tablespoon of fat and place in the press. Close the top and cook until lightly browned and the cheese is melted, 5 to 6 minutes. \n            \n\n              Skillet method (fool-proof and low-tech): Sandwich 2 slices of cheese between 2 slices of bread. Preheat a skillet over medium-low heat. Spread or brush the outside of the sandwich with 1 tablespoon of fat and cook until lightly browned, 3 to 4 minutes. Flip the sandwich, and continue cooking until browned and the cheese is melted, 3 to 4 minutes more.\n            \n\n              Great combos:\n            \n\n              1. Pepper jack and sourdough, brushed with chili oil \n            \n\n              2. American and white bread, brushed with butter\n            \n\n              3. Swiss and rye, brushed with mayo \n            \n\n              4. Cheddar and brioche, brushed with butter\n            \n", "ingredients": [{"food": "macaroni cheese", "quantity": 2.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "butter oil", "quantity": 1.0}], "title": "\nThe Perfect Grilled Cheese\n"}, {"directions": "\n\n              Bake the waffle fries as the label directs. Meanwhile, cook the bacon in a large skillet over medium heat until crisp, about 4 minutes per side. Drain on paper towels, then chop into bite-size pieces. \n            \n\n              Combine the cheddar, mozzarella, cornstarch, pimientos and mustard powder in a food processor and pulse until smooth. Transfer to a medium saucepan; add 1/3 cup water and cook over medium heat, stirring constantly, until the cheese melts and the mixture is smooth, about 5 minutes. Stir in the sour cream and season with salt and pepper. Divide the waffle fries among plates; top with the cheese sauce, bacon and scallions. \n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [{"food": "waffle", "quantity": 1.0}, {"food": "bacon", "quantity": 4.0}, {"food": "cheddar cheese", "quantity": 1.5}, {"food": "macaroni cheese", "quantity": 0.5}, {"food": "cornstarch", "quantity": 1.0}, {"food": "", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.25}, {"food": "sour cream", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}], "title": "\nThe Smotherload\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: a small offset spatula\n\n              Make the cookies: Whisk together the flour, ginger, cinnamon, black pepper, salt, baking soda, allspice, nutmeg, cayenne, and baking powder in a medium bowl.\n            \n\n              Beat the butter and granulated sugar in a large bowl with an electric mixer on medium speed until pale and fluffy, about 3 minutes (scrape down the sides of the bowl, as needed). Beat in the molasses until combined, then the egg (the mixture will look curdled). Add the flour mixture and beat on low speed until the dough comes together. Divide the dough in 2 pieces, flatten each half into a disk and wrap each disk in plastic wrap. Refrigerate at least 2 hours or up to overnight. \n            \n\n              Position 2 racks in the top and bottom thirds of the oven and preheat to 350 degrees F. Line 2 baking sheets with parchment paper.\n            \n\n              Keeping one disk refrigerated, roll the other disk on a well-floured work surface to 1/4 inch thick, sprinkling flour on and under the dough as needed and sliding a spatula underneath every so often to prevent sticking (If the dough looks crackly or breaks apart, press it back together from the outside edge in). Using cookie cutters, cut out gingerbread shapes as close together as possible. Pull away the extra dough around each shape then use a small offset spatula to transfer the shapes to the prepared cookie sheets, spacing them 1 inch apart. Reroll the scraps and cut out more cookies. Freeze the cookies until firm, about 15 minutes. \n            \n\n              Bake the cookies, rotating the baking sheets from top to bottom and from front to back halfway through cooking, until they are slightly firm to the touch but not browned at the edges, about 12 minutes. Repeat the rolling, cutting and baking with the remaining dough disk.  \n            \n\n              Cool the cookies for 5 minutes on the baking sheet then transfer them to a cooling rack to cool completely, about 20 minutes (The cookies will continue to firm as they cool). \n            \n\n              Make the icing: Combine the confectioners' sugar, meringue powder and 3 tablespoons water in a large bowl and beat with an electric mixer on low speed until the frosting thickens, trying not to incorporate too much air. (The icing should be pure white and thick, but not fluffy and bubbly.)\n            \n\n              Scrape the icing into a resealable plastic bag and snip the corner to the desired size. Pipe the icing onto the cookies to decorate, as desired, sticking the candy onto the icing while it is still wet. Let the cookies stand at room temperature until the icing hardens, at least 1 hour.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 3.0}, {"food": "ginger", "quantity": 3.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "allspice", "quantity": 0.5}, {"food": "nutmeg", "quantity": 0.5}, {"food": "", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "butter oil", "quantity": 1.5}, {"food": "sugar", "quantity": 0.75}, {"food": "molasses", "quantity": 0.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 1}], "title": "\nThe Spiciest Gingerbread Cookies Ever\n"}, {"directions": "\n\n              Make the honey syrup: Combine the honey with 1/4 cup hot water and stir until smooth; let cool. (Makes 4 ounces; refrigerate up to 1 month.)\n            \n\n              Combine the rum, lime juice and 1/2 ounce honey syrup in a cocktail shaker; fill with ice. Shake well; strain into a tall glass filled with ice. Top with ginger ale and garnish with cucumber spear.\n            \n", "ingredients": [{"food": "honey smoked ham", "quantity": 0.25}, {"food": "martha white foods", "quantity": 1.5}, {"food": "lime juice", "quantity": 0.75}, {"food": "dessert topping", "quantity": 1}, {"food": "", "quantity": 1}], "title": "\nThe Tax Break\n"}, {"directions": "\n\n              Toppings: Sweet pickle relish, dill pickle spear, pickled peppers, yellow mustard, chopped onion and tomato, celery salt and poppy seeds\n            \n\n              How to Make Classic Potato Skins:\n            \n\n              Pierce 4 large russet potatoes with a fork. Bake directly on the oven rack at 350 degrees until tender, about 1 hour. Let cool, then quarter lengthwise and scoop out the flesh, leaving a 1/4-inch shell. Brush both sides with melted butter and season with salt and pepper. Bake, skin-side up, at 450 degrees until crisp, about 15 minutes. Add your favorite team toppings. (For cheesy skins, flip the baked shells over before topping, sprinkle with 1 cup grated cheddar cheese and bake an extra 5 minutes.)\n            \n\n              Photograph by Karl Juengel/Studio D\n            \n", "ingredients": [], "title": "\nThe Works Potato Skins\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Movie theaters use butter-flavored oil, which has a lower water content than butter so it makes popcorn less soggy. Real clarified butter has the same effect. To make it, melt 2 sticks butter in a glass measuring cup in the microwave. Let sit for a few minutes; the butter will separate into 3 layers. Skim off the top layer of foam, then slowly pour the clarified butter into a heatproof container; discard the bottom layer of milk solids. Use 3 tablespoons hot clarified butter for 10 cups popcorn; refrigerate the rest (it's great for sauteeing).\n            \n\n              Photograph by Burke/Triolo/Jupiter Images\n            \n", "ingredients": [], "title": "\nTheater-Style Buttered Popcorn\n"}, {"directions": "\n\n              Position a rack in the middle of the oven and preheat the oven to 350 degrees F. Line a 13by-9-inch baking pan with foil, letting the excess hang over the edges of the pan by about 1 inch (this will help you lift the bar easily from the pan in one piece). Spray the pan with cooking spray.\n            \n\n              Mix the flour, baking soda and salt in a medium bowl. In a large bowl, whisk the melted butter and sugars until combined. Use a whisk or a rubber spatula to mix in the egg, egg yolk, peanut butter and vanilla until smooth. Fold in the flour mixture until just combined (be careful not to over mix the dough or the bars will be tough). Fold in the chocolate chips and the peanuts.\n            \n\n              Scrape the dough into the prepared pan, pressing and smoothing the top with a rubber spatula. Bake until the top is slightly golden and firm to the touch and the edges are starting to pull away from the sides of the pan, 30 to 35 minutes. Let cool completely on a wire rack.\n            \n\n              Lift up on the foil overhang to remove the bar from the pan, and transfer it to a cutting board. Use a ruler to cut it into 2-inch squares.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 2.25}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 1.5}, {"food": "sugar", "quantity": 0.75}, {"food": "sugar", "quantity": 0.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "peanut butter ", "quantity": 0.6666666666666666}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "peanuts", "quantity": 0.5}], "title": "\nThick and Chewy Peanut Butter Chocolate Chip Bars\n"}, {"directions": "\n\n              Make the dough: Put a pizza stone or inverted baking sheet on the lowest oven rack and preheat to 450 degrees F. Combine the flour, baking powder and salt in a large bowl. Add the water and olive oil and mix to make a shaggy, sticky dough. Turn out onto a lightly floured surface and knead into a smooth and elastic ball, 2 to 3 minutes. Divide the dough in half and shape each half into a flat disk. Wrap each disk in plastic wrap and let rest in a warm place, 15 minutes.\n            \n\n              Brush two large sheets of parchment paper with olive oil. Place a ball of dough between the parchment, oiled-sides in; use a rolling pin to roll the dough into a 12- to 14-inch round, about 1/8 inch thick. Remove the top piece of parchment and transfer the dough (and the bottom piece of parchment) to a pizza peel or inverted baking sheet.\n            \n\n              Spread 1/3 cup sauce on the crust; scatter with 3/4 cup mozzarella. Slide the pizza (on the parchment) onto the hot stone. Bake until the crust is crisp and golden brown and the cheese is bubbling, 10 to 12 minutes. Transfer to a cutting board and let cool 1 to 2 minutes before slicing. Repeat to make the second pizza.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "salt", "quantity": 0.75}, {"food": "coconut water", "quantity": 0.75}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "Worcestershire sauce", "quantity": 0.6666666666666666}, {"food": "macaroni cheese", "quantity": 1.5}], "title": "\nThin & Crispy Pizza\n"}, {"directions": "\nSpecial equipment: 12-cup trifle dish\n\n              Prepare a 9-by-13-inch baking pan and the cake mix according to package directions. Stir in 1 cup of the chopped cookies into the batter. Bake the cake according to package directions and let cool completely. Once cool, cut the cake into 1-inch square pieces, set aside.\n            \n\n              Whip together the cream, corn syrup and vanilla together, in a medium bowl, with an electric mixer on medium-high speed until medium peaks form. \n            \n\n              Assemble the trifle: Layer half of the cake pieces on bottom of the trifle dish. Evenly spread half of the whipped cream over the cake and to the edge of the trifle dish. Sprinkle all but 2 tablespoons of the chopped cookies over the whipped cream. Dollop all of the vanilla pudding over the cookie layer and spread evenly to the edge of the trifle dish. Evenly top with the remaining cake. Then dollop with the remaining whipped cream. Sprinkle with the reserved cookies and mint. \n            \n\n              Refrigerate for at least 4 hours up to overnight. Use a long-handled serving spoon to scoop.\n            \n", "ingredients": [{"food": "shortening cake mix", "quantity": 15.0}, {"food": "chocolate chip cookies", "quantity": 9.0}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "silk light vanilla", "quantity": 0.3333333333333333}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}], "title": "\nThin Mint Trifle\n"}, {"directions": "\n\n              Whisk the milk, eggs, melted butter and vanilla in a large bowl until combined. Add the flour, sugar and salt; whisk until the batter is smooth, with no lumps.\n            \n\n              Heat a medium nonstick skillet over medium heat; lightly brush with butter. Add 1/4 cup batter; swirl the skillet to coat the bottom with a thin layer of the batter. Cook until set on top and lightly browned around the edge, about 1 1/2 minutes. Gently lift and flip the pancake with a rubber spatula; cook until just browned on the other side, about 15 more seconds. Transfer to a plate and repeat with the remaining batter (do not brush the skillet with more butter). Fold into quarters and serve with butter and syrup or jam.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [{"food": "milk", "quantity": 2.0}, {"food": "eggs", "quantity": 2.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "potato flour", "quantity": 1.25}, {"food": "sugar", "quantity": 3.0}, {"food": "salt", "quantity": 0.25}, {"food": "syrup", "quantity": 1}], "title": "\nThin and Lacy Pancakes\n"}, {"directions": "\n\n              Place a pizza stone or inverted baking sheet in the lower third of the oven and preheat to 450 degrees F. Mix the flour, baking powder and 1/2 teaspoon salt in a medium bowl. Stir in 1/3 cup water and 2 tablespoons olive oil until a shaggy dough forms. Turn out onto a lightly floured surface and knead into a smooth ball, 1 to 2 minutes. Wrap in plastic wrap and set aside for 15 minutes at room temperature.\n            \n\n              Meanwhile, toss the beans, giardiniera and brine, basil, parsley and 1 tablespoon olive oil in a large bowl. Season with salt and pepper; set aside. Slice the tomatoes, place on paper towels and sprinkle lightly with salt; set aside.\n            \n\n              Roll out the dough into a 12-inch round on a lightly oiled piece of parchment paper. Slide the parchment with the dough onto an inverted baking sheet. Rub 1 tablespoon olive oil and the garlic all over the dough. Sprinkle the parmesan on top. Slide onto the hot stone and bake until browned and crisp, about 8 minutes.\n            \n\n              Remove the crust from the oven and top with the mozzarella, tomatoes and basil leaves. Drizzle with the remaining 1 tablespoon olive oil and season with salt and pepper. Serve with the bean salad.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 5.0}, {"food": "fava beans", "quantity": 1.0}, {"food": "vegetables", "quantity": 0.6666666666666666}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "parsley", "quantity": 2.0}, {"food": "pepper", "quantity": 1}, {"food": "tomatoes", "quantity": 3.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "parmesan cheese", "quantity": 0.25}, {"food": "macaroni cheese", "quantity": 8.0}], "title": "\nThin-Crust Caprese Pizza\n"}, {"directions": "\n\n              Line a large rimmed baking sheet with foil and generously butter it. Working in batches, cook the bacon in a large skillet over medium heat, turning occasionally, until crisp, 9 to 11 minutes. Drain on paper towels, then break each slice in half.\n            \n\n              Combine the sugar, corn syrup and 1/2 cup water in a medium heavy-bottomed saucepan. Cook, stirring occasionally, over medium-high heat until a candy thermometer registers 260 degrees F, 10 to 12 minutes.\n            \n\n              Remove from the heat and add the butter, nuts and 1 teaspoon salt. Stir once, then continue cooking over medium-high heat, undisturbed, until the syrup turns golden and the candy thermometer registers 285 degrees F, 5 to 10 more minutes. Carefully stir in the prepared bacon, the vanilla and baking soda. (The mixture will foam a bit.) Cook, stirring several times, until the foam subsides and the mixture darkens slightly, 1 to 2 more minutes.\n            \n\n              Pour the mixture onto the prepared baking sheet, then carefully tilt to spread it into a thin layer. Use tongs to redistribute the bacon pieces if necessary. Let cool completely, then break into pieces.\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 1.0}, {"food": "bacon", "quantity": 16.0}, {"food": "sugar", "quantity": 1.5}, {"food": "silk light vanilla", "quantity": 0.75}, {"food": "mixed nuts", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "vanilla extract", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 1.5}], "title": "\nThis Brittle Piggy\n"}, {"directions": "\n\n              Make a paste with the garlic and 1/4 teaspoon of the salt by crushing them with the side of a chef's knife. In a small mixing bowl, whisk together the garlic, mayonnaise, chili sauce, ketchup, onion, relish and egg until combined. Season with salt and pepper to taste. Use now or store covered in the refrigerator for up to 2 days.\n            \n", "ingredients": [{"food": "garlic powder", "quantity": 0.5}, {"food": "salt", "quantity": 0.25}, {"food": "barley flour or meal", "quantity": 0.75}, {"food": "Worcestershire sauce", "quantity": 0.25}, {"food": "", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.5}, {"food": "pickle relish", "quantity": 2.0}, {"food": "egg substitute", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}], "title": "\nThousand Island Dressing\n"}, {"directions": "\n\n              Bring a pot of salted water to a boil. Set up a large bowl of ice water. Add the fresh beans to the boiling water, and cook until crisp-tender, about 4 to 5 minutes. Drain and plunge the beans into the ice water to stop the cooking and set their color. Drain. \n            \n\n              In a medium bowl, combine the beans and the onion. In a small saucepan, bring the sugar, vinegar, oil, and salt to a simmer. Pour the liquid over the beans. Marinate the beans at room temperature for 1 hour, tossing several times. Just before serving, season with salt and pepper to taste, add the parsley. Serve. \n            \n", "ingredients": [{"food": "fava beans", "quantity": 0.5}, {"food": "fava beans", "quantity": 0.5}, {"food": "fava beans", "quantity": 15.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "sugar", "quantity": 0.25}, {"food": "vinegar", "quantity": 0.3333333333333333}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "salt", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "parsley", "quantity": 1.0}], "title": "\nThree Bean Salad\n"}, {"directions": "\n\n              Bring a large pot of salted water to a boil. Make the brine: Combine the vinegar, half of the lemon juice, 1/2 cup water, the sugar, coriander, 1 teaspoon salt and a pinch of pepper in a saucepan. Bring to a boil and cook 1 to 2 minutes. Put the bell pepper and red onion in a bowl; pour in the brine. Let cool to room temperature.\n            \n\n              Cook the green and wax beans in the boiling water until crisp-tender, 3 to 4 minutes. Drain and rinse. Transfer to a large bowl along with the black beans.\n            \n\n              Reserve 1/4 cup brine, then drain the bell pepper and onion and add to the beans. Make the vinaigrette: Whisk the reserved brine, the remaining lemon juice and the mustard in a bowl, then whisk in the olive oil until smooth. Toss with the bean mixture. Cover and refrigerate at least 1 hour. Stir in the cilantro and season with salt and pepper before serving.\n            \n\n              Photograph by Kana Okada\n            \n", "ingredients": [{"food": "salt", "quantity": 1}, {"food": "vinegar", "quantity": 0.5}, {"food": "", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "seeds", "quantity": 0.5}, {"food": "pepper", "quantity": 1}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "fava beans", "quantity": 0.5}, {"food": "fava beans", "quantity": 0.5}, {"food": "fava beans", "quantity": 1.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "", "quantity": 2.0}], "title": "\nThree-Bean Salad\n"}, {"directions": "\n\n              Put a pizza stone or inverted baking sheet on the lowest oven rack and preheat to 475 degrees F for at least 15 minutes. Meanwhile, roll out the dough into a 9-inch round on a lightly floured surface. Lightly dust a pizza peel or another inverted baking sheet with flour; lay the round of dough on top and set aside. Cook the bacon in a large skillet over medium heat, stirring, until crisp, about 6 minutes. Remove with a slotted spoon and drain on paper towels. Combine the tomato sauce, olive oil, garlic and oregano in a medium bowl; season with salt and pepper. Slide the dough directly onto the hot stone or baking sheet and bake until lightly golden and puffy, about 7 minutes. Remove from the oven and let cool slightly, then carefully slice the crust in half horizontally with a serrated knife to make 2 thin crusts. Turn the crusts cut-side up. Spread with the sauce mixture, then top evenly with the mozzarella, cheddar and bacon. Slide the pizzas back onto the hot stone or baking sheet; bake until the cheese melts and the crust is golden, about 8 more minutes. Sprinkle with the parmesan.\n            \n\n              Photograph by Sam Kaplan\n            \n", "ingredients": [{"food": "pizza rolls", "quantity": 1.0}, {"food": "potato flour", "quantity": 1}, {"food": "bacon", "quantity": 4.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "cheddar cheese", "quantity": 1.0}, {"food": "parmesan cheese", "quantity": 1.0}], "title": "\nThree-Cheese Bacon Pizza\n"}, {"directions": "\n\n              Preheat the oven to 450 degrees F. Line a baking sheet with aluminum foil.\n            \n\n              Make the filling: Mix the mozzarella, ricotta, basil, scallions, 1/4 cup parmesan and the breadcrumbs in a medium bowl until combined. Divide the pizza dough into 4 equal pieces. Roll out each piece on a lightly floured surface into a 7-to-8-inch round.\n            \n\n              Spoon one-quarter of the filling onto one half of each dough round, leaving a 1/2-inch border. Lightly brush the edges of the dough with some of the beaten egg; fold the dough over the filling and crimp the edges with a fork to seal. Transfer the calzones to the prepared baking sheet.\n            \n\n              Brush the calzones with the remaining beaten egg and cut 2 slits in the top of each to let steam escape. Sprinkle the calzones with the remaining 2 teaspoons parmesan, then bake until golden brown and cooked through, 18 to 20 minutes. Serve with marinara sauce, the salami and giardiniera.\n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [{"food": "macaroni cheese", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 0.5}, {"food": "basil", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "parmesan cheese", "quantity": 0.25}, {"food": "", "quantity": 1.0}, {"food": "pizza rolls", "quantity": 1.0}, {"food": "potato flour", "quantity": 1}, {"food": "egg substitute", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1}, {"food": "sliced salami", "quantity": 4.0}, {"food": "vegetables", "quantity": 1}], "title": "\nThree-Cheese Calzones\n"}, {"directions": "\n\n              Make the Basic Dinner-Roll Dough, using the Parmesan as the mix-in. Let rise as directed.\n            \n\n              Lightly coat 2 baking sheets with cooking spray. Turn the dough out onto a lightly floured surface and divide in half. Roll or stretch each half into a 12-inch round, about 1/4 inch thick. Brush each round with some of the beaten egg and sprinkle with the Havarti and Cheddar, leaving a 1-inch border. Lightly press on the cheese to ensure it sticks.\n            \n\n              Cut each round into 12 wedges with a pizza cutter or chef's knife. Starting from the wide ends, roll up each wedge. Place the rolls on the prepared baking sheets, bending the ends slightly to create a crescent. Loosely cover with plastic wrap; let stand until puffy, about 45 minutes.\n            \n\n              Position racks in the upper and lower thirds of the oven; preheat to 375 degrees F. Combine the sesame seeds, poppy seeds and salt in a small bowl. Brush the crescents with the remaining beaten egg and sprinkle with the seed mixture. Bake, switching and rotating the baking sheets halfway through, until the rolls are golden brown, about 25 minutes. Let cool 5 minutes on the baking sheets, then transfer to a rack to cool completely.\n            \n\n              Photograph by Ryan Liebe\n            \n\nBasic Dinner-Roll Dough:\n\n\n              Warm the milk and 1/2 cup water in a small saucepan or in the microwave until very warm (110 degrees F). Transfer to the bowl of a stand mixer fitted with the dough hook; mix in the sugar, yeast and 1 cup flour until combined but still lumpy. Let stand until the mixture is very bubbly, about 30 minutes.\n            \n\n              Add the butter, salt and 2 cups flour; mix on medium speed until smooth and elastic, 2 to 3 minutes. Mix in the eggs until combined, scraping the bottom and side of the bowl as needed. Add 1 1/4 cups flour and the mix-ins, if using; mix until the dough is smooth and starts to gather into a loose ball, about 4 minutes. The dough should be slightly sticky; if it's too wet, add the remaining 1/4 cup flour.\n            \n\n              Lightly oil a large bowl; scrape the dough into the bowl and turn to coat with the oil. Cover with plastic wrap and set aside in a warm place until doubled in size, about 2 hours.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "macaroni cheese", "quantity": 0.3333333333333333}, {"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 1}, {"food": "egg substitute", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "sesame seeds", "quantity": 0.75}, {"food": "seeds", "quantity": 0.75}, {"food": "salt", "quantity": 0.75}, {"food": "whole milk", "quantity": 0.5}, {"food": "sugar", "quantity": 3.0}, {"food": "yeast extract spread", "quantity": 1.25}, {"food": "potato flour", "quantity": 4.25}, {"food": "butter oil", "quantity": 6.0}, {"food": "salt", "quantity": 1.5}, {"food": "eggs", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 1}, {"food": "vegetable oil", "quantity": 1}], "title": "\nThree-Cheese Crescents\n"}, {"directions": "\n\n              Whisk the egg, evaporated milk, cayenne, nutmeg, and salt and black pepper to taste in a bowl. Toss the grated cheeses in a separate bowl.\n            \n\n              Bring a large pot of salted water to a boil. Add the cauliflower and cook until almost falling apart, about 7 minutes. Transfer with a slotted spoon to a bowl. Add the pasta to the same water and cook until al dente, about 10 minutes. Drain, reserving 1/4 cup cooking water. Preheat the broiler.\n            \n\n              Combine the egg mixture and the grated cheeses in the empty pot and cook over medium-low heat, stirring constantly, until the cheeses melt and the sauce begins to thicken. Remove from the heat and add the cauliflower. Puree with an immersion blender until smooth and light (you can also use a regular blender). Stir in some of the reserved pasta water until creamy.\n            \n\n              Toss the pasta in the sauce; season with salt and black pepper. Transfer to a shallow casserole dish and top with muenster slices. Broil until golden brown, about 5 minutes.\n            \n\n              Photograph by Kate Mathis\n            \n", "ingredients": [{"food": "egg substitute", "quantity": 1.0}, {"food": "whole milk", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "hearts of palm", "quantity": 1}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 1.3333333333333333}, {"food": "cheddar cheese", "quantity": 0.5}, {"food": "parmesan cheese", "quantity": 0.25}, {"food": "cauliflower", "quantity": 0.5}, {"food": "italian veg medley pasta", "quantity": 4.0}], "title": "\nThree-Cheese Macaroni\n"}, {"directions": "\n\n              Position a rack in the middle of the oven and preheat to 375. Butter the bottom and sides of a 2-quart souffle dish up to the top edge. Sprinkle with 1/4 cup parmesan and the cornmeal. Place in the freezer while you prepare the souffle.\n            \n\n              Make the roux: Melt 6 tablespoons butter in a heavy-bottomed saucepan over medium heat and add the garlic. Stir in the flour, nutmeg and 2 teaspoons salt and cook, stirring, until the flour is cooked but not browned, about 2 minutes. Whisk in the milk and simmer, whisking constantly, until the mixture is as thick as pudding, about 5 minutes. Stir in the comte, emmentaler and 3/4 cup parmesan until melted, then remove from the heat. Stir in the 4 egg yolks one at a time. Transfer the mixture to a large bowl and stir to cool slightly.\n            \n\n              Beat the 6 egg whites and lemon juice in a large bowl with a mixer until soft peaks form. Fold a quarter of the whites into the cheese base, then fold in the remaining whites.\n            \n\n              Place the prepared souffle dish on a baking sheet, pour in the batter and smooth the top. Run your finger around the inside lip of the dish to push the batter away from the edge and create a ridge. Scatter the remaining 1/4 cup parmesan on top. Transfer to the oven and immediately reduce the temperature to 325. Bake until golden and puffed about 2 inches above the lip of the dish, about 35 minutes. Serve immediately with baguette slices and pate and/or apple butter, if desired.\n            \n\n              Photograph by Marcus Nilsson\n            \n", "ingredients": [{"food": "butter oil", "quantity": 6.0}, {"food": "parmesan cheese", "quantity": 1.25}, {"food": "cornmeal", "quantity": 1.0}, {"food": "garlic powder", "quantity": 0.75}, {"food": "potato flour", "quantity": 0.5}, {"food": "hearts of palm", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "whole milk", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 1.5}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "eggs", "quantity": 4.0}, {"food": "lemon juice", "quantity": 0.75}, {"food": "", "quantity": 1}, {"food": "butter oil", "quantity": 1}], "title": "\nThree-Cheese Souffle\n"}, {"directions": "\n\n              Make the dough: Combine the yeast, 1 cup warm water (about 100 degrees F) and the sugar in a food processor and pulse once to combine. Let sit until foamy, 5 to 10 minutes. Add the olive oil; pulse to combine. Mix the flour and 2 teaspoons salt in a medium bowl; add to the food processor and pulse until the dough pulls away from the side and gathers around the blade.\n            \n\n              Turn the dough out onto a lightly floured surface and form into 2 even balls. Transfer to 2 lightly oiled bowls; cover with plastic wrap and let rise in a warm place until doubled in size, 2 to 4 hours. (You can make the dough ahead; wrap in plastic and refrigerate up to 1 week or freeze up to 2 months. Bring to room temperature before using.)\n            \n\n              Set a pizza stone or large baking sheet on the lowest oven rack and preheat to 500 degrees F. Meanwhile, make the topping: Combine the ricotta, parmesan, olive oil, garlic, oregano and red pepper flakes in a bowl; season with salt and set aside.\n            \n\n              Stretch 1 ball of dough into a 12-inch round on a lightly floured pizza peel or inverted baking sheet. Spread half of the ricotta mixture on top, leaving a 1/2-inch border. Top with half of the mozzarella, then brush the edge lightly with olive oil.\n            \n\n              Slide the pizza onto the hot stone or baking sheet and bake until the crust is golden and the cheese is bubbling, 7 to 10 minutes. Transfer to a cutting board and let cool 2 minutes before slicing. Repeat to make the second pizza.\n            \n", "ingredients": [{"food": "yeast extract spread", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "potato flour", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "macaroni cheese", "quantity": 0.6666666666666666}, {"food": "parmesan cheese", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "garlic powder", "quantity": 2.0}, {"food": "barley flour or meal", "quantity": 0.5}, {"food": "ruby red grapefruit juice blend", "quantity": 0.75}, {"food": "salt", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}], "title": "\nThree-Cheese White Pizza\n"}, {"directions": "\n\n              Position a rack in the middle of the oven and preheat to 300 degrees F. Line a baking sheet with parchment.\n            \n\n              Pulse the nuts in a food processor until coarsely chopped.\n            \n\n              Beat the egg white in a medium bowl with an electric mixer until stiff peaks form, about 2 minutes. Gently fold in the sugar and nuts. Spoon leveled tablespoons of the batter onto the prepared baking sheet, about 12 cookies total.\n            \n\n              Bake, rotating halfway through, until golden brown, 25 to 30 minutes. Cool completely on the baking sheet set on a wire rack.\n            \n", "ingredients": [{"food": "mixed nuts", "quantity": 0.6666666666666666}, {"food": "egg substitute", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}], "title": "\nThree-Ingredient Cookies\n"}, {"directions": "\n\n              Make the cake: Position racks in the upper and lower thirds of the oven and preheat to 350 degrees F. Brush three 9-inch-round cake pans with vegetable oil and line the bottoms with parchment paper. Spread the pecans on a baking sheet and bake until toasted, about 10 minutes. Let cool, then pulse in a food processor until very finely chopped.\n            \n\n              Combine the pecans, flour, baking powder, baking soda, salt, cinnamon, ginger and granulated sugar in a large bowl. In another bowl, whisk the vegetable oil, lemon zest, eggs and 1/2 cup marmalade. Stir in the carrots, then fold the carrot mixture into the flour mixture until just combined. Divide among the prepared pans and spread evenly (it won't look like a lot of batter, but the cakes will rise in the oven). Put 2 pans on the upper oven rack and the third pan on the lower rack. Bake until the cakes bounce back when touched and a toothpick comes out clean, 20 to 25 minutes, switching the position of the pans halfway through. Transfer the pans to racks until cool enough to handle, then invert the cakes onto the racks to cool completely. Remove the parchment.\n            \n\n              Make the frosting: Beat the cream cheese and butter in a bowl with a mixer until smooth, scraping down the bowl as needed. Beat in the confectioners' sugar, lemon juice, vanilla and salt until smooth. \n            \n\n              Put 1 cake layer on a platter. Spread with 1 tablespoon marmalade, then spread about 3/4 cup frosting over the marmalade. Top with another cake layer, marmalade and frosting. Spread the final cake layer with a thin layer of frosting. (This is the crumb coat; it doesn't have to be perfect.) Refrigerate 1 hour, then cover with the remaining frosting. Swirl some marmalade into the top of the cake. Refrigerate until ready to serve. Photograph by Con Poulos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.75}, {"food": "", "quantity": 1.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.5}, {"food": "salt", "quantity": 1.0}, {"food": "cinnamon", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "sugar", "quantity": 0.75}, {"food": "lemon juice", "quantity": 1.0}, {"food": "eggs", "quantity": 4.0}, {"food": "orange", "quantity": 0.5}, {"food": "carrots", "quantity": 3.75}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "butter oil", "quantity": 12.0}, {"food": "sugar", "quantity": 3.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}], "title": "\nThree-Layer Carrot Cake\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Line 2 baking sheets with parchment paper. Whisk the flour, baking powder and salt in a bowl. Beat the butter, granulated sugar and vanilla in a large bowl with a mixer until light and fluffy. Add half of the dry ingredients and mix until just combined, then mix in the remaining dry ingredients. Knead a few times by hand to bring the dough together.\n            \n\n              Roll teaspoonfuls of dough into balls and place about 1/2 inch apart on the prepared baking sheets. Make an indentation in the center of each ball with a small measuring spoon or the back of a pen. Fill each indentation with jam (a scant 1/8 teaspoon).\n            \n\n              Bake until the edges of the cookies are golden, 15 to 20 minutes. Let cool 2 minutes on the baking sheets, then transfer to a rack to cool completely. Dust with confectioners' sugar, if desired. Store in an airtight container up to 1 week.\n            \n\n              Photograph by Steve Giralt\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 12.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "grape juice", "quantity": 1}, {"food": "sugar", "quantity": 1}], "title": "\nThumbprints\n"}, {"directions": "\n\n              Bring 1 bunch thyme and 1 1/2 cups each sugar and water to a simmer in a saucepan over medium heat, stirring until the sugar dissolves. Let cool, then strain the syrup into an ice-filled pitcher. Stir in 2 cups each fresh lemon juice and cold water. Serve over ice with thyme sprigs and lemon slices.\n            \n\n              Photograph by Kana Okada\n            \n", "ingredients": [], "title": "\nThyme Lemonade\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Line a 12-cup muffin pan with paper liners; set aside. Melt the butter in a large skillet over medium-high heat. Add the leeks and celery and cook, stirring, until wilted, about 5 minutes. Add the parsley, thyme, walnuts and raisins; season with salt and pepper. Cook, stirring, until the vegetables are tender, about 5 more minutes; set aside to cool.\n            \n\n              Whisk the cornmeal, flour, sugar, baking powder, baking soda and 1/2 teaspoon salt in a medium bowl. Whisk in the milk, sour cream and egg until combined. Stir in all but 1/2 cup of the cooled vegetable mixture. Divide the batter among the prepared muffin cups, filling each almost to the top. Sprinkle the reserved vegetable mixture on top. Bake until the muffins bounce back when pressed, about 15 minutes. Let cool 5 minutes in the pan, then remove to a rack to cool completely.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [{"food": "butter oil", "quantity": 2.0}, {"food": "silk light vanilla", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "parsley", "quantity": 1.0}, {"food": "thyme", "quantity": 1.0}, {"food": "walnuts", "quantity": 0.5}, {"food": "raisins", "quantity": 0.5}, {"food": "pepper", "quantity": 1}, {"food": "cornmeal", "quantity": 1.5}, {"food": "potato flour", "quantity": 0.25}, {"food": "sugar", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "whole milk", "quantity": 1.0}, {"food": "sour cream", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}], "title": "\nThyme Savors\n"}, {"directions": "\n\n              Place the ricotta in a shallow serving dish. Gently warm the honey and thyme in a small skillet over medium-low heat until fragrant and the honey just begins to bubble, about 4 minutes. Pour over the ricotta. Drizzle with the olive oil and sprinkle with the salt and pepper. Serve with crostini.\n            \n", "ingredients": [{"food": "macaroni cheese", "quantity": 1.5}, {"food": "honey smoked ham", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "sea lion", "quantity": 0.25}, {"food": "black bean mango", "quantity": 0.125}, {"food": "", "quantity": 1}], "title": "\nThyme and Honey Ricotta Spread\n"}, {"directions": "\n\n              Cut 1 small green cabbage (outer leaves removed) into 4 wedges. Brush with melted butter; season with chopped thyme, salt and pepper. Lay each wedge on a thyme sprig on a parchment-lined baking sheet. Roast at 400 degrees F until the cabbage leaves are crisp, 25 to 30 minutes.\n            \n", "ingredients": [], "title": "\nThyme-Roasted Cabbage\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: a 10-inch springform pan and a wooden skewer\n\n              Position an oven rack in the middle of the oven and preheat to 325 degrees F.\n            \n\n              For the crust: Mix together the graham cracker crumbs, butter, sugar and salt and press into bottom of a 10-inch springform pan. Bake until golden brown, 15 to 18 minutes. Cool completely. Wrap up the bottom and sides of pan with a large piece of foil and put in a large roasting pan.\n            \n\n              For the filling: Beat the cream cheese and sugar, in a large bowl, with an electric mixer on medium speed for 1 minute. Add the sour cream and mix until just combined. Add the heavy cream and mix until just combined. Mix in the eggs, by hand, 1 at time. Then mix in the vanilla, lemon juice, by hand as well, until just combined. (Overmixing can turn your cheesecake into a souffle.) \n            \n\n              Using a ladle, divide the cheesecake batter into 4 separate bowls. Dye each a separate color; blue, pink, purple and yellow. Add enough food coloring so that the colors are very vibrant and intense.  \n            \n\n               Use an ice cream scoop or large spoon to drop spoonfuls of the batter onto the crust, alternating the colors, until all the batter has been scooped. Use a wooden skewer and drag it through the colors to marble them for tie-dye effect, making sure the skewer reaches down to the bottom of the pan. Transfer the pan to the roasting pan. Add enough hot water to come about halfway up the side of the springform pan.  \n            \n\n              Bake until the outside of the cake is set and the center is still slightly loose, about 1 hour 20 minutes. Turn the oven off and leave the cheesecake in the oven for another hour. Remove the cheesecake from the roasting pan to a cooling rack. Run a knife around the edge and cool to room temperature. Cover and refrigerate at least 8 hours.\n            \n\n              Unmold the cheesecake and transfer to a serving plate or cake stand. Serve slices with a dollop of whipped cream.\n            \n", "ingredients": [{"food": "crackers", "quantity": 2.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "whipped cream substitute", "quantity": 11.0}, {"food": "sugar", "quantity": 1.25}, {"food": "sour cream", "quantity": 16.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "eggs", "quantity": 4.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "ice cream swich", "quantity": 1}], "title": "\nTie-Dye Cheesecake\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Spray one 6-inch cake pan and two 1-quart ovenproof bowls with cooking spray. Beat the cake mix, eggs, buttermilk and vegetable oil with a mixer.\n            \n\n              Divide the batter evenly among the pan and bowls; bake until a toothpick comes out clean, about 25 minutes for the pan and 35 minutes for the bowls. Cool; unmold.\n            \n\n              Trim all 3 cakes to make them level. Hollow out the smaller end of one of the bowl cakes, carving about 1 inch deep. (Leave a thick rim around the edge.)\n            \n\n              Put the uncut bowl cake, wider side up, on a cake board or plate. Spread with a layer of chocolate frosting, then position the round cake on top.\n            \n\n              Spread the round cake with frosting, then put the other bowl cake on top, carved part up. Freeze the cake about 1 hour (this will make it easier to frost).\n            \n\n              Frost the outer rim and inside of the hole with vanilla frosting (an offset spatula works best). Put the remaining vanilla frosting in a resealable plastic bag.\n            \n\n              Spread the remaining chocolate frosting over the outside of the cake. Press handfuls of\n            \n\n              toasted coconut into the frosting, covering the cake completely.\n            \n\n              Microwave the bag of vanilla frosting for 5 seconds (the bag will not melt). Snip off a corner and squeeze the frosting into the top of the cake so it looks like liquid.\n            \n\n              Thread dried fruit onto a wooden skewer and insert it into the cake. Add a cocktail umbrella and straw.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "shortening cake mix", "quantity": 1.0}, {"food": "eggs", "quantity": 4.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.75}, {"food": "coconut water", "quantity": 1.5}, {"food": "fruit cocktail", "quantity": 1}], "title": "\nTiki Cocktail Cake\n"}, {"directions": "\n\n              Bring the rice, 1 1/3 cups water and 1/4 teaspoon salt to a simmer in a saucepan over medium-high heat. Reduce the heat to low, cover and cook 15 minutes. Remove from the heat and add the peas; cover and set aside.\n            \n\n              Puree 1/2 cup yogurt, the garlic, ginger, lime juice, cumin, cayenne and 3/4 teaspoon salt in a food processor. Transfer all but 3 tablespoons of the mixture to a large bowl. Pierce the fish a few times with a fork and season with salt; add to the bowl and toss. Marinate 15 minutes.\n            \n\n              Preheat the broiler. Place the fish on a broiler pan; top with the marinade and butter. Broil until opaque, 6 to 8 minutes. Mix the remaining 1/4 cup yogurt, the cilantro, and salt to taste with the yogurt mixture. Serve the fish and rice with the yogurt sauce and lime wedges.\n            \n", "ingredients": [{"food": "crisped rice bar", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "pigeon peas", "quantity": 0.5}, {"food": "silk plain soy yogurt", "quantity": 0.75}, {"food": "garlic powder", "quantity": 1.0}, {"food": "ginger", "quantity": 1.0}, {"food": "lime juice", "quantity": 1.0}, {"food": "cumin seed", "quantity": 0.25}, {"food": "pepper", "quantity": 0.25}, {"food": "vegetarian fillets", "quantity": 4.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "barley flour or meal", "quantity": 1.0}], "title": "\nTilapia Masala With Rice\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Soak the fish in a bowl with the milk and 2 cups ice, 15 minutes. Meanwhile, mix the flour with 1/2 teaspoon each salt and pepper in a shallow dish. Lightly beat the eggs in another dish. Pulse the bread, parsley, lemon zest and 1/2 teaspoon salt in a food processor until crumbs form, then transfer to a third dish. One at a time, remove the fillets from the milk and dredge in the flour, shaking off the excess. Dip in the eggs, then coat with the breadcrumbs, gently pressing to coat both sides. Transfer to a large plate. Line a baking sheet with foil. Heat 2 tablespoons each olive oil and butter in a large skillet over medium-high heat. Add 2 fillets and cook until golden, about 3 minutes per side. Transfer to the prepared baking sheet. Repeat with the remaining 2 fillets, adding 2 more tablespoons each olive oil and butter. Transfer the fish to the oven and bake until cooked through, about 8 minutes. Toss the arugula with the remaining 1 to 2 tablespoons olive oil, and salt and pepper to taste. Serve the fish with the salad and lemon wedges.  \n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "vegetarian fillets", "quantity": 4.0}, {"food": "milk", "quantity": 1.5}, {"food": "potato flour", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "eggs", "quantity": 3.0}, {"food": "garlic bread", "quantity": 6.0}, {"food": "chrysanthemum leaves", "quantity": 0.3333333333333333}, {"food": "lemon juice", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 5.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "arugula", "quantity": 6.0}], "title": "\nTilapia Milanese\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Toss the hash browns with the garlic and 1 teaspoon salt in a bowl. Heat 2 tablespoons olive oil in a large nonstick ovenproof skillet over medium heat. Add the hash browns, flatten with a spatula and cook until the bottom is golden brown, 6 to 8 minutes. Drizzle with 2 tablespoons olive oil. Flip the potato cake and pat it back into shape. Cook until crisp and golden, 6 to 8 minutes. \n            \n\n              Meanwhile, mix the olives, tomatoes, roasted peppers, scallions and parsley in a bowl. Cut the fish into 12 pieces and season with the dried herbs, salt and pepper. Scatter half of the olive mixture over the potato cake and top with the fish. \n            \n\n              Scatter the remaining olive mixture on top and drizzle with the remaining 1 tablespoon olive oil. Transfer the skillet to the oven and bake until the fish is cooked through, about 12 minutes. Drizzle with olive oil and season with salt. Serve from the skillet. \n            \n\n              Per serving: Calories 443; Fat 19 g (Saturated 3 g); Cholesterol 85 mg; Sodium 937 mg; Carbohydrate 32 g; Fiber 4 g; Protein 37 g \n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "frozen yogurt", "quantity": 1.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 5.0}, {"food": "olives", "quantity": 0.5}, {"food": "tomatoes", "quantity": 0.75}, {"food": "diced chicken", "quantity": 0.25}, {"food": "silk light vanilla", "quantity": 3.0}, {"food": "parsley", "quantity": 2.0}, {"food": "vegetarian fillets", "quantity": 1.5}, {"food": "barley flour or meal", "quantity": 1.0}, {"food": "pepper", "quantity": 1}], "title": "\nTilapia With Hash Browns\n"}, {"directions": "\n\n              For the marinade: Pulse the lime juice, olive oil, marjoram, cilantro, red pepper flakes, garlic clove and 1/2 teaspoon salt in a mini-food processor or blender until smooth. Cut each tilapia fillet in half through the seam, separating the thicker half from the thinner. Place the tilapia and shrimp in a large resealable plastic bag and add the marinade. Toss to coat, seal and refrigerate for 1 hour.\n            \n\n              For the slaw: Meanwhile, toss the cabbage with 1/2 teaspoon of salt in a large bowl and let stand at room temperature for 30 minutes to soften it a bit. Whisk the sour cream, jalapenos and pickling liquid in another large bowl. Toss in the seasoned shredded cabbage and stir to coat. Season with black pepper, cover and set aside.\n            \n\n              Prepare a grill for medium-high heat. Transfer the tilapia and shrimp to a rimmed baking sheet and sprinkle with 1/2 teaspoon salt and a few grinds of pepper. Brush the fillets with 1 tablespoon vegetable oil. Lightly oil the grill grates.\n            \n\n              For the taco bar: Wrap the tortillas in foil and set to the side on the heated grill while you grill the tilapia and shrimp.\n            \n\n              Grill the tilapia starting with the thicker pieces, 4 minutes for the thicker fillets, 3 minutes for the thinner ones. Use a spatula to loosen the fish and gently flip. Grill until just cooked through, another 2 to 3 minutes. Grill the shrimp until opaque, 2 to 3 minutes, flipping halfway. Serve with the tortillas, slaw, scallions, radishes and salsa.\n            \n", "ingredients": [{"food": "lime juice", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "chrysanthemum leaves", "quantity": 0.3333333333333333}, {"food": "chrysanthemum leaves", "quantity": 1.25}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "garlic powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "vegetarian fillets", "quantity": 1.5}, {"food": "shrimp", "quantity": 1.5}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "swamp cabbage", "quantity": 4.5}, {"food": "salt", "quantity": 1}, {"food": "sour cream", "quantity": 0.5}, {"food": "", "quantity": 3.0}, {"food": "black bean mango", "quantity": 1}, {"food": "corn bran", "quantity": 24.0}, {"food": "turnip greens", "quantity": 4.75}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.75}, {"food": "barley flour or meal", "quantity": 2.0}], "title": "\nTilapia and Shrimp Tacos with Cabbage Slaw\n"}, {"directions": "\n\n              Heat 1/4 cup of the olive oil in a large deep skillet with a lid over medium heat. Place the potatoes in the pan cut-side down. Add the garlic and cook until the potatoes are slightly golden and crisp, 4 to 5 minutes. Add the escarole, season with salt and pepper, then add about 1/3 cup water. Cover and steam until the escarole wilts, about 5 minutes.\n            \n\n              Season the fish with salt and pepper; place on top of the greens in the pan and sprinkle with the oregano leaves. Cover and steam until the fish is just cooked through, about 5 more minutes.\n            \n\n              Meanwhile, whisk the lemon juice in a bowl with the remaining 1/4 cup olive oil; season with 1 teaspoon salt and plenty of pepper.\n            \n\n              Carefully lift the fish off the greens and transfer to rimmed plates or bowls. Distribute the greens, potatoes and pan juices around the fish. Drizzle with the lemon-pepper oil.\n            \n\n              Photograph By Antonis Achilleos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.5}, {"food": "sweet potatoes", "quantity": 12.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "escarole", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "vegetarian fillets", "quantity": 1.25}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "", "quantity": 1.0}], "title": "\nTilapia with Escarole and Lemon-Pepper Oil\n"}, {"directions": "\n\n              Combine the flour, oregano and parsley in a shallow dish. Season with salt and pepper.\n            \n\n              Place a large skillet over medium-high heat. Dredge the fish in the flour mixture, shaking off the excess. Melt 3 tablespoons butter in the skillet, then add 2 fillets and cook until golden brown on the bottom, about 4 minutes. Flip and cook through, 1 to 2 more minutes. Transfer to a plate and keep warm. Repeat with the remaining 2 fillets.\n            \n\n              Add the green beans and garlic to the skillet and cook about 2 minutes. Season with salt and pepper, then add the tomatoes and cook until just softened, about 1 more minute. Stir in the lemon juice and 1/4 cup water, then cover and cook until the beans are tender, about 3 more minutes. Remove from the heat and stir in the remaining 1 tablespoon butter until just melted.\n            \n\n              Divide the fish and vegetables among plates. Garnish with oregano.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "parsley", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "vegetarian fillets", "quantity": 4.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "fava beans", "quantity": 0.5}, {"food": "garlic powder", "quantity": 1.0}, {"food": "grape juice", "quantity": 1.0}, {"food": "", "quantity": 1.0}], "title": "\nTilapia with Green Beans\n"}, {"directions": "\n\n              Heat 2 tablespoons olive oil in a Dutch oven or large pot over medium-high heat. Add the onion, celery and garlic and cook, stirring occasionally, until the vegetables soften, about 5 minutes. Add the tomatoes, 1/2 teaspoon salt and a few grinds of pepper. Cook, stirring occasionally, until thickened, about 8 minutes.\n            \n\n              Add 1/2 cup water, the wine and red pepper flakes to the pot and bring to a simmer. Add the mussels and tilapia; cover and cook until the mussels open and the tilapia is cooked through, about 5 minutes. (Discard any unopened mussels.) Season with salt and pepper. Gently stir in the parsley.\n            \n\n              Meanwhile, preheat the broiler. Arrange the bread on a baking sheet and brush with the remaining 1/2 tablespoon olive oil. Broil until toasted, about 3 minutes. Serve with the seafood stew.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "tomatoes", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "martha white foods", "quantity": 0.5}, {"food": "ruby red grapefruit juice blend", "quantity": 0.75}, {"food": "", "quantity": 1.5}, {"food": "", "quantity": 12.0}, {"food": "parsley", "quantity": 3.0}, {"food": "garlic bread", "quantity": 4.0}], "title": "\nTilapia-Seafood Stew\n"}, {"directions": "\nSpecial equipment: a pastry bag a large star pastry tip\n\n              Line a baking sheet with parchment. Put the chocolate in a small microwave-safe bowl, and microwave in 30-second increments, stirring after each, until smooth. Transfer the melted chocolate to a mug.\n            \n\n              Put the walnuts in another small bowl. Peel the bananas, trim the ends and cut each into six 2-inch pieces. Dip each piece halfway into the chocolate, and let any excess drip off. Roll the chocolate-dipped ends in walnuts, then set them on the prepared baking sheet. Refrigerate to set the chocolate. (The bananas can be refrigerated up to 2 hours.)\n            \n\n              Whip the cream in a small bowl until soft peaks form. Add the preserves, and stir to incorporate. Transfer the mixture to a pastry bag fitted with a large star tip. Pipe a star-shaped dollop on top of each banana. Garnish with a piece of cherry and sprinkles.\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 4.0}, {"food": "bananas", "quantity": 3.0}, {"food": "walnuts", "quantity": 0.3333333333333333}, {"food": "ice cream swich", "quantity": 0.3333333333333333}, {"food": "pineapple chunks", "quantity": 2.0}, {"food": "maraschino cherries", "quantity": 12.0}, {"food": "", "quantity": 1}], "title": "\nTiny Banana Splits\n"}]