[{"directions": "\nSpecial equipment: cookie cutters (pumpkins, ghosts, black cat, bats and witches), optional\n\n              Heat olive oil in a medium sauce pot over medium-high heat. Add fennel, onion, garlic, salt, fennel seed and crushed pepper, if using, and cook until vegetables soften and brown slightly, about 5 minutes. Drain and reserve juice from the tomatoes, then crush tomatoes gently with your hands. Add the tomatoes, increase heat to high, and cook until they begin to brown slightly, about 5 minutes.\n            \n\n              Add the reserved tomato juice, vegetable broth, tomato juice, and basil leaves. Bring to a boil, stir, reduce heat to medium low, cover and cook until vegetables are cooked through and soup reduces and thickens, about 30 minutes.\n            \n\n              Remove pot from stove and puree the soup in batches, with an immersion, regular blender, or food processor. Stir in lemon juice and season with pepper to taste. Serve.\n            \n\nOptional Garnishes:\n\n\n              Toast bread in toaster or toaster oven until slightly crisp, about 5 minutes (or less if using a toaster.) Spread one side of each slice of bread with apple jelly. Layer the cheese over the apple jelly, top with remaining slice of bread. Cut out as desired. Garnish as desired.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "fennel seed", "quantity": 0.5}, {"food": "onion powder", "quantity": 0.5}, {"food": "garlic powder", "quantity": 4.0}, {"food": "salt", "quantity": 1.25}, {"food": "fennel seed", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.375}, {"food": "plum", "quantity": 28.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "tomato juice", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 6.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "garlic bread", "quantity": 3.5}, {"food": "apple", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "pickle loaf", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "pasta with tomato sauce", "quantity": 1}], "title": "\nVampire Blood Tomato Soup with Muenster Sammies\n"}, {"directions": "\n\n              For the syrup: Put the sugar, water, hibiscus flowers, and ginger in a medium saucepan. Bring to a boil over high heat, stirring occasionally. Remove from the heat and set aside to steep for 30 minutes. Strain and refrigerate until chilled.\n            \n\n              To make the cocktail: Combine the tequila, 2 cups of the hibiscus syrup, lime juice, and orange liqueur in a large pitcher. (The vampiro can be made up to this point a day ahead and refrigerated.)\n            \n\n              To serve, fill a cocktail shaker halfway with ice, add the some of the vampiro and shake until chilled. Strain and serve straight-up in a cocktail glass garnished with lime slices. Alternatively, serve over ice in a rocks glass.\n            \n", "ingredients": [{"food": "sugar", "quantity": 2.0}, {"food": "coconut water", "quantity": 2.0}, {"food": "pumpkin flowers", "quantity": 0.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "martha white foods", "quantity": 4.0}, {"food": "lime juice", "quantity": 2.0}, {"food": "orange", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1}, {"food": "lime", "quantity": 1}], "title": "\nVampiro\n"}, {"directions": "\n\n              For the syrup: Put the sugar, water, hibiscus flowers, and ginger in a medium saucepan. Bring to a boil over high heat, stirring occasionally. Remove from the heat and set aside to steep for 30 minutes. Strain and refrigerate until chilled.\n            \n\n              To make the cocktail: Combine the tequila, 2 cups of the hibiscus syrup, lime juice, and orange liqueur in a large pitcher. (The vampiro can be made up to this point a day ahead and refrigerated.)\n            \n\n              To serve, fill a cocktail shaker half way with ice, add the some of the vampiro and shake until chilled. Strain and serve straight-up in a cocktail glass garnished with lime slices. Alternatively, serve over ice in a rocks glass.\n            \n", "ingredients": [{"food": "sugar", "quantity": 2.0}, {"food": "coconut water", "quantity": 2.0}, {"food": "pumpkin flowers", "quantity": 0.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "martha white foods", "quantity": 4.0}, {"food": "lime juice", "quantity": 2.0}, {"food": "orange", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1}, {"food": "lime", "quantity": 1}], "title": "\nVampiro\n"}, {"directions": "\n\n              Combine the butter, sugar and salt in the bowl of a stand mixer fitted with a paddle attachment (or in a large bowl if using a handheld electric mixer). Mix on low speed until mostly incorporated. Add the vanilla, increase the speed to medium-high and mix until smooth. Adjust the consistency with milk as desired. Use immediately, or refrigerate in an airtight container up to 3 days. Allow to come to room temperature and mix on medium-high until smooth.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 2.0}, {"food": "", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "milk", "quantity": 1.0}], "title": "\nVanilla American Buttercream\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Cut each banana into 6 chunks and freeze until rock solid, preferably overnight.\n            \n\n              Put the banana chunks and vanilla bean seeds or extract in a food processor and process. Hang on, your food processor may jolt in the very beginning! The bananas will look crumbly at first, then gooey and eventually light and creamy- just like ice cream. Stop the food processor frequently to scrape down the sides of the bowl and break up any clumps. Serve right away or scrape into a container and freeze until ready to serve.\n            \n", "ingredients": [{"food": "bananas", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 1.0}], "title": "\nVanilla Banana Ice Cream\n"}, {"directions": "\n\n              Combine the heavy cream, milk, and vanilla pod and seeds in a large saucepan. Bring to a gentle simmer over medium-high heat, then remove from the heat.\n            \n\n              Whisk the egg yolks, sugar and salt in a medium bowl. Ladle half of the cream mixture into the egg mixture and whisk to combine; return to the saucepan with the remaining cream mixture. Cook over medium heat, stirring constantly with a wooden spoon in a figure-8 motion, until the custard is thick enough to coat the back of the spoon, about 10 minutes.\n            \n\n              Strain the custard through a fine-mesh sieve into a blender; discard the vanilla pod. Puree until frothy, about 30 seconds; pour back into the bowl. Cover with plastic wrap and refrigerate at least 3 hours or overnight.\n            \n\n              Transfer the chilled custard to an ice cream maker and churn according to the manufacturer's instructions. Transfer to a resealable container and freeze until firm, about 2 hours.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [{"food": "ice cream swich", "quantity": 3.0}, {"food": "whole milk", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "egg substitute", "quantity": 10.0}, {"food": "sugar", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}], "title": "\nVanilla Bean Ice Cream\n"}, {"directions": "\n\n              Prepare the vanilla.\n            \n\n              Halve the vanilla bean lengthwise and scrape out the seeds with a paring knife. Position a rack in the middle of the oven and preheat to 325 degrees F.\n            \n\n              Infuse the cream.\n            \n\n              Bring the cream, half-and-half and vanilla seeds and pod to a simmer in a saucepan over medium heat. Reduce the heat to low and simmer to infuse the cream with the vanilla, 10 to 15 minutes. Discard the vanilla pod. Remove the cream mixture from the heat and cool slightly. Meanwhile, bring\n            \n\n              Make the custard.\n            \n\n              Whisk the egg yolks, 1/2 cup sugar and the salt in a large bowl until the sugar dissolves and the mixture is pale yellow and thick; it should leave a trail when you lift the whisk. Pour in the cream mixture in a slow, steady stream, whisking constantly. Skim off any foam or bubbles from the surface.\n            \n\n              Pour into ramekins.\n            \n\n              Arrange eight 6-ounce ramekins in a roasting pan and divide the custard evenly among them.\n            \n\n              Bake in a water bath.\n            \n\n              Pull out the oven rack slightly, place the roasting pan on it and pour enough boiling water into the pan to come halfway up the sides of the ramekins.\n            \n\n              Bake until the custards are just set in the center, 40 to 45 minutes. Carefully remove the ramekins from the water bath and transfer to the refrigerator. Chill, uncovered, at least 2 hours and up to 1 day.\n            \n\n              Prepare the topping.\n            \n\n              About 30 minutes before serving, sprinkle 1 teaspoon sugar over each custard. Tilt the ramekins to evenly distribute the sugar and tap out any excess.\n            \n\n              Caramelize the sugar.\n            \n", "ingredients": [{"food": "vanilla extract", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "egg substitute", "quantity": 8.0}, {"food": "sugar", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "hearts of palm", "quantity": 1}], "title": "\nVanilla Creme Brulee\n"}, {"directions": "\n\n              Preheat oven to 350 degrees F. Line two 12-cup cupcake tins with paper liners. (To avoid cupcakes sticking if they overflow slightly, lightly spray the tops of the pans.) Put tins on a baking sheet. Set aside.\n            \n\n              Process sugar and butter in a food processor until very creamy, scraping sides as needed, 1 to 2 minutes. Add the eggs and yolks, one at a time, pulsing after each addition. Add the milk, water, and vanilla and process to blend.\n            \n\n              Whisk both flours, baking powder, and salt in a medium bowl. Add the dry ingredients, in 3 batches to the wet, pulsing, and then scraping batter off the sides of the processor as needed after each addition. Process until the batter is very smooth and pourable like pancake batter, about 2 minutes.\n            \n\n              Evenly pour the batter into the prepared cups, filling them 3/4 of the way full. Bake until the cakes are just firm and spring back when gently pressed, and the tops are golden, 18 to 25 minutes. Cool slightly in tin, and turn out of tin when cool enough to handle. Cool cupcakes completely on a rack before frosting.\n            \n\nFluff Frosting:\n\n\n              Whisk the milk and vanilla extract together in a small bowl.\n            \n\n              Slowly beat the butter and sugar, in another medium bowl, with an electric mixer until incorporated. Raise the speed to high and mix until light and fluffy, about 5 to 7 minutes. (Occasionally turn the mixer off, and scrape the sides of the bowl down with a rubber spatula.) Add the fluff and salt and reduce the speed to low. Add the milk and vanilla mixture, scrape the bowl down, and mix until fully incorporated. Raise the mixer to high and beat briefly until fluffy, about 1 to 2 minutes. Use immediately.\n            \n\n              Yield: 3 3/4 cups\n            \n", "ingredients": [{"food": "sugar", "quantity": 2.6666666666666665}, {"food": "butter oil", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "egg substitute", "quantity": 2.0}, {"food": "milk", "quantity": 0.6666666666666666}, {"food": "coconut water", "quantity": 0.6666666666666666}, {"food": "vanilla extract", "quantity": 2.5}, {"food": "potato flour", "quantity": 2.6666666666666665}, {"food": "potato flour", "quantity": 1.3333333333333333}, {"food": "baking chocolate", "quantity": 4.0}, {"food": "salt", "quantity": 0.5}, {"food": "", "quantity": 1}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "whole milk", "quantity": 0.25}, {"food": "butter oil", "quantity": 10.0}, {"food": "sugar", "quantity": 5.0}, {"food": "", "quantity": 0.5}, {"food": "salt", "quantity": 1}], "title": "\nVanilla Cupcakes\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Line a 12-cup muffin pan with paper liners. Whisk the flour, baking powder and salt in a bowl. Beat the butter and sugar in a stand mixer fitted with the paddle attachment on medium-high speed until fluffy, about 4 minutes. Beat in the eggs, one at a time, scraping down the bowl as needed. Beat in the vanilla. Reduce the mixer speed to medium low; beat in half of the flour mixture, then all of the milk, then the remaining flour mixture until just combined.\n            \n\n              Divide the batter among the muffin cups, filling each three-quarters full. Bake until a toothpick inserted into the center of a cupcake comes out clean, 18 to 20 minutes, rotating the pan halfway through. Transfer the pan to a rack and let cool 5 minutes, then remove the cupcakes to the rack to cool completely. Top with Frosting.\n            \n\n              Photograph by Levi Brown\n            \n\nWhite Frosting:\n\n\n              Whisk the egg whites, sugar and salt in a heatproof bowl set over a saucepan of simmering water (do not let the bowl touch the water) until the mixture is warm and the sugar dissolves. Remove the bowl from the pan; let cool slightly.\n            \n\n              Beat the egg white mixture in a stand mixer fitted with the whisk attachment (or with a hand mixer) on medium-high speed until stiff peaks form, 12 to 15 minutes. Beat in the butter a few pieces at a time, then continue beating until smooth. (Don't worry if the mixture looks separated at first-it will come together as you keep beating.)\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 1.25}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "whole milk", "quantity": 0.6666666666666666}, {"food": "dessert topping", "quantity": 1}, {"food": "egg substitute", "quantity": 4.0}, {"food": "sugar", "quantity": 0.75}, {"food": "hearts of palm", "quantity": 1}, {"food": "butter oil", "quantity": 2.0}], "title": "\nVanilla Cupcakes\n"}, {"directions": "\n\n              Combine 2 cups dark rum with 3 cups ginger beer (not ginger ale), the juice of 4 limes and a tiny splash of vanilla extract in a pitcher. Serve on the rocks with lime wedges.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [], "title": "\nVanilla Dark and Stormy\n"}, {"directions": "\n\n              In a small bowl, whisk together the milk, vanilla, lemon juice, and zest.\n            \n\n              In a standing mixer fitted with the paddle attachment, or with a hand-held electric mixer and a bowl, combine the butter and sugar and mix on low until incorporated. Raise the speed to high and mix until light and fluffy, about 10 minutes. (Occasionally turn the mixer off, and scrape the sides of the bowl down with a rubber spatula.)\n            \n\n              Reduce the speed of the mixer to low. Add the milk mixture in 3 batches, waiting for each batch to be fully incorporated before adding the next (scrape the bowl down occasionally). Raise the speed to high and mix briefly until fluffy. Use as desired. May be stored, covered, in the refrigerator for 3 days.\n            \n", "ingredients": [{"food": "whole milk", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 1.75}, {"food": "lemon juice", "quantity": 1.5}, {"food": "lemon juice", "quantity": 0.5}, {"food": "butter oil", "quantity": 1.5}, {"food": "sugar", "quantity": 4.5}], "title": "\nVanilla Frosting\n"}, {"directions": "\n\n              Trim the brown crust off the top, bottom and sides of the angel food cake using a serrated knife. Thinly slice the cake.\n            \n\n              Whisk 1/2 cup heavy cream and 1/4 cup malted milk powder in a small bowl until the powder is mostly dissolved; let sit 5 minutes, then whisk again until the powder is completely dissolved and the mixture is slightly thickened. Lightly coat the bottom and sides of a 10-inch tube pan with cooking spray. Press about half of the cake slices into the bottom of the pan and slightly up the sides in a single layer, trimming as needed. Drizzle half of the malted cream over the cake slices.\n            \n\n              Scoop half of the ice cream into the pan and spread with an offset spatula to make an even layer. Press some of the remaining cake slices on top of the ice cream to make an even layer, trimming the slices as needed. Drizzle with the remaining malted cream. Repeat with the remaining ice cream and cake slices. Cover with plastic wrap and freeze until firm, at least 4 hours and up to 5 days.\n            \n\n              Loosen the edges of the cake with an offset spatula, then invert onto a platter. Beat the remaining 1 cup heavy cream and 2 tablespoons malted milk powder with a mixer until stiff peaks form. Spread over the top and sides of the cake and top with sprinkles.\n            \n\n              Photograph by Johnny Miller\n            \n", "ingredients": [{"food": "rice cake", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1.5}, {"food": "milk", "quantity": 0.25}, {"food": "", "quantity": 1}, {"food": "ice cream swich", "quantity": 1.5}, {"food": "dessert topping", "quantity": 1}], "title": "\nVanilla Malted Ice Cream Cake\n"}, {"directions": "\n\n              Make dessert in just 15 minutes: Peel, halve and core 4 pears. Put in a shallow dish with 1 cup white wine, 2/3 cup sugar, 2 strips grapefruit zest and 1 split vanilla bean. Cover with plastic wrap; microwave about 10 minutes. Serve the pears with the vanilla syrup; top with whipped cream, if desired.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [], "title": "\nVanilla Poached Pears\n"}, {"directions": "\n\n              Heat 4 cups of the milk in a large saucepan over medium heat until steaming.\n            \n\n              Whisk the sugar, cornstarch and 1/2 teaspoon salt in a large bowl. Whisk in the egg yolks and the remaining 1/2 cup milk.\n            \n\n              Whisk half of the hot milk into the egg mixture until smooth, then gradually whisk the egg-milk mixture into the saucepan. Cook over medium heat, whisking constantly, until the mixture boils. Continue to cook, whisking constantly, until it has thickened to a puddinglike consistency, 3 to 4 minutes. Remove from the heat and stir in the vanilla.\n            \n\n              Cool slightly, stirring a few times to prevent a skin from forming. Place a piece of plastic wrap directly on top of the pudding and refrigerate until completely cooled and thickened, about 4 hours.\n            \n\n              Before serving, whisk the pudding vigorously until smooth and creamy.\n            \n\n              Stir-ins:\n            \n\n              Cookies and Cream: Crush 20 chocolate wafer cookies, stir some into the pudding and top with the rest.\n            \n\n              Fresh Berries and Gingersnaps: Fold in 2 cups of fresh, mixed berries and top with about 12 finely crushed gingersnaps.\n            \n\n              Vanilla-Banana: Fold in 3 sliced bananas. Cover and refrigerate for 1 hour. Fold in 24 crushed vanilla wafer cookies and top with more sliced bananas.\n            \n\n              Rocky Road: Fold in 1 cup each mini marshmallows and toasted chopped walnuts and 1/2 cup of mini chocolate chips. Sprinkle with more chocolate chips.\n            \n\n              Peanut Butter* and Jelly (See Cook's Note): Fold in 1 cup quartered red grapes and 1/3 cup each chopped roasted peanuts and peanut butter chips. Top with whole grapes.\n            \n", "ingredients": [{"food": "whole milk", "quantity": 4.5}, {"food": "sugar", "quantity": 1.0}, {"food": "cornstarch", "quantity": 0.3333333333333333}, {"food": "salt", "quantity": 1}, {"food": "egg substitute", "quantity": 5.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "", "quantity": 1}], "title": "\nVanilla Pudding\n"}, {"directions": "\n\n              Combine 1/2 cup sugar, 2 tablespoons cornstarch and teaspoon salt in a medium bowl; slowly whisk in 1 cup milk, then whisk in 1 large egg. Meanwhile, bring another 1 cup milk to a boil in a medium saucepan over medium heat. Remove from the heat and whisk in the sugar mixture. Return to medium-low heat and simmer, whisking, until thick and creamy, 5 to 7 minutes. Remove from the heat and whisk in 1 tablespoon each vanilla and unsalted butter until smooth. Add stir-ins (see below). Divide among ramekins. Cover with plastic wrap and refrigerate until set, about 2 hours.\n            \n\n              Mix-In Ideas:\n            \n\n              Gingerbread cookie:Stir in 1/4 cup cookie butter and layer with crumbled gingersnaps\n            \n\n              Double chocolate chip:Stir in 1/2 cup milk chocolate chips and layer with crumbled chocolate chip cookies\n            \n\n              Chocolate-Mint: Stir in 1/2 cup mint baking chips and layer with crumbled chocolate sandwich cookies\n            \n\n              Caramel crunch: Stir in 1/2 cup dulce de leche and layer with broken pretzels\n            \n\n              Pumpkin pie: Stir in 1/2 cup pumpkin puree and layer with crushed graham crackers\n            \n\n              Chocolate peanut butter: Stir in 1/2 cup semisweet chocolate chips and layer with crumbled peanut butter cookies\n            \n\n              Photographs by Jeff Harris\n            \n", "ingredients": [], "title": "\nVanilla Pudding Six Ways\n"}, {"directions": "\n\n              Heat 4 cups of the milk in a large saucepan over medium heat until steaming.\n            \n\n              Whisk the sugar, cornstarch and 1/2 teaspoon salt in a large bowl. Whisk in the egg yolks and the remaining 1/2 cup milk.\n            \n\n              Whisk half of the hot milk into the egg mixture until smooth, then gradually whisk the egg-milk mixture into the saucepan. Cook over medium heat, whisking constantly, until the mixture boils. Continue to cook, whisking constantly, until it has thickened to a puddinglike consistency, 3 to 4 minutes. Remove from the heat and stir in the vanilla.\n            \n\n              Cool slightly, stirring a few times to prevent a skin from forming. Place a piece of plastic wrap directly on top of the pudding and refrigerate until completely cooled and thickened, about 4 hours.\n            \n\n              Before serving, whisk the pudding vigorously until smooth and creamy. Gently fold in the berries. Spoon the pudding into six to eight individual cups and top with the crushed gingersnaps.\n            \n", "ingredients": [{"food": "whole milk", "quantity": 4.5}, {"food": "sugar", "quantity": 1.0}, {"food": "cornstarch", "quantity": 0.3333333333333333}, {"food": "salt", "quantity": 1}, {"food": "egg substitute", "quantity": 5.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "blueberries", "quantity": 2.0}, {"food": "chocolate chip cookies", "quantity": 3.0}], "title": "\nVanilla Pudding with Fresh Berries and Gingersnaps\n"}, {"directions": "\n\n              Bring the granulated sugar and 1/2 cup water to a boil in a small saucepan, stirring until the sugar has dissolved. Halve the vanilla bean lengthwise, scrape out the seeds with a knife, then add the seeds and pod to the saucepan. Boil the syrup for 1 minute more. Let cool, then transfer the syrup to a 3-quart pitcher.\n            \n\n              Add the Lillet, soda water and 2 tablespoons of the lemon juice to the pitcher, and stir to combine. Add the starfruit, and cover the pitcher with plastic wrap. Refrigerate the sangria to chill, at least 4 hours up to overnight.\n            \n\n              When ready to serve, put the remaining 1/2 tablespoon lemon juice on a saucer. Put some sanding sugar on another saucer. Dip the rims of 8 glasses in the lemon juice, then in the sugar. Add the champagne to the pitcher, and stir gently to combine. Fill each glass halfway with ice, then pour sangria and starfruit into each glass.\n            \n", "ingredients": [{"food": "sugar", "quantity": 0.75}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "", "quantity": 2.0}, {"food": "coconut water", "quantity": 1.0}, {"food": "lemon juice", "quantity": 2.5}, {"food": "luncheon slices", "quantity": 1.125}, {"food": "barley flour or meal", "quantity": 750.0}, {"food": "sugar", "quantity": 1}], "title": "\nVanilla, Starfruit and Champagne Sangria\n"}, {"directions": "\n\n              Heat 4 cups of the milk in a large saucepan over medium heat until steaming.\n            \n\n              Whisk the sugar, cornstarch and 1/2 teaspoon salt in a large bowl. Whisk in the egg yolks and the remaining 1/2 cup milk.\n            \n\n              Whisk half of the hot milk into the egg mixture until smooth, then gradually whisk the egg-milk mixture into the pan. Cook over medium heat, whisking constantly, until the mixture boils. Continue to whisk until it has thickened to a puddinglike consistency, 3 to 4 minutes. Remove from the heat and stir in the vanilla extract.\n            \n\n              Cool slightly, stirring a few times to prevent a skin from forming. Place a piece of plastic wrap directly on top of the pudding and refrigerate until completely cooled and thickened, about 4 hours.\n            \n\n              One hour before serving, whisk the pudding vigorously until smooth and creamy. Gently fold in 3/4 of the sliced bananas. Cover with plastic wrap and refrigerate for 1 hour. Fold in the vanilla wafers, spoon the pudding into six to eight individual cups and top with the remaining banana slices.\n            \n", "ingredients": [{"food": "whole milk", "quantity": 4.5}, {"food": "sugar", "quantity": 1.0}, {"food": "cornstarch", "quantity": 0.3333333333333333}, {"food": "salt", "quantity": 1}, {"food": "egg substitute", "quantity": 5.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.25}, {"food": "vanilla extract", "quantity": 3.0}], "title": "\nVanilla-Banana Pudding\n"}, {"directions": "\n\n              Make the crust: Pulse the flour, granulated sugar and salt in a food processor to combine. Add about one-third of the butter and pulse until the mixture looks like cornmeal. Add the remaining butter and pulse until it is in pea-size pieces. Add the vanilla seeds, bourbon and 2 to 3 tablespoons ice water; pulse until the dough just comes together. Turn out onto a piece of plastic wrap; shape into a disk and wrap. Refrigerate until firm, at least 1 hour or overnight.\n            \n\n              Put a baking sheet on the middle oven rack and preheat to 425 degrees F for 30 minutes. Meanwhile, roll out the dough into a 12-inch round on a lightly floured surface. Ease into a 9-inch pie plate. Fold the overhanging dough under itself and crimp with your fingers or a fork. Refrigerate until firm, about 30 minutes.\n            \n\n              Meanwhile, make the filling: Combine the heavy cream, bourbon and cinnamon stick in a small saucepan over medium-low heat; bring to a simmer. Transfer the mixture to a large bowl and let cool slightly. Whisk in the pumpkin, eggs, granulated sugar, brown sugar and pumpkin pie spice. Set aside.\n            \n\n              Line the crust with foil, then fill with pie weights or dried beans. Transfer to the hot baking sheet in the oven and bake until lightly golden around the edge, about 15 minutes. Remove the foil and weights and continue baking until the crust is dry and golden all over, about 5 more minutes. Transfer to a rack and let cool completely; leave the baking sheet in the oven. Reduce the temperature to 375 degrees F.\n            \n\n              Discard the cinnamon stick from the filling; pour into the cooled crust and return the pie to the hot baking sheet. Bake until the crust is golden brown and the filling is set, 1 hour to 1 hour 10 minutes. (Tent the crust with foil if it browns too quickly.) Transfer to a rack and let cool completely.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.5}, {"food": "sugar", "quantity": 3.0}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 10.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1.5}, {"food": "", "quantity": 2.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "pumpkin flowers", "quantity": 1.0}, {"food": "eggs", "quantity": 3.0}, {"food": "sugar", "quantity": 0.5}, {"food": "sugar", "quantity": 0.5}, {"food": "pumpkin pie spice", "quantity": 1.5}], "title": "\nVanilla-Bourbon Pumpkin Pie\n"}, {"directions": "\n\n              Sift the flour, baking powder and salt into a medium bowl. Beat the butter and sugar in a large bowl with a mixer on medium-high speed until light and fluffy, 3 to 5 minutes. Add the egg and vanilla; beat until combined. Reduce the mixer speed to low; add the flour mixture in 2 batches, beating after each, until just incorporated. Divide the dough between 2 sheets of plastic wrap; form into disks. Wrap and refrigerate until firm, at least 1 hour.\n            \n\n              Make the filling: Bring the heavy cream to a simmer in a small saucepan over medium heat. Pour over the chocolate in a medium bowl and let stand 2 minutes; stir until smooth. Set aside.\n            \n\n              Working with 1 disk at a time, roll out the dough between floured sheets of parchment paper until about 1/8 inch thick; chill 15 minutes. Line 2 baking sheets with parchment. Cut out circles with a 2-inch cutter; transfer to the baking sheets. Gather the scraps and refrigerate until firm; reroll once to cut out more cookies. Chill the cutouts 30 minutes.\n            \n\n              Position racks in the upper and lower thirds of the oven and preheat to 350 degrees F. Bake, switching the pans halfway through, until just golden, about 12 minutes. Let cool 5 minutes on the baking sheets, then transfer to racks to cool completely.\n            \n\n              Briefly beat the filling with a mixer on medium-high speed until thick, 30 seconds. Chill until cold, about 1 hour. Sandwich between the cookies and roll the edges in sprinkles.\n            \n\n              Photograph by Andrew Purcell\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.5}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 2.5}, {"food": "sugar", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 0.6666666666666666}, {"food": "baking chocolate", "quantity": 8.0}, {"food": "", "quantity": 1}], "title": "\nVanilla-Chocolate Sandwich Cookies\n"}, {"directions": "\n\n              Split the vanilla bean lengthwise and scrape the seeds into a saucepan. Add the vanilla pod, milk, cream, sugar, cinnamon stick and salt; bring to a simmer over medium heat. Remove from the heat, cover and steep 15 minutes.\n            \n\n              Whisk the cornstarch and egg yolks in a large bowl. Slowly whisk in the warm milk mixture, then pour the mixture back into the saucepan. Bring to a boil over medium heat and cook, whisking constantly, until thick, about 3 minutes. Stir in the butter. Pour the pudding through a fine-mesh sieve into a bowl; let cool slightly.\n            \n\n              Divide most of the cookie crumbs among small glasses. Top with the pudding. Cover with plastic wrap and refrigerate until cold, about 3 hours. Top with the remaining cookie crumbs.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "vanilla extract", "quantity": 0.5}, {"food": "whole milk", "quantity": 4.0}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "sugar", "quantity": 0.5}, {"food": "cinnamon", "quantity": 1.0}, {"food": "salt", "quantity": 0.125}, {"food": "cornstarch", "quantity": 0.25}, {"food": "egg substitute", "quantity": 4.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "chocolate chip cookies", "quantity": 4.0}], "title": "\nVanilla-Cookie Pudding\n"}, {"directions": "\n\n              Blend the ingredients in a food processor, shape into a log on waxed paper, wrap and chill.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "fava beans", "quantity": 2.0}, {"food": "cinnamon", "quantity": 0.5}, {"food": "hearts of palm", "quantity": 1}], "title": "\nVanilla-Spice Butter\n"}, {"directions": "\n\n              Prepare the veal: Preheat the oven to 350 degrees F. Heat 3 tablespoons vegetable oil in a large skillet over medium-high heat. Add the onions, bell peppers and 1 teaspoon salt and cook, stirring, until soft, 8 to 10 minutes. Add the tomatoes and cook until most of the liquid evaporates, about 5 minutes. Stir in the paprika, then add the wine and boil until reduced by half, about 3 minutes. Add the chicken broth; transfer the mixture to a large baking dish.\n            \n\n              Pat the veal dry; sprinkle with 2 teaspoons salt and 1 teaspoon pepper. Wipe out the skillet, add 1 tablespoon vegetable oil and heat over medium-high heat. Cook the veal in 2 batches until browned, 3 to 4 minutes per side, adding the remaining 1 tablespoon vegetable oil between batches. Transfer the veal to the baking dish, cover with foil and bake until tender, 2 hours to 2 hours, 30 minutes.\n            \n\n              Meanwhile, prepare the vegetables: Heat the sugar and 1 1/2 tablespoons olive oil in a skillet over medium-high heat until the sugar melts. Add the cipollini onions and cook, tossing, until browned, 3 to 5 minutes. Add the wine, 1/4cup water and a pinch of salt. Reduce the heat to medium low and cook, partially covered, until tender, about 20 minutes. Uncover and cook over medium-high heat, stirring until glazed, about 5 more minutes.\n            \n\n              Heat the remaining 1 tablespoon olive oil in a separate skillet over medium heat. Add the mushrooms and cook, stirring, until tender, 3 to 5 minutes. Add the parsley, dill and salt and pepper to taste. Keep warm.\n            \n\n              Transfer the veal to an ovenproof platter, cover with foil and keep warm in the oven (turn the oven off). Strain the liquid from the baking dish, discarding the solids. Skim off 1 tablespoon fat from the strained liquid; transfer the fat to a saucepan over medium-high heat. Add the flour and cook, stirring, 1 minute. Whisk in the liquid and simmer, whisking occasionally, until thickened, 10 to 15 minutes. Spoon the sauce over the veal and serve with the mushrooms and onions\n            \n\n              Photograph by Anna Williams\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 5.0}, {"food": "onions", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 1.5}, {"food": "martha white foods", "quantity": 0.5}, {"food": "diced chicken", "quantity": 1.0}, {"food": "veal", "quantity": 6.0}, {"food": "pepper", "quantity": 1}, {"food": "potato flour", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 2.5}, {"food": "onions", "quantity": 1.0}, {"food": "martha white foods", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "mushrooms", "quantity": 0.75}, {"food": "parsley", "quantity": 2.0}, {"food": "dill seed", "quantity": 2.0}, {"food": "pepper", "quantity": 1}], "title": "\nVeal Shank Paprikash\n"}, {"directions": "\n\n              For the \"pulled pork\": Preheat the oven to 300 degrees F, line two baking sheets with parchment paper and line a third baking sheet or pan with paper towels. Brush the parchment-lined baking sheets with about 1 tablespoon of vegetable oil each. Place the mushroom slices in a single layer, very close together, on the parchment and brush lightly with the remaining vegetable oil.\n            \n\n              Bake the mushrooms until slightly softened and brown, 25 to 30 minutes, then flip the mushrooms over, rotate the pans in the oven, and continue to bake until the mushrooms are well-browned and the edges are crispy, 30 to 35 minutes. Remove from the oven and transfer to the paper-towel lined baking sheet to dry for a few minutes. (Leave the oven on.)\n            \n\n              In a large bowl, whisk together the soy sauce, molasses, brown sugar, paprika and garlic powder. Carefully toss the baked mushrooms in the marinade until evenly coated. (You may need to do this in several batches.) Return the marinated mushrooms to the baking sheets in a single layer. Sprinkle with salt and a few grinds of pepper and return to the oven until crisp, about 5 minutes.\n            \n\n              For the coleslaw: Meanwhile, combine the cabbage and carrots in a large bowl and set aside. Combine the mayonnaise, vinegar, celery seed and sugar in a small bowl and mix well. Add and salt and pepper to taste. Pour the dressing over the cabbage and carrots and toss to coat. Add more sugar, salt and pepper if desired. Chill until ready to serve.\n            \n\n              To serve: Separate the party buns into halves. Place some of the mushrooms on the bottom half of the bun, then top with coleslaw. Add toppings as desired, then top with the top bun.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 6.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.125}, {"food": "soy sauce", "quantity": 2.0}, {"food": "molasses", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "smoked turkey roll", "quantity": 0.75}, {"food": "garlic powder", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "black bean mango", "quantity": 1}, {"food": "swamp cabbage", "quantity": 1.0}, {"food": "carrots", "quantity": 0.5}, {"food": "mayonnaise dressing", "quantity": 0.25}, {"food": "vinegar", "quantity": 1.0}, {"food": "celery seed", "quantity": 0.5}, {"food": "sugar", "quantity": 1}, {"food": "black bean mango", "quantity": 1}, {"food": "cinnamon buns", "quantity": 12.0}, {"food": "Worcestershire sauce", "quantity": 1}], "title": "\nVegan \"Pulled Pork\" Sliders\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Line the bottom and two long sides of a 9-by-5-by-3-inch loaf pan with parchment, leaving a 2-inch overhang on each long side, and lightly coat with cooking spray.\n            \n\n              Whisk the flour, baking soda and salt together in a medium bowl. Whisk the bananas, sugar, yogurt, oil and vanilla together in another medium bowl. Gently fold the wet ingredients into the dry ingredients with a rubber spatula until the batter just comes together (it's OK if there are lumps). Transfer the batter to the prepared loaf pan and bake until a tester inserted in the center comes out clean, 55 to 60 minutes; tent the loaf with foil if it is browning too quickly. Cool the loaf in the pan on a wire rack for 30 minutes, then lift it from the pan by the parchment overhangs and cool completely on the rack. Store the loaf in an airtight container at room temperature for up to 5 days.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 1.25}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "silk very vanilla", "quantity": 3.0}, {"food": "sugar", "quantity": 0.75}, {"food": "silk plain soy yogurt", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 1.0}], "title": "\nVegan Banana Bread\n"}, {"directions": "\n\n              Position a rack in the center of the oven and preheat to 350 degrees F. Line a 12-cup muffin tin with paper liners and set aside. Whisk the flour, baking soda and salt together in a medium bowl. Whisk the bananas, sugar, yogurt, oil and vanilla together in another medium bowl. Gently fold the wet ingredients into the dry ingredients with a rubber spatula until the batter just comes together (it's okay if there are lumps).\n            \n\n              Spoon about 1/4 cup of the batter into each lined muffin cup and bake until a tester inserted in the center comes out clean, about 30 minutes. Cool the muffins in the pan on a wire rack for 30 minutes, then remove muffins from pan and transfer to a rack to cool completely. Store the muffins in an airtight container at room temperature for up to 5 days.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.25}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "silk very vanilla", "quantity": 3.0}, {"food": "sugar", "quantity": 0.75}, {"food": "silk plain soy yogurt", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 1.0}], "title": "\nVegan Banana Muffins\n"}, {"directions": "\n\n              Add the basil, almonds, pistachios, tea, garlic, 3/4 teaspoon salt and lemon zest to a food processor. Cover and pulse a few times.\n            \n\n              Drizzle in the oil while pureeing; continue to process until the mixture makes a coarse pesto. Add salt to taste.\n            \n", "ingredients": [{"food": "chrysanthemum leaves", "quantity": 1.5}, {"food": "smoked turkey roll", "quantity": 0.3333333333333333}, {"food": "", "quantity": 1.0833333333333333}, {"food": "tea", "quantity": 0.25}, {"food": "garlic powder", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "lemon juice", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.25}], "title": "\nVegan Basil Pesto\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Line a 12-muffin tin with paper liners and lightly coat with cooking spray.\n            \n\n              Whisk the flour, baking powder and salt together in a large bowl. Whisk the brown sugar, yogurt, almond milk, oil, applesauce and vanilla together in a medium bowl.\n            \n\n              Gently fold the wet mixture into the dry mixture with a rubber spatula. Just before the batter comes together, fold in the blueberries (it's OK if there are some lumps in the batter). Divide the batter evenly among the muffin cups. Sprinkle the tops of the muffins evenly with the turbinado sugar. Bake until a tester inserted in the center comes out clean, 20 to 24 minutes. Let cool in the pan for a few minutes, then remove and cool completely on a rack. Store in an airtight container at room temperature for up to 3 days.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "salt", "quantity": 0.5}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "silk plain soy yogurt", "quantity": 0.5}, {"food": "milk", "quantity": 0.3333333333333333}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "applesauce", "quantity": 0.25}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "blueberries", "quantity": 2.0}, {"food": "sugar", "quantity": 2.0}], "title": "\nVegan Blueberry Muffins\n"}, {"directions": "\n\n              For the chickpea crab cakes: Place the reserved chickpea liquid into a large bowl, then add the cream of tartar and whip vigorously until foamy and thick.\n            \n\n              Whisk in the parsley, lemon juice, Old Bay and honey mustard, then add the bread pieces and toss to coat. Let sit until the bread is soft, about 5 minutes.\n            \n\n              Meanwhile, finely chop the chickpeas (alternatively, you can pinch or smush them). When the bread mixture is ready, add the chickpeas and toss and squeeze the mixture until it holds together. Form into eight 3/4-inch thick patties with nice rounded edges. Cover and chill them for at least 1 hour.\n            \n\n              For the tartar sauce: Whisk together the mayonnaise, honey mustard, Old Bay, pickle and pickle brine in a small bowl. Refrigerate until ready to serve.\n            \n\n              Preheat the oven to 350 degrees F. Whisk a large pinch of salt into the flour and put on a plate. Pour enough oil to cover the bottom of a large nonstick skillet and heat over medium-high heat. Dredge half of the cakes in the flour. Once the oil is hot and shimmering, add the cakes and cook until crunchy and deep golden brown, about 3 minutes per side. Adjust the heat as necessary to keep them from browning too quickly. Transfer to a baking sheet and repeat with the remaining cakes. Sprinkle each with salt, then bake until heated completely through, about 5 minutes.\n            \n\n              Serve the chickpea crab cakes with the tartar sauce and lemon wedges.\n            \n", "ingredients": [{"food": "chickpeas", "quantity": 15.25}, {"food": "ice cream swich", "quantity": 1}, {"food": "parsley", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "garlic bread", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "potato flour", "quantity": 0.6666666666666666}, {"food": "vegetable oil", "quantity": 1}, {"food": "mayonnaise dressing", "quantity": 0.25}, {"food": "mustard spinach", "quantity": 0.5}, {"food": "", "quantity": 1}, {"food": "pickle loaf", "quantity": 0.5}, {"food": "pickle loaf", "quantity": 1.0}], "title": "\nVegan Chickpea Crab Cakes\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F. Line three baking pans with parchment paper and set aside.\n            \n\n              Whisk the flours, cocoa powder, baking powder, salt and xanthan gum together in a medium bowl.\n            \n\n              Put the sugar, applesauce, coconut oil, grapeseed oil and vinegar in a large bowl and beat with an electric mixer on low speed until combined, about 1 minute. Add the flour mixture to the bowl with the wet ingredients, alternating with 1/3 cup water, until fully combined. Fold in the chocolate chips. \n            \n\n              Spoon heaping tablespoons (or a small scoop) of the dough onto the baking sheets, 1 inch to 1 1/2 inches apart. Bake the cookies in two batches, two sheets at a time, until the cookies are set and beginning to crack on the top, 16 to 18 minutes. Rotate the sheets halfway through for even baking.\n            \n\n              Remove from the oven and let the cookies cool on the sheets for 2 minutes, and then remove to a rack and cool completely. Bake the remaining cookies on the third pan following the above directions.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 0.75}, {"food": "potato flour", "quantity": 0.5}, {"food": "potato flour", "quantity": 3.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "salt", "quantity": 0.5}, {"food": "gum", "quantity": 0.5}, {"food": "sugar", "quantity": 1.5}, {"food": "applesauce", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "vinegar", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 1.0}], "title": "\nVegan Chocolate Cookies\n"}, {"directions": "\nSpecial equipment: A 9-inch springform pan\n\n              Position an oven rack in the center of the oven and preheat to 350 degrees F.\n            \n\n              For the crust: Spray a 9-inch springform pan with cooking spray. Add the graham crackers and sugar to the bowl of a food processor and process until fine crumbs form (you should have about 1 1/2 cups). Add the margarine and 2 tablespoons water to a measuring cup and melt in the microwave; add to the crumbs and blend until the mixture looks like wet sand. Pour the crumb mixture into the prepared pan; press it evenly into the bottom and use a measuring cup to smooth it evenly about 2 inches up the side. Bake until golden brown, about 15 minutes. Cool completely on a rack.\n            \n\n              For the filling: Add the tofu to the cleaned bowl of the food processor and process until smooth and very fluffy, about 2 minutes. Add the vegan cream cheese, sugar, cornstarch, vanilla, lemon juice and zest and orange juice and zest and process again until smooth and combined, 2 minutes more. Pour onto the cooled crust.\n            \n\n              Bake the cheesecake until the outside is set but the center is still a bit loose, about 1 hour. Turn off the oven and leave the cake in for 30 minutes more. Remove the cake from the oven and let it cool completely on a rack; cover and refrigerate overnight. About 30 minutes prior to serving, remove the cake from the refrigerator (if it weeps overnight, gently dab the top with a clean paper towel). Remove the springform ring, top the cheesecake with fresh raspberries and serve.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "", "quantity": 18.0}, {"food": "sugar", "quantity": 3.0}, {"food": "margarine spread", "quantity": 3.0}, {"food": "firm tofu", "quantity": 1.5}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "sugar", "quantity": 1.5}, {"food": "cornstarch", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "orange juice", "quantity": 1.0}, {"food": "raspberries", "quantity": 2.0}], "title": "\nVegan Classic Cheesecake\n"}, {"directions": "\n\n              Heat the oil in a large saucepan over medium heat. Add the onions and 1/2 teaspoon salt and cook until light brown, about 7 minutes. Add the celery, garlic and 1/4 teaspoon pepper and cook for 5 minutes. Add the potatoes, 4 cups water and 1/2 teaspoon salt, raise the heat to high and bring to a boil. Return the heat to medium, cover and cook until the potatoes are tender, about 15 minutes. Add the broccoli, cover and cook until the broccoli is bright green, about 5 minutes.\n            \n\n              Transfer the soup to a blender; add the soy milk and puree until smooth, leaving the filler cap slightly open to let steam escape (or puree the soup in the pot with an immersion blender). Return the soup to the saucepan and bring to a simmer; stir in the nutritional yeast and nutmeg. Add water if needed to adjust consistency and add salt and pepper to taste.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "celery seed", "quantity": 0.5}, {"food": "garlic powder", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "sweet potatoes", "quantity": 2.75}, {"food": "broccoli raab", "quantity": 4.0}, {"food": "milk", "quantity": 0.5}, {"food": "yeast extract spread", "quantity": 0.25}, {"food": "nutmeg", "quantity": 0.25}], "title": "\nVegan Cream of Broccoli Soup\n"}, {"directions": "\n\n              Set a baking sheet on an oven rack and preheat to 200 degrees F.\n            \n\n              Blend the almond milk, soy yogurt, cornstarch, sugar, cinnamon and vanilla in a blender until combined. Transfer to a casserole dish or glass pie plate.\n            \n\n              Heat a large nonstick skillet over medium heat. Add 1 tablespoon of the oil, swirling the skillet to coat the surface. Place 3 slices of bread in the milk-yogurt mixture, let soak for about 1 minute per side, then carefully lay the slices in the skillet. Cook, undisturbed, until browned and crisp, 2 to 4 minutes per side (adjust the heat as needed). Serve immediately or transfer to the rack in the oven to keep warm. Repeat with the remaining oil, bread and milk-soy mixture. Serve with maple syrup.\n            \n", "ingredients": [{"food": "milk", "quantity": 1.25}, {"food": "silk banana-strawberry soy yogurt", "quantity": 0.5}, {"food": "cornstarch", "quantity": 2.0}, {"food": "sugar", "quantity": 2.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 4.0}, {"food": "barbecue loaf", "quantity": 1.75}, {"food": "syrup", "quantity": 1}], "title": "\nVegan French Toast\n"}, {"directions": "\n\n              Position an oven rack in the highest position, and preheat to 450 degrees F. Toss the onions, celery, carrots and garlic with 1 teaspoon each oil and salt on a rimmed baking sheet. Roast until the vegetables are charred in some places, 25 to 30 minutes.\n            \n\n              Bring the roasted vegetables, 1 cup water, mushrooms, thyme, sun-dried tomatoes, soy sauce, bay leaf and 1 teaspoon salt to a simmer in a medium saucepan over medium-high heat. Cook, stirring occasionally, until most of the liquid is gone, 8 to 10 minutes. Add 6 cups water and 1/2 teaspoon salt, and bring back to a simmer. Reduce the heat to medium-low, and gently simmer until reduced by about one third, about 45 minutes. Strain the stock through a strainer into a large liquid measuring cup; use the back of a ladle to squeeze all the liquid out of the solids (there should be about 4 cups of stock). If not making gravy right away, let the stock cool to room temperature, then refrigerate for up to 3 days or freeze for up to 1 month.\n            \n\n              To make the gravy, warm the stock slightly in a medium saucepan if it has been refrigerated. Heat the remaining 4 tablespoons oil in another medium saucepan over medium heat. Add the sage leaves, and cook until fried and crispy, about 2 minutes; remove and set aside. Add the flour to the saucepan, and stir until smooth and lightly golden, about 2 minutes. Slowly pour in the warm stock while whisking constantly until smooth and thick, 8 to 10 minutes\n            \n\n              Chop up the fried sage, stir it into the gravy along with the parsley and season to taste with pepper.\n            \n", "ingredients": [{"food": "onion powder", "quantity": 1.0}, {"food": "celery seed", "quantity": 2.0}, {"food": "carrot juice", "quantity": 1.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "mushrooms", "quantity": 1.0}, {"food": "thyme", "quantity": 6.0}, {"food": "tomatoes", "quantity": 2.0}, {"food": "soy sauce", "quantity": 2.0}, {"food": "corier leaf", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 6.0}, {"food": "potato flour", "quantity": 0.3333333333333333}, {"food": "parsley", "quantity": 0.25}, {"food": "black bean mango", "quantity": 1}], "title": "\nVegan Gravy\n"}, {"directions": "\n\n              Bring a large pot of water to a boil and cook the fettuccine according to package directions. Strain, reserving 1 cup of the pasta cooking water.\n            \n\n              Add the soy milk, soy cream cheese, almonds, nutritional yeast, lemon zest, 1 teaspoon salt and 1/4 teaspoon pepper to a blender and process until smooth.\n            \n\n              Heat the oil and garlic in a large skillet over medium heat, stirring until the garlic just starts to sizzle and softens, about 1 minute. Add the soy milk mixture and 1/2 cup of the reserved pasta water, bring to a simmer and cook until thick and creamy, about 8 minutes. Remove from the heat, add the fettuccini and parsley and toss to combine. Thin out with a little more pasta water if needed.\n            \n\n              Divide the pasta among four bowls and sprinkle each with some nutritional yeast and a few grinds of pepper.\n            \n", "ingredients": [{"food": "", "quantity": 12.0}, {"food": "milk", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "yeast extract spread", "quantity": 3.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "chrysanthemum leaves", "quantity": 0.5}], "title": "\nVegan Lemon Fettuccine Alfredo\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Bring the lentils and 1 3/4 cup of the broth to a boil in a medium saucepan over high heat. Reduce heat to medium-low, partially cover and simmer until the lentils are fully softened and the liquid is absorbed, about 30 minutes. Transfer to a medium bowl with the remaining 1 tablespoon broth and mash well with a potato masher. Set aside.\n            \n\n              Heat the oil in a large nonstick skillet over medium heat. Add the chopped onion, lemon juice and 1/4 teaspoon salt and cook, stirring, until softened, about 6 minutes. Add the spinach, garlic, 1 1/2 teaspoons black pepper and cumin and stir until the spinach is wilted, about 3 minutes.\n            \n\n              Add the spinach mixture, breadcrumbs, walnuts and 3/4 teaspoon salt to the lentils and mix thoroughly. Cover and refrigerate for at least 1 hour or overnight.\n            \n\n              Preheat the grill to medium-high. Form the mixture into six 4-inch patties and spray with cooking spray on each side. Grill until nice grill marks form, about 3 minutes per side. Place the patties in the buns with the sliced onion and other toppings, as desired, and serve.\n            \n", "ingredients": [{"food": "lentils", "quantity": 0.75}, {"food": "vegetable oil", "quantity": 1.75}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "mustard spinach", "quantity": 8.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "cumin seed", "quantity": 0.5}, {"food": "", "quantity": 1.0}, {"food": "walnuts", "quantity": 0.5}, {"food": "", "quantity": 1}, {"food": "cinnamon buns", "quantity": 6.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1}], "title": "\nVegan Lentil Burgers\n"}, {"directions": "\n\n              Bring a large pot of water to a boil.\n            \n\n              Put the cauliflower and 1 cup water in a small saucepan over medium heat. Cover, bring to a simmer and cook until the cauliflower is fully softened, about 20 minutes. Transfer the cooked cauliflower and all the cooking liquid to a food processor and set aside. Wipe out the saucepan.\n            \n\n              Heat the oil in the saucepan over medium heat. Add the shallot and garlic and cook, stirring, until softened, about 3 minutes. Stir in the lemon juice, miso, mustard, 1 teaspoon salt, 3/4 teaspoon black pepper, cayenne and turmeric until well combined. Gradually whisk in the almond milk, nutritional yeast and brown sugar and bring just to a simmer. Remove from heat.\n            \n\n              Process the cauliflower until smooth. With the food processor running, gradually add the warm almond milk mixture and process until extra creamy.\n            \n\n              Transfer the cauliflower-almond milk mixture to a large saucepan over medium heat, add the vegan Cheddar and stir occasionally until it melts.\n            \n\n              Meanwhile, add the elbow macaroni to the boiling water and cook according to package directions. Strain, reserving 1 cup of pasta water.\n            \n\n              Add the pasta to the sauce and stir to combine. Stir in some of the reserved pasta cooking liquid to reach your desired consistency. Add salt to taste. Serve hot with hot sauce on the side if using.\n            \n", "ingredients": [{"food": "cauliflower", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "miso", "quantity": 1.0}, {"food": "spicy black bean enchilada", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "pepper", "quantity": 0.5}, {"food": "turmeric", "quantity": 0.125}, {"food": "milk", "quantity": 0.75}, {"food": "yeast extract spread", "quantity": 0.25}, {"food": "sugar", "quantity": 2.0}, {"food": "", "quantity": 10.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1}], "title": "\nVegan Mac 'n' Cheese\n"}, {"directions": "\nSpecial equipment: 1 large pastry bag 1 large star or round pastry tip\n\n              Preheat the oven to 250 degrees F. Line 2 baking sheets with parchment.\n            \n\n              Strain the chickpeas directly into the bowl of a stand mixer. There should be about 3/4 cup liquid; reserve the chickpeas for another use. Add the cream of tartar and a pinch of salt to the liquid, and beat on medium-high speed until very foamy. While still beating, add the sugar, 1 tablespoon at a time, then continue to beat until the mixture forms stiff and glossy peaks, about 4 minutes.\n            \n\n              Transfer the mixture to a large pastry bag fitted with a large star or round tip, and pipe 2-inch mounds about 2 inches apart onto the prepared baking sheets. Bake until the meringues are set and no longer glossy, about 2 hours, rotating the trays (from top to bottom) halfway through. Turn the oven off, and let the meringues sit in the closed oven until they have dried out inside, about 1 hour more. (The meringues will keep in an airtight container for up to 3 days.)\n            \n", "ingredients": [{"food": "chickpeas", "quantity": 15.0}, {"food": "ice cream swich", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "sugar", "quantity": 0.75}], "title": "\nVegan Meringues\n"}, {"directions": "\n\n              Preheat the oven to 250 degrees F. Whisk together the flour, sugar, baking powder and 1 teaspoon salt in a medium bowl. Whisk together the soy milk, coconut oil and vanilla in a second medium bowl (don't worry if the coconut oil clumps). Add the soy milk mixture to the flour mixture and gently fold until just combined (it's OK if there are lumps).\n            \n\n              Heat a nonstick griddle or large nonstick skillet over medium-low heat. Add 1 teaspoon of the vegetable oil. Once the pan is hot, add three 1/4-cup mounds of batter, evenly spaced, and cook until the pancakes begin to bubble and are golden brown, 4 to 5 minutes. Carefully flip the pancakes and cook until the underside is golden brown and the pancakes are cooked through, 3 to 4 minutes (adjust the heat as necessary for consistent browning). Repeat with the remaining vegetable oil and batter. Transfer the cooked pancakes to the oven to keep warm. Serve 2 per person with maple syrup, nut butter, jam or your favorite topping.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.0}, {"food": "sugar", "quantity": 3.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "silk plain soy yogurt", "quantity": 1.5}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 4.0}, {"food": "butter oil", "quantity": 1}], "title": "\nVegan Pancakes\n"}, {"directions": "\n\n              Put the flour, sugar, vinegar and 1/2 teaspoon salt in a food processor, and pulse to combine. Add the coconut oil in small spoonfuls, and pulse until the largest pieces are pea-size. Add 8 tablespoons ice water, and pulse until evenly combined. Squeeze a handful of the dough together; it should just hold its shape. If the mixture is very powdery, pulse in an additional 1 to 2 tablespoons ice water. Divide the dough between 2 large pieces of plastic wrap, pat each into a 1/2-inch-thick disc and chill for at least 1 hour up to overnight.\n            \n\n              To make rolling easier, let the dough soften up a bit-it should be slightly soft when pressed-at room temperature (this may take anywhere from 20 to 40 minutes depending on the temperature of your kitchen).\n            \n", "ingredients": [{"food": "potato flour", "quantity": 3.0}, {"food": "sugar", "quantity": 2.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 8.0}], "title": "\nVegan Pie Dough\n"}, {"directions": "\n\n              Heat 2 tablespoons of oil in a large skillet over medium-high heat, then add the onions, mushrooms and 1/4 teaspoon salt and cook, stirring, until the onions and mushrooms are soft and thick almost like a paste, about 6 minutes. Stir in the soy sauce and remove from the heat. Let cool.\n            \n\n              Put the drained beans, chickpea flour, onion-mushroom mixture and 1 tablespoon oil in a food processor and pulse until the beans are finely chopped and hold together when squeezed, but not a smooth paste. Add the sage, thyme, maple syrup, rosemary, nutmeg, red pepper flakes, 1 teaspoon salt and 1/4 teaspoon pepper and pulse until combined.\n            \n\n              Divide the bean mixture into 12 even portions. Roll each out into a cylinder about 4 inches long, then roll up tightly in plastic wrap and twist the ends to secure.\n            \n\n              Set up a steamer and arrange the rolled up sausages in it (you may have to do this in batches). Heat the steamer over medium heat and once steaming, cover and steam until the sausages have plumped up, about 20 minutes. Remove from heat, uncover and refrigerate the steamed sausages until firm, about 2 hours or up to overnight.\n            \n\n              Preheat the oven to 350 degrees F. Unwrap the sausages and heat the remaining 2 tablespoons oil in a large ovenproof nonstick skillet over medium-high heat. Add the sausages and cook, turning them as needed, until browned and crisp all over, about 5 minutes. Transfer the skillet to the oven and bake until heated all the way through, about 5 minutes.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "mushrooms", "quantity": 8.0}, {"food": "salt", "quantity": 1}, {"food": "soy sauce", "quantity": 1.0}, {"food": "fava beans", "quantity": 15.0}, {"food": "chickpea flour", "quantity": 0.3333333333333333}, {"food": "sage", "quantity": 2.0}, {"food": "thyme", "quantity": 2.0}, {"food": "syrup", "quantity": 1.5}, {"food": "rosemary", "quantity": 1.0}, {"food": "nutmeg", "quantity": 0.5}, {"food": "ruby red grapefruit juice blend", "quantity": 1}, {"food": "black bean mango", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1}], "title": "\nVegan Pinto Bean Breakfast Sausage\n"}, {"directions": "\n\n              Put the potatoes in a small saucepan, and add just enough water to cover them. Bring to a boil, and cook until the potatoes are tender, about 10 minutes. Drain through a sieve, and shake all the remaining water off. Return the potatoes to the saucepan, and add 2 tablespoons of the oil, nutritional yeast and 1/2 teaspoon salt. Mash with a fork until roughly smooth (it's OK if there are a few lumps). Set aside.\n            \n\n              Heat the remaining 2 tablespoons oil in a small skillet over medium-high heat; add the shallots and a pinch of salt, and cook, stirring frequently, until soft and just starting to brown, about 3 minutes. Add the vinegar, tomato paste, paprika and cayenne and cook, stirring constantly, until the spices are toasted and the oil turns brick red, about 1 minute. Remove from the heat, and scrape every last bit into the mashed potatoes. Add half the parsley and peppers, the olives and 3/4 teaspoon salt, and stir to combine. (The filling can be made and refrigerated up to a day in advance.)\n            \n\n              Preheat the oven to 425 F. Arrange the phyllo cups on a baking sheet, and fill each with a heaping teaspoon of the potato mixture. Bake until the filling is hot, 4 to 5 minutes. Garnish with the remaining parsley and peppers.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.25}, {"food": "vegetable oil", "quantity": 4.0}, {"food": "yeast extract spread", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 1.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 0.5}, {"food": "", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "peppers", "quantity": 2.0}, {"food": "olives", "quantity": 12.0}, {"food": "tostada shells", "quantity": 30.0}], "title": "\nVegan Potato, Pepper and Olive Phyllo Cups\n"}, {"directions": "\n\n              For the crust: Put the flour, sugar, vinegar and 1/2 teaspoon salt in a food processor, and pulse to combine. Add the coconut oil in small spoonfuls, and pulse until the largest pieces are pea-sized. Add 4 tablespoons ice water, and pulse until evenly combined. Squeeze a handful of the dough together; it should just hold its shape. If the mixture is too powdery, pulse in an additional 1 to 2 tablespoons ice water. Turn the dough out onto a large piece of plastic wrap, pat into a 1/2-inch-thick disc and chill for at least 1 hour up to overnight.\n            \n\n              To make rolling easier, let the dough soften up a bit-it should be slightly soft when pressed-at room temperature (this may take anywhere from 20 to 40 minutes depending on the temperature of your kitchen). Roll the disc into a 12-inch round on a lightly floured surface or between two pieces of floured parchment paper. If the dough gets too warm, refrigerate it to firm it up. Ease the crust into a 9-inch pie plate. Fold the overhanging dough under itself, and crimp the edge as desired. Chill for 30 minutes.\n            \n\n              Position an oven rack in the center of the oven, and preheat to 350 degrees F. Line the chilled pie crust with a large coffee filter or foil, and fill with pie weights. Bake until the edges are lightly golden, 20 to 25 minutes. Remove the coffee filter or foil and weights, and continue baking until the crust is lightly golden all over, 15 to 20 minutes more. Transfer to a rack, and let cool completely.\n            \n\n              For the filling: Process the pumpkin puree, tofu, sugar, cornstarch, cinnamon, nutmeg, vanilla and 1/4 teaspoon salt in a food processor until completely smooth, scraping down the sides of the bowl as needed.\n            \n\n              Pour the filling into the parbaked pie shell, and bake until firm and set, 40 to 45 minutes. Let cool completely on a rack. Chill for at least 2 hours up to overnight. Slice and serve.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.5}, {"food": "sugar", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "ice cream swich", "quantity": 4.0}, {"food": "", "quantity": 1}, {"food": "pumpkin flowers", "quantity": 15.0}, {"food": "soft tofu", "quantity": 8.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "cornstarch", "quantity": 2.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "nutmeg", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "salt", "quantity": 1}], "title": "\nVegan Pumpkin Pie\n"}, {"directions": "\n\n              Position an oven rack in the middle of the oven; preheat the oven to 400 degrees F.\n            \n\n              Cut each squash in half lengthwise and scoop out and discard the seeds. Arrange the halves in a large baking dish, flesh-side up.\n            \n\n              Whisk together the vinegar, 2 tablespoons of the oil and the maple syrup in a cup. Brush the flesh side of the squash halves with some of the maple mixture and sprinkle with 1/4 teaspoon salt and a few grinds of pepper. Put the squash flesh-side down in the baking dish, then brush the skin side with maple mixture and sprinkle with 1/4 teaspoon salt and a few grinds of pepper. Roast until the squash is fork-tender, 50 to 60 minutes. Poke the inside of the squash halves with a fork and brush generously with more of the maple mixture.\n            \n\n              Meanwhile, heat the remaining 1 tablespoon oil in a medium saucepan over medium-high heat. Add the onions and cook, stirring occasionally, until soft and golden brown, about 6 minutes. Add the quinoa, curry powder, cinnamon, and 1 teaspoon salt and stir until the spices are toasted, about 1 minute. Add 2 cups water and bring to a simmer. Lower the heat, cover the pan and simmer, stirring occasionally, until the quinoa is tender and most of the liquid is absorbed, 20 to 24 minutes. Remove from the heat and let sit, covered, for 5 minutes. Uncover and stir in the cranberries, remaining maple mixture, half of the parsley and half of the pistachios.\n            \n\n              Stuff the squash halves with the quinoa and sprinkle with the remaining parsley and pistachios. Serve warm or at room temperature.\n            \n", "ingredients": [{"food": "acorn flour", "quantity": 2.0}, {"food": "vinegar", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "syrup", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "onion powder", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "curry powder", "quantity": 1.0}, {"food": "cinnamon", "quantity": 0.5}, {"food": "pepper", "quantity": 0.25}, {"food": "cranberries", "quantity": 0.25}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "", "quantity": 0.25}], "title": "\nVegan Quinoa-Cranberry Stuffed Acorn Squash\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Place the garlic on a piece of foil, drizzle with 1 teaspoon of the oil, wrap and roast until very tender, about 20 minutes.\n            \n\n              Meanwhile, put the potatoes in a large saucepan, cover by 1 inch with cold water and bring to a boil. Reduce the heat to a simmer and cook until the potatoes are very tender, about 20 minutes. Strain and return the potatoes to the saucepan.\n            \n\n              Add the roasted garlic with any juice that has collected, almond milk, remaining 2 teaspoons of oil and 1 1/4 teaspoons salt to the potatoes. Mash with a potato masher until smooth or to the desired consistency, adding additional almond milk if necessary. Stir in the chives and add salt to taste. Transfer the potatoes to a serving bowl, garnish with additional chives and serve.\n            \n", "ingredients": [{"food": "garlic powder", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "sweet potatoes", "quantity": 2.75}, {"food": "milk", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "chives", "quantity": 2.25}], "title": "\nVegan Roasted-Garlic Mashed Potatoes\n"}, {"directions": "\n\n              Separate the white and green (light and dark) portions of the leek, and cut each in half lengthwise; rinse well to remove any soil. Roughly chop the green top, and set aside for the stock. Thinly slice the white portion into half circles, and set aside for the risotto. Cut the tops off the fennel, and roughly chop for the stock. Finely chop the fennel bulb, and set aside for the risotto.\n            \n\n              For the stock: Put the wine, leek greens, fennel tops, carrots, celery, garlic, orange peel, parsley, thyme, bay leaf, 1 teaspoon salt and peppercorns in a large pot. Bring to a simmer, and cook, stirring occasionally, until most of the wine has evaporated, 6 to 7 minutes. Add 10 cups of water, and bring to a boil; reduce to a gentle simmer, and cook until the stock has reduced by about one third (7 to 8 cups), about 30 minutes. Strain, then use the back of a ladle to squeeze out any excess liquid from the vegetables; discard the vegetables, and keep the stock warm (or cool the stock and refrigerate for up to 3 days).\n            \n\n              For the risotto: Add a splash of water to the saffron in a small bowl, and set aside to bloom.\n            \n\n              Heat the oil in a large saucepan over medium heat. Add the sliced leeks, chopped fennel and a pinch of salt, and cook, stirring frequently with a wooden spoon, until soft, 6 to 7 minutes. Add the tomato paste, soy sauce, garlic, 1 teaspoon salt and cayenne, and stir for 1 minute. Add the rice, and stir until coated. Add the wine, and simmer, stirring constantly, until it is absorbed, about 1 minute. Add 3 cups of the warm stock, the saffron and the blooming water to the rice. Bring to a simmer, and cook, stirring constantly, until most of the liquid is absorbed, 7 to 8 minutes. Add 3 more cups of stock, bring back to a simmer and cook, stirring constantly, until the rice is tender but slightly toothsome, 10 to 12 minutes more. In the last few minutes of cooking, add the tomatoes.\n            \n\n              Remove the saucepan from the heat. Stir in half the parsley and 3 tablespoons of the nutritional yeast, and season to taste with salt and pepper. Adjust the consistency of the risotto by adding more of the stock as necessary. Pour into a serving dish, and sprinkle with the remaining parsley and 1 tablespoon nutritional yeast.\n            \n", "ingredients": [{"food": "", "quantity": 1.0}, {"food": "fennel seed", "quantity": 1.0}, {"food": "martha white foods", "quantity": 1.0}, {"food": "carrots", "quantity": 2.0}, {"food": "celery seed", "quantity": 1.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "hearts of palm", "quantity": 3.0}, {"food": "parsley", "quantity": 4.0}, {"food": "thyme", "quantity": 2.0}, {"food": "corier leaf", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "black bean mango", "quantity": 5.0}, {"food": "saffron", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "soy sauce", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "crisped rice bar", "quantity": 2.0}, {"food": "martha white foods", "quantity": 1.0}, {"food": "plum", "quantity": 14.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "yeast extract spread", "quantity": 4.0}], "title": "\nVegan Saffron Risotto\n"}, {"directions": "\n\n              Position an oven rack in the middle and preheat the oven to 375 degrees F. Brush the sides and bottom of a 2-quart baking dish with oil.\n            \n\n              Combine the tofu, 2 tablespoons oil, almonds, nutritional yeast, lemon juice, garlic, 1 teaspoon salt and a few grinds of pepper in a food processor and pulse until completely smooth.\n            \n\n              Heat the remaining 1 tablespoon oil in a large skillet over medium-high heat, then add the onions and cook, stirring frequently, until soft and deeply golden brown, 6 to 8 minutes. Remove from heat and stir in the parsley and thyme. Transfer the onion-herb mixture to a small bowl. (There's no need to wipe out the skillet; there's a lot of flavor in there.)\n            \n\n              Combine the potatoes, almond milk, 1 cup water and 1 teaspoon salt in the skillet and bring to a simmer over medium heat. Cook, gently tossing the potatoes from the bottom to the top with a rubber spatula frequently, until the liquid has reduced and thickened and the potatoes are just slightly tender, 15 to 18 minutes.\n            \n\n              Transfer half of the potatoes and cooking liquid to the oiled baking dish and arrange in an even layer. Season with 1/2 teaspoon salt and few grinds of pepper. Drizzle with half of the tofu mixture and sprinkle with about a third of the onion-herb mixture. Top with the remaining potatoes and cooking liquid and season with another 1/2 teaspoon of salt and a few grinds of pepper. Drizzle with the remaining tofu mixture and sprinkle with the remaining onion-herb mixture.\n            \n\n              Cover the dish with foil and bake until just bubbly, about 30 minutes. Uncover and continue to bake until very bubbly and lightly golden brown, about 15 minutes more. Sprinkle with parsley leaves and let rest for 10 minutes before serving.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "soft tofu", "quantity": 8.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "yeast extract spread", "quantity": 2.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "onion powder", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 2.125}, {"food": "milk", "quantity": 1.5}], "title": "\nVegan Scalloped Potatoes\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Grease a 9-inch square baking dish with oil.\n            \n\n              Heat the oil in a large nonstick skillet over medium-high heat. Add the sliced garlic, fennel seeds and red pepper flakes and stir until fragrant, about 45 seconds. Add the mushrooms and cook, undisturbed, until they begin to brown in spots, about 3 minutes. Continue to cook, stirring occasionally, until tender, about 4 minutes more. Add the tomatoes, 1 cup water and 1 teaspoon salt, bring to a simmer and cook until the sauce is reduced and most of the water is evaporated, 10 to 15 minutes. Let cool.\n            \n\n              Meanwhile, add the tofu, spinach, vegan cream cheese, basil, nutritional yeast, whole clove garlic, 1 teaspoon salt and nutmeg to a food processor and pulse until smooth.\n            \n\n              Spread a few tablespoons of the mushroom-tomato sauce on the bottom of the prepared baking dish and top with 4 noodles (it's OK if they overlap slightly; break 1 noodle into pieces to fill in any gaps if needed). Add half of the tofu mixture and spread out evenly. Top with a third of the sauce. Repeat with another 4 noodles, the remaining spinach mixture and half the remaining sauce. Finish the lasagna with the remaining 4 noodles and sauce. Cover with foil and bake until the lasagna is hot, about 45 minutes. Remove the foil, sprinkle with the shredded vegan cheese and bake until the lasagna is very hot and the cheese is slightly melted, about 15 minutes more. Let cool for a few minutes, cut into 6 pieces and garnish with basil leaves.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "fennel seed", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "tomatoes", "quantity": 28.0}, {"food": "salt", "quantity": 1}, {"food": "firm tofu", "quantity": 12.0}, {"food": "mustard spinach", "quantity": 10.0}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "yeast extract spread", "quantity": 3.0}, {"food": "nutmeg", "quantity": 0.5}, {"food": "lasagna", "quantity": 12.0}, {"food": "macaroni cheese", "quantity": 0.5}], "title": "\nVegan Spinach and Mushroom Lasagna\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F. Grease a 9-by-13-inch baking dish with oil.\n            \n\n              Brew the tea bags in 2 cups of hot water for 5 minutes. Discard the tea bags (don't squeeze them out).\n            \n\n              Heat 3 tablespoons oil in a large skillet over medium heat. Add the onions and celery and cook, stirring frequently, until just soft, about 6 minutes. Add the mushrooms, sage, thyme, 1 1/2 teaspoon salt and a few grinds of pepper and cook, stirring, until the mushrooms are soft, about 4 minutes. Add the brewed green tea, then bring to a simmer and remove from heat.\n            \n\n              Put the bread in a large bowl and pour in the green tea-vegetable mixture. Add the parsley and toss until the bread is completely coated. Let rest for 10 minutes so the bread can soak up the liquid. Gently toss again and transfer to the prepared baking dish. Drizzle with the remaining 1 tablespoon oil.\n            \n\n              Cover with foil and bake for 30 minutes. Uncover and continue to bake until golden brown, about 15 minutes more. Serve hot.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 4.0}, {"food": "tea", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "celery seed", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 8.0}, {"food": "sage", "quantity": 1.0}, {"food": "thyme", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "garlic bread", "quantity": 16.0}, {"food": "parsley", "quantity": 0.25}], "title": "\nVegan Stuffing\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Cover the sunflower seeds with at least 1/4 inch of water and soak, at room temperature in an air tight container, for at least 24 hours. The seeds are ready when they have nearly doubled in size.\n            \n\n              Drain the seeds and pulse half (about 1 cup) with the lemon juice, mustard and 1/4 teaspoon salt in a food processor until almost smooth, scraping down the bowl as needed.\n            \n\n              Add the remaining seeds, along with the dill, parsley, paprika, celery, shallot, 1/4 teaspoon salt and a few grinds of pepper to the food processor. Pulse until the mixture resembles tuna salad. Refrigerate in an airtight container for up to 3 days.\n            \n\n              Fill a whole wheat wrap with lettuce, tomato, avocado and the vegan tuna salad.\n            \n", "ingredients": [{"food": "sunflower seed kernels", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "dill seed", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "paprika", "quantity": 0.25}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "pasta with tomato sauce", "quantity": 1}], "title": "\nVegan Sunflower Seed Tuna Salad\n"}, {"directions": "\n\n              Combine the tofu, turmeric, 1/2 teaspoon black pepper, 1/4 teaspoon salt and cayenne if using in a medium bowl. Toss well to combine and set aside.\n            \n\n              Heat the oil in a large nonstick skillet over medium-high heat. Add the scallion whites and cook, stirring, until soft, about 1 minute. Add the tofu mixture and cook, stirring occasionally, until the tofu is lightly browned and resembles scrambled eggs, about 5 minutes.\n            \n\n              Add the spinach, lemon juice and 1/2 teaspoon salt and stir until the spinach is wilted, about 1 minute. Add the tomatoes and scallion greens and stir until the tomatoes are just heated through and begin to soften, about 1 minute. Remove from the heat, add the basil and stir to combine. Season with salt and pepper.\n            \n", "ingredients": [{"food": "firm tofu", "quantity": 14.5}, {"food": "turmeric", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "pepper", "quantity": 0.125}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "mustard spinach", "quantity": 5.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "grape juice", "quantity": 1.0}, {"food": "basil", "quantity": 0.5}], "title": "\nVegan Tofu and Spinach Scramble\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F. Line three baking pans with parchment paper and set aside.\n            \n\n              Whisk the flours, baking powder, salt and xanthan gum together in a medium bowl.\n            \n\n              Put the sugar, applesauce, coconut oil, grapeseed oil, vanilla and vinegar in a large bowl and beat with an electric mixer on low speed until combined, about 1 minute. Add the flour mixture to the bowl with the wet ingredients, alternating with 1/3 cup water, until fully combined. Fold in the chopped walnuts.\n            \n\n              Spoon heaping tablespoons (or a small scoop) of the dough onto the baking sheets, 1 inch to 1 1/2 inches apart. Bake the cookies in two batches, two sheets at a time, until the cookies are set and slightly browned around the edges, 18 to 20 minutes.\n            \n\n              Remove from the oven and let the cookies cool on the sheets for 2 minutes, and then remove to a rack and cool completely. Bake the remaining cookies on the third pan following the above directions.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.5}, {"food": "potato flour", "quantity": 0.75}, {"food": "potato flour", "quantity": 3.0}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "salt", "quantity": 0.5}, {"food": "gum", "quantity": 0.5}, {"food": "sugar", "quantity": 1.5}, {"food": "applesauce", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "vinegar", "quantity": 0.5}, {"food": "walnuts", "quantity": 1.5}], "title": "\nVegan Vanilla Cookies with Walnuts\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F. Line a 12-cup muffin tin with paper liners and spray the liners with nonstick cooking spray.\n            \n\n              For the cake: Whisk together the flour, granulated sugar, baking powder, baking soda and salt in a medium bowl. Whisk together the almond milk, brown sugar, oil and vanilla in another medium bowl. Add the almond milk mixture to the flour mixture and gently fold until just combined (it's OK if there are lumps). Divide the batter evenly among the prepared liners.\n            \n\n              Bake the cupcakes until they are golden brown and bounce back when pressed and a toothpick inserted in the center comes out clean, 20 to 22 minutes. Let cool in the pan for a few minutes, then transfer to a rack to cool completely.\n            \n\n              For the frosting: Beat the margarine on medium-high in the bowl of a stand mixer fitted with a paddle attachment (or in a large bowl if using a hand mixer) until smooth, about 1 minute. Add the confectioners' sugar, almond milk and vanilla and beat on low until the frosting comes together and is smooth, about 1 minute.\n            \n\n              Frost and decorate the cupcakes as desired.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 2.25}, {"food": "sugar", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "milk", "quantity": 1.5}, {"food": "sugar", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "margarine spread", "quantity": 0.5}, {"food": "sugar", "quantity": 3.0}, {"food": "milk", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 0.5}], "title": "\nVegan Vanilla Cupcakes\n"}, {"directions": "\n\n              Position an oven rack in the middle of the oven and preheat to 400 degrees F.\n            \n\n              Cut each squash in half lengthwise and scoop out and discard the seeds. Arrange the halves in a large baking dish, flesh-side up.\n            \n\n              Whisk together the vinegar, maple syrup and 2 tablespoons oil. Brush the flesh-side of the squash halves with some of the maple-oil and sprinkle with 1/4 teaspoon salt and a few grinds of pepper. Put the squash flesh-side down in the baking dish, then brush the skin side with the maple-oil mixture and sprinkle with 1/4 teaspoon salt and a few grinds of pepper. Roast until the squash is fork-tender, 30 to 40 minutes. Let the squash rest until cool enough to handle. Scoop some of the flesh out into a large bowl, leaving about 1/4-inch border of flesh all around. Leave the scooped-out flesh in relatively large chunks.\n            \n\n              Meanwhile, heat 1 tablespoon oil in a medium saucepan over medium-high heat, then add the onions and cook, stirring occasionally, until soft and golden brown, about 6 minutes. Add the rice, curry powder, cinnamon, cayenne and 1/2 teaspoon salt and stir until the spices are toasted, about 1 minute. Add 2 cups water and bring to a simmer covered, stirring occasionally, until the rice is tender and most of the liquid is absorbed, 30 to 40 minutes (different brands of wild rice may vary in cooking times; add more water if needed). Remove from heat and add to the chunks of butternut squash along with the remaining maple-oil, cherries, parsley, sage, 1/2 teaspoon salt and a few grinds of black pepper.\n            \n\n              Evenly stuff the scooped-out squash halves with the filling, then drizzle with the remaining 1 tablespoon oil and bake, uncovered, until the filling is warmed through, about 30 minutes. Cut each in half crosswise and transfer to a serving platter. Sprinkle with walnuts and parsley. Serve warm.\n            \n", "ingredients": [{"food": "", "quantity": 2.0}, {"food": "vinegar", "quantity": 3.0}, {"food": "syrup", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 4.0}, {"food": "black bean mango", "quantity": 1}, {"food": "onion powder", "quantity": 1.0}, {"food": "wild rice", "quantity": 0.5}, {"food": "curry powder", "quantity": 0.5}, {"food": "cinnamon", "quantity": 0.5}, {"food": "pepper", "quantity": 0.25}, {"food": "maraschino cherries", "quantity": 3.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "sage", "quantity": 1.0}, {"food": "walnuts", "quantity": 0.25}], "title": "\nVegan Wild-Rice-Stuffed Butternut Squash\n"}, {"directions": "\n\n              Make the rice: Place the rice in a sieve and rinse under cold running water until the water runs clear. Set aside.\n            \n\n              Melt the butter in a medium saucepan with a tight-fitting lid, over medium-high heat. Add the golden raisins, almonds, turmeric, cumin seed, coriander seed, cardamom pods, and cinnamon stick and cook, stirring, until toasted and fragrant, about 2 minutes. Add the rice and cook, stirring, until toasted, about 1 minute more. Add the water and salt and bring to a boil. Lower the heat and simmer, (wrap the lid tightly with a kitchen towel), cover, and steam until the rice is tender, 20 minutes. Remove from the heat and let rest, covered, for 10 minutes. Fluff with a fork and set aside.\n            \n\n              Meanwhile, make the vegetables. Melt the butter in a medium straight-sided skillet with a tight-fitting lid, over medium-high heat. Add the onion and cook, stirring, until lightly browned, about 1 minute. Add the garlic and ginger and cook, stirring, until fragrant, about 1 minute. Add the golden raisins, almonds, coriander seed, cumin seed, and cardamom and cook, stirring, until toasted and fragrant, about 2 minutes. Stir in the cauliflower, green beans, potatoes, carrots, and salt. Raise the heat to high, pour in the water, and cook, covered, for 4 minutes. Uncover and cook, stirring, until the vegetables are tender and most of the water has evaporated, about 1 1/2 minutes more.\n            \n\n              Add the rice to the vegetable mixture and, using a rubber spatula, stir to combine. Season with salt to taste. Divide the vegetable-rice mixture among plates and top with some of the toasted coconut and almonds. Serve immediately.\n            \n", "ingredients": [{"food": "crisped rice bar", "quantity": 0.75}, {"food": "butter oil", "quantity": 1.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "turmeric", "quantity": 0.5}, {"food": "whole milk", "quantity": 0.25}, {"food": "whole milk", "quantity": 0.25}, {"food": "drumstick pods", "quantity": 3.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "coconut water", "quantity": 1.5}, {"food": "salt", "quantity": 1.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.25}, {"food": "ginger", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "whole milk", "quantity": 1.5}, {"food": "whole milk", "quantity": 0.5}, {"food": "drumstick pods", "quantity": 5.0}, {"food": "cauliflower", "quantity": 1.0}, {"food": "fava beans", "quantity": 3.0}, {"food": "sweet potatoes", "quantity": 3.0}, {"food": "carrot juice", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "coconut water", "quantity": 0.6666666666666666}, {"food": "coconut water", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}], "title": "\nVegetable Biryani\n"}, {"directions": "\n\n              Make the pesto: \n            \n\n              Combine the cilantro, parsley leaves, almonds and garlic in a food processor; pulse until coarsely chopped. Add the olive oil and 1/2 teaspoon salt; process until smooth.\n            \n\n              Prepare the vegetables for the couscous: Heat a wide heavy-bottomed pot over medium heat. Add 3 tablespoons butter and 1 teaspoon salt; cook until the butter begins to brown. Add the onion. Tie the reserved parsley stems and cinnamon stick together with twine; add to the pot. Cook, stirring occasionally, until the onion is lightly browned, about 5 minutes. Add the tomatoes, 1 cup water, carrots, zucchini and/or Swiss chard, raisins, 1 1/2 teaspoons salt, and pepper to taste. Cook, stirring occasionally, until the vegetables are crisp-tender, about 15 minutes. Remove the parsley and cinnamon.\n            \n\n              Meanwhile, cook the couscous as the label directs. Add the remaining 1 tablespoon butter, season with salt and pepper and fluff with a fork. Top the couscous with the vegetables and pesto.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "couscous", "quantity": 0.5}, {"food": "whole milk", "quantity": 2.0}, {"food": "garlic powder", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "onion powder", "quantity": 1.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "tomatoes", "quantity": 1.0}, {"food": "pineapple chunks", "quantity": 2.0}, {"food": "chard", "quantity": 1.0}, {"food": "raisins", "quantity": 0.3333333333333333}, {"food": "pepper", "quantity": 1}, {"food": "couscous", "quantity": 1.5}], "title": "\nVegetable Couscous with Moroccan Pesto\n"}, {"directions": "\n\n              In a small food processor (mini-chopper), combine the garlic and ginger and puree into a paste. Set aside.\n            \n\n              Heat the oil in a large pot over medium-high heat. Add the cumin seeds, cloves, cardamom, allspice, cinnamon stick, and bay leaf and cook, stirring constantly, until toasted and fragrant and the cinnamon stick unfurls, about 30 seconds. Add the onion and cook, stirring, until lightly browned, about 3 minutes. Add the garlic-ginger paste, curry powder, and jalapeno and cook, stirring, until lightly browned and fragrant, about 1 minute. Add the tomato and yogurt and cook, stirring, until they separate from the oil and there is a distinctive sizzling sound, as the sauce \"fries\" in the oil, about 7 minutes. Continue to cook, stirring, for about 1 minute more.\n            \n\n              Add the water, salt, and potatoes and bring to a boil. Lower the heat and simmer, covered, stirring occasionally, until tender, about 10 minutes. Add the cauliflower, green beans, and chickpeas, bring to a boil, and cook, uncovered, until the vegetables are tender and the liquid has thickened, about 5 minutes more. Transfer to a serving bowl and serve with rice and chutney.\n            \n", "ingredients": [{"food": "garlic powder", "quantity": 5.0}, {"food": "ginger", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "whole milk", "quantity": 0.5}, {"food": "cloves", "quantity": 0.25}, {"food": "drumstick pods", "quantity": 10.0}, {"food": "allspice", "quantity": 8.0}, {"food": "cinnamon", "quantity": 3.0}, {"food": "corier leaf", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "curry powder", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}, {"food": "pasta with tomato sauce", "quantity": 0.5}, {"food": "whole milk", "quantity": 0.5}, {"food": "coconut water", "quantity": 2.5}, {"food": "salt", "quantity": 2.0}, {"food": "sweet potatoes", "quantity": 6.0}, {"food": "cauliflower", "quantity": 1.5}, {"food": "fava beans", "quantity": 4.0}, {"food": "chickpeas", "quantity": 1.0}, {"food": "crisped rice bar", "quantity": 1}], "title": "\nVegetable Curry\n"}, {"directions": "\n\n              Place a wok or large skillet over high heat. Add the vegetable oil and bacon and stir-fry until golden and crisp, about 2 minutes. Sprinkle the sugar over the bacon and toss. Add 1/4 teaspoon soy sauce (watch out-the oil will bubble up) and continue to stir-fry until the bacon is glazed, about 30 seconds. Transfer the bacon to a bowl with a slotted spoon. Add the garlic, ginger and red pepper flakes to the drippings in the pan and stir-fry until fragrant, about 30 seconds. Add the broccoli and cook until crisp, 2 to 3 minutes. Add the rice, the remaining 2 teaspoons soy sauce, the broth and glazed bacon. Toss to heat through.\n            \n\n              Push the fried rice to one side of the pan, crack the eggs into the other side and scramble until set, about 1 minute. Mix the eggs into the rice and stir in the watercress. Divide among bowls and serve with mustard or chili sauce, if desired.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "bacon", "quantity": 0.5}, {"food": "sugar", "quantity": 0.75}, {"food": "soy sauce", "quantity": 2.25}, {"food": "garlic powder", "quantity": 3.0}, {"food": "ginger", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.75}, {"food": "broccoli raab", "quantity": 0.75}, {"food": "crisped rice bar", "quantity": 5.0}, {"food": "diced chicken", "quantity": 0.25}, {"food": "eggs", "quantity": 4.0}, {"food": "watercress", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1}], "title": "\nVegetable Fried Rice with Bacon\n"}, {"directions": "\n\n              Position a rack in the upper third of the oven and preheat to 450 degrees F. Whisk the whole eggs and whites in a bowl. Add the cottage cheese and whisk until almost smooth. Whisk in the gouda and rosemary.\n            \n\n              Cook the garlic in the olive oil in a 10-inch nonstick ovenproof skillet over medium-high heat until it starts to brown, 1 to 2 minutes. Add the onion, season with salt and cook 2 minutes. Add the vegetables, increase the heat to high and cook until just tender, about 5 minutes.\n            \n\n              Reduce the heat to medium. Spread the egg mixture evenly in the pan. Cook, undisturbed, until a thin crust forms on the bottom, about 2 minutes. Run a rubber spatula around the edge to release the egg from the pan. Continue cooking until the bottom is golden, 2 to 3 more minutes. Sprinkle with the parmesan and paprika; transfer to the oven and bake until just set, 5 to 7 minutes. Remove from the oven, cover and let sit, 5 to 7 minutes. Cut into wedges and serve with the bread.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "eggs", "quantity": 3.0}, {"food": "macaroni cheese", "quantity": 0.75}, {"food": "smoked turkey roll", "quantity": 4.0}, {"food": "rosemary", "quantity": 1.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "mixed nuts", "quantity": 1.0}, {"food": "parmesan cheese", "quantity": 2.0}, {"food": "paprika", "quantity": 1.0}, {"food": "garlic bread", "quantity": 4.0}], "title": "\nVegetable Frittata\n"}, {"directions": "\n\n              Heat the vegetable oil in a large pot over medium-high heat. Add the flour and cook, stirring, until golden, about 3 minutes. Add the onion, bell pepper, celery, garlic, 3 tablespoons water and 1/4 teaspoon each salt and pepper. Reduce the heat to medium, cover and cook, stirring occasionally, until the vegetables soften, about 8 minutes.\n            \n\n              Add the soy sauce and paprika and cook, stirring, 30 seconds. Stir in the vegetable broth, scraping up any browned bits from the bottom of the pot, then cover and bring to a boil.\n            \n\n              Add the greens and black-eyed peas to the pot. Reduce the heat, cover and simmer, stirring occasionally, until tender, about 15 minutes. Season with salt and pepper. Serve with the rice, if desired.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "potato flour", "quantity": 3.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "pepper", "quantity": 1.0}, {"food": "celery seed", "quantity": 2.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "smoked turkey roll", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "chard", "quantity": 1.0}, {"food": "pigeon peas", "quantity": 1.0}, {"food": "crisped rice bar", "quantity": 1}], "title": "\nVegetable Gumbo\n"}, {"directions": "\n\n              Slice zucchini and yellow squash lengthwise into 1/8 to 1/4-inch thick strips. Lay the strips out on baking sheet pan and salt generously. Set aside.\n            \n\n              Roast the peppers over a gas flame or broil on a sheet pan until completely charred, about 8 minutes. Put the peppers in a bowl, cover, and set aside until just cool enough to handle, about 5 minutes. Rub the skins off the peppers with your fingers to remove most of the charred skin. Core and remove the seeds, then slice the peppers lengthwise into 1 1/2-inch strips.\n            \n\n              Preheat the oven to 375 degrees F. Mix the goat cheese, olives, thyme, and red pepper flakes together in a bowl and season, to taste, with salt and pepper.\n            \n\n              Thoroughly wipe excess salt and moisture from zucchini and squash with paper towel.\n            \n\n              Spread 1 cup of the tomato sauce into the bottom of an 8- by 11-inch baking dish. Begin layering, remembering to season with pepper between each layer. Start with the zucchini and then summer squash and all the peppers. Dollop spoonfuls of the cheese over the peppers and then spread it out to cover. Spoon half of the remaining sauce over the vegetables. Repeat with the remaining zucchini, squash, goat cheese, and sauce. Sprinkle top layer with Parmesan and bake, covered, for 30 minutes, then uncover. Continue baking until the vegetables are tender and the sauce thickens, about 30 minutes more. Let lasagna stand for 10 minutes before slicing.\n            \n\nTomato Sauce with Basil:\n\n\n              Put the tomatoes, olive oil, garlic, vinegar, and salt in a sauce pan. Bring to a boil over high heat, lower heat to a brisk simmer, and cook until thickened, about 30 minutes. While sauce cooks tear basil leaves into small pieces. Remove the sauce from the heat and stir in the basil. Transfer half of the sauce to a food processor and puree. Return to the saucepan and season, to taste, with salt and pepper.\n            \n", "ingredients": [{"food": "", "quantity": 2.0}, {"food": "squash", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "ruby red grapefruit juice blend", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 7.0}, {"food": "olives", "quantity": 0.3333333333333333}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 0.25}, {"food": "tomatoes", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 0.3333333333333333}, {"food": "black bean mango", "quantity": 1}], "title": "\nVegetable Lasagna Casserole\n"}, {"directions": "\n\n              Heat the olive oil in a medium saucepan over medium heat; add all the vegetables, garlic and onion. Season with the salt, and cook until tender, about 6 minutes. Add the pasta and cook until slightly toasted and golden, about 2 minutes. Add broth, and bring to a boil over high heat. Cook, covered, until pasta is just tender, about 8 minutes.\n            \n\n              Stir in whatever herb suits you (or your young eater) and lemon juice. Season with pepper and additional salt, to taste. Fill thermos, pack in a lunch sack with crackers and cheese sticks and send off to school.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.75}, {"food": "garlic powder", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.75}, {"food": "salt", "quantity": 0.25}, {"food": "barley flour or meal", "quantity": 0.3333333333333333}, {"food": "diced chicken", "quantity": 4.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "lemon juice", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "macaroni cheese", "quantity": 1}], "title": "\nVegetable Noodle Soup\n"}, {"directions": "\n\n              Preheat the oven to 450 degrees. Core the tomatoes, cut into wedges and place in a medium bowl; season with salt, drizzle with a bit of olive oil and toss. Set aside.\n            \n\n              Heat 1/4 cup olive oil in a 12-inch ovenproof skillet or a paella pan over medium-high heat. Add the onion, garlic, paprika, cayenne and saffron and season with salt. Cook, stirring occasionally, until the onion softens, about 5 minutes.\n            \n\n              Add the fennel wedges and cook until lightly browned on one side, about 5 minutes. Flip the fennel and add the baby artichokes and eggplant to the skillet; cook until slightly tender, about 4 more minutes. Add the mushrooms and cook for 1 to 2 minutes. Pour in the wine and simmer until reduced by about one-third. Stir in the rice and 1 3/4 teaspoons salt; add just enough water to cover the rice completely, 2 1/2 to 3 cups. Increase the heat to high and boil for 2 to 3 minutes. Scatter the haricots verts and 2 tablespoons capers over the rice. Remove the pan from the heat and arrange the tomatoes on top; drizzle with any tomato juices.\n            \n\n              Transfer the paella to the oven and bake, undisturbed, for 20 minutes. Scatter the remaining 2 tablespoons capers and the piquillo peppers over the paella. Turn off the oven but leave the paella inside to continue cooking until the rice is tender, 15 to 20 more minutes. Garnish with parsley, if desired\n            \n\n              Photograph by Yunhee Kim\n            \n", "ingredients": [{"food": "plum", "quantity": 8.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "paprika", "quantity": 1.5}, {"food": "pepper", "quantity": 0.25}, {"food": "saffron", "quantity": 1.0}, {"food": "fennel seed", "quantity": 1.0}, {"food": "", "quantity": 8.0}, {"food": "eggplant", "quantity": 1.0}, {"food": "mushrooms", "quantity": 4.0}, {"food": "martha white foods", "quantity": 2.0}, {"food": "crisped rice bar", "quantity": 2.5}, {"food": "fava beans", "quantity": 4.0}, {"food": "capers", "quantity": 0.25}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "parsley", "quantity": 1}], "title": "\nVegetable Paella\n"}, {"directions": "\n\n              Mix 1 cup leftover mashed potatoes, 1/2 cup chopped leftover cooked vegetables (such as carrots or green beans), 1/2 cup thawed frozen peas, 1/4 teaspoon curry powder and 1 tablespoon each chopped cilantro, mint and ginger; season with salt and cayenne pepper. Roll a sheet of puff pastry into a 14-inch square, then cut into 25 smaller squares and place 1 tablespoon filling in the center of each. Brush the edges with a beaten egg, fold into triangles and press to seal. Bake at 350 degree until golden brown, 20 to 25 minutes. Mix yogurt with leftover cranberry sauce for dipping.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [], "title": "\nVegetable Samosas\n"}, {"directions": "\n\n              Preheat the broiler. Cover the potatoes with water in a pot; season with salt, cover and boil until the potatoes are fork-tender, 15 minutes.\n            \n\n              Meanwhile, heat the oil in a stovetop casserole dish or shallow enamel pot over medium-high heat. Add the onion, carrots, celery, turnips and garlic. Season with salt and pepper and cook until the vegetables brown, 8 minutes. Add 1 1/2 cups cooking liquid from the potatoes to the casserole dish. Lower the heat and scrape up any browned bits with a wooden spoon. Tie the parsley stems with twine and add to the casserole. Cover and simmer until the vegetables are tender, 8 minutes. Stir in the Worcestershire sauce, 2 tablespoons butter and the chopped veggie burgers and warm through, 5 minutes. Remove the parsley stems and stir in the chopped parsley. Keep warm.\n            \n\n              Drain the potatoes and mash with the remaining 3 tablespoons butter and the milk; season with salt and pepper and spoon over the casserole. Sprinkle with parmesan, if desired. Broil until golden brown, 5 minutes.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 6.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "pineapple chunks", "quantity": 3.5}, {"food": "pineapple chunks", "quantity": 2.5}, {"food": "turnips", "quantity": 1.0}, {"food": "garlic powder", "quantity": 6.0}, {"food": "pepper", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "Worcestershire sauce", "quantity": 1.5}, {"food": "butter oil", "quantity": 5.0}, {"food": "barley flour or meal", "quantity": 0.75}, {"food": "milk", "quantity": 0.6666666666666666}, {"food": "parmesan cheese", "quantity": 1}], "title": "\nVegetable Shepherd's Pie\n"}, {"directions": "\nSpecial equipment: Bamboo sushi mat\n\n              For the rice:\n            \n\n              Mix together vinegar, sugar, and salt.\n            \n\n              Rinse the rice in colander and drain. Put the rice and water in medium saucepan with a tight fitting lid. Bring to a boil over high heat, reduce heat to very low and simmer, tightly covered. (For a good seal wrap the pan's lid tightly with a small kitchen towel and cover the saucepan. Make sure the towel's edges are folded up well away from the heat.) Cook until all the water is absorbed, about 15 minutes. Remove the rice from the heat (don't uncover) and set aside for 10 minutes.\n            \n\n              Fluff the rice with a fork and transfer it to a large bowl. Add the vinegar mixture and toss with the rice, using a wooden spoon. Spread it out on a parchment paper-lined baking sheet. Fan the rice continuously with a fan or magazine until cooled. Cover the rice with a damp towel.\n            \n\n              To assemble rolls:\n            \n\n              Place the sushi mat with the slats running crosswise directly in front of you on a clean work space. Lay a sheet of nori shiny-side down and lined up with the closest edge of the mat. Lightly moisten fingers with water, and evenly press about 1/4 of the rice onto the nori, with 1 1/2-inches uncovered at the far edge. Line up the fillings about 1-inch from the closest near edge, evenly across the rice. Leave 1-inch of rice uncovered at the far edge.\n            \n\n              Beginning with the near edge of the mat, tightly roll up the nori, rice, and fillings into a cylinder. Firmly tug on the rounded mat over the roll as you pull on the far edge of the mat to tighten the roll. Open the mat, dab unsealed edge of nori with a bit of water and roll the sushi forward to seal. Transfer the sushi to a plate and cover with damp paper towels. Repeat with remaining rice and fillings.\n            \n\n              Cut each sushi roll, crosswise, into 8 pieces with a sharp wet knife.\n            \n\n              Serve with bowl of soy sauce for dipping.\n            \n", "ingredients": [{"food": "vinegar", "quantity": 0.3333333333333333}, {"food": "sugar", "quantity": 2.0}, {"food": "salt", "quantity": 1.0}, {"food": "crisped rice bar", "quantity": 1.5}, {"food": "coconut water", "quantity": 1.5}, {"food": "", "quantity": 4.0}, {"food": "cucumber", "quantity": 1.5}, {"food": "carrot juice", "quantity": 1.0}, {"food": "yellow rice", "quantity": 1.0}, {"food": "", "quantity": 4.0}, {"food": "barley flour or meal", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}, {"food": "Worcestershire sauce", "quantity": 1}], "title": "\nVegetable Sushi Rolls for All Ages\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 400 degrees F. Toss both kinds of potatoes, the parsnips, onion, garlic, olive oil, 1 teaspoon salt and 1/4teaspoon pepper in a bowl. Spread in a single layer on a baking sheet; bake until tender, about 45 minutes. Let cool slightly.\n            \n\n              Meanwhile, mix 2 tablespoons water and the sugar in a skillet and bring to a boil over medium heat. Cook, swirling the pan, until amber, about 7 minutes. Remove from the heat and stir in the vinegar and 1/4teaspoon each salt and pepper. Pour the caramel into a 9-by-13-inch glass baking dish and spread with a rubber spatula. Sprinkle the sage and oregano on top.\n            \n\n              Arrange the roasted potatoes and parsnips in a single snug layer on top of the caramel. Scatter the onion and garlic over the roasted vegetables; sprinkle evenly with the mozzarella.\n            \n\n              Roll out the puff pastry on a lightly floured surface into a 9-by-13-inch rectangle. Pierce the pastry all over with a fork, then lay it on top of the mozzarella, folding the edges under to fit, if necessary. Bake 20 minutes, then reduce the oven temperature to 350 degrees F and continue baking until the dough is cooked through, 15 to 20 more minutes.\n            \n\n              Let the tart cool 10 minutes in the baking dish, then carefully invert it onto a cutting board. Replace any vegetables that stick to the dish, if necessary.\n            \n\n              Photograph by Anna Williams\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 2.5}, {"food": "sweet potatoes", "quantity": 2.5}, {"food": "parsnips", "quantity": 2.5}, {"food": "onion powder", "quantity": 1.5}, {"food": "garlic powder", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "sugar", "quantity": 0.75}, {"food": "vinegar", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "", "quantity": 6.0}, {"food": "puff pastry", "quantity": 1.0}, {"food": "potato flour", "quantity": 1}], "title": "\nVegetable Tarte Tatin\n"}, {"directions": "\n\n              1. To make the batter, whisk the flour, salt, egg yolk, and 1/2 cup water in a medium bowl. Add the sparkling water and then the olive oil. Set aside for 20 minutes.\n            \n\n              2. Meanwhile, stir together the harissa and mayonnaise in a bowl and set aside.\n            \n\n              3. For the frito misto, bring 3 inches canola oil to 375 degrees F in a large, heavy-bottomed deep pot. Line 2 plates or a rack with paper towels.\n            \n\n              4. Whisk together the egg whites and salt until they hold stiff peaks. Fold into the batter. Pat dry the vegetables and prawns and dip, a few at a time, into the batter and then into the oil. Fry in small batches, starting with the sage and ending with the prawns, until golden and the vegetables are crisp-tender, about 3 minutes, depending on the size, turning to brown on both sides. Drain on paper towels and season with salt while warm. Serve with the harissa mayonnaise.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.75}, {"food": "sea lion", "quantity": 1}, {"food": "egg substitute", "quantity": 1.0}, {"food": "coconut water", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "", "quantity": 1.0}, {"food": "mayonnaise dressing", "quantity": 0.3333333333333333}, {"food": "vegetable oil", "quantity": 1}, {"food": "egg substitute", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "sweet potato puffs", "quantity": 1.0}, {"food": "onion rings", "quantity": 1.0}, {"food": "fava beans", "quantity": 12.0}, {"food": "chrysanthemum leaves", "quantity": 8.0}, {"food": "", "quantity": 8.0}], "title": "\nVegetable and Shrimp Frito Misto with Harissa Mayonnaise\n"}, {"directions": "\n\n              Position a rack in the middle of the oven and preheat to 375 degrees F. Butter the bottom and sides of four 6- or 8-ounce ramekins.\n            \n\n              Melt the butter in a medium saucepan over medium heat. Add the flour and salt and cook, stirring, about 1 minute. Add 3/4 cup water, bring to a simmer and cook, whisking constantly, until the mixture is as thick as pudding, about 3 minutes. Remove from the heat and stir in the cheese, fines herbes and whole eggs. Transfer to a medium bowl and stir until slightly cool.\n            \n\n              Beat the egg white in another medium bowl until soft peaks form, about 2 minutes. Gently fold the whites into the cheese mixture until there are only a few streaks.\n            \n\n              Put the prepared ramekins on a baking dish, divide the batter evenly among them and smooth the tops with a spoon. Bake until golden and puffed about 1 inch above the lips of the ramekins, 15 to 20 minutes. Serve and enjoy right away.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 3.0}, {"food": "potato flour", "quantity": 0.25}, {"food": "salt", "quantity": 1.0}, {"food": "", "quantity": 1.5}, {"food": "chives", "quantity": 0.5}, {"food": "egg substitute", "quantity": 2.0}], "title": "\nVegetable, Herb and Cheese Souffle\n"}, {"directions": "\n\n              Cook 3/4 cup quinoa as the label directs; fluff. Transfer to a large bowl; toss with 1 cup each shredded carrots, chopped cucumber and chopped sugar snap peas, 1/2 cup raisins and 1/4 cup each chopped parsley and salted sunflower seeds. Drizzle with olive oil and white balsamic vinegar; season with salt and pepper.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [], "title": "\nVegetable-Quinoa Salad\n"}, {"directions": "\n\n              Preheat the oven to 450 degrees F. Toss the mushrooms with 2 tablespoons olive oil, 1/4 teaspoon salt, and pepper to taste on a baking sheet. Roast until tender and golden, about 12 minutes. Meanwhile, put the eggs in a saucepan and cover with cold water; bring to a boil. Add the wax beans and remove from the heat; cover and let stand 10 minutes. Drain, then rinse the eggs and beans under cold water. Peel and quarter the eggs; set aside. Toss the beans with 1 teaspoon vinegar and a pinch each of salt and pepper in a medium bowl. Cut three-quarters of the tofu into sticks. Make the dressing: Combine one-third of the mushrooms, the remaining tofu, 3 tablespoons vinegar and 1 tablespoon olive oil, the yogurt, 3/4 teaspoon salt, and pepper to taste in a food processor and puree. Toss with the greens; season with salt and pepper. Divide among bowls. Top with the remaining mushrooms and tofu, the eggs, beans, beets, cheese and sunflower seeds. \n            \n\n               Photograph by Justin Walker\n            \n", "ingredients": [{"food": "mushrooms", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "eggs", "quantity": 4.0}, {"food": "fava beans", "quantity": 0.5}, {"food": "vinegar", "quantity": 3.0}, {"food": "smoked turkey roll", "quantity": 4.0}, {"food": "silk plain soy yogurt", "quantity": 0.3333333333333333}, {"food": "mixed nuts", "quantity": 12.0}, {"food": "beets", "quantity": 2.0}, {"food": "cheddar cheese", "quantity": 3.0}, {"food": "sunflower seed kernels", "quantity": 2.0}], "title": "\nVegetarian Chef's Salad\n"}, {"directions": "\nSpecial equipment: A deep-fry thermometer\n\n              Position an oven rack at the top of the oven, and preheat the broiler. Arrange the mushrooms on a baking sheet, and broil until the sides facing up begin to soften, about 5 minutes. Flip, and continue to broil until the sides facing up are soft, about 5 minutes more. Let cool.\n            \n\n              Put the mushrooms, gill-side up, between 2 pieces of plastic wrap, and pound to about 1/4 inch thick with a meat mallet. Season all over with 1/2 teaspoon salt.\n            \n\n              Whisk together the flour, baking powder and 1 teaspoon each salt and pepper in a shallow dish. Whisk together the milk and eggs in a separate shallow dish.\n            \n\n              Lower the oven heat to 250 degrees F. Put a rack over a rimmed baking sheet. Heat about an inch of oil to 350 degrees F in a large cast-iron skillet or Dutch oven over medium-high heat.\n            \n\n              While the oil heats, dredge each mushroom in the flour mixture to completely coat; shake off any excess. Then dip into the egg mixture until fully coated; let the excess drip off. Return the mushroom to the flour mixture, and dredge a second time, until completely coated, pressing firmly into the flour mixture. Arrange on one side of the rack on the baking sheet.\n            \n\n              Add 2 of the breaded mushrooms to the hot oil, and cook, turning once, until crisp and golden, about 5 minutes total. Transfer the mushrooms to the unused side of the rack. When the oil comes back to temperature, repeat with the remaining 2 mushrooms and keep the first 2 warm in the oven.\n            \n\n              Serve the mushroom steaks with mashed potatoes and generous spoonfuls of hot gravy. Garnish with chives or scallions if using.\n            \n\nVegetarian Gravy:\n\n\n              Position an oven rack in the top position in the oven and preheat to 450 degrees F. Toss the onions, celery, carrots and garlic with the oil and 1 teaspoon salt on a rimmed baking sheet. Roast until the vegetables are charred in some places, 25 to 30 minutes.\n            \n\n              Bring the roasted vegetables, 1 cup water, mushrooms, thyme, sun-dried tomatoes, soy sauce, bay leaf and 1 teaspoon salt to a simmer in a medium saucepan over medium-high heat. Cook, stirring occasionally, until most of the liquid is gone, 8 to 10 minutes. Add 6 cups water and 1/2 teaspoon salt, and bring back to a simmer. Reduce the heat to medium-low, and gently simmer until reduced by about one third, about 45 minutes. Strain the stock into a large liquid measuring cup, then squeeze all the liquid out of the solids with the back of a ladle (there should be about 4 cups of stock); discard the solids. (If not making gravy right away, let the stock cool to room temperature, then refrigerate for up to 3 days or freeze for up to 1 month; warm slightly before making gravy.)\n            \n\n              Melt the butter in a medium saucepan over medium heat. Add the sage leaves to the butter, and stir for 30 seconds; remove the fried sage leaves, and set aside. Add the flour to the saucepan, and stir until smooth and lightly golden, about 2 minutes. Slowly pour in the warm stock while whisking constantly until smooth and thick, 8 to 10 minutes.\n            \n\n              Chop the fried sage, stir it and the parsley into the gravy and season to taste with pepper. \n            \n", "ingredients": [{"food": "milk", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "sweet potatoes", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "mushrooms", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "potato flour", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "barley flour or meal", "quantity": 1}, {"food": "onion powder", "quantity": 1.0}, {"food": "celery seed", "quantity": 2.0}, {"food": "carrot juice", "quantity": 1.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "mushrooms", "quantity": 1.0}, {"food": "thyme", "quantity": 6.0}, {"food": "tomatoes", "quantity": 2.0}, {"food": "soy sauce", "quantity": 2.0}, {"food": "corier leaf", "quantity": 1.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "chrysanthemum leaves", "quantity": 6.0}, {"food": "potato flour", "quantity": 0.3333333333333333}, {"food": "parsley", "quantity": 0.25}, {"food": "black bean mango", "quantity": 1}], "title": "\nVegetarian Chicken-Fried Portobello Mushroom Steaks\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: a 9-by-13-inch baking dish\n\n              Preheat the oven to 350 degrees F.\n            \n\n              For the sauce: Heat the oil in a large skillet over medium heat. Add the onions, and cook, stirring frequently, until soft and translucent, about 5 minutes. Add the garlic, chile powder, cumin and cayenne, and continue to cook, stirring, until the spices are toasted, about 1 minute. Add 2 cups water, the tomato puree and 1/2 teaspoon salt, and bring to a simmer. Continue cooking until the sauce reduces and thickens slightly (it should be looser and thinner than marinara sauce), 15 to 20 minutes. Set aside to cool slightly.\n            \n\n              For the filling: Squeeze all the excess moisture out of the spinach. Put it into a large bowl with the pinto beans, and squeeze with your hands to combine and smash up the beans a little. Add half of both the Cheddar and the pepper Jack, half of both the sour cream and the scallions and 1 1/4 teaspoons salt, and stir to combine.\n            \n\n              Spread about 1/2 cup of the tomato sauce in the bottom of a 9-by-13-inch baking dish. Lay the tortillas out on a work surface, and spread 1 side of each with about 1 teaspoon of tomato sauce. Put about 1/4 cup of the filling across the middle of each tortilla. Roll each up, then shingle them in 2 even rows in the baking dish. Pour the remaining sauce over the top of the rolled tortillas, and sprinkle with the remaining cheeses. Cover the baking dish loosely with foil, and bake until the cheeses are melted and the filling is hot, about 30 minutes. Uncover, and continue baking to heat completely through, about 10 minutes more.\n            \n\n              For the topping: Whisk together the remaining sour cream, the lime juice and a pinch of salt in a small bowl. Drizzle the mixture over the baked enchiladas, and sprinkle with the remaining scallions.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "garlic powder", "quantity": 2.0}, {"food": "onion powder", "quantity": 2.0}, {"food": "cumin seed", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "pasta with tomato sauce", "quantity": 15.0}, {"food": "salt", "quantity": 1}, {"food": "mustard spinach", "quantity": 10.0}, {"food": "fava beans", "quantity": 15.0}, {"food": "", "quantity": 4.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "sour cream", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "corn flour", "quantity": 6.0}, {"food": "lime", "quantity": 0.5}], "title": "\nVegetarian Enchiladas\n"}, {"directions": "\n\n              Position an oven rack in the top position in the oven and preheat to 450 degrees F. Toss the onions, celery, carrots and garlic with the oil and 1 teaspoon salt on a rimmed baking sheet. Roast until the vegetables are charred in some places, 25 to 30 minutes.\n            \n\n              Bring the roasted vegetables, 1 cup water, mushrooms, thyme, sun-dried tomatoes, soy sauce, bay leaf and 1 teaspoon salt to a simmer in a medium saucepan over medium-high heat. Cook, stirring occasionally, until most of the liquid is gone, 8 to 10 minutes. Add 6 cups water and 1/2 teaspoon salt, and bring back to a simmer. Reduce the heat to medium-low, and gently simmer until reduced by about one third, about 45 minutes. Strain the stock through a strainer into a large liquid measuring cup, use the back of a ladle to squeeze all the liquid out of the solids (there should be about 4 cups of stock). If not making gravy right away, let the stock cool to room temperature, then refrigerate for up to 3 days or freeze for up to 1 month.\n            \n\n              To make the gravy, warm the stock slightly in a medium saucepan if it has been refrigerated. Melt the butter in another medium saucepan over medium heat. Add the sage leaves, and stir for 30 seconds; remove and set aside. Add the flour to the saucepan, and stir until smooth and lightly golden, about 2 minutes. Slowly pour in the warm stock while whisking constantly until smooth and thick, 8 to 10 minutes.\n            \n\n              Chop up the fried sage, stir it into the gravy along with the parsley and season to taste with pepper.\n            \n", "ingredients": [{"food": "onion powder", "quantity": 1.0}, {"food": "celery seed", "quantity": 2.0}, {"food": "carrot juice", "quantity": 1.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "mushrooms", "quantity": 1.0}, {"food": "thyme", "quantity": 6.0}, {"food": "tomatoes", "quantity": 2.0}, {"food": "soy sauce", "quantity": 2.0}, {"food": "corier leaf", "quantity": 1.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "chrysanthemum leaves", "quantity": 6.0}, {"food": "potato flour", "quantity": 0.3333333333333333}, {"food": "parsley", "quantity": 0.25}, {"food": "black bean mango", "quantity": 1}], "title": "\nVegetarian Gravy\n"}, {"directions": "\n\n              Heat the olive oil in a large skillet over medium-high heat. Add the celery chunks, carrots and red onion. Cook, stirring occasionally, until the vegetables are slightly softened, about 2 minutes. Add the bell pepper, thyme, paprika, 1/2 teaspoon salt and a few grinds of pepper. Cook, stirring, until the paprika is toasted, about 1 minute.\n            \n\n              Add the rice to the skillet and stir to coat. Add the tomatoes, black-eyed peas and 1 1/2 cups water. Bring to a boil, then reduce the heat to low. Cover and simmer until the rice is tender, about 15 minutes.\n            \n\n              Scatter the okra over the rice. Continue to cook, covered, until the okra is tender and the rice is cooked through, about 5 more minutes. Remove from the heat and let stand, covered, 3 minutes. Fluff the rice with a fork and sprinkle with the celery leaves. Season with salt and pepper.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "celery seed", "quantity": 3.0}, {"food": "pineapple chunks", "quantity": 3.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "thyme", "quantity": 1.0}, {"food": "smoked turkey roll", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "crisped rice bar", "quantity": 1.25}, {"food": "diced chicken", "quantity": 1.0}, {"food": "pigeon peas", "quantity": 1.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 8.0}], "title": "\nVegetarian Jambalaya\n"}, {"directions": "\n\n              For the sauce: Put the olive oil and garlic in a medium pot over low heat. Cook the garlic, stirring occasionally at first and more often as it colors, until golden brown, about 7 minutes. Raise the heat to medium-low, add the onions and a large pinch of salt and cook, stirring occasionally, until the onions are softened, about 5 minutes. Add the carrots, and cook, stirring occasionally, until softened, about 5 minutes. Add the tomato paste and red pepper flakes, and cook, stirring constantly, for 2 minutes. Add the tomatoes, bay leaves, basil sprig, thyme and 1 teaspoon salt, raise the heat to medium and bring the sauce to a lively simmer. Continue to cook, stirring frequently, until quite thick (if you draw a spoon through the sauce, you'll see the bottom of the pot for a few seconds before the sauce fills back in), about 30 minutes. As the sauce thickens, turn the heat down a bit so the bottom doesn't scorch. Stir in the chopped basil. Let cool to room temperature before assembling the lasagna. (Makes 1 quart.)\n            \n\n              To assemble: Preheat the oven to 350 degrees F. Squeeze the spinach in your hands to remove as much liquid as possible. Put it in a large bowl, and stir in the ricotta, 1/2 cup of the Parmesan, the egg, 1 teaspoon salt and the nutmeg.\n            \n\n              Spread 3/4 cup of the tomato sauce on the bottom of a 9-by-13-inch baking dish. Lay 3 lasagna noodles across the sauce (they won't touch). Spread 3/4 cup tomato sauce on top. Dollop 1/3 of the ricotta mixture (about 1 cup) across the sauce, and use the back of a spoon to spread it (it will smush into the tomato sauce, which is fine). Scatter 1 cup of the mozzarella on top.\n            \n\n              Repeat the layering 2 more times. Top with the last 3 noodles, spread the last 3/4 cup tomato sauce over them and scatter the remaining 1 cup mozzarella and 1/4 cup Parmesan over the top. Spray a large piece of foil with cooking spray, and cover the baking dish.\n            \n\n              Bake until the noodles are soft and the cheese has melted, about 40 minutes. Remove the foil, and continue to bake until the cheese is bubbling and the lasagna is slightly browned around the edges, about 15 minutes more. Let rest 10 minutes before serving.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "garlic powder", "quantity": 4.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "hearts of palm", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "plum", "quantity": 28.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 1.25}, {"food": "thyme", "quantity": 1.0}, {"food": "mustard spinach", "quantity": 10.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "", "quantity": 0.75}, {"food": "egg substitute", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "nutmeg", "quantity": 0.25}, {"food": "lasagna", "quantity": 12.0}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 1}], "title": "\nVegetarian Lasagna\n"}, {"directions": "\n\n              Heat the olive oil in a medium, heavy saucepan over medium heat until hot. Then stir in the garlic and 1/2 teaspoon each salt and pepper. Cook until golden, about 3 minutes. Stir in the tomatoes and simmer until thickened, about 10 minutes.\n            \n\n              Preheat the oven to 350 degrees F.\n            \n\n              Cut the seitan into 1/2-inch-thick slices. Whisk together the flour, 1 teaspoon salt, 1/2 teaspoon pepper and the cola in a bowl.\n            \n\n              Heat the oil in a large, heavy skillet over medium-high heat until hot. Dip half of the seitan into the batter, letting the excess drip off, and add to the skillet. Brown, turning occasionally, about 5 minutes. Drain the seitan on paper towels. Repeat with the remaining seitan.\n            \n\n              Divide the seitan among the rolls and top with the sauce. Divide the cheeses among the rolls. Place the rolls on a baking sheet and bake until the cheese is melted, about 5 minutes.\n            \n\n              Serve the heroes topped with the oregano.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "black bean mango", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 28.0}, {"food": "", "quantity": 1.5}, {"food": "potato flour", "quantity": 0.5}, {"food": "", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "pizza rolls", "quantity": 4.0}, {"food": "", "quantity": 8.0}, {"food": "", "quantity": 0.75}, {"food": "", "quantity": 4.0}], "title": "\nVegetarian Parm Heroes\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Melt the butter in a large ovenproof skillet over medium-high heat; remove 1 tablespoon to a small bowl. Add the carrots, celery and onion to the skillet; cover and cook, stirring occasionally, until slightly softened, about 5 minutes. Add the mushrooms and soy sauce; cover and continue cooking, stirring occasionally, until tender, about 3 minutes. Add the flour; cook, stirring, 1 minute.\n            \n\n              Add the milk, 1 cup water and 1/2 teaspoon salt and stir until the flour is incorporated. Bring to a boil, then reduce the heat to medium and simmer, stirring occasionally, until thickened, about 5 minutes. Add the tofu and frozen peas; return to a simmer. Season with salt and pepper. Remove from the heat.\n            \n\n              Brush the bread with the reserved melted butter and cut into quarters. Arrange buttered-side up on the tofu mixture. Transfer the skillet to the oven and bake until the bread is toasted, about 8 minutes.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [{"food": "butter oil", "quantity": 4.0}, {"food": "diced chicken", "quantity": 3.0}, {"food": "diced chicken", "quantity": 3.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 8.0}, {"food": "soy sauce", "quantity": 1.0}, {"food": "potato flour", "quantity": 3.0}, {"food": "whole milk", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "soft tofu", "quantity": 1.0}, {"food": "pigeon peas", "quantity": 2.0}, {"food": "pepper", "quantity": 1}, {"food": "potato flour", "quantity": 5.0}], "title": "\nVegetarian Potpie\n"}, {"directions": "\n\n              For the sauerkraut: Heat the olive oil in a medium saucepan over medium heat. Add the onion and garlic and cook until golden brown, about 15 minutes. Add the sauerkraut, apple, and allspice, season with salt and a generous grinding of pepper. Cook until sauerkraut is tender, lightly browned and all the liquid has evaporated, about 15 minutes more.\n            \n\n              For the Russian dressing: Mix all the dressing ingredients together, cover and refrigerate until ready to use.\n            \n\n              For the Sandwich: Preheat broiler to low. \n            \n\n              If using the tempeh: Heat the vegetable oil in a large skillet over medium-high heat, and cook the tempeh, in batches as needed, until crispy golden brown, about 3 minutes. Transfer to paper towels. \n            \n\n              Spread some butter on 1 side of each slice of bread. Place 4 pieces, buttered side down, on a foil-lined baking sheet. Spread some of the Russian dressing on the sides facing up. Evenly lay the pickles, tempeh if using, sauerkraut, and then cheese on top. Place the open faced sandwiched under the broiler and cook until the cheese melts, about 2 minutes. Remove the baking sheet from the broiler. Spread the rest of the dressing on the uncovered side of the 4 remaining bread slices, place on top melted cheese, buttered side up to finish the sandwiches. Return to the broiler and toast sandwich, turning once so both sides get nice and golden brown, about 2 minutes total, serve hot.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "sauerkraut", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 1.0}, {"food": "allspice", "quantity": 1}, {"food": "black bean mango", "quantity": 1}, {"food": "mayonnaise dressing", "quantity": 0.25}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1}, {"food": "dill seed", "quantity": 1.0}, {"food": "capers", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "bacon", "quantity": 12.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "garlic bread", "quantity": 8.0}, {"food": "luncheon slices", "quantity": 12.0}, {"food": "", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nVegetarian Reuben Sandwich\n"}, {"directions": "\n\n              In a soup pot or Dutch oven heat the 1/4 cup olive oil over medium heat. Add the onions, celery, zucchini, carrots, garlic, and rosemary; season with salt and pepper. Cook until the vegetables are soft and juicy, about 10 minutes. Add the cabbage, tomatoes, basil, and marjoram and season again with salt and pepper. Cook until cabbage is just tender, about 10 minutes. Stir in the beans and vegetable broth, and adjust the heat to simmer gently for 20 minutes.\n            \n\n              Remove the rosemary sprig. Stir in the bread and spinach, increase the heat to medium and cook until the soup thickens, about 10 minutes more. Season with salt and pepper. Ladle soup into warm bowls. Top with cheese and a little drizzle extra-virgin olive oil.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.25}, {"food": "onion powder", "quantity": 1.0}, {"food": "celery seed", "quantity": 1.75}, {"food": "", "quantity": 1.0}, {"food": "carrots", "quantity": 2.3333333333333335}, {"food": "garlic powder", "quantity": 3.0}, {"food": "rosemary", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "black bean mango", "quantity": 1}, {"food": "swamp cabbage", "quantity": 1.0}, {"food": "grape juice", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "marjoram", "quantity": 1.0}, {"food": "fava beans", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 10.0}, {"food": "garlic bread", "quantity": 4.5}, {"food": "chrysanthemum leaves", "quantity": 3.0}, {"food": "", "quantity": 0.5}], "title": "\nVegetarian Ribollita\n"}, {"directions": "\n\n              For the chili: Heat the oil in a 12-inch cast-iron skillet over medium-high heat. Add the squash and a pinch of salt and black pepper and cook, stirring occasionally, until the squash is tender and browned in spots, about 8 minutes. Remove the squash from the pan and set aside.\n            \n\n              Reduce the heat to medium. Add the garlic and onion and cook, stirring often, until the onion is soft, about 8 minutes. Add the chili powder (use less if you like milder chili) and cumin and cook until fragrant, about 1 minute. Add the vegetable stock, tomatoes, beans, sugar and cooked squash and bring to a simmer. Cook until all of the vegetables are tender and the sauce has thickened, about 30 minutes. (If the liquid reduces to less than three-quarters of the way up the sides of the squash, stir in a little water.) Stir in the baby spinach by the handful until all is incorporated and wilted.\n            \n\n              For the cornbread topping: Meanwhile, position a rack in the center of the oven and preheat to 400 degrees F. Whisk the cornmeal, flour, baking soda, sugar and 1 teaspoon salt together in a medium bowl. Whisk the milk, sour cream and egg together in another bowl. Add the wet ingredients to the dry ingredients, whisking until well combined. Stir in the melted butter and Cheddar. Drop spoonfuls of the batter on top of the chili, leaving space in between. (The batter will not completely cover the chili.) \n            \n\n              Bake until the cornbread is golden brown and springs back when touched and the chili is hot and bubbly, about 18 minutes. Serve with more sour cream and pickled jalapenos. \n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "garlic powder", "quantity": 3.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "chili powder", "quantity": 4.0}, {"food": "cumin seed", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "diced chicken", "quantity": 14.0}, {"food": "fava beans", "quantity": 14.0}, {"food": "sugar", "quantity": 1.0}, {"food": "mustard spinach", "quantity": 5.0}, {"food": "cornmeal", "quantity": 0.75}, {"food": "potato flour", "quantity": 0.75}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "sugar", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "whole milk", "quantity": 0.5}, {"food": "sour cream", "quantity": 0.25}, {"food": "egg substitute", "quantity": 1.0}, {"food": "butter oil", "quantity": 3.0}, {"food": "", "quantity": 0.75}, {"food": "", "quantity": 1}], "title": "\nVegetarian Skillet Chili Topped with Cornbread\n"}, {"directions": "\n\n              Preheat the oven and bake the Tater Tots as the label directs. Toss with 1/2 teaspoon chili powder and 1/4 teaspoon garlic powder; season with salt and pepper.\n            \n\n              Meanwhile, crumble the tofu on a paper towel-lined plate. Mix the ketchup and chili sauce in a bowl. Set aside.\n            \n\n              Heat the oil in a large nonstick skillet over medium-high heat. Add the onion, celery, carrot and a pinch of salt. Cook, stirring, 3 minutes. Add the remaining 1 tablespoon chili powder and 1/2 teaspoon garlic powder. Cook, stirring, 1 minute. Add the tofu, 1/2 teaspoon salt and a few grinds of pepper. Cook, stirring, 3 minutes. Add 3/4 cup of the ketchup sauce and 1/3 cup water; simmer until thickened, 2 minutes.\n            \n\n              Place the bottom buns on a baking sheet. Top with the tofu mixture, the remaining ketchup sauce and the cheese. Bake until the cheese melts, 3 minutes. Add the pickles and top buns. Serve with the Tater Tots.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "frozen yogurt", "quantity": 1.0}, {"food": "chili powder", "quantity": 1.5}, {"food": "garlic powder", "quantity": 0.75}, {"food": "salt", "quantity": 1}, {"food": "soft tofu", "quantity": 1.0}, {"food": "", "quantity": 0.6666666666666666}, {"food": "Worcestershire sauce", "quantity": 0.3333333333333333}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "celery seed", "quantity": 1.0}, {"food": "carrot juice", "quantity": 1.0}, {"food": "split pea soup", "quantity": 4.0}, {"food": "cheddar cheese", "quantity": 4.0}, {"food": "dessert topping", "quantity": 1}], "title": "\nVegetarian Sloppy Joes\n"}, {"directions": "\n\n              Special equipment: 5-inch ramekin\n            \n\n              Bring a large pot of water to a boil. Line a 5-inch ramekin with plastic wrap, leaving at least a 2-inch overhang; smooth out the plastic in the ramekin as much as possible.\n            \n\n              Add the spinach to the pot of water, stir to submerge and cook until wilted and tender, about 2 minutes. Drain and let cool completely. Squeeze every last drop of water out of the spinach, then finely chop. Transfer to a medium bowl.\n            \n\n              Process the walnuts, 1/3 cup warm water, cilantro, tarragon, dill, vinegar, scallions, garlic, 1 1/4 teaspoons salt, coriander and cayenne in a food processor until the mixture is the consistency of mayonnaise.\n            \n\n              Add the walnut-herb mixture to the bowl with the spinach, and stir to combine thoroughly. Spoon into the prepared ramekin, and pat down with the back of the spoon to compact. Cover with the plastic overhang, and refrigerate at least 4 hours up to overnight.\n            \n\n              To serve, unwrap and invert onto a serving platter. Garnish with pomegranate seeds and chopped walnuts. Serve with crackers or crudites.\n            \n", "ingredients": [{"food": "mustard spinach", "quantity": 1.5}, {"food": "walnuts", "quantity": 0.75}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "chrysanthemum leaves", "quantity": 0.25}, {"food": "dill seed", "quantity": 0.25}, {"food": "vinegar", "quantity": 2.0}, {"food": "", "quantity": 3.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "ground turkey", "quantity": 0.25}, {"food": "pepper", "quantity": 1}, {"food": "pomegranate", "quantity": 2.0}, {"food": "barley flour or meal", "quantity": 1}], "title": "\nVegetarian Spinach-Walnut Pate\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Arrange the squash on a baking sheet and sprinkle with 1/8 teaspoon salt. Bake until just soft, about 10 minutes, flipping the squash once about halfway through. Combine the mozzarella, Parmesan and 1/2 teaspoon salt in a small bowl.\n            \n\n              Spray an 8-inch square baking dish with cooking spray. Arrange 4 of the tortillas in the bottom of the dish so they overlap and top with the squash and half the scallions. Drizzle 1/3 cup of the salsa verde over the vegetables and top with 1/3 of the cheese mixture. Add another 4 overlapping tortillas, top with the sliced tomatoes and spinach, drizzle 1/3 cup of the remaining salsa verde over the vegetables and top with half of the remaining cheese mixture. Finish building the casserole with the remaining 4 tortillas, salsa verde and cheese mixture. Bake, uncovered, until the casserole is golden brown and hot, 20 to 25 minutes. Garnish with the remaining scallions.\n            \n", "ingredients": [{"food": "pasta with sliced franks in tomato sauce", "quantity": 1.25}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 0.25}, {"food": "", "quantity": 1}, {"food": "corn bran", "quantity": 6.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 1.25}, {"food": "mustard spinach", "quantity": 9.0}], "title": "\nVegetarian Tortilla Casserole\n"}, {"directions": "\n\n              Place the eggs in a small saucepan and cover with water by about 1 inch. Bring to a high simmer over medium-high heat and cook for 1 minute. Cover, remove from the heat and let sit 12 minutes. Drain the eggs and rinse under cold water, then peel and thinly slice. Meanwhile, cook the veggie burgers as the label directs. Whisk the yogurt, garlic, paprika, 2 tablespoons water, and salt to taste in a small bowl. In a large bowl, toss the arugula, roasted red peppers, cucumber, olive oil, mint, feta, and salt to taste. Cut 1 inch off the top of each pita to make an opening; stuff the pita strip inside the pita to reinforce the bottom. Stuff each pita with a veggie burger, some arugula salad and a few slices of hard-boiled egg. Drizzle with the yogurt dressing. Serve with pickles. \n            \n\n              Per Serving (does not include pickles): Calories: 426; Total Fat: 14 grams; Saturated Fat: 4 grams; Protein: 26 grams; Total carbohydrates: 51 grams; Sugar: 5 grams; Fiber: 9 grams; Cholesterol: 118 milligrams; Sodium: 1074 milligrams\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "eggs", "quantity": 2.0}, {"food": "frozen yogurt", "quantity": 4.0}, {"food": "silk plain soy yogurt", "quantity": 0.5}, {"food": "garlic powder", "quantity": 1.0}, {"food": "hot pockets ham cheese stuffed swich", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "arugula", "quantity": 4.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 0.25}, {"food": "", "quantity": 4.0}, {"food": "", "quantity": 1}], "title": "\nVeggie Burger Pockets\n"}, {"directions": "\n\n              Put the lentils and barley in a saucepan with cold water to cover by about 2 inches. Season with salt, and bring to a boil over high heat; reduce the heat and simmer, uncovered, until the lentils and barley tender, about 20 minutes. Drain excess liquid and put the beans and grain into a large bowl. Cool.\n            \n\n              Meanwhile, melt the butter in skillet over medium heat and cook the onion, garlic, and ginger until the onion is tender, about 4 minutes. Stir in the curry powder and cook until aromatic, about 1 minute more. Cool slightly and then add to the lentils and barley.\n            \n\n              Stir the cilantro, bread crumbs, and eggs into the lentil mixture, and season with 1 teaspoon salt and pepper, to taste. Puree 1 cup of the burger mix in a food processor until smooth. Return puree back to the bowl and mix well. Form mixture into 6 burgers (about 1/2 cup each). Place on a plate and refrigerate for 1 hour.\n            \n\n              Preheat oven to 400 degrees F.\n            \n\n              Heat 1 tablespoon of the olive oil in a nonstick skillet over medium-high heat. Season burgers with salt and pepper and cook 3 burgers, turning once, until golden brown on both sides, about 5 minutes in all. Transfer the browned burgers to a baking sheet. Repeat with the remaining oil and burgers. Transfer burgers to the oven, and cook until firm, about 10 minutes.\n            \n\n              Meanwhile lightly toast buns or pitas. Mix the goat cheese and yogurt in a small bowl until smooth, season with salt and pepper. Put the burgers on the buns, and top with cheese and lettuce, cucumber, radish, and/or a squeeze of lime juice, if desired. Serve.\n            \n", "ingredients": [{"food": "lentils", "quantity": 1.0}, {"food": "barley", "quantity": 0.25}, {"food": "butter oil", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "ginger", "quantity": 1.0}, {"food": "curry powder", "quantity": 1.5}, {"food": "chrysanthemum leaves", "quantity": 3.0}, {"food": "bread crumbs", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "sesame meal", "quantity": 6.0}, {"food": "goat", "quantity": 0.5}, {"food": "whole milk", "quantity": 0.25}, {"food": "lime juice", "quantity": 1}], "title": "\nVeggie Burgers\n"}, {"directions": "\n\n              Smash the beans in a bowl with a potato masher or fork until slightly chunky. Add the onion, walnuts, carrot, 1/2 cup breadcrumbs, scallions, parsley and 1 teaspoon Worcestershire sauce. Season with salt and pepper and mix with your hands until combined.\n            \n\n              Spread the remaining 1/2 cup breadcrumbs on a plate. Form the bean mixture into 4 patties; lightly coat with the breadcrumbs, shaking off any excess. Heat 2 tablespoons olive oil in a large nonstick skillet over medium-high heat. Add the patties and cook until golden and slightly crisp, 2 to 3 minutes per side. Transfer the burgers to a plate.\n            \n\n              Heat the remaining 1 tablespoon oil in the same skillet over medium heat. Add the mushrooms and the remaining 1 teaspoon Worcestershire sauce; season with salt and pepper and cook until the mushrooms are slightly wilted, 3 to 4 minutes. Serve the burgers on the English muffins with mayonnaise and/or mustard, baby greens and mushrooms.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "fava beans", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.5}, {"food": "walnuts", "quantity": 0.3333333333333333}, {"food": "diced chicken", "quantity": 1.0}, {"food": "silk plain soy yogurt", "quantity": 1.0}, {"food": "martha white foods", "quantity": 2.0}, {"food": "parsley", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 3.0}, {"food": "split pea soup", "quantity": 4.0}, {"food": "mustard spinach", "quantity": 1}, {"food": "mustard spinach", "quantity": 1}], "title": "\nVeggie Burgers with Mushrooms\n"}, {"directions": "\n\n              Squeeze or scoop the avocado from the skin into a small bowl. Mash with a fork and stir in the vinegar, oregano, yogurt and garlic to make a smooth spread. Thinly spread the avocado mixture onto one side of each slice of bread.\n            \n\n              Top 4 of the slices of bread with the arugula, tofu, onions and sun-dried tomatoes. Place 4 of the remaining slices on top, avocado-side down. Top with the cucumbers, pepperoncini, provolone and roasted peppers. Place the remaining bread slices on top, avocado-side down.\n            \n\n              Insert bamboo picks into each sandwich, cut in half on the diagonal with a bread knife and serve.\n            \n", "ingredients": [{"food": "avocado", "quantity": 0.5}, {"food": "martha white foods", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "silk plain soy yogurt", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "garlic bread", "quantity": 12.0}, {"food": "barley flour or meal", "quantity": 1.0}, {"food": "smoked turkey roll", "quantity": 2.5}, {"food": "onion powder", "quantity": 0.5}, {"food": "tomatoes", "quantity": 0.3333333333333333}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.3333333333333333}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.5}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}], "title": "\nVeggie Lover's Club Sandwich\n"}, {"directions": "\n\n              1. Preheat the oven to 350 degrees F. Butter 4 (8-ounce) ramekins and lightly coat with breadcrumbs.\n            \n\n              2. Soak the sun-dried tomatoes in the water until soft. Remove the tomatoes and coarsely chop. In a large bowl, whisk together the eggs and soaking water, and add the breadcrumbs. Set aside.\n            \n\n              3. Heat a large skillet over medium-high heat, add the olive oil, followed by the onions. Cook until brown, stirring frequently, about 10 minutes. Add the garlic, mushrooms, and sun-dried tomatoes and cook until the liquid from the mushrooms has evaporated, about 15 minutes. Stir in 1 1/2 teaspoons salt and 1 teaspoon pepper. Transfer the vegetables to a large bowl to cool.\n            \n\n              4. Add the breadcrumb mixture and the grated cheese to the vegetables and mix well with your hands. Evenly distribute the mixture among the coated ramekins. Place on a baking sheet and bake for 30 minutes. Let cool slightly, then run a knife around the edges of the ramekins.\n            \n\n              5. Toss the spinach in a hot skillet just until wilted and divide among 4 serving plates. Invert the meatloaf onto the spinach. Serve immediately.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "tomatoes", "quantity": 4.0}, {"food": "coconut water", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "cheesecake mix", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "", "quantity": 4.0}, {"food": "chrysanthemum leaves", "quantity": 8.0}], "title": "\nVeggie Meatloaf with Mushrooms and Sun-Dried Tomatoes\n"}, {"directions": "\n\n              1. Puree chickpeas, water, cheese, lemon juice, salt and red pepper flakes in a food processor until smooth, about 5 minutes. Pour in olive oil, with motor running, and process until velvety. Season with pepper, to taste. \n            \n\n              2. Spoon a scant tablespoon bean spread into toasted pitas. (Store remaining bean dip covered and refrigerated for another use.) Add avocado and cucumber slices, or other vegetables choice and season, to taste, with salt and pepper. Serve wrapped in parchment or butcher paper. \n            \n", "ingredients": [{"food": "fava beans", "quantity": 1.0}, {"food": "coconut water", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 0.25}, {"food": "lemon juice", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.5}, {"food": "", "quantity": 12.0}], "title": "\nVeggie Stack Pita Pockets\n"}, {"directions": "\n\n              Combine the chickpeas, water, cheese, lemon juice, salt and red pepper flakes in a food processor and puree until completely smooth, about 5 minutes. While the motor is running, pour in the olive oil and process until fully incorporated and velvety. Season with pepper, to taste.\n            \n\n              Spoon a scant tablespoon bean spread into toasted pitas. (Put remaining bean spread in an air-tight container.) Add avocado and cucumber slices, or other vegetables of choice and season, to taste, with salt and pepper. Wrap in parchment or butcher paper, and pack in a plastic container to keep from getting squished. Pack in a lunch box and send to school.\n            \n", "ingredients": [{"food": "fava beans", "quantity": 1.0}, {"food": "coconut water", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 0.25}, {"food": "lemon juice", "quantity": 2.0}, {"food": "seasoning mix", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "black bean mango", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.5}, {"food": "", "quantity": 10.0}], "title": "\nVeggie-Stack Pita Pockets\n"}, {"directions": "\n\n              Make the filling: Place the beef, bay leaves, 1 tablespoon salt and water to cover in a saucepan and bring to a boil over medium heat. Reduce to a simmer, cover and cook until the meat is almost falling apart, about 1 hour 30 minutes. Transfer the meat to a bowl and shred with a fork; cool. Reserve the broth.\n            \n\n              Heat the olive oil in a large skillet over medium-high heat. Add the onion, bell pepper, garlic and shallot; cook until the onion is translucent, about 3 minutes. Stir in the scallion, paprika, sazon completa, oregano, cumin and 1/4 teaspoon pepper. Add the beef and 1 cup of the reserved broth and cook over medium heat until thick, about 10 minutes. Season with salt.\n            \n\n              Make the dough: Mix 3 1/2 cups hot water, the sugar, vegetable oil, butter and salt in a medium bowl until the butter melts. Stir in the cornmeal and flour until a soft dough forms, then knead on a clean surface until the dough comes together. Shape into 12 balls, using about 1/2 cup dough for each.\n            \n\n              One at a time, sprinkle each dough ball with water, place between two pieces of lightly oiled heavy-duty plastic wrap (a cut resealable bag works well) and roll into a 7-inch circle. Remove the top sheet of plastic and place 2 to 3 tablespoons filling in the center of the dough. Use the bottom piece of\n            \n\n              plastic to fold the dough in half over the filling and press to seal. Trim into a half-moon shape with a knife or press down with the round edge of a bowl. Remove the plastic and place the empanada on a parchment-lined baking sheet.\n            \n\n              Preheat the oven to 300 degrees F. Heat 1 inch of vegetable oil in a large skillet until a deep-fry thermometer registers 365 degrees F. Fry the empanadas in batches until golden, about 4 minutes per side. Transfer to a paper-towel-lined baking sheet; keep warm in the oven.\n            \n\n              Make the sauce: Combine the cilantro, olive oil, avocado, bell pepper, scallion, vinegar and garlic in a blender. Add 1 teaspoon salt and 2 teaspoons pepper and puree until smooth. Thin out the sauce with up to 1/4 cup water and serve with the empanadas.\n            \n\n              Photograph by Kate Mathis\n            \n", "ingredients": [{"food": "roast beef", "quantity": 1.5}, {"food": "chrysanthemum leaves", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "diced chicken", "quantity": 0.25}, {"food": "garlic powder", "quantity": 2.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "paprika", "quantity": 2.0}, {"food": "seasoning mix", "quantity": 2.0}, {"food": "", "quantity": 0.25}, {"food": "cumin seed", "quantity": 0.25}, {"food": "pepper", "quantity": 1}, {"food": "sugar", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 1.5}, {"food": "butter oil", "quantity": 1.5}, {"food": "salt", "quantity": 1.0}, {"food": "cornmeal", "quantity": 3.5}, {"food": "potato flour", "quantity": 0.25}, {"food": "chrysanthemum leaves", "quantity": 1.25}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "avocado", "quantity": 1.0}, {"food": "pepper", "quantity": 0.25}, {"food": "", "quantity": 1.0}, {"food": "vinegar", "quantity": 4.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}], "title": "\nVenezuelan Empanadas\n"}, {"directions": "\n\n              Place the chicken breast-side up in a high-sided pot that fits the chicken snugly. Fill the pot with cold water to about 1 inch above the chicken and bring to a boil over medium-high heat.\n            \n\n              While waiting for the water to boil, cut the ginger into very thin rounds, peel and quarter 1 of the onions and add them and 1 tablespoon salt to the pot.\n            \n\n              Once the water reaches a boil, reduce to a simmer and cook, skimming and discarding any scum that floats to the surface of the poaching liquid, until an instant-read thermometer inserted between the breast and thigh of the chicken reads 165 degrees F, 30 to 35 minutes. (To take the temperature, use a pair of sturdy tongs to carefully lift the chicken out of the hot poaching liquid and insert the thermometer between the breast and thigh.)\n            \n\n              While the chicken is cooking, core the white and purple cabbages, very thinly slice them into ribbonlike strands and place the sliced cabbage in a large bowl; set aside.\n            \n\n              Fill a second large bowl a little more than halfway with equal parts ice and water, and use the tongs to add the cooked chicken to it; reserve the pot and poaching liquid. Leave the chicken in the ice water to cool completely, about 10 minutes.\n            \n\n              Meanwhile, peel, halve and very thinly slice the remaining onion, and place it in a small bowl. Add the vinegar, oil, 1 teaspoon of the sugar, 1/4 teaspoon salt and 1/4 teaspoon black pepper. Use your hands to gently massage the vinegar mixture into the onions until they begin to wilt slightly. Let the marinated onions sit at room temperature for at least 15 minutes and up to overnight.\n            \n\n              Discard the ice water, but keep the chicken in the bowl. Remove and discard the skin. Shred the chicken into large bite-size pieces; set aside.\n            \n\n              Add the chicken carcass to the poaching liquid, and return it to a simmer. Cook for 30 minutes, skimming off any fat and/or scum that floats to the surface. Strain the poaching liquid over a large bowl; discard the solids. Let this flavorful broth cool completely, and reserve it for another purpose. (It can be frozen in an airtight container for up to 3 months.)\n            \n\n              While the broth is cooking, make the dressing: Cook the remaining sugar and 1/4 cup water in a small saucepan over medium heat, stirring occasionally, until the sugar has completely dissolved, about 5 minutes. Remove to a small bowl and let cool slightly.\n            \n\n              While the sugar mixture is cooling, finely grate the garlic, halve and juice the limes (about 1/2 cup of juice total) and slice the chiles into thin rounds. Whisk the fish sauce into the cooled sugar mixture; add the garlic, lime juice and chiles.\n            \n\n              To assemble the salad, add the chicken, marinated onions (and any residual liquid) and lime dressing to the cabbage bowl. Tear the mint and basil leaves into the bowl, and gently toss to combine. Season with additional fish sauce if needed. Let the salad sit for 15 minutes so the flavors can marry, then transfer to a large platter. Place the peanuts and fried shallots in separate piles beside the salad. Just before serving, gently toss together the salad, peanuts and fried shallots and any liquid that has accumulated at the bottom of the platter (the liquid has a lot of great flavor). Serve with the fried shrimp chips.\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 5.0}, {"food": "ginger", "quantity": 2.0}, {"food": "onions", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "hearts of palm", "quantity": 0.5}, {"food": "swamp cabbage", "quantity": 0.5}, {"food": "vinegar", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "garlic powder", "quantity": 6.0}, {"food": "limes", "quantity": 6.0}, {"food": "ruby red grapefruit juice blend", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 0.3333333333333333}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "peanuts", "quantity": 0.5}, {"food": "fried chicken", "quantity": 0.5}, {"food": "potato chips", "quantity": 1}], "title": "\nVietnamese Chicken Salad (Goi Ga)\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F. Wrap each roll in foil and bake until crisp on the outside, about 15 minutes.\n            \n\n              Meanwhile, toss the carrot, cucumber, vinegar and 2 teaspoons fish sauce in a bowl; set aside, stirring occasionally, 10 minutes. Combine the mayonnaise, Sriracha and the remaining 1 teaspoon fish sauce in a small bowl. Beat the eggs in a medium bowl.\n            \n\n              Unwrap the rolls; spread the bottom buns with the mayonnaise mixture and top with the pate.\n            \n\n              Heat the vegetable oil in a large nonstick skillet over medium heat. Add the eggs and cook, stirring, until just set, about 3 minutes; divide among the rolls. Add the basil and carrot-cucumber salad to the sandwiches and drizzle with some of the vinegar mixture from the salad bowl. Serve with potato chips; sprinkle the chips with vinegar and drizzle with Sriracha.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [{"food": "pizza rolls", "quantity": 4.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "mayonnaise dressing", "quantity": 3.0}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "eggs", "quantity": 8.0}, {"food": "pate", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "basil", "quantity": 0.5}, {"food": "potato chips", "quantity": 1}], "title": "\nVietnamese Egg Sandwiches\n"}, {"directions": "\n\n              Prepare the salmon: Whisk the grapeseed oil, ginger, garlic, shallot, lemongrass, lime juice, fish sauce, brown sugar, a pinch of salt and 1/2 cup water in a medium bowl. Place the salmon on a rimmed baking sheet and pour the marinade on top. Turn the salmon so the marinade coats both sides. Cover and refrigerate, 30 minutes.\n            \n\n              Meanwhile, make the carrot-sesame dressing: Whisk the fish sauce, rice vinegar, Sriracha, sesame oil, brown sugar, lime juice and a pinch of salt in a medium bowl until the sugar dissolves. Add the carrot, scallions and 1/4 cup water; stir to combine. Set aside.\n            \n\n              Preheat a grill to medium high. Remove the salmon from the marinade, wiping off any excess. Brush the grill grates with grapeseed oil. Brush the skin side of the salmon generously with grapeseed oil, then place on the grill skin-side down. Cover and cook until the skin is crisp and the salmon is nearly cooked through, about 8 minutes. Uncover and cook until the salmon is just cooked through, about 5 more minutes. (Do not flip the fish.)\n            \n\n              Transfer the salmon to a platter and spoon the carrot-sesame dressing on top.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "ginger", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "sugar", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "wild rice", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 3.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "carrot juice", "quantity": 1.0}, {"food": "", "quantity": 3.0}], "title": "\nVietnamese Grilled Salmon\n"}, {"directions": "\n\n              Whisk together the rice wine vinegar and 1 tablespoon of the sugar in a mixing bowl until the sugar dissolves. Add the grated carrot and stir to combine. Season with salt and reserve.\n            \n\n              Combine the remaining sugar and 1/4 cup water in a small saucepan. Bring to a simmer over medium heat and simmer until the sugar dissolves, about 3 minutes. Turn off the heat and add the fish sauce, garlic, lime zest and juice and a pinch or 2 of red pepper flakes. Spoon out a 1/4 cup of the sauce to baste the pork chops and reserve the rest to serve with the rice bowls.\n            \n\n              Heat an outdoor grill or large cast-iron grill over medium-high heat. Whisk together the 1/4 cup sauce and the oil and brush liberally all over the pork chops. Place the pork chops on the grill and cook until the pork is warmed through and charred on both sides, about 5 minutes total. The pork chops might stick a bit to the grill but that is okay - just use a pair of tongs to gently pull away as needed. Transfer to a cutting board and allow to rest for 5 minutes. Cut each pork chop off the bone and thinly slice against the grain.\n            \n\n              To serve, divide the rice among 4 large bowls. Toss the carrots with the cilantro. Top each bowl with a few slices of the pork, divide the carrot salad among the bowls and top with the rest of the sauce. Stir to combine and serve.\n            \n", "ingredients": [{"food": "vinegar", "quantity": 3.0}, {"food": "sugar", "quantity": 5.0}, {"food": "carrot juice", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "Worcestershire sauce", "quantity": 3.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "grape juice", "quantity": 2.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "smoked turkey roll", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "crisped rice bar", "quantity": 4.0}], "title": "\nVietnamese Grilled Smoked Pork Chop Rice Bowls\n"}, {"directions": "\n\n              Put the instant espresso powder in a small bowl with 1/2 cup of hot water. Stir and let the espresso dissolve completely, then allow to cool completely. Pour into an ice cube tray and freeze until completely set, at least 2 hours and up to overnight.\n            \n\n              Put the coconut ice cream and sweetened condensed milk in the blender, then add the espresso ice cubes. Blend until the mixture is completely combined and smooth, about 2 minutes. (Stop the blender as needed and use a spoon to help evenly disperse the ingredients as they blend.) Pour into a tall glass and top with whipped cream and toasted shredded coconut if using.\n            \n", "ingredients": [{"food": "ice cream swich", "quantity": 1.5}, {"food": "milk", "quantity": 0.25}, {"food": "whipped cream substitute", "quantity": 1}, {"food": "coconut water", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.5}], "title": "\nVietnamese Iced Coffee Milkshake\n"}, {"directions": "\n\n              Prepare the rice noodles as the label directs.\n            \n\n              Meanwhile, place a large pot over high heat. Poke the meat all over with a fork to tenderize it and season with salt and pepper. Sear the meat until charred but still rare, 2 to 3 minutes per side, then transfer to a plate. Add the onion and ginger to the pot; cook about 4 minutes. Add the broth, 3 cups water, the star anise and cinnamon, reduce the heat and simmer about 20 minutes.\n            \n\n              Meanwhile, thinly slice the scallions and jalapenos (remove seeds for less heat) and tear the cilantro. Thinly slice the meat against the grain. Drain the noodles.\n            \n\n              Add the fish sauce to the broth and boil 5 minutes. Discard the ginger, star anise and cinnamon stick. Remove and slice the onion. Divide the noodles among 4 bowls; top with the broth, beef, scallions, cilantro, bean sprouts, jalapenos and onion.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "rice noodles", "quantity": 8.0}, {"food": "low fat big franks", "quantity": 12.0}, {"food": "salt", "quantity": 1}, {"food": "onion powder", "quantity": 1.0}, {"food": "ginger", "quantity": 1.0}, {"food": "frankfurter beef", "quantity": 3.0}, {"food": "drumstick pods", "quantity": 5.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "", "quantity": 4.0}, {"food": "ruby red grapefruit juice blend", "quantity": 2.0}, {"food": "", "quantity": 0.5}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "brussels sprouts", "quantity": 1.0}], "title": "\nVietnamese Noodle Soup\n"}, {"directions": "\n\n              Combine 1/4 cup water with the brown sugar, soy sauce, fish sauce, lemongrass, garlic and shallot in a shallow dish. Add the pork chops and turn to coat. Let marinate 15 minutes.\n            \n\n              Meanwhile, cook the rice as the label directs, adding the grated ginger to the water.\n            \n\n              Preheat the broiler. Remove the pork chops from the marinade; transfer to a broiler pan (reserve the marinade). Broil until the pork is charred and cooked through, 6 minutes. Transfer the marinade to a skillet; add 1/4 cup water and bring to a boil over high heat. Cook, stirring occasionally, until thickened, about 3 minutes.\n            \n\n              Fluff the rice with a fork and stir in the mint and cucumber; season with salt and pepper. Serve the pork with the rice and pan sauce.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "sugar", "quantity": 2.0}, {"food": "soy sauce", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "pork skins", "quantity": 4.0}, {"food": "crisped rice bar", "quantity": 1.0}, {"food": "ginger", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "diced chicken", "quantity": 2.0}, {"food": "salt", "quantity": 1}], "title": "\nVietnamese Pork Chops with Ginger Rice\n"}, {"directions": "\n\n              Whisk the vegetable oil with the fish sauce, ginger and garlic in a large bowl; transfer 2 tablespoons to a large resealable plastic bag and add the steak. Turn to coat, then set aside to marinate, 10 minutes. Whisk the rice vinegar into the bowl with the remaining marinade; set aside.\n            \n\n              Meanwhile, microwave the edamame as the label directs. Add the edamame, broccoli slaw and cucumbers to the bowl with the vinegar mixture; toss to coat, then set aside.\n            \n\n              Preheat a grill pan over medium heat and brush with vegetable oil. Sprinkle the sesame seeds over the steak and toss to coat, pressing to adhere. Grill the steak and tofu until the steak is just cooked through and the tofu is marked, about 4 minutes per side for each. Top each serving of the vegetable mixture with a piece of tofu, some steak and the herbs.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "ginger", "quantity": 2.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.5}, {"food": "vinegar", "quantity": 3.0}, {"food": "frozen yogurt", "quantity": 0.75}, {"food": "broccoli raab", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "sesame seeds", "quantity": 0.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "", "quantity": 0.5}], "title": "\nVietnamese Sesame Beef and Tofu\n"}, {"directions": "\n\n              Combine 1 ounce each rye and cognac, 1/2 ounce each sweet vermouth and Benedictine and 2 dashes each Peychaud's and angostura bitters in a shaker. Fill with ice and stir briefly; let sit 5 minutes. Strain into a chilled cocktail glass.\n            \n\n              Photograph by Marcus Nilsson\n            \n", "ingredients": [], "title": "\nVieux Carre\n"}, {"directions": "\n\n              Bring wine, sugar, shallot, garlic, rosemary, 1 1/2 teaspoons kosher salt and 1/2 teaspoon pepper to a boil in medium saucepan. Simmer over medium-low heat until thickened and reduced to about 3/4 cup, about 12 minutes. Let wine mixture cool completely.\n            \n\n              Pour wine mixture into a medium bowl. Add the chicken pieces, cover and marinate mixture for 1 hour.\n            \n\n              Preheat oven to 400 degrees F. Cover the top insert of a 2 piece broiler pan with foil, place on bottom pan. Evenly space the chicken on the pan skin-side up, reserving marinade. Roast the chicken until cooked through about 40 minutes.\n            \n\n              Meanwhile, pour the reserved marinade into a small skillet and add the grapes. Bring mixture to a rolling boil, and cook until the grapes are tender, about 5 minutes. Baste the chicken with the grape mixture, including both the grapes and the liquid every 15 minutes until the chicken and grapes are glazed and the chicken is cooked through, about 40 minutes. Serve.\n            \n", "ingredients": [{"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "sugar", "quantity": 0.25}, {"food": "", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "rosemary", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "mixed nuts", "quantity": 8.0}, {"food": "black bean mango", "quantity": 0.5}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}], "title": "\nVineyard Glazed Chicken\n"}, {"directions": "\n\n              Add the celery and the lemon juice to a blender and puree until smooth. Drain through a fine mesh sieve into a pitcher. Stir in the beef broth, horseradish, hot sauce, and 3/4 teaspoon each of salt and pepper. Pour into glasses filled with ice and garnish with a celery stalk and a lemon wedge.\n            \n", "ingredients": [{"food": "celery seed", "quantity": 8.0}, {"food": "lemons", "quantity": 2.0}, {"food": "frankfurter beef", "quantity": 5.0}, {"food": "horseradish", "quantity": 5.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "salt", "quantity": 0.75}, {"food": "black bean mango", "quantity": 0.75}], "title": "\nVirgin Bullshot\n"}, {"directions": "\n\n              Puree 1 cup cubed watermelon, 2 cups cranberry juice and 1/4 cup each grenadine and lemon juice in a blender. Strain, then pour 3/4 cup of the strained puree into ice-filled glasses; top with seltzer and garnish with lemon.\n            \n", "ingredients": [], "title": "\nVirgin Watermelon Cape Codders\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Pulse the flour, lard, sugar, salt and 4 tablespoons of the butter in a food processor until it has the consistency of a fine meal. Add the remaining 8 tablespoons butter, and pulse until you have pea-sized pieces. Sprinkle the vodka and water over the flour, and pulse until the dough just comes together. Evenly divide the dough between 2 pieces of plastic wrap, and gently pat each into a round. Wrap each round tightly and refrigerate until firm, about 1 hour and up to overnight. \n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.5}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "sugar", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "butter oil", "quantity": 1.5}, {"food": "", "quantity": 0.25}, {"food": "coconut water", "quantity": 3.0}], "title": "\nVodka Pie Dough\n"}, {"directions": "\n\n              Cook 2 chopped shallots in a skillet with 2 tablespoons butter over medium heat, about 3 minutes. Add 3/4 cup heavy cream, 2 cups Perfect Marinara Sauce (see Cook's Note) and a pinch of red pepper flakes; heat through. Stir in 1/4 cup grated parmesan and 1 to 2 tablespoons vodka; season with salt. Toss with penne.\n            \n\n              Photograph by Kang Kim\n            \n", "ingredients": [], "title": "\nVodka Sauce\n"}, {"directions": "\n\n              Cook 2 minced shallots in a skillet with butter over medium heat until slightly softened, 3 minutes. Add 1 minced garlic clove and a pinch of red pepper flakes; cook 30 seconds. Remove from the heat. Add 1/2 cup vodka, a 28-ounce can crushed tomatoes and some salt. Simmer, stirring, 7 minutes. Stir in 2/3 cup heavy cream and simmer until thickened, 3 minutes. Stir in 1/2 cup grated parmesan and a handful of torn basil. Toss with 12 ounces cooked penne, adding some pasta-cooking water to loosen.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [], "title": "\nVodka Sauce\n"}]