[{"directions": "\n\n              Toast 3 frozen waffles until crisp. Stack the waffles with some chocolate-hazelnut spread and sliced strawberries between each layer. Top with more strawberries and dust with cocoa powder.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nWaffle Cake\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Make the dipping sauce: Whisk the maple syrup and hot sauce in a bowl.\n            \n\n              Make the chicken fingers: Whisk the egg, buttermilk, mustard and 1/2 teaspoon each salt and pepper in a large bowl. Add the chicken and toss to coat.\n            \n\n              Pulse the waffles in a food processor to make fine crumbs. Transfer the crumbs to a baking sheet.\n            \n\n              Heat 1/2 inch of vegetable oil in a large skillet or heavy-bottomed pot until hot but not smoking. Remove the chicken from the egg mixture, shaking off any excess, and coat with the waffle crumbs, pressing firmly to adhere. Fry the chicken in batches, adjusting the heat if necessary, until golden brown and cooked through, about 2 minutes per side. Transfer to a rack set over a baking sheet to drain. Serve with the dipping sauce.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "syrup", "quantity": 0.5}, {"food": "Worcestershire sauce", "quantity": 2.0}, {"food": "diced chicken", "quantity": 1}, {"food": "egg substitute", "quantity": 1.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.25}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 2.0}, {"food": "frozen yogurt", "quantity": 8.0}, {"food": "vegetable oil", "quantity": 1}], "title": "\nWaffle Chicken Fingers\n"}, {"directions": "\nSpecial equipment: waffle cone iron\n\n              Whisk the eggs, heavy cream and vanilla extract in a bowl until well combined, about 1 minute. In another bowl, sift the flour, sugar and salt. Stir the dry ingredients into the cream mixture until the batter is smooth.\n            \n\n              Heat up a waffle iron and spray it with cooking spray. Pour 1/4 cup of the batter towards the back of the iron and close the lid. Bake until golden brown, 3 1/2 minutes, depending on waffle cone maker.\n            \n\n              Open the iron and carefully remove the browned batter with a small offset spatula. Mold as desired. After a few minutes, the waffle cup/cone will take its shape. Allow to cool completely.\n            \n", "ingredients": [{"food": "eggs", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "salt", "quantity": 0.25}, {"food": "waffle", "quantity": 1}], "title": "\nWaffle Cones\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: Waffle iron (preferably Belgian style)\n\n              Preheat a waffle iron to medium-high. Preheat the oven to 200 degrees F (to keep cooked waffles warm). Whisk together the flour, sugar, walnuts, baking powder, baking soda, cinnamon, nutmeg and salt in a large bowl. Whisk together the banana, oil, sour cream, vanilla and eggs in another bowl. Fold the banana mixture into the flour mixture until just combined (it's ok if there are lumps).\n            \n\n              Lightly brush the top and bottom of the waffle iron with oil. Fill each section about three-quarters of the way full (there should still be some waffle iron showing). Close and cook until the waffles are golden brown, 4 to 6 minutes. Keep the waffles warm in the oven or covered with foil on a plate while you cook the remaining batter.\n            \n\n              Spread with butter and dust with confectioners' sugar if you'd like.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.25}, {"food": "sugar", "quantity": 0.75}, {"food": "walnuts", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "cinnamon", "quantity": 0.5}, {"food": "nutmeg", "quantity": 0.5}, {"food": "salt", "quantity": 0.25}, {"food": "bananas", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "sour cream", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "butter oil", "quantity": 1}], "title": "\nWaffled Banana Bread\n"}, {"directions": "\n\n              Soak, drain and rinse the rice in a strainer until the water runs clear and is not cloudy. Combine the rinsed rice with 3/4 cup water in a small saucepan. Bring to a simmer over medium heat, then over and turn the heat down to low. Cook, undisturbed, until the water is absorbed, about 15 minutes. Remove from the heat and let sit, covered, for another 15 minutes. Uncover and fluff the rice with a fork. Stir in 1 tablespoon sesame oil, the sesame seeds, 1 tablespoon soy sauce, the vinegar, sugar and 1/2 teaspoon salt. Let cool completely (the rice can be refrigerated up to 1 day ahead). \n            \n\n              Combine the baby spinach with 1 tablespoon water in a microwave-safe bowl. Cover and microwave until wilted, 3 to 4 minutes. Drain and toss with the remaining sesame oil and soy sauce. Set aside. \n            \n\n              Preheat a waffle iron to medium-high. Generously brush the top and bottom of the waffle iron with sesame oil. Stir the 2 beaten eggs into the cooled rice. Evenly spread about 1/2 cup of the rice mixture in the waffle iron. Close and cook until the rice is golden in spots and can be easily lifted out with a spatula, 4 to 6 minutes. Repeat with the remaining rice mixture. Transfer to two plates and set aside. \n            \n\n              Lightly brush the waffle iron bottom with more sesame oil. Crack the remaining 2 eggs right onto the waffle iron and keep the iron open. Sprinkle the eggs with salt. Cook until the whites are set and the yolk is still runny, 4 to 5 minutes. Serve an egg on top of each rice waffle. Top with the spinach, kimchi, gochujang paste and sesame seeds.\n            \n\n              Copyright 2013 Television Food Network, G.P. All rights reserved\n            \n\n              From Food Network Kitchens\n            \n", "ingredients": [{"food": "crisped rice bar", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "sesame seeds", "quantity": 1.0}, {"food": "soy sauce", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "mustard spinach", "quantity": 4.0}, {"food": "", "quantity": 4.0}, {"food": "", "quantity": 0.5}, {"food": "almond paste", "quantity": 1}, {"food": "waffle", "quantity": 1}, {"food": "almond paste", "quantity": 1}], "title": "\nWaffled Bibimbap\n"}, {"directions": "\nSpecial equipment: a waffle iron\n\n              Heat the oil in a large nonstick skillet over medium-high heat. Add the sausage and cook, breaking it up with a wooden spoon, until browned and cooked through, about 5 minutes. \n            \n\n              Add the scallion whites, garlic, allspice, 1/4 teaspoon salt and 1/4 teaspoon pepper; stir for 30 seconds. Add the flour and stir until toasted, about 1 minute. Pour in the milk and chicken broth and simmer, stirring, until thick, 4 to 5 minutes. Stir in the scallion greens and parsley. Cover and keep warm over low heat. \n            \n\n              Preheat a waffle iron to medium-high heat. Place 1 biscuit round into each section of your waffle iron, close gently (don't push down) and cook until golden and cooked through, 3 to 4 minutes. Repeat with the remaining biscuits. \n            \n\n              Place 2 biscuits on each plate and top with the sausage gravy.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "breakfast tart", "quantity": 8.0}, {"food": "turnip greens", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "allspice", "quantity": 0.125}, {"food": "black bean mango", "quantity": 1}, {"food": "potato flour", "quantity": 1.0}, {"food": "milk", "quantity": 1.0}, {"food": "diced chicken", "quantity": 0.5}, {"food": "parsley", "quantity": 1.0}, {"food": "biscuit", "quantity": 8.0}], "title": "\nWaffled Biscuits and Sausage Gravy\n"}, {"directions": "\n\n              Make the smoothies: Combine the yogurt, 1 1/2 cups ice, carrots, 2 tablespoons of the maple syrup and the ginger in a blender and blend until smooth. Divide among four glasses and refrigerate until ready to serve.\n            \n\n              Make the sauce: Combine the blueberries and the remaining 3 tablespoons of maple syrup in a small microwave-safe bowl. Cover with plastic wrap and microwave until the blueberries pop, about 2 minutes. Set aside.\n            \n\n              Preheat a waffle iron and lightly coat with the nonstick cooking spray. Whisk together the milk, egg, cinnamon and 1/8 teaspoon salt in a baking dish. Soak a piece of bread, on each side, for a few seconds. Place on the waffle iron, close and cook until golden brown, 3 to 4 minutes. Remove and keep warm on a plate covered in foil, repeat with the remaining bread.\n            \n\n              Divide the waffles and blueberry sauce evenly among four plates, sprinkle with almonds. Serve with the smoothies.\n            \n", "ingredients": [{"food": "silk plain soy yogurt", "quantity": 2.0}, {"food": "carrots", "quantity": 2.0}, {"food": "syrup", "quantity": 5.0}, {"food": "ginger", "quantity": 1.0}, {"food": "blueberries", "quantity": 1.0}, {"food": "", "quantity": 1}, {"food": "milk", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "cinnamon", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "garlic bread", "quantity": 4.0}, {"food": "almonds", "quantity": 2.0}], "title": "\nWaffled Blueberry French Toast with a Carrot-Ginger Smoothie\n"}, {"directions": "\n\n              Preheat a waffle iron to medium-high. Preheat the oven to 200 degrees F (to keep cooked waffles warm). Whisk together the milk, sugar, vanilla, salt and eggs in a bowl or baking dish. Soak a piece of bread in the mixture for 2 minutes per side.\n            \n\n              Lightly brush the top and bottom of the waffle iron with butter. Place the soaked bread on the waffle iron and close gently (don't push down). Cook until golden brown and dry underneath when you lift a corner, 5 to 6 minutes. Keep the warm in the oven or covered with foil on a plate. Repeat with the remaining bread.\n            \n\n              Top the French toast with syrup, raspberries and confectioners' sugar.\n            \n", "ingredients": [{"food": "milk", "quantity": 1.5}, {"food": "sugar", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "eggs", "quantity": 5.0}, {"food": "garlic bread", "quantity": 1.5}, {"food": "waffle", "quantity": 1}, {"food": "raspberries", "quantity": 1}, {"food": "waffle", "quantity": 1}], "title": "\nWaffled Brioche French Toast\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: Waffle iron (preferably Belgian style)\n\n              Preheat a waffle iron to medium-high. Preheat the oven to 200 degrees F (to keep cooked waffles warm). Sift together the flour, cocoa powder and 1/8 teaspoon salt in a small bowl; set aside.\n            \n\n              Combine half the chocolate and the butter in a medium saucepan over medium heat, stirring until melted and smooth, about 5 minutes. Remove from the heat and let cool slightly. Stir in the sugar and eggs. Add the flour mixture and remaining chocolate and stir until just combined.\n            \n\n              Lightly brush the top and bottom of the waffle iron with butter. Fill the waffle iron about three-quarters of the way full (some waffle iron should still be showing). Close the lid gently and cook until the waffles are cooked through and slightly crispy around the edges, 4 to 6 minutes. Keep the cooked waffles warm in a 200 degrees F oven or covered with foil on a plate while you make the remaining waffles.\n            \n\n              Top each waffle with ice cream, whipped cream, caramel sauce, sprinkles and a cherry, if desired.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 0.75}, {"food": "onion powder", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "baking chocolate", "quantity": 4.0}, {"food": "waffle", "quantity": 3.0}, {"food": "sugar", "quantity": 0.5}, {"food": "eggs", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 1}], "title": "\nWaffled Brownie Sundae\n"}, {"directions": "\nSpecial equipment: Waffle iron (preferably Belgian style)\n\n              Preheat the oven to 350 degrees F. Spread all the pecans on a baking sheet and bake until toasted, 8 to 10 minutes. Let cool slightly, then pulse 1/2 cup in a food processor until very finely chopped, but not ground. Roughly chop the remaining pecans for garnish.\n            \n\n              For the cream cheese frosting: Meanwhile, combine the cream cheese and butter in a small bowl and beat with a hand mixer until smooth, about 1 minute. Add the sugar, lemon juice, vanilla and salt and beat until incorporated and smooth. Set aside.\n            \n\n              For the carrot cake: Turn the oven down to 200 degrees F. Preheat a waffle iron to medium-high. Whisk together the finely ground pecans, flour, sugar, baking powder, cinnamon, baking soda, ginger and salt in a large bowl. Whisk together the oil, milk, lemon zest, vanilla and eggs in another bowl. Stir in the coconut and carrots. Fold the carrot-egg mixture into the flour mixture until just combined (it's ok if there are lumps).\n            \n\n              Lightly brush the top and bottom of the waffle iron with oil. Fill the waffle iron about three-quarters of the way full (some waffle iron should still be showing). Close the lid gently and cook until the waffle is golden brown and slightly crisp, 4 to 6 minutes. Keep the cooked waffles warm in the oven or covered with foil on a plate while you make the remaining waffles.\n            \n\n              Spread each waffle with the cream cheese frosting, sprinkle with the chopped pecans and dust with cinnamon.\n            \n", "ingredients": [{"food": "", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "sugar", "quantity": 0.5}, {"food": "lemon juice", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "potato flour", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.75}, {"food": "ginger", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "milk", "quantity": 0.25}, {"food": "lemon juice", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "eggs", "quantity": 2.0}, {"food": "coconut water", "quantity": 0.25}, {"food": "carrots", "quantity": 2.0}], "title": "\nWaffled Carrot Cake\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Whisk together the flour, baking soda and salt in a medium bowl. Beat the sugars and butter with an electric mixer on medium-high speed until light and fluffy, about 5 minutes. Beat in the vanilla and egg until incorporated. Adjust the speed to medium-low and add the flour in 2 batches, mixing until incorporated. Mix in the chocolate chips. Refrigerate the dough for at least 30 minutes. \n            \n\n              Preheat a waffle iron to medium-low. Generously spray the top and bottom of the waffle iron with cooking spray. Scoop tablespoons of the dough, roll into balls and flatten slightly. Working in batches, place 1 dough round onto each section of the waffle iron, close gently and cook until slightly crisp, 3 to 6 minutes. \n            \n\n              Serve the cookies warm or store in an airtight container at room temperature for up to 1 day.\n            \n\n              Copyright 2013 Television Food Network, G.P. All rights reserved\n            \n\n              From Food Network Kitchens\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.25}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "butter oil", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "egg substitute", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "", "quantity": 1}, {"food": "waffle", "quantity": 1}], "title": "\nWaffled Chocolate Chip Cookies\n"}, {"directions": "\n\n              Combine the lime juice, onions and salt in a small nonreactive bowl, tossing occasionally. Let sit at room temperature until the onions are pink, about 15 minutes. \n            \n\n              Heat the oil in a medium nonstick skillet over medium-high heat. Add the chorizo and cook, breaking up with a wooden spoon, until browned, about 3 minutes. \n            \n\n              Preheat a waffle iron to medium-high. Brush one side of 2 tortillas with oil and lay dry-side up on a work surface. Scatter each with 1/3 cup cheese, then the pickled onions. Sandwich with the remaining tortillas and brush the tops with oil. \n            \n\n              Place 1 quesadilla in the waffle iron, close gently (don't push down) and cook until golden brown and the cheese is melted, 4 to 6 minutes. Repeat with the remaining quesadilla. Cut the quesadillas into wedges and top with the chorizo. Serve with salsa, sour cream and avocado.\n            \n\n              Copyright 2013 Television Food Network, G.P. All rights reserved\n            \n\n              From Food Network Kitchens\n            \n", "ingredients": [{"food": "lime", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "chorizo", "quantity": 2.0}, {"food": "potato flour", "quantity": 6.0}, {"food": "", "quantity": 0.6666666666666666}, {"food": "sour cream", "quantity": 1}, {"food": "waffle", "quantity": 1}], "title": "\nWaffled Chorizo-Cheese Quesadilla\n"}, {"directions": "\nSpecial equipment: Waffle iron (preferably for thin waffles)\n\n              Preheat the oven to 200 degrees F (to keep cooked waffles warm).\n            \n\n              Combine the oil, cilantro, flour, parsley, baking powder, cumin, salt, coriander, cayenne, egg whites, garlic and chickpeas in a food processor and pulse until smooth.\n            \n\n              Lightly brush the top and bottom of the waffle iron with oil. Fill the waffle iron about three-quarters of the way full (some waffle iron should still be showing). Close the lid gently and cook until the falafel is golden brown and firm in the center, 6 to 10 minutes. Keep the cooked falafels warm in the oven or covered with foil on a plate while you make the remaining falafels.\n            \n\n              To build the sandwiches, stuff each pita half with a falafel. Add your choice of toppings, drizzle with the hummus and sprinkle with a few dashes of hot sauce.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "", "quantity": 2.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "parsley", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "cumin seed", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "ground turkey", "quantity": 0.5}, {"food": "pepper", "quantity": 0.25}, {"food": "egg substitute", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "chickpeas", "quantity": 15.0}, {"food": "", "quantity": 4.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1}, {"food": "pasta with tomato sauce", "quantity": 0.25}, {"food": "Worcestershire sauce", "quantity": 1}], "title": "\nWaffled Falafel\n"}, {"directions": "\nSpecial equipment: A waffle iron (preferably for thin waffles)\n\n              Preheat a waffle iron to medium-high heat. Preheat the oven to 200 degrees F. Peel the potatoes, then shred on a box grater. Squeeze out the excess liquid into a bowl and reserve.\n            \n\n              Combine the shredded potatoes, butter, chives, 2 teaspoons of the potato liquid, 1/2 teaspoon salt and a few grinds of pepper.\n            \n\n              Lightly brush the top and bottom of the waffle iron with melted butter. Pour a scant 1/2 cup of the potato batter into the waffle iron, close gently and cook until golden and crisp, 4 to 8 minutes. Keep the cooked waffles warm in the oven or covered with foil on a plate while you make the remaining waffles.\n            \n\n              Top the waffled hash browns with smoked salmon, dollop with sour cream and sprinkle with chives.\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 2.0}, {"food": "waffle", "quantity": 2.0}, {"food": "chives", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "salmon", "quantity": 1}, {"food": "ice cream swich", "quantity": 1}], "title": "\nWaffled Hash Browns\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: Waffle iron (preferably Belgian style)\n\n              Preheat a waffle iron to medium-high. Combine the stuffing, parsley and eggs. Generously brush the top and bottom of the waffle iron with oil. Evenly and firmly pack each section of the waffle iron full with the stuffing mixture. Close and cook until golden and the waffles can easily be lifted out of the waffle iron, 4 to 6 minutes.\n            \n\n              Meanwhile, heat the gravy in a small saucepan. Once the waffles are ready, top each with as much turkey as you want and close the waffle iron. Cook until the turkey is warmed through, 2 to 3 minutes.\n            \n\n              Transfer the waffles to 4 plates and top each with as much gravy and cranberry sauce as you'd like.\n            \n", "ingredients": [{"food": "bread stuffing", "quantity": 4.5}, {"food": "parsley", "quantity": 0.25}, {"food": "eggs", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "Worcestershire sauce", "quantity": 1}], "title": "\nWaffled Leftover Thanksgiving Brunch\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Stir together the tomatoes, 1 tablespoon olive oil, the salt, basil and garlic. Let sit at room temperature to give the flavors time to meld, about 1 hour. \n            \n\n              Preheat a waffle iron to medium-high. Lightly dust a clean work surface with flour and roll out half of the pizza dough into a 6-inch round (or to the maximum size your waffle iron can fit). Brush one side with olive oil and place oiled-side down on the waffle iron, then brush the other side with oil. Close the iron (don't push down) and cook until golden and cooked through, 4 to 6 minutes. Repeat with the remaining dough. \n            \n\n              Meanwhile, heat the tomato sauce in a microwave until hot. Spread each pizza with half of the sauce and half of the mozzarella. Place one pizza back on the waffle iron and hold the top of the iron just over the cheese until melted, 1 to 2 minutes. Remove and garnish with basil leaves, drizzle with olive oil and sprinkle with Parmesan. Repeat with the second pizza. \n            \n\n              Cut the pizzas into slices with a large knife or pizza cutter and serve.\n            \n\n              Copyright 2013 Television Food Network, G.P. All rights reserved\n            \n\n              From Food Network Kitchens\n            \n", "ingredients": [{"food": "tomatoes", "quantity": 0.3333333333333333}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "garlic powder", "quantity": 0.5}, {"food": "pizza rolls", "quantity": 8.0}, {"food": "potato flour", "quantity": 1}, {"food": "macaroni cheese", "quantity": 0.5}, {"food": "", "quantity": 1}, {"food": "waffle", "quantity": 1}], "title": "\nWaffled Margherita Pizza\n"}, {"directions": "\n\n              Preheat the oven to 300 degrees F. Arrange the tomatoes on a baking sheet cut-side down. Drizzle with olive oil and sprinkle with salt. Slow-roast until the tomatoes are soft and wrinkled, about 1 hour. Set aside to cool. (The tomatoes can be made and refrigerated up to 1 day ahead.) \n            \n\n              Preheat a waffle iron to medium-high. Brush one side of each bread slice with melted butter. Lay the bread out on a clean work surface, dry-side up. Spread each slice of bread with some of the mayonnaise. Top 4 bread slices with 2 tomato halves, slightly smashing them into the bread. Top with 3 cheese slices each and the remaining bread slices. \n            \n\n              Place two sandwiches at a time in the waffle iron and gently close the lid (don't press down). Cook until the cheese is melted and the sandwiches are golden-brown, 6 to 10 minutes. Repeat with the remaining sandwiches. Cut in half and serve.\n            \n\n              Copyright 2013 Television Food Network, G.P. All rights reserved\n            \n\n              From Food Network Kitchens\n            \n", "ingredients": [{"food": "plum", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "garlic bread", "quantity": 8.0}, {"food": "butter oil", "quantity": 1}, {"food": "mayonnaise dressing", "quantity": 0.25}, {"food": "macaroni cheese", "quantity": 12.0}, {"food": "waffle", "quantity": 1}], "title": "\nWaffled Tomato-Grilled Cheese\n"}, {"directions": "\n\n              Preheat a waffle iron to medium-high. \n            \n\n              In a large bowl, whisk together the flour, baking powder, salt, and nutmeg. \n            \n\n              In a medium bowl, whisk together the milk, egg yolks, vanilla, and 1/4 cup melted butter. Whisk the milk mixture into the flour mixture until a batter is formed. Take care not to over mix the batter. In medium bowl, with a hand-held electric mixer or whisk, whip the 3 egg whites until they just begin to hold a loose peak. Scatter the sugar over the whites and continue beating until they hold a soft peak. Using a rubber spatula, fold a third of the egg whites into the batter to lighten the base. Fold in the remaining whites. \n            \n\n              Brush the inside surface of the iron with butter. Pour in enough batter to lightly cover the surface of the iron, about 1/3 to 3/4 cup, depending upon the size of the iron. (Take into consideration that the batter will spread once the lid is closed.) Cover and cook until golden brown and slightly crisp, about 5 minutes. Repeat with the remaining batter. (If the waffle iron is well seasoned or nonstick it is not necessary to brush the inner surface each time before cooking the waffles.) \n            \n\n              Serve the waffles immediately with syrup, jam, fresh fruit, or yogurt. \n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.75}, {"food": "baking chocolate", "quantity": 1.75}, {"food": "salt", "quantity": 0.125}, {"food": "nutmeg", "quantity": 0.125}, {"food": "milk", "quantity": 1.5}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "butter oil", "quantity": 0.25}, {"food": "egg substitute", "quantity": 1.0}, {"food": "sugar", "quantity": 0.25}, {"food": "fruit syrup", "quantity": 1}], "title": "\nWaffles\n"}, {"directions": "\n\n              Make the creamy topping: Combine the cottage cheese, sugar, milk and vanilla in a food processor and puree until smooth. Cover and refrigerate until ready to serve.\n            \n\n              Make the compote: Melt the butter in a saucepan over medium heat. Add the pears and cook until the edges brown, about 2 minutes. Add the dried cherries, orange juice, sugar and 1/3 cup water. Bring to a simmer and cook until syrupy, about 5 minutes; set aside.\n            \n\n              Make the waffles: Preheat the oven to 250 degrees F. Whisk the flour, oats, sugar, baking powder, baking soda, ginger and salt in a large bowl. Whisk the milk, cottage cheese, eggs, vanilla and orange zest in another bowl (it will be lumpy), then whisk into the flour mixture until just combined. Whisk in the melted butter.\n            \n\n              Preheat a waffle iron and spray with cooking spray. Ladle in some batter (about 1/2 cup, depending on your waffle iron) and cook until crisp. Transfer to a baking sheet and keep warm in the oven; repeat with the remaining batter. Top the waffles with the creamy topping and compote.\n            \n\n              Photographs by Kang Kim\n            \n", "ingredients": [{"food": "macaroni cheese", "quantity": 1.0}, {"food": "sugar", "quantity": 2.0}, {"food": "milk", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "butter oil", "quantity": 2.0}, {"food": "prickly pears", "quantity": 3.0}, {"food": "maraschino cherries", "quantity": 0.3333333333333333}, {"food": "", "quantity": 2.0}, {"food": "sugar", "quantity": 2.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "oats", "quantity": 0.5}, {"food": "sugar", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "ginger", "quantity": 0.5}, {"food": "hearts of palm", "quantity": 1}, {"food": "milk", "quantity": 1.25}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "", "quantity": 0.5}, {"food": "butter oil", "quantity": 2.0}, {"food": "", "quantity": 1}], "title": "\nWaffles With Pear-Cherry Compote\n"}, {"directions": "\n\n              Bring a medium pot of water to a boil. Add the pasta and cook according to package directions. About 30 seconds before the pasta is done, add the broccoli florets and corn kernels. Cook for 30 seconds and then drain into a colander. Run cold water over the pasta to stop the cooking. Keep the pasta draining in the colander while you make the dressing.\n            \n\n              Whisk together the garlic, red wine vinegar, olive oil, 1/2 teaspoon salt, and a few grinds of black pepper.\n            \n\n              Add the well-drained pasta, broccoli, and corn to the bowl, along with the ham, cheese, tomatoes, parsley and scallions, if using. Toss together. Refrigerate in an airtight container for up to 5 days.\n            \n", "ingredients": [{"food": "italian veg medley pasta", "quantity": 6.0}, {"food": "broccoli raab", "quantity": 1.0}, {"food": "sunflower seed kernels", "quantity": 0.5}, {"food": "garlic powder", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "black bean mango", "quantity": 0.5}, {"food": "cheddar cheese", "quantity": 2.0}, {"food": "ham", "quantity": 2.0}, {"food": "silk black cherry soy yogurt", "quantity": 1.0}, {"food": "parsley", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}], "title": "\nWagon Wheel Pasta Salad\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: a 7-by-3-inch round cake pan\n\n              For the cake: Preheat the oven to 350 degrees F. Butter a 7-by-3-inch round cake pan.\n            \n\n              Whisk together the sugar, oats, baking powder, salt, baking soda and 1 1/2 cups flour in a large bowl and set aside. Toss the blueberries with the remaining 1 tablespoon flour in a small bowl.\n            \n\n              Whisk together the oil, yogurt, vanilla and eggs in a medium bowl. Fold the oil mixture into the sugar mixture until just combined. Then gently fold in the floured blueberries. \n            \n\n              Pour the batter into the prepared cake pan and bake until a toothpick inserted in the center comes out clean, 55 minutes to 1 hour 5 minutes.\n            \n\n              Cool in the pan on a rack for 30 minutes. Unmold the cake and cool completely on the rack, about 30 minutes more. \n            \n\n              For the frosting: Meanwhile, beat the yogurt and cream cheese in a large bowl with an electric mixer on medium-high speed until smooth. Beat in the vanilla. Then slowly add the sugar, while beating, until completely combined. Refrigerate until ready to use. \n            \n\n              Slice the cooled cake in half horizontally to make 2 rounds.\n            \n\n              Put 1 cake round on a cake stand or round serving platter. Evenly spread half the frosting over the top of the cake, spreading all the way to the edge. Dollop half the blueberry preserves in several small drops all over the frosting layer. Top with the remaining cake round and spread the remaining frosting over the top. The sides of the cake will be unfrosted. Dollop the remaining blueberry preserves in the center of the cake. Sprinkle blueberries on top of the preserves. The cake can be served right away or made the night before and refrigerated.\n            \n", "ingredients": [{"food": "butter oil", "quantity": 1}, {"food": "sugar", "quantity": 0.75}, {"food": "oats", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "potato flour", "quantity": 1.5}, {"food": "vegetable oil", "quantity": 0.5}, {"food": "silk plain soy yogurt", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "blueberries", "quantity": 1.25}, {"food": "silk plain soy yogurt", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "blueberry muffin mix", "quantity": 0.25}], "title": "\nWake and Cake Blueberry Breakfast Cake\n"}, {"directions": "\n\n              Preheat the oven to 350 degree F. Spread the nuts on a baking sheet and toast in the oven for 8 to 10 minutes. Cool and break the nuts up into small pieces. Half, core, and cut the apples into 3/4-inch pieces, leaving the skin intact. In a medium bowl, mix the apples with the lemon juice, celery, and walnuts.\n            \n\n              In a small bowl, whisk together the mayonnaise, chives, sour cream, parsley, sugar, and lemon zest and season with pepper. Add the mayonnaise mixture to the apple mixture and stir to coat. Refrigerate if not using immediately. When ready to serve, arrange the lettuce leaves on a large platter, or divide them among 6 salad plates. Place the salad on the lettuce and serve.\n            \n", "ingredients": [{"food": "walnuts", "quantity": 0.75}, {"food": "pasta with tomato sauce", "quantity": 3.0}, {"food": "lemon juice", "quantity": 1.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.5}, {"food": "mayonnaise dressing", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "sour cream", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "lemon juice", "quantity": 0.75}, {"food": "black bean mango", "quantity": 1}, {"food": "lettuce", "quantity": 1.0}], "title": "\nWaldorf Salad\n"}, {"directions": "\n\n              Preheat the oven to 350 degrees F.\n            \n\n              Spread the nuts on a baking sheet and toast in the oven for 8 to 10 minutes. Cool and break the nuts up into small pieces.\n            \n\n              Whisk the yogurt, mayonnaise, parsley, honey, and lemon zest in a large bowl and season generously with pepper.\n            \n\n              Halve, core, and cut the apples into 3/4-inch pieces, leaving the skin intact. Add the apples, celery and raisins to the bowl, and sprinkle with the lemon juice; then toss with the dressing. Cover and refrigerate if not serving immediately.\n            \n\n              When ready to serve, toss walnuts into the salad. Arrange the lettuce leaves on a large platter, or divide them among 4 salad plates. Place the salad on the lettuce and serve.\n            \n", "ingredients": [{"food": "walnuts", "quantity": 0.5}, {"food": "silk banana-strawberry soy yogurt", "quantity": 0.5}, {"food": "silk light vanilla", "quantity": 2.0}, {"food": "parsley", "quantity": 2.0}, {"food": "honey smoked ham", "quantity": 1.0}, {"food": "lemon juice", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}, {"food": "apples", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 2.5}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.25}, {"food": "lemon juice", "quantity": 0.5}, {"food": "lettuce", "quantity": 1.0}], "title": "\nWaldorf Salad\n"}, {"directions": "\n\n              Cook the bacon in a medium skillet over medium heat, stirring occasionally, until golden brown and crisp, about 8 minutes; drain on paper towels.\n            \n\n              Whisk the mayonnaise, vinegar, mustard, sugar and celery seeds in a large bowl until combined. Slice the apples into matchsticks, then add to the bowl with the dressing along with the celery, carrots, walnuts, raisins, parsley and bacon. Season with salt and pepper and toss.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "bacon", "quantity": 4.5}, {"food": "mayonnaise dressing", "quantity": 0.25}, {"food": "vinegar", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "celery seed", "quantity": 1.0}, {"food": "apples", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "carrots", "quantity": 2.0}, {"food": "walnuts", "quantity": 0.5}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.5}, {"food": "parsley", "quantity": 1.0}, {"food": "salt", "quantity": 1}], "title": "\nWaldorf Slaw with Bacon\n"}, {"directions": "\n\n              Whisk the flour, lemon-pepper seasoning, granulated garlic, baking powder and 1/2 teaspoon salt in a bowl. Whisk in 1 tablespoon vegetable oil, then 1/2 to 3/4 cup ice water to make a smooth batter. Refrigerate for at least 20 minutes.\n            \n\n              Meanwhile, make the tartar sauce: Whisk the mayonnaise, pickle relish, lemon juice, and salt and pepper to taste in a bowl.\n            \n\n              Heat 4 to 6 inches of vegetable oil in a deep pot until a deep-fry thermometer registers 375 degrees.\n            \n\n              Cut the fish into 8 pieces, about 1 1/2 by 4 1/2 inches. Thread each piece of fish onto a long wooden skewer. Season generously with salt and pepper.\n            \n\n              Dip the fish into the batter, turning to coat; let the excess drip off. Carefully place the fish (skewers and all) in the hot oil. Fry, turning as needed with tongs, until golden and cooked through, about 6 minutes. Remove and drain on paper towels; season with salt. Serve with the tartar sauce and lemon wedges.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.0}, {"food": "seasoning mix", "quantity": 1.0}, {"food": "garlic powder", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "mayonnaise dressing", "quantity": 1.0}, {"food": "pickle relish", "quantity": 0.3333333333333333}, {"food": "lemon juice", "quantity": 0.5}, {"food": "pepper", "quantity": 1}, {"food": "vegetarian fillets", "quantity": 1.0}], "title": "\nWalleye on a Stick\n"}, {"directions": "\n\n              Fill a highball glass three-quarters of the way with ice. Add the vodka, then fill the glass almost to the top with soda. Add the cranberry juice cocktail and stir. Garnish with a strawberry, if desired.\n            \n\n              Photograph by Jonathan Kantor\n            \n", "ingredients": [{"food": "", "quantity": 1.5}, {"food": "", "quantity": 1}, {"food": "cranberry juice cocktail", "quantity": 0.5}, {"food": "", "quantity": 1}], "title": "\nWally World\n"}, {"directions": "\n\n              1. Set the oven rack on the lowest level and preheat the broiler to high. Line the bottom of a broiler pan with foil and brush with oil.\n            \n\n              2. Combine the parsley, walnuts, pecorino, 1/4 cup olive oil, lemon zest, garlic, 1/2 teaspoon salt and 1/4 teaspoon pepper in a food processor. Add 1 tablespoon water and process until smooth and creamy, about 30 seconds. (Makes about 1 cup.)\n            \n\n              3. Pat the chicken dry and carefully loosen the skin to form a pocket under the skin. Lift the skin, and use a spoon or fingers to stuff about 1/4 cup pesto deep into the pockets of each of the halves, cover as much of the meat as possible without breaking the skin. Season each side of the chicken with salt and pepper. Place the chicken skin-side down on the pan and broil until lightly browned, about 15 minutes. Carefully turn to keep the skin intact and cook the other side until crispy and dark brown, about 10 minutes. Garnish with lemon and serve with potatoes.\n            \n\n              Total Fat: 51 grams\n            \n\n              Saturated Fat: 12 grams\n            \n\n              Total Carbohydrates: 3 grams\n            \n\n              Protein: 37 grams\n            \n\n              Sodium: 724 milligrams\n            \n\n              Cholesterol: 185 milligrams\n            \n\n              Fiber: 1 gram\n            \n\n              Recipe courtesy of Food Network Kitchens for entwine.\n            \n\n              Copyright 2010 Television Food Network, G.P. All rights reserved\n            \n", "ingredients": [{"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "walnuts", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "lemon juice", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 2.0}, {"food": "", "quantity": 1}, {"food": "", "quantity": 1}], "title": "\nWalnut Pesto Broiled Cornish Hens\n"}, {"directions": "\n\n              Position racks in the upper and lower thirds of the oven; preheat to 350 degrees F. Spread the walnuts on a rimmed baking sheet. Bake on the lower rack until toasted, 10 to 12 minutes; let cool completely. Pulse the nuts in a food processor until finely ground. Add the flour and pulse to combine; set aside.\n            \n\n              Beat the butter in a large bowl with a mixer on medium-high speed until light and fluffy, 2 to 4 minutes. Add 1/2 cup confectioners' sugar, the vanilla, cardamom and salt; beat until combined. Reduce the mixer speed to low and beat in the walnut-flour mixture until just incorporated. Cover the dough and refrigerate until slightly firm, about 30 minutes.\n            \n\n              Place the remaining 1 cup confectioners' sugar in a shallow bowl; set aside. Shape tablespoonfuls of dough into thin crescents and arrange 1 inch apart on 2 unlined baking sheets.\n            \n\n              Bake, switching the pans halfway through, until the cookies are golden on the bottom, 20 to 25 minutes. Let cool 5 minutes on the pans, then carefully transfer to the bowl of confectioners? sugar and gently roll to coat. Transfer to a rack to cool completely, then reroll in the confectioners? sugar.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "walnuts", "quantity": 1.0}, {"food": "potato flour", "quantity": 1.5}, {"food": "butter oil", "quantity": 1.5}, {"food": "sugar", "quantity": 1.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "ground turkey", "quantity": 0.5}, {"food": "salt", "quantity": 0.25}], "title": "\nWalnut-Cardamom Crescents\n"}, {"directions": "\n\n              Make Classic Shortbread dough, adding 3/4 cup finely ground walnuts with the flour. Sprinkle 1/2 teaspoon dried lavender over the dough before baking. Slice into wedges.\n            \n", "ingredients": [], "title": "\nWalnut-Lavender Wedges\n"}, {"directions": "\n\n              Position racks in the upper and lower thirds of the oven and preheat to 350 degrees F. Spread the walnuts on a baking sheet and toast in the oven until golden, 8 to 10 minutes. Let cool, then transfer to a food processor and pulse until finely ground.\n            \n\n              Whisk the ground walnuts, 1/2 cup confectioners' sugar, the flour, baking powder and salt in a medium bowl. Beat the butter in a large bowl with a mixer on medium-high speed until smooth, 2 to 3 minutes. Beat in the egg yolk, maple syrup and maple extract until incorporated. Reduce the mixer speed to medium low; add the flour mixture and beat until the dough comes together, about 2 minutes.\n            \n\n              Line 2 baking sheets with parchment paper. Form teaspoonfuls of dough into balls and arrange about 1 inch apart on the prepared baking sheets. Bake, switching the pans halfway through, until golden, 18 to 20 minutes.\n            \n\n              Remove from the oven and brush the cookies with maple syrup; let cool 2 minutes on the baking sheets. Put the remaining 2 cups confectioners' sugar in a shallow bowl; add the cookies in batches and toss to coat, then transfer to racks to cool completely.\n            \n\n              Photograph by Andrew Purcell\n            \n", "ingredients": [{"food": "walnuts", "quantity": 1.0}, {"food": "sugar", "quantity": 2.5}, {"food": "potato flour", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "syrup", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}], "title": "\nWalnut-Maple Sandies\n"}, {"directions": "\n\n              Mix 1 cup mayonnaise, 1/2 cup chopped toasted walnuts, 1/4 cup chopped roasted red pepper, 2 tablespoons chopped parsley and 2 teaspoons lemon juice. Season with salt and pepper.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [], "title": "\nWalnut-Pepper Mayo\n"}, {"directions": "\n\n              Pulse 2 cups toasted walnuts, 1/4 cup each olive and walnut oil, 2 tablespoons lemon juice, 2 teaspoons honey, 1 teaspoon salt and 1/2 teaspoon red pepper flakes in a food processor. Transfer to a bowl; mix in 1 chopped roasted red pepper and 1/4 cup chopped parsley. \n            \n\n              Photograph by Con Poulos \n            \n", "ingredients": [], "title": "\nWalnut-Pepper Spread\n"}, {"directions": "\n\n              Preheat the oven to 400. Toss the beets with 3 tablespoons olive oil in a roasting pan and season with salt and pepper. Roast until tender, 30 minutes.\n            \n\n              Meanwhile, season the nuts with salt and pepper in a shallow bowl. Cut the goat cheese into 4 even rounds. Press the cut sides in the nuts and set aside. Warm the lentils in the microwave or in a saucepan and season with salt and pepper.\n            \n\n              Cook the bacon in a skillet over medium-high heat until crisp, 10 minutes, and transfer to paper towels with a slotted spoon. Add the shallot to the pan drippings and cook for 20 seconds. Remove from the heat; whisk in the vinegar and sugar.\n            \n\n              Remove the beets from the oven and warm the nut-crusted goat cheese on the hot roasting pan. Toss the frisee with the bacon and dressing and divide among bowls. Top the salads with beets, lentils and a round of goat cheese. Drizzle with more olive oil.\n            \n\n              Per serving: Calories 482; Fat 39 g (Saturated 12 g); Cholesterol 42 mg; Sodium 571 mg; Carbohydrate 19 g; Fiber 5 g; Protein 15 g\n            \n\n              Photograph by Antonis Achilleos\n            \n\nSalmon with Lentils:\n\n\n              Heat 1/4 cup olive oil in a skillet over medium heat. Add the leeks and carrots and cook until tender, 5 minutes. Add the garlic and tomato paste and cook 1 minute. Increase the heat to high; add 4 cups water, the cinnamon stick and lentils. Bring to a boil, then reduce the heat to medium-high, cover and simmer until tender, 20 minutes.\n            \n\n              Meanwhile, remove the Swiss chard stems; reserve 3 leaves and chop the rest. Place the whole leaves over the lentils, cover and wilt, 1 minute. Remove the chard and cover the lentils. Season the salmon with salt and pepper and wrap a wilted chard leaf around each fillet.\n            \n\n              Reserve about 1 cup lentils for another use. Stir the honey and lemon juice into the remaining lentils and season with salt and pepper. Stir in the chopped chard. Place the wrapped salmon on top of the lentils, drizzle with olive oil and season with salt and pepper. Cover and cook over medium-high heat until the fish is just cooked through, 6 minutes.\n            \n\n              Remove the salmon and cut into pieces. (If the lentils are dry, add a splash of water.) Divide lentils among bowls and top with salmon.\n            \n\n              Per serving: Calories 510; Fat 20 g (Saturated 3 g); Cholesterol 70 mg; Sodium 357 mg; Carbohydrate 45 g; Fiber 8 g; Protein 40 g\n            \n", "ingredients": [{"food": "beets", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "hazelnuts or filberts", "quantity": 0.25}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "bacon", "quantity": 0.25}, {"food": "", "quantity": 1.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "sugar", "quantity": 1}, {"food": "turnip greens", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "martha white foods", "quantity": 2.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "barley flour or meal", "quantity": 0.5}, {"food": "chard", "quantity": 1.0}, {"food": "vegetarian fillets", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "honey smoked ham", "quantity": 1.0}, {"food": "", "quantity": 1.0}], "title": "\nWarm Beet and Lentil Salad with Goat Cheese\n"}, {"directions": "\n\n              Place 1 pound beets on a large piece of foil. Drizzle with 1 tablespoon olive oil and 3 tablespoons water; close into a packet. Roast at 400 degrees F until tender, 50 minutes. Peel the beets and cut into wedges. Whisk 1/3 cup orange juice, 2 tablespoons olive oil, and salt to taste in a bowl. Add 2 segmented oranges, the beets and 1/4 cup chopped toasted walnuts and toss.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nWarm Beet-Orange Salad\n"}, {"directions": "\n\n              Bring the wine, shallot, bay leaf, sugar, 1/2 teaspoon salt and 1/4 teaspoon pepper to a simmer in a skillet over medium-high heat; cook until reduced to about 2 tablespoons, 8 to 10 minutes. Remove from the heat and discard the bay leaf. Whisk in the butter and 1 teaspoon water until smooth.\n            \n\n              Combine the lettuce, hazelnuts and herbs in a large bowl. Add the warm dressing and toss to coat. Season with salt and pepper and serve immediately. \n            \n\n              Photograph by Kana Okada\n            \n", "ingredients": [{"food": "martha white foods", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "corier leaf", "quantity": 1.0}, {"food": "sugar", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 4.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "hazelnuts or filberts", "quantity": 0.25}, {"food": "parsley", "quantity": 2.0}], "title": "\nWarm Butter Lettuce Salad With Hazelnuts\n"}, {"directions": "\n\n              Combine the beans, roasted peppers, pickles, celery, parsley and lemon zest and juice in a large bowl. \n            \n\n              Heat the olive oil in a large skillet over medium-high heat. Add the chicken and thyme, then scatter the red onion and red pepper flakes around the pan. Cook until the chicken is browned on the bottom and the onion is soft, about 4 minutes. Turn the chicken, add 1/4 cup water, cover the skillet and reduce the heat to low. Continue cooking until the chicken is cooked through, 5 to 8 more minutes. Transfer the chicken to a cutting board; discard the thyme. Add the cooked onion to the bean mixture. \n            \n\n              Thinly slice the chicken against the grain and add to the bean mixture. Add the greens and toss to combine. \n            \n\n              Per serving: Calories 499; Fat 16 g (Saturated 3 g); Cholesterol 99 mg; Sodium 1,384 mg; Carbohydrate 36 g; Fiber 6 g; Protein 47 g \n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "fava beans", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "dill seed", "quantity": 0.25}, {"food": "diced chicken", "quantity": 2.0}, {"food": "parsley", "quantity": 2.0}, {"food": "grape juice", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "diced chicken", "quantity": 1.5}, {"food": "thyme", "quantity": 6.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "mixed nuts", "quantity": 6.0}], "title": "\nWarm Chicken and Butter Bean Salad\n"}, {"directions": "\n\n              Toss 2 cups cubed winter squash and 1 pint cherry tomatoes with olive oil and salt on a baking sheet; roast at 425 degrees F until tender, 25 minutes. Meanwhile, combine 1 cup farro or barley in a saucepan with 1/2 teaspoon salt, a pinch of red pepper flakes, a bay leaf and enough water to cover by 1 inch. Bring to a simmer over high heat, then reduce the heat to medium low and cook, uncovered, until al dente, 15 to 20 minutes. Drain the farro (remove the bay leaf) and toss with the squash, tomatoes, 1 tablespoon olive oil and 3 tablespoons each chopped parsley and grated pecorino. Season with salt and pepper.\n            \n\n              Serves: 4 (side); Calories: 293; Total Fat: 9 grams; Saturated Fat: 2 grams; Protein: 9 grams; Total carbohydrates: 47 grams; Sugar: 4 grams; Fiber: 10 grams; Cholesterol: 6 milligrams; Sodium: 689 milligrams\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nWarm Farro Salad\n"}, {"directions": "\n\n              Put the potatoes in a large saucepan; cover with cold water and season with 1 teaspoon salt. Bring to a simmer and cook until tender, 8 to 10 minutes. Drain and transfer to a large bowl.\n            \n\n              Meanwhile, cook the bacon in a medium nonstick skillet over medium heat, stirring occasionally, until crisp, about 10 minutes. Remove the bacon to a paper towel-lined plate using a slotted spoon. Pour the drippings into a small bowl and wipe out the skillet.\n            \n\n              Return the skillet to medium heat and add the olive oil and 2 tablespoons of the reserved drippings. Add the shallots and cook, stirring, until softened, about 4 minutes. Whisk in 2 tablespoons each vinegar and water, the mustard and sugar. Bring to a simmer.\n            \n\n              Pour the warm dressing over the potatoes; season with 1/2 teaspoon salt and a few grinds of pepper and toss. Add the remaining 1 tablespoon vinegar, the chives, dill and bacon; toss again. Serve warm.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 2.25}, {"food": "salt", "quantity": 1}, {"food": "bacon", "quantity": 4.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "shallots", "quantity": 2.0}, {"food": "vinegar", "quantity": 3.0}, {"food": "mustard spinach", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "chives", "quantity": 0.5}, {"food": "dill seed", "quantity": 0.25}], "title": "\nWarm German Potato Salad\n"}, {"directions": "\n\n              Preheat the broiler. Arrange the red onions, eggplant, bell peppers and tomatoes on a baking sheet; drizzle with 2 tablespoons olive oil and season with salt and pepper. Broil, turning halfway through, until the vegetables are soft and slightly charred, about 12 minutes. Combine the kale and romaine in a large bowl with the remaining 1 tablespoon olive oil and the vinegar. Add the broiled vegetables and toss. \n            \n\n              Make the croutons: Spread the bread cubes on the same baking sheet, season with salt and pepper and broil until golden, turning once, 1 to 2 minutes. \n            \n\n              Divide the salad among bowls. Top with the soppressata, pecorino and croutons, drizzle with olive oil and gently toss. \n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [{"food": "onions", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "peppers", "quantity": 12.0}, {"food": "silk black cherry soy yogurt", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "kale", "quantity": 1.0}, {"food": "lettuce", "quantity": 1.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "smoked turkey roll", "quantity": 1.0}, {"food": "salami", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 2.0}], "title": "\nWarm Kale Antipasto Salad\n"}, {"directions": "\n\n              Cook 2 slices chopped bacon in a saucepan; remove with a slotted spoon. Add 2 chopped celery stalks, 2 minced garlic cloves and 1 chopped red onion; saute 4 minutes. Add 4 cups water and 1 cup dried green lentils (rinsed and picked over); simmer until tender, 30 minutes. Stir in 3 tablespoons olive oil, 2 tablespoons sherry vinegar and 1 tablespoon grainy mustard; season with salt and pepper. Top with the bacon, chopped parsley and chopped roasted red peppers.\n            \n", "ingredients": [], "title": "\nWarm Lentil Salad with Bacon\n"}, {"directions": "\n\n              Scrub the beets, pat them dry and put into a paper bag. Place the bag into the microwave on a microwave-safe plate and cook on high power in 2 minute increments, until tender when pierced with a knife, 10 to 12 minutes total. When cool enough to handle, peel off the skin with a paring knife. Quarter the beets and cut each segment into 1/2-inch wedges. Transfer to a medium bowl.\n            \n\n              Coarsely chop the pecans. Toast in a small, dry skillet over medium heat, stirring the pecans around frequently, until very aromatic, but not blackened, about 5 minutes. Remove from the skillet to a bowl to cool.\n            \n\n              Juice the orange over a small bowl. Combine 1/4 cup of the orange juice and the maple syrup in the same small skillet. Boil the mixture over medium heat until reduced to a thick syrup (about 2 tablespoons), about 5 minutes. Whisk the mustard into the syrup, remove from the heat and add to the cooked beets. Stir in the pecans and 1 teaspoon of the remaining orange juice. Season with salt and pepper and toss to combine.\n            \n", "ingredients": [{"food": "pillsbury golden layer buttermilk biscuits", "quantity": 4.0}, {"food": "", "quantity": 0.3333333333333333}, {"food": "orange juice", "quantity": 1.25}, {"food": "syrup", "quantity": 2.0}, {"food": "mustard spinach", "quantity": 1.5}, {"food": "black bean mango", "quantity": 1}], "title": "\nWarm Maple and Orange Beet Salad\n"}, {"directions": "\n\n              Heat the oil in a heavy saucepan over medium heat. Add the shallots and garlic and cook until softened, about 5 minutes. Remove from the heat and stir in the sugar, vinegar, cinnamon stick, orange peel, and olives. Season with salt and pepper.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "sugar", "quantity": 3.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "orange peel", "quantity": 1.0}, {"food": "mixed nuts", "quantity": 2.0}, {"food": "salt", "quantity": 1}], "title": "\nWarm Mediterranean Olives\n"}, {"directions": "\n\n              Cook 8 ounces small pasta as the label directs, adding 1 1/2 cups thawed frozen fava or lima beans in the last minute of cooking. Drain and toss with 1 cup chopped parsley, 1 bunch sliced scallions, 1/4 cup olive oil, 3/4 cup grated parmesan, 1/2 teaspoon grated lemon zest, and salt and pepper.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nWarm Pasta-Bean Salad\n"}, {"directions": "\n\n              Brush halved pitted plums with melted butter, sprinkle with cinnamon and grill until soft, 3 minutes per side. Top with hazelnut gelato and chopped toasted hazelnuts.\n            \n\n              Photographs by Con Poulos\n            \n", "ingredients": [], "title": "\nWarm Plums With Gelato\n"}, {"directions": "\n\n              1. Stir the sugar and butter in a large skillet over medium heat until combined, about 2 minutes. Add the plums and cook until soft and coated with syrup, 8 to 10 minutes. Remove from the heat; stir in the raspberries.\n            \n\n              2. Meanwhile, make the sabayon: Put about 1 inch of water in a saucepan and bring to a simmer over medium-high heat.\n            \n\n              3. In a heatproof bowl that can rest in the saucepan without touching the water, beat the egg yolks and sugar with a large whisk, making sure to scrape the sides of the bowl. Add the wine and salt and beat until foamy. Set the bowl on the pan and continue whisking constantly, moving in a circular motion around the bowl, until the eggs can hold a thick ribbon, 4 to 6 minutes. Remove from the heat and continue whisking to cool slightly. Serve the fruit warm in shallow bowls or small glasses with sabayon spooned on top.\n            \n", "ingredients": [{"food": "sugar", "quantity": 0.25}, {"food": "butter oil", "quantity": 2.0}, {"food": "plums", "quantity": 1.0}, {"food": "raspberries", "quantity": 2.0}, {"food": "egg substitute", "quantity": 4.0}, {"food": "sugar", "quantity": 0.25}, {"food": "", "quantity": 0.25}, {"food": "salt", "quantity": 1}], "title": "\nWarm Sabayon with Glazed Plums and Raspberries\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Toss the potatoes and bell pepper with 1 tablespoon olive oil, 1/2 teaspoon salt, and pepper to taste in a shallow baking dish. Roast 15 minutes. Meanwhile, toss the shrimp with the garlic, oregano, paprika, 1 tablespoon olive oil, 1/4 teaspoon salt, and pepper to taste in a medium bowl.\n            \n\n              Add the shrimp to the baking dish. Roast, stirring once, until the shrimp are just cooked through and the potatoes are golden brown, 12 to 15 more minutes.\n            \n\n              Toss the radicchio and romaine in a serving bowl with the lemon juice, the remaining 3 tablespoons olive oil, and salt and pepper to taste. Add the warm shrimp and vegetables and toss to combine. Top with the feta.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 5.0}, {"food": "salt", "quantity": 1}, {"food": "shrimp", "quantity": 1.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "paprika", "quantity": 0.5}, {"food": "radicchio", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.5}, {"food": "macaroni cheese", "quantity": 0.5}], "title": "\nWarm Shrimp-and-Potato Salad\n"}, {"directions": "\n\n              Cook 1 sliced red onion in 1/4 cup olive oil until golden. Add 2 cups sliced mushrooms and cook until brown; season with salt. Off the heat, stir in 1/2 cup torn parsley, 10 ounces spinach and the juice of 1 lemon. Season with salt and pepper. Sprinkle with 1/2 cup feta.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nWarm Spinach Salad\n"}, {"directions": "\n\n              Cook 3 slices chopped thick-cut bacon in a skillet until crisp. Remove with a slotted spoon to paper towels; whisk 2 tablespoons of the drippings with 1 diced small shallot, 1 teaspoon dijon mustard, 3 tablespoons white wine vinegar and 2 tablespoons water. Toss with one 5-ounce bag baby spinach, 1 cup halved red grapes and 1/2 cup pistachios; season with salt and pepper. Top with 1/4 cup crumbled blue cheese and the bacon.\n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [], "title": "\nWarm Spinach Salad\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Toss the bell peppers, fennel, red onion, 2 tablespoons olive oil, 1/2 teaspoon salt and a few grinds of pepper on a rimmed baking sheet. Bake, stirring occasionally, until the vegetables are tender and lightly browned, about 25 minutes.\n            \n\n              Meanwhile, bring a large pot of salted water to a boil. Add the tortellini and cook as the label directs; drain. Put the kale in a large bowl and top with the warm tortellini and roasted vegetables.\n            \n\n              Heat the remaining 1/4 cup olive oil in a small skillet over medium heat. Add the garlic and cook, stirring occasionally, until it just starts browning, about 2 minutes. Remove from the heat and add the vinegar; pour over the tortellini mixture and toss to coat. Add the basil and fennel fronds, season with salt and pepper and toss.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.25}, {"food": "onion rings", "quantity": 1.25}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "kale", "quantity": 1.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "basil", "quantity": 0.5}], "title": "\nWarm Tortellini and Roasted Vegetable Salad\n"}, {"directions": "\n\n              Mix 1 teaspoon each wasabi powder and water; set aside 15 minutes. Halve and pit 3 avocados; scoop the flesh into a large bowl and mash with a fork. Add the juice of 2 limes, 2 tablespoons chopped pickled ginger plus 1 tablespoon brine from the jar, 1 finely chopped seeded jalapeno, 3 thinly sliced scallions, 3 tablespoons chopped cilantro and 1 teaspoon kosher salt. Add the wasabi mixture and stir to combine. Season with salt. Serve with rice crackers.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [], "title": "\nWasabi Guacamole with Pickled Ginger\n"}, {"directions": "\n\n              Mix 3/4 cup ranch dressing, 1/2 cup grated cucumber, the juice of 1/2 lemon and 1 tablespoon wasabi paste. Season with salt.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [], "title": "\nWasabi Ranch Sauce\n"}, {"directions": "\n\n              Bring the chicken broth to a boil in a medium saucepan, covered, over high heat. Stir in the rice, some salt to taste and a bit of black pepper. Cover, lower the heat to medium-low and boil until the rice is just cooked through, about 15 minutes.\n            \n\n              When the rice is just about done, beat the eggs with a whisk in a medium bowl. Whisk in the lemon juice.\n            \n\n              Whisking constantly, slowly ladle about 2 cups of the hot broth into the eggs. Lower the heat under the remaining broth to low and whisk the egg mixture into the pan. Stir with a wooden spoon until the soup thickens slightly, about 2 minutes. Do not let the soup boil.\n            \n\n              Remove the soup from the heat and stir in the lemon zest and watercress; let sit until the watercress is tender but still vibrant green, 1 to 2 minutes. Ladle into 6 bowls and sprinkle each serving with a bit of black pepper.\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 8.0}, {"food": "crisped rice bar", "quantity": 0.75}, {"food": "black bean mango", "quantity": 1}, {"food": "eggs", "quantity": 3.0}, {"food": "grape juice", "quantity": 3.0}, {"food": "watercress", "quantity": 2.0}], "title": "\nWatercress Avgolemono Soup\n"}, {"directions": "\n\n              Bring the cream and 2 tablespoons whiskey to a simmer in a medium skillet over medium heat; cook until reduced to about 3/4 cup, about 10 minutes. Stir in the remaining 1 tablespoon whiskey. Transfer to a bowl and refrigerate until cold.\n            \n\n              Meanwhile, melt the butter in a large saucepan over medium heat. Add the onion and celery; cover and cook, stirring occasionally, until softened, about 5 minutes. Add 2 cups water, the potato, broth, sugar and 1/2 teaspoon salt; bring to a simmer and cook, partially covered, until the potato is tender, about 10 minutes.\n            \n\n              Add the watercress to the saucepan and simmer until just tender, about 5 minutes. Transfer the soup to a blender in batches and puree until smooth. Return to the saucepan and bring to a bare simmer; season with salt and pepper.\n            \n\n              Whisk the chilled whiskey cream until soft peaks form. Ladle the soup into bowls and top each with a dollop of the whipped cream.\n            \n\n              Photograph by Anna Williams\n            \n", "ingredients": [{"food": "ice cream swich", "quantity": 1.0}, {"food": "whiskey sour mix", "quantity": 3.0}, {"food": "butter oil", "quantity": 3.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "celery seed", "quantity": 1.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "diced chicken", "quantity": 3.0}, {"food": "sugar", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "watercress", "quantity": 2.0}, {"food": "pepper", "quantity": 1}], "title": "\nWatercress Soup With Whiskey Cream\n"}, {"directions": "\n\n              Soak 1/4 thinly sliced red onion in cold water, about 10 minutes. Whisk 1/4 cup orange juice, the juice of 1 lime, 1 tablespoon honey, 2 teaspoons dijon mustard, 1/2 teaspoon salt, and pepper to taste in a bowl. Whisk in 3 tablespoons olive oil. Drain the onion; toss with 2 bunches watercress, 2 sliced avocados, 2 segmented oranges and the dressing. Top with chopped toasted hazelnuts.\n            \n\n              Photograph by Jonny Valiant\n            \n", "ingredients": [], "title": "\nWatercress, Avocado and Orange Salad\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: two 8-inch cake pans and a 2-quart (8-inch) metal bowl; parchment\n\n              Preheat the oven to 350 degrees F. Spray two 8-inch cake pans and a 2-quart (8-inch) metal bowl with cooking spray and coat with flour, tapping out the excess. Line the bottoms of the cake pans with circles of parchment.\n            \n\n              Toss the chocolate chips with 1 tablespoon of the flour in a small bowl and set aside.\n            \n\n              In a stand mixer fitted with the paddle attachment, combine the cake mix, eggs, vegetable oil, the remaining flour and 2 cups cold water. Beat on low speed just to combine, then increase the speed to high and beat until very smooth, about 2 minutes. Add red food coloring to deepen the shade from light to dark pink (15 to 20 drops). Stir the flour-coated chocolate chips into the batter. Pour half of the batter into the bowl and divide the remaining batter between the 2 cake pans.\n            \n\n              Bake all 3 cakes until the cake rounds (not the bowl) are risen and a tester inserted in the center comes out clean, 23 to 25 minutes. Remove the cake rounds to a cooling rack, reduce the oven temperature to 300 degrees F and continue to bake the cake in the bowl until it is risen and a tester inserted in the center comes out clean, 40 to 45 minutes more. Cool the bowl cake on a rack, then unmold all three cakes and remove the parchment from the rounds.\n            \n\n              With a serrated knife, cut the domed tops from all 3 cakes to flatten them, and dust off any excess crumbs.\n            \n\n              Remove a heaping 1/4 cup of the frosting to a small bowl and stir in enough red food coloring to approximately match the color of the inside of the cake. Place 1 cake round, cut-side up, on a serving plate. Spread a very thin layer of red frosting on the layer. You do not want the layer to be visible when you cut the cake, it is just to glue the layers together. Top with the second cake round, cut-side down. Spread with another very thin layer of red frosting. Top with the domed cake.\n            \n\n              Frost the entire cake with a layer of white frosting about 1/4 inch thick to make the watermelon \"rind.\" Let the frosting dry and harden in the refrigerator for about 20 minutes\n            \n\n              Meanwhile, put the remaining frosting in an electric mixer fitted with the paddle attachment and add green food coloring, about 15 drops to start, to make a medium-pale green color several shades lighter than your fruit candy.\n            \n\n              Smooth the green frosting over the white layer, taking care not to combine the two colors. Drape the green fruit candy over the cake, cutting to fit as necessary, starting in the center like spokes in a wheel to make the lines on the watermelon. Top with the black or brown licorice candy as a stem.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "shortening cake mix", "quantity": 14.0}, {"food": "eggs", "quantity": 6.0}, {"food": "vegetable oil", "quantity": 0.6666666666666666}, {"food": "rice cake", "quantity": 1}, {"food": "vanilla extract", "quantity": 16.0}, {"food": "frosting", "quantity": 1}, {"food": "fruit leather", "quantity": 1}, {"food": "black bean mango", "quantity": 1.0}], "title": "\nWatermelon Cake\n"}, {"directions": "\n\n              Make the pickled watermelon: Quarter the watermelon, then use a paring knife to remove most of the fruit, leaving about 1/4 inch of fruit on the rind. (Reserve the fruit for another use.) Trim the outside skin from the rind and discard. Cut the rind into 1/2-inch pieces; combine with the tomato and bell pepper in a bowl.\n            \n\n              Combine 1 cup water, the vinegar, sugar, allspice, star anise and 4 teaspoons salt in a medium saucepan. Bring to a boil, stirring to dissolve the sugar, then pour over the watermelon rind mixture. Let cool to room temperature, then cover and refrigerate at least 4 hours and up to 1 week.\n            \n\n              Make the salad: Bring a saucepan of salted water to a boil. Add the beans and cook until crisp-tender, about 5 minutes. Drain and transfer to a bowl of ice water to cool. Drain, pat dry and cut into 2-inch pieces.\n            \n\n              Using a slotted spoon, transfer 4 cups of the pickled watermelon mixture to a large bowl. Add the beans, black-eyed peas, jalapeno and olive oil; season with salt and pepper and toss. Cover and refrigerate at least 1 hour before serving.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "watermelon seed krnls", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "sugar", "quantity": 0.75}, {"food": "allspice", "quantity": 1.0}, {"food": "anise seed", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "fava beans", "quantity": 8.0}, {"food": "pigeon peas", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "pepper", "quantity": 1}], "title": "\nWatermelon ChowChow Salad\n"}, {"directions": "\n\n              Spread out the watermelon chunks on a cookie sheet and freeze it. Place the watermelon, sherbet and lemon juice in a blender and blend until smooth.\n            \n", "ingredients": [{"food": "watermelon seed krnls", "quantity": 3.0}, {"food": "sherbet", "quantity": 3.0}, {"food": "", "quantity": 0.5}], "title": "\nWatermelon Cooler\n"}, {"directions": "\n\n              Preheat the oven to 300 degrees F. Coat a 4-quart ovenproof bowl with cooking spray. Prepare the cake mixes as directed; fold in 2 teaspoons red food coloring and the chocolate chips.\n            \n\n              Transfer the batter to the prepared bowl; bake until a skewer inserted into the center comes out clean, about 1 hour 30 minutes. Let cool slightly, then invert onto a rack to cool completely.\n            \n\n              Put the cake flat-side down on a small cardboard circle. Trim 2 opposite sides with a serrated knife to make an oval shape.\n            \n\n              Cover the sides of the cake with a thick layer of frosting; cover the top with a thin layer (this will be the bottom of the cake). Reserve about 1/2 cup frosting for the inside of the cake. Freeze until the frosting is firm, at least 20 minutes.\n            \n\n              Gently pat the sides of the cake with a smooth paper towel to even out any bumps in the frosting.\n            \n\n              Mix 1/2 teaspoon yellow food coloring with a drop of green food coloring and a splash of lemon juice in a small bowl. Paint the yellow-green food coloring all over the side of the cake with a pastry brush.\n            \n\n              Mix 1/2 teaspoon green food coloring with a splash of lemon juice in another bowl. Paint green stripes on the cake, then blend the edges of the stripes with the tip of the pastry brush.\n            \n\n              Put another small cardboard circle on the cake and flip it over. Carve out the center of the cake, about 1 inch deep, leaving a 1-inch border. Cover the center with frosting, leaving the border unfrosted. Freeze the cake 20 minutes.\n            \n\n              Use a paring knife to make zigzag cuts around the rim of the cake. Mound the fruit in the center, covering the frosting completely.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "shortening cake mix", "quantity": 2.0}, {"food": "yellow rice", "quantity": 1}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "fruit cocktail", "quantity": 1}], "title": "\nWatermelon Fruit Basket Cake\n"}, {"directions": "\n\n              Slice the bread 1/4 to 1/2 inch thick and remove the crust from all but 4 slices. Tear the crustless slices into pieces and pulse in a food processor to make coarse crumbs. Add the chopped watermelon to the food processor along with the chopped scallion, tomato, half each of the cucumber and jalapeno and 1/4 cup cold water; puree. With the machine running, gradually add 1/3 cup olive oil and the juice of 1 lime. Stir in 2 tablespoons mint, 1 teaspoon salt and a few grinds of pepper. Cover and refrigerate until ready to serve.\n            \n\n              Heat a grill pan over medium-high heat and brush with olive oil. Toss the shrimp and whole scallions with the juice of the remaining lime and 2 tablespoons each olive oil and mint, the garlic, 1/4 teaspoon salt and a few grinds of pepper. Grill the shrimp until marked, about 3 minutes. Flip and continue grilling until cooked through, about 2 more minutes. Grill the scallions until lightly charred, 1 minute per side. Brush the remaining bread slices with olive oil and grill until toasted, 1 to 2 minutes per side.\n            \n\n              Top each serving of gazpacho with the diced watermelon and the remaining cucumber and jalapeno; drizzle with olive oil. Serve with the grilled shrimp, scallions, bread and lime wedges.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "barbecue loaf", "quantity": 0.5}, {"food": "diced chicken", "quantity": 6.5}, {"food": "whole milk", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "", "quantity": 2.0}, {"food": "", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "shrimp", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}], "title": "\nWatermelon Gazpacho with Shrimp\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Sprinkle the watermelon rind with the salt and toss to combine. Set aside for 30 minutes until the moisture has drawn out. Drain the rind and pat dry on a paper-towel-lined baking sheet.\n            \n\n              Add 1 cup of the watermelon flesh, fish sauce, sugar, garlic, ginger and onion to a food processor. Pulse until combined. Transfer to a bowl and stir in the Korean chili flakes. Add the drained watermelon rind and the scallions and toss to combine. Transfer to a jar and let it rest for at least 12 hours before serving.\n            \n", "ingredients": [{"food": "watermelon seed krnls", "quantity": 0.25}, {"food": "salt", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 0.5}, {"food": "sugar", "quantity": 1.0}, {"food": "garlic powder", "quantity": 6.0}, {"food": "ginger", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "chili powder", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}], "title": "\nWatermelon Kimchi\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Place the watermelon in a single layer on a rimmed baking sheet, and freeze until completely frozen, like ice cubes, about 2 hours.\n            \n\n              Meanwhile, cook the sugar and 1/2 cup water in a small saucepan over medium heat, stirring occasionally, until the sugar is completely melted, about 5 minutes. Turn off the heat, add the chopped basil and stir until completely wilted. Cool completely at room temperature, at least 1 hour.\n            \n\n              When the watermelon is completely frozen, put half in a blender. Strain the basil syrup into the blender, use the back of a wooden spoon or spatula to press down on the basil to extract as much flavor as possible, and discard the basil. Add the lemon juice, and blend until the mixture is mostly smooth, pushing it down with a wooden spoon or spatula if needed. Add the remaining watermelon, and continue to blend until the mixture is completely smooth.\n            \n\n              Spoon the mixture into 4 short glasses (or wineglasses, if you want to be fancy), and garnish each with a basil leaf.\n            \n", "ingredients": [{"food": "watermelon seed krnls", "quantity": 2.0}, {"food": "sugar", "quantity": 0.5}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "", "quantity": 3.5}], "title": "\nWatermelon Lemonade Slushie\n"}, {"directions": "\n\n              Freeze 2 cups cubed watermelon until solid. Meanwhile, bring 3/4 cup each sugar and water to a boil, stirring to dissolve the sugar. Transfer to a pitcher and refrigerate until cold. Puree 4 more cups cubed watermelon in a blender; strain into the pitcher. Stir in 1 cup lime juice (from about 9 limes) and 2 cups cold seltzer. Add the frozen watermelon and some lime slices.\n            \n\n              Photograph by Ryan Liebe\n            \n", "ingredients": [], "title": "\nWatermelon Limeade\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: about 24 wooden ice-pop sticks; 1 extra-large resealable plastic bag\n\n              Pierce the rind of each watermelon wedge with the tip of a paring knife to make a 1/2-inch-wide slit that is about 1 inch deep. Combine the tequila, lime juice and agave in an extra-large resealable plastic bag. Add the watermelon, seal the bag and turn it over gently to combine. Refrigerate, turning over once more halfway through, for about 1 hour.\n            \n\n              Line 2 baking sheets with wax paper. Insert an ice-pop stick into the slit of each watermelon wedge. Put on the prepared baking sheets and freeze until solid, 4 hours to overnight. Serve with lime wedges and chile powder.\n            \n", "ingredients": [{"food": "watermelon seed krnls", "quantity": 1.0}, {"food": "", "quantity": 7.0}, {"food": "lime juice", "quantity": 0.5}, {"food": "silk light vanilla", "quantity": 0.5}, {"food": "onion powder", "quantity": 1}], "title": "\nWatermelon Margarita Pops\n"}, {"directions": "\n\n              Muddle 2 watermelon chunks with the juice of 1 lime and 2 teaspoons sugar in each glass. Stir in a handful of mint leaves, then add 2 ounces white rum and ice. Top with ginger ale; garnish with more mint.\n            \n", "ingredients": [], "title": "\nWatermelon Mojitos\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: an immersion blender or a drill with an adjustable chuck and beater from an electric hand mixer; a tap\n\n              Cut a thin slice from the bottom of the watermelon rind (but not into the flesh) so the watermelon will sit upright. With a sharp knife, carve out a circle in the top of the watermelon to make a lid, as you would when carving a jack-o'-lantern.\n            \n\n              To prepare with an immersion blender: Set the watermelon in the sink (to avoid splashes). Remove the lid and insert an immersion blender into the flesh. Gently push and move the immersion blender down and around in the watermelon to puree the center. As more of the watermelon becomes pureed, move the blender to the sides to puree almost all of the flesh, leaving a thin wall of flesh lining the rind. Pour the pureed juice out of the watermelon; you should have between 6 and 7 cups.\n            \n\n              To prepare with a drill: Fasten one beater from an electric hand mixer to the tip of a drill and tighten the chuck. Set the watermelon in the sink (to avoid splashes) and push the beater into the flesh. Gently push and move the beater down and around in the watermelon to puree the center. As more of the watermelon becomes pureed, move the beater to the sides to puree almost all of the flesh, leaving a thin wall of flesh lining the rind. Pour the pureed juice out of the watermelon, and strain, discarding any pulp and seeds; you should have between 6 and 7 cups of strained juice.\n            \n\n              Insert a tap in the empty watermelon according to the package directions. Pour the watermelon juice, wine and vodka into the watermelon and top with the lid. Refrigerate until the watermelon and punch inside are well chilled, at least 2 hours.\n            \n", "ingredients": [{"food": "watermelon seed krnls", "quantity": 20.0}, {"food": "rose hips", "quantity": 750.0}, {"food": "orange", "quantity": 1.5}], "title": "\nWatermelon Punch Keg\n"}, {"directions": "\n\n              Bring 1/4 cup each sugar and water to a simmer in a saucepan. Remove from the heat, add 3 mint sprigs and steep 10 minutes. Discard the mint; add the zest and juice of 1 lemon and a pinch of salt. Toss with 2 cups blueberries and 3 cups cubed watermelon. Let stand 15 minutes. Top with chopped mint.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nWatermelon Salad\n"}, {"directions": "\n\n              The night before your picnic, puree 6 cups chopped seedless watermelon in a blender until smooth, pour into a shallow airtight container and freeze. Bring the frozen watermelon on your picnic (it'll double as an extra ice pack) and let thaw slightly, then mash with a fork and spoon into cups.\n            \n", "ingredients": [], "title": "\nWatermelon Slushies\n"}, {"directions": "\n\n              Line a small sieve with a coffee filter. Put the yogurt in it, set it over a bowl, and refrigerate 2 hours. Discard the expressed liquid and put yogurt in a small serving bowl.\n            \n\n              Trim the rind off the watermelon and cut the fruit into pieces a couple inches long and about 1/2-inch square. Arrange on a platter with the limes. Put the mint, curry, and cayenne, in 3 small bowls.\n            \n\n              Squeeze lime on the watermelon. Dip melon into the yogurt, then into a little curry and as much cayenne as you like and finish with the mint. Nibble on.\n            \n", "ingredients": [{"food": "low fat big franks", "quantity": 1.0}, {"food": "watermelon seed krnls", "quantity": 1.5}, {"food": "lime", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "onion powder", "quantity": 1}, {"food": "pepper", "quantity": 1}], "title": "\nWatermelon Snack\n"}, {"directions": "\n\n              Puree 4 cups watermelon chunks; strain. Stir in 4 ounces Alize Red Passion or other fruit-flavored liqueur, 8 ounces gin and 2 cups sour mix; chill. Add sparkling rose before serving. Garnish with lime. Makes 10 to 12 drinks.\n            \n\n              Photograph by Lisa Hubbard\n            \n", "ingredients": [], "title": "\nWatermelon Sours\n"}, {"directions": "\nSpecial equipment: an immersion blender and a cocktail umbrella (or whatever fun garnish you'd like)\n\n              Cut off a small piece of the bottom of the watermelon so that it can sit without rolling. Set the watermelon in a bowl to stabilize it and catch any drips/overflow. Using an immersion blender (but not turning it on yet), press it gently into the top of the watermelon and twist to score the rind. Then twist and push harder, working in a circle to pop out the top \"plug\" of rind. If your immersion blender head is not sharp, you may have to use a knife to help get the \"plug\" out.\n            \n\n              Now for the fun part: Press the immersion blender into the flesh and pulse to start liquefying it. Make sure to scrape down the sides and be careful not to go through the bottom. The process can be a little messy, so wear an apron. Once the flesh is mostly liquid, top it off with lemonade and a shot of vodka or rum if desired.\n            \n\n              Garnish with lemon slices, mint sprigs and a cocktail umbrella or other fun garnish.\n            \n", "ingredients": [{"food": "watermelon seed krnls", "quantity": 1.0}, {"food": "", "quantity": 1}, {"food": "barley flour or meal", "quantity": 2.0}, {"food": "luncheon slices", "quantity": 1}, {"food": "", "quantity": 1}], "title": "\nWatermelon Tiki Drinks\n"}, {"directions": "\n\n              Serve a new kind of wedge salad at your next cookout: Use watermelon in place of iceberg lettuce. Cut a small seedless watermelon into quarters, then cut each quarter in half. Drizzle the wedges with chunky blue cheese dressing and sprinkle with crumbled cooked bacon and chopped chives.\n            \n\n              Photograph by Ralph Smith\n            \n", "ingredients": [], "title": "\nWatermelon Wedge Salad\n"}, {"directions": "\n\n              1. Heat 1-inch vegetable oil in a small saucepan to 350 degrees F. Fry the cheese until golden brown, 30 to 45 seconds, turning often. Remove to paper towels to drain.\n            \n\n              2. Just before serving, toss the cheese in a large bowl with the watermelon and celery. Drizzle with the balsamic vinegar and olive oil.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1}, {"food": "macaroni cheese", "quantity": 10.0}, {"food": "watermelon seed krnls", "quantity": 0.5}, {"food": "chrysanthemum leaves", "quantity": 6.0}, {"food": "vinegar", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 3.0}], "title": "\nWatermelon and Haloumi Salad\n"}, {"directions": "\nSpecial equipment: Four 4-ounce ice-pop molds or six 3-ounce molds, 4 or 6 ice-pop sticks\n\n              Bring the sugar and 1/4 cup water to a simmer in a small saucepan. Cook over medium heat, stirring occasionally, until the sugar is completely melted, about 5 minutes. Turn off the heat, add the basil and stir until completely wilted. Let cool completely at room temperature, at least 30 minutes.\n            \n\n              Meanwhile, finely mince the chile (seeded for less heat, if desired). Add the salt to the minced chile, and run your knife through the mixture several times until the salt starts to turn light pink; set aside.\n            \n\n              Put the watermelon and lime juice in a blender. Strain the basil syrup into the blender, pressing the basil in the strainer with the back of a spoon to extract as much flavor as possible; discard the basil. Puree the watermelon mixture until completely smooth, scraping down the sides of the blender partway through if needed. Transfer the mixture to a large liquid measuring cup with a pouring spout.\n            \n\n              Pour the mixture into the ice-pop molds, leaving 1/4 inch of space at the top (the mixture will expand). Insert the sticks. Freeze until solid, 5 hours to overnight. Unmold, and sprinkle 1 or both sides of the pops with the chili salt, depending on how spicy you want your pops. Serve immediately with any remaining chili salt on the side.\n            \n", "ingredients": [{"food": "lime juice", "quantity": 2.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "salt", "quantity": 2.0}, {"food": "watermelon seed krnls", "quantity": 3.0}], "title": "\nWatermelon, Chili and Basil Ice Pops\n"}, {"directions": "\n\n              Blend 8 cups frozen cubed watermelon with 8 ounces lemon vodka, 7 ounces simple syrup (see No. 17) and a 17.5-ounce can coconut juice. Serve with watermelon wedges.\n            \n\n              See all 50 Summer Drinks\n            \n", "ingredients": [], "title": "\nWatermelon-Coconut Cooler\n"}, {"directions": "\n\n              Soak 1/2 thinly sliced red onion in cold water. Pat dry 4 cups diced watermelon and 1 seeded and sliced cucumber; toss with a handful of thinly sliced mint. Drain the onion, squeeze dry and add to the salad along with some chopped cashews. Add 1/4 cup olive oil and the juice of 1/2 lemon; season with salt and toss. Top with crumbled goat cheese.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nWatermelon-Cucumber Salad\n"}, {"directions": "\n\n              Toss 3 cups diced seedless watermelon, 1 1/2 cups diced cucumber, 1 bunch sliced scallions, 1/2 cup chopped cilantro, 1 seeded and minced jalapeno, the juice of 2 limes, 1 1/2 tablespoons olive oil and a pinch of salt. Serve on a bed of watercress and sprinkle with feta cheese. Drizzle with olive oil and sprinkle with pepper.\n            \n\n              Photograph by Andrew Purcell\n            \n", "ingredients": [], "title": "\nWatermelon-Cucumber Salad\n"}, {"directions": "\n\n              Whisk 1 part white wine vinegar with 3 parts olive oil, and salt and pepper. Toss with baby arugula, red onion slices, watermelon cubes, crumbled feta, nicoise olives and fresh oregano.\n            \n\n              See all 50 Simple Salads\n            \n", "ingredients": [], "title": "\nWatermelon-Feta Salad\n"}, {"directions": "\n\n              Puree the watermelon, sugar, lime juice and Sambuca in a blender until smooth, working in batches if necessary. Pour through a fine-mesh sieve into a large liquid measuring cup. \n            \n\n              Pour 1 cup of the watermelon mixture into a small saucepan and bring to a boil. Meanwhile, pour another 1 cup of the watermelon mixture into a large bowl and sprinkle the gelatin on top; let stand 1 minute. Pour the hot watermelon mixture into the bowl and stir until the gelatin dissolves. Stir in the remaining watermelon mixture from the measuring cup. \n            \n\n              Spray an 8-inch-square cake pan with cooking spray, wiping out the excess. Pour in the watermelon mixture. Skim the foam from the surface and refrigerate the gelatin until slightly thickened, about 20 minutes. Arrange the mint leaves on top in rows, then push them just below the surface. Refrigerate until fully set, at least 4 hours.\n            \n\n              Unmold the gelatin: Invert onto a cutting board, then re-invert onto another cutting board and cut into squares.\n            \n\n              Photograph by Jonathan Kantor\n            \n", "ingredients": [{"food": "watermelon seed krnls", "quantity": 8.0}, {"food": "sugar", "quantity": 0.75}, {"food": "lime juice", "quantity": 2.0}, {"food": "barley flour or meal", "quantity": 1.5}, {"food": "onion powder", "quantity": 2.25}, {"food": "", "quantity": 1}, {"food": "chrysanthemum leaves", "quantity": 16.0}], "title": "\nWatermelon-Lime Gelatin Squares\n"}, {"directions": "\n\n              Place 4 cups 1/2 inch-cubed watermelon (about 1 1/4 pounds; lightly smashed) and 6 sprigs mint (lightly crushed) in a pitcher. For still infused water, add 2 quarts of water. For sparkling water, add 1 quart of seltzer during prep and a second quart just before serving. Refrigerate 2 to 4 hours to allow the ingredients to infuse. Stir well and strain, discarding the solids. For serving, add fresh watermelon and mint sprigs for garnish and plenty of ice. The infused water will keep refrigerated for up to 2 days.\n            \n", "ingredients": [], "title": "\nWatermelon-Mint Water\n"}, {"directions": "\nSpecial equipment: Four 3- to 4-ounce ice pop molds\n\n              Combine the raspberries, watermelon, coconut milk, honey, lime juice and salt in a blender and puree until smooth.\n            \n\n              Divide the mixture evenly among four 3- to 4-ounce ice pop molds and freeze until solid, at least 8 hours and preferably overnight. Let sit at room temperature for a few minutes before unmolding. Roll in toasted coconut or cocoa nibs if desired.\n            \n\n              The pops will keep in the freezer for up to 2 weeks.\n            \n", "ingredients": [{"food": "raspberries", "quantity": 1.0}, {"food": "watermelon seed krnls", "quantity": 1.0}, {"food": "coconut milk", "quantity": 0.3333333333333333}, {"food": "honey smoked ham", "quantity": 3.0}, {"food": "", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "coconut water", "quantity": 1}], "title": "\nWatermelon-Raspberry Breakfast Pops\n"}, {"directions": "\n\n              Combine the raspberries, sugar and 1/4 cup water in a small saucepan and bring to a simmer over medium heat. Cook, stirring occasionally, until the raspberries have completely broken down, about 6 minutes.\n            \n\n              Press the raspberry mixture through a fine-mesh sieve into a blender; let cool completely. Add the watermelon and lime juice and puree until smooth. Pour the mixture into an 8-inch-square stainless-steel or glass baking dish.\n            \n\n              Freeze until ice crystals begin forming around the edges, about 45 minutes. Use a fork to scrape the crystals toward the center of the pan, then continue freezing, scraping every 30 minutes, until frozen, about 4 hours.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "raspberries", "quantity": 1.0}, {"food": "sugar", "quantity": 0.5}, {"food": "watermelon seed krnls", "quantity": 4.0}, {"food": "", "quantity": 1.0}], "title": "\nWatermelon-Raspberry Granita\n"}, {"directions": "\n\n              Combine one 750-ml bottle chilled dry rose, 2 cups cubed watermelon, 1 cup grapefruit soda, 1/3 cup elderflower liqueur, 2 tablespoons superfine sugar and 1/4 teaspoon salt in a blender; puree until smooth. Strain through a fine-mesh sieve, then churn in an ice cream maker until thick and slushy.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [], "title": "\nWatermelon-Rose Cocktail\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Put the cucumber, buttermilk, honey if using and lime juice into a blender. Blend on high until smooth. Add half of the frozen watermelon and blend until almost completely smooth, turning off the blender and pushing down on the ingredients with a spatula or wooden spoon as needed to help the blending process. Add the remaining frozen watermelon and continue to blend until smooth. Add 1 to 2 tablespoons of water if needed to adjust consistency. Pour into a glass and garnish with a cucumber slice.\n            \n", "ingredients": [{"food": "cucumber", "quantity": 2.5}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 3.0}, {"food": "honey smoked ham", "quantity": 1.0}, {"food": "lime", "quantity": 0.5}, {"food": "watermelon seed krnls", "quantity": 2.0}], "title": "\nWatermelon-and-Cucumber Smoothie\n"}, {"directions": "\n\n              Puree 1 cup each mayo and blue cheese with 1/2 cup buttermilk, 1 shallot, lemon zest, Worcestershire sauce, parsley, salt and pepper. Drizzle over iceberg wedges; top with egg mimosa (See No. 42) and crumbled bacon.\n            \n\n              See all 50 Simple Salads\n            \n", "ingredients": [], "title": "\nWedge Salad\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Cook the bacon in a medium cast-iron skillet over medium heat, flipping about halfway through, until crisp and the fat has rendered, about 8 minutes; transfer to a plate. Pour off and reserve the bacon drippings, leaving enough in the skillet to coat it nicely.\n            \n\n              Slice 4 rounded chunks of lettuce (4 to 5 inches across) from the top and 3 sides of the head to make \"bun\" halves; set on a platter. \n            \n\n              Shape the ground beef into 2 burgers, each about 4 inches wide and 3/4 inch thick, and sprinkle both sides with salt and pepper. Put the bacon skillet over high heat, add the burgers and cook for 3 minutes; flip and cook for 3 minutes more for medium rare.\n            \n\n              Lay 1 lettuce \"bun\" half cut-side up on each of 2 plates and top with a burger. Spoon 1 tablespoon of the dressing over each burger and top with 1 tablespoon of the onion. Crumble 1 piece of bacon over each burger and top with the remaining lettuce \"bun\" tops.\n            \n", "ingredients": [{"food": "bacon", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "frankfurter beef", "quantity": 10.0}, {"food": "black bean mango", "quantity": 1}, {"food": "dressing", "quantity": 2.0}, {"food": "onion powder", "quantity": 2.0}], "title": "\nWedge Salad Burgers\n"}, {"directions": "\n\n              Heat a heavy skillet over medium-high heat. Add the oil and then the sausage; cook, turning occasionally, until brown all over, about 5 minutes. Transfer the sausage to the slow cooker. Pour off and discard all the oil in the skillet and return it to the heat. Add the tomato paste and cook, stirring, until brick red, about 1 minute. Add the water and bring to a boil, stirring to scrape up the browned bits. Pour the mixture over the sausage.\n            \n\n              Add the beef shins, crushed tomatoes, sun-dried tomatoes, onion, garlic, Italian herbs, bay leaf, salt, and pepper to taste. Set the slow cooker on LOW for 8 hours, cover, and cook until the beef is very tender.\n            \n\n              When ready to serve, bring a large pot of water to a boil and salt it generously. Add the pasta to the boiling water and cook, stirring occasionally, until al dente, about 10 minutes. Transfer the sausage and beef to a cutting board, slice into serving portions, and arrange on a serving platter. Drain the pasta and toss with some of the sauce; transfer to a serving bowl.\n            \n\n              Serve the meat and pasta separately with sauce on the side. Freeze any leftover sauce for up to 3 months.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "sausage link", "quantity": 1.5}, {"food": "pasta with tomato sauce", "quantity": 2.0}, {"food": "coconut water", "quantity": 0.5}, {"food": "frankfurter beef", "quantity": 4.0}, {"food": "tomatoes", "quantity": 2.0}, {"food": "tomatoes", "quantity": 6.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 6.0}, {"food": "cheesecake mix", "quantity": 2.0}, {"food": "corier leaf", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "italian veg medley pasta", "quantity": 1.0}, {"food": "barley flour or meal", "quantity": 1}], "title": "\nWeekday Italian Gravy\n"}, {"directions": "\n\n              Arrange one or more types of cheese on a platter. Add a few cookies or biscotti, a small bunch of grapes and some candied nuts. Spoon a few tablespoons of honey or jam into a small bowl and add to the platter. Let the cheese come to room temperature before serving.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nWeeknight Cheese Plate\n"}, {"directions": "\n\n              1. Heat the oil in a large covered casserole dish over medium-high heat. Add the bacon and cook, stirring, until lightly browned and fat renders, about 5 minutes. Transfer bacon to a small bowl. \n            \n\n              2. Meanwhile, season the flour with 1/2 teaspoon salt and some pepper in a large bowl. Add the chicken and turn to coat completely. \n            \n\n              3. Shake excess flour from chicken and brown in the casserole, about 4 minutes per side. Remove to a plate and pour off all but 2 tablespoons fat from the casserole. Add the onion and mushrooms and cook, stirring, until the onions are soft, about 3 minutes. Pour in the wine, increase the heat to high and boil, stirring to pick up any browned bits on the bottom, until reduced by half. Return the chicken to the casserole, add the thyme and reduce heat to medium. Sprinkle half of the bacon into the pot, cover and cook until the chicken is tender, about 30 minutes. \n            \n\n              4. Remove the chicken and sauce to a serving plate or platter. Garnish with parsley and remaining bacon and serve with polenta, if desired.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "bacon", "quantity": 8.25}, {"food": "low fat fried chicken", "quantity": 8.0}, {"food": "potato flour", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "onion powder", "quantity": 1.0}, {"food": "mushrooms", "quantity": 4.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "thyme", "quantity": 2.0}, {"food": "parsley", "quantity": 2.0}, {"food": "onions", "quantity": 1}], "title": "\nWeeknight Coq au Vin\n"}, {"directions": "\n\n              Heat the oil in a large saucepan over medium-high heat; add the jalapenos, onions and vinegar and cook, stirring, until softened, about 5 minutes. Add the garlic and cook about 30 seconds. \n            \n\n              Stir in the broth, tomatoes, chili powder and five-spice powder if using, and increase the heat to high. Bring to a full boil and cook for 1 minute. Stir in the beans and return to a full boil. Reduce the heat to medium and simmer until just slightly thickened but still soupy, about 5 minutes. Stir in the cilantro. \n            \n\n              Fill each bowl with about 1/2 cup of rice. Ladle the chili on top, sprinkle with the Cheddar and serve.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "onion powder", "quantity": 1.5}, {"food": "vinegar", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.25}, {"food": "tomatoes", "quantity": 1.0}, {"food": "chili powder", "quantity": 1.5}, {"food": "onion powder", "quantity": 0.25}, {"food": "fava beans", "quantity": 15.0}, {"food": "", "quantity": 2.0}, {"food": "crisped rice bar", "quantity": 2.0}, {"food": "", "quantity": 0.5}], "title": "\nWeeknight Two-Bean Chili\n"}, {"directions": "\n\n              Whisk the flour, sugar, baking powder, zest, nutmeg and salt in a medium bowl. Rub in the butter with your fingertips until the mixture looks sandy. Stir in the currants. Beat the eggs and 2 tablespoons of the buttermilk together. Stir into the dry ingredients to make a shaggy dough, add more buttermilk if the dough is dry. Gather dough into a disk, wrap in plastic wrap and refrigerate for 1 hour.\n            \n\n              Roll the dough on a floured workspace into a piece about 1/4-inch thick. Cut into 2 to 3- inch rounds.\n            \n\n              Heat a griddle or frying pan over medium-low heat. Brush the pan surface with butter. Cook the cookies until slightly brown and cooked through, about 4 to 5 minutes on each side. Transfer to a rack, sprinkle with sugar and cool. Store in a cookie tin.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.0}, {"food": "sugar", "quantity": 0.75}, {"food": "baking chocolate", "quantity": 2.5}, {"food": "orange", "quantity": 1.0}, {"food": "nutmeg", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "diced chicken", "quantity": 0.5}, {"food": "currants", "quantity": 0.75}, {"food": "eggs", "quantity": 2.0}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 2.0}, {"food": "butter oil", "quantity": 1}], "title": "\nWelsh Cookies\n"}, {"directions": "\n\n              Whisk the flour, 3/4 cup sugar, the baking powder, lime zest, cardamom and salt in a medium bowl. Work in the diced butter with your fingertips until the mixture looks sandy. Stir in the dried cranberries. Lightly beat the eggs and heavy cream in a small bowl, then stir into the flour mixture to make a shaggy dough. Transfer to a sheet of plastic wrap; shape into a disk. Wrap and refrigerate until firm, about 1 hour.\n            \n\n              Roll out the dough on a generously floured surface until about 1/4 inch thick. Cut out circles with a 1 1/2- to 2-inch round cookie cutter; arrange in a single layer on a baking sheet. Refrigerate until ready to cook, at least 30 minutes and up to 1 hour.\n            \n\n              Heat a large skillet or griddle over medium-low heat. Put the remaining 1 cup sugar in a medium bowl. Working in batches, brush the skillet with melted butter, then add the dough rounds. Cook until lightly browned and cooked through, 4 to 5 minutes per side. (Brush the skillet with more butter between batches.) Toss the warm cookies in the sugar, then transfer to racks to cool completely. Store in an airtight container for 3 to 5 days; the texture actually improves after a day.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "potato flour", "quantity": 2.0}, {"food": "sugar", "quantity": 1.75}, {"food": "baking chocolate", "quantity": 2.5}, {"food": "lime", "quantity": 1.0}, {"food": "ground turkey", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "diced chicken", "quantity": 1.0}, {"food": "cranberries", "quantity": 0.75}, {"food": "eggs", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 2.0}], "title": "\nWelsh Cranberry Skillet Cookies\n"}, {"directions": "\n\n              Preheat a broiler. Slice the steak into 1/4-inch thick slices. Slice the cheese into 12 pieces. Set the rolls, cut side-up on a baking sheet and toast under the broiler. Set the tops of the rolls aside.\n            \n\n              Slather the bottom halves of the rolls with half the mustard and top with the slices of steak, overlapping them slightly. Season with salt and pepper. Cover with 2 slices of cheese. Broil the open-faced sandwiches until the cheese is lightly browned and melted, about 1 minute.\n            \n\n              Transfer the sandwiches to the work surface. Top each sandwich with an equal portion of the roasted shallots and about 3/4 cup of the watercress. Slather the tops of the rolls with the remaining mustard and cover the sandwiches. Slice the sandwiches in half crosswise. Serve immediately.\n            \n\nROASTED SHALLOTS\n\n\n              Preheat the oven to 400 degrees F. In a large bowl, toss the shallots with the oil and salt, and season generously with pepper. Transfer to an aluminum foil-lined baking sheet and spread out in a single layer. Bake until the shallots? skins are somewhat charred and crispy and the flesh is very tender, about 40 minutes. Remove from the oven and allow to cool slightly.\n            \n\n              Using a knife, slice off the tips of the shallots (the end opposite the root end) and discard. Gently squeeze the shallots from their skins and season with salt and pepper to taste. Serve with roasted beef, chicken, or on steak sandwiches.\n            \n", "ingredients": [{"food": "barley flour or meal", "quantity": 1.5}, {"food": "macaroni cheese", "quantity": 0.75}, {"food": "pizza rolls", "quantity": 6.0}, {"food": "mustard spinach", "quantity": 0.3333333333333333}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "watercress", "quantity": 4.5}, {"food": "shallots", "quantity": 18.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "salt", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nWest 52nd Street Steak Sandwich\n"}, {"directions": "\n\n              Spread the wings in a single layer on wire rack set over a rimmed baking sheet and season liberally with salt and pepper. Refrigerate at least 1 hour, or preferably overnight.\n            \n\n              Heat 2 inches of oil in a large, heavy-bottomed pot over medium heat until a deep-fry thermometer registers 275 degrees F. Working in 2 batches, fry the wings, tossing occasionally, until pale brown and cooked through, about 20 minutes per batch. To test for doneness, lift a wing from the oil and pierce with a paring knife. If there is no resistance they are done. Transfer the wings with a slotted spoon to a clean rack set over a baking sheet and let cool for at least 30 minutes. (Make sure the oil returns to the proper temperature between batches.)\n            \n\n              Meanwhile, make the sauce: Heat 2 tablespoons vegetable oil in a medium pot over medium heat. Add the garlic, onion and chile and cook, stirring occasionally, until soft and lightly golden, about 12 minutes. Add the tomato paste and cook, stirring until lightly caramelized, about 2 minutes. Stir in the peanut butter and bay leaf, then pour in the broth. Bring the mixture to a simmer then cook, stirring often, until it is thickened and slightly reduced, about 8 minutes. Remove the sauce from the heat, discard the bay leaf and stir in the fish sauce. Finely grate the zest of 1 lime into the sauce, then add its juice. Season the sauce with salt and pepper, then pour it into a blender and puree until very smooth. Transfer the sauce to a small saucepan and keep warm.\n            \n\n              Increase the temperature of the frying oil to 425 degrees F. Working in 3 batches, fry the wings again until the skin is golden brown and very crisp, about 3 minutes per batch. Transfer the wings to a large bowl and season each batch with salt while hot. (Make sure the oil returns to the proper temperature between batches.)\n            \n\n              Pour two-thirds of the reserved peanut sauce over the wings and toss to coat evenly. Transfer the wings to a platter and sprinkle with the peanuts. Finely grate the zest of another lime over the wings then cut the remaining limes into wedges. Serve the wings immediately with lime wedges, sliced mango and extra peanut sauce on the side.\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 6.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "barley flour or meal", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 2.0}, {"food": "peanut butter ", "quantity": 0.3333333333333333}, {"food": "corier leaf", "quantity": 1.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "Worcestershire sauce", "quantity": 1.0}, {"food": "limes", "quantity": 3.0}, {"food": "peanuts", "quantity": 0.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}], "title": "\nWest African Spicy Peanut Chicken Wings\n"}, {"directions": "\n\n              Beat the eggs in a large bowl until foamy. Heat the olive oil in a large nonstick ovenproof skillet over medium-high heat. Add the ham, bell peppers, onion, 1/4 teaspoon salt and a few grinds of pepper. Cook, stirring occasionally, until the vegetables are tender and starting to brown, about 6 minutes; add to the bowl with the eggs.\n            \n\n              Preheat the broiler. Wipe out the skillet and return to medium-high heat. Melt the butter in the skillet, then add the frozen hash browns in an even layer. Cook, pressing the hash browns into the bottom and up the side of the skillet with a spatula, until golden on the bottom, about 6 minutes.\n            \n\n              Pour the egg mixture over the hash browns. Transfer the skillet to the broiler; cook until partially set, 3 to 5 minutes. Sprinkle the cheese and all but about 2 tablespoons scallions over the eggs. Continue broiling until the cheese melts and the eggs are set, 2 to 3 more minutes.\n            \n\n              Loosen the edge of the omelet with a small spatula. Slide onto a platter and fold in half. Cut into wedges; top with the reserved scallions.\n            \n\n              Photograph by Justin Walker\n            \n", "ingredients": [{"food": "eggs", "quantity": 8.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 2.0}, {"food": "frozen yogurt", "quantity": 3.0}, {"food": "smoked turkey roll", "quantity": 4.0}, {"food": "", "quantity": 1.0}], "title": "\nWestern Hash Brown Omelet\n"}, {"directions": "\n\n              Toppings: Sauteed green pepper, onion and ham, paprika and chopped parsley on cheesy skins\n            \n\n              How to Make Classic Potato Skins:\n            \n\n              Pierce 4 large russet potatoes with a fork. Bake directly on the oven rack at 350 degrees until tender, about 1 hour. Let cool, then quarter lengthwise and scoop out the flesh, leaving a 1/4-inch shell. Brush both sides with melted butter and season with salt and pepper. Bake, skin-side up, at 450 degrees until crisp, about 15 minutes. Add your favorite team toppings. (For cheesy skins, flip the baked shells over before topping, sprinkle with 1 cup grated cheddar cheese and bake an extra 5 minutes.)\n            \n\n              Photograph by Karl Juengel/Studio D\n            \n", "ingredients": [], "title": "\nWestern Omelet Potato Skins\n"}, {"directions": "\n\n              In a small bowl, beat together 3 of the eggs and season lightly with salt and pepper. Set aside. \n            \n\n              Heat 3 tablespoons of the butter in a small non-stick skillet, with tight-fitting lid, over medium heat. Add the peppers and cook, covered, without stirring, until tender, about 3 minutes. Uncover and raise the heat to medium-high. Add the ham and scallions and cook, stirring frequently, until hot, about 1 minute. Transfer the mixture to a bowl. \n            \n\n              Melt a nut-sized piece of the remaining butter in the skillet over medium heat. When the foam subsides, add 1/4 of the pepper mixture. Pour in the beaten eggs and cook, stirring constantly with a heat-resistant rubber spatula, until just cooked, about 30 seconds. Turn off the heat and, using the rubber spatula, smooth over the top of the omelette so that it evenly covers the inside of the skillet. If using the cheese, sprinkle about 2 tablespoons over the omelette. Let rest for 30 seconds until the omelette has set. \n            \n\n              Using the rubber spatula, fold the omelette in half, and transfer to a warmed plate. Cover with foil to keep warm. Repeat with the remaining ingredients to make 4 omelettes in all. \n            \n", "ingredients": [{"food": "eggs", "quantity": 12.0}, {"food": "black bean mango", "quantity": 1}, {"food": "butter oil", "quantity": 0.25}, {"food": "pepper", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "ham", "quantity": 6.5}, {"food": "martha white foods", "quantity": 4.0}, {"food": "cheddar cheese", "quantity": 0.5}], "title": "\nWestern Omelette\n"}, {"directions": "\n\n              Position a rack in the upper third of the oven and preheat to 350 degrees F. Whisk the half-and-half, cayenne, 1/2 teaspoon salt, and black pepper to taste in a small bowl.\n            \n\n              Heat the olive oil in a large ovenproof skillet over medium-high heat. Add the shallots and cook until just softened, 1 to 2 minutes. Add the bell peppers; cook until the peppers are soft and the shallots are golden, 5 to 6 more minutes. Add the tomatoes, ham, bread, parsley and 1/4 cup water and cook until most of the liquid is absorbed, about 3 minutes. Season with salt and black pepper. Remove from the heat.\n            \n\n              Make 8 evenly spaced indentations in the bread mixture with the bottom of a ladle or small measuring cup. Crack an egg into each indentation. Slowly pour the half-and-half mixture over the eggs. Bake, rotating the skillet a few times, until the whites are set, about 15 minutes. Top with parsley.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "whole milk", "quantity": 0.5}, {"food": "hearts of palm", "quantity": 1}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "peppers", "quantity": 2.5}, {"food": "silk black cherry soy yogurt", "quantity": 1.5}, {"food": "ham", "quantity": 0.25}, {"food": "garlic bread", "quantity": 4.0}, {"food": "parsley", "quantity": 2.0}, {"food": "eggs", "quantity": 8.0}], "title": "\nWestern Skillet Eggs\n"}, {"directions": "\n\n              Put a rimmed baking sheet in the oven and preheat to 400 degrees F. Toast the wheat berries in a large dry pot or Dutch oven over medium-high heat, stirring often, 6 to 7 minutes. Add 8 cups water and season with salt. Bring to a boil, then reduce the heat to a gentle simmer and cook, stirring and scraping the bottom of the pot occasionally, until the wheat berries are tender but still slightly chewy, 1 hour to 1 hour 10 minutes, adding up to 1 cup more water if needed. Drain. Wipe out the pot and reserve.\n            \n\n              Meanwhile, place the beets on a large sheet of foil; drizzle with 1 tablespoon olive oil and season with salt and pepper. Fold and crimp the edges to form a packet, leaving room for steam to circulate. Transfer the packet directly to the oven rack and roast until the beets are tender when pierced with a knife, 40 to 45 minutes. Let cool slightly, then rub off the skins with a paper towel and cut into wedges.\n            \n\n              Meanwhile, remove the hot baking sheet from the oven and drizzle with 1 tablespoon olive oil. Add the carrots and season with 1/4 teaspoon salt and a few grinds of pepper; toss. Roast until tender, 20 to 25 minutes.\n            \n\n              Heat 2 tablespoons olive oil in the reserved pot over medium-high heat. Add the red onion, fennel, garlic, ginger, 1/2 teaspoon salt and a few grinds of pepper; cook, stirring occasionally, until the onion is soft and the fennel is crisp-tender, about 6 minutes. Add the wheat berries, carrots and remaining 1 tablespoon olive oil. Cook, stirring, until warmed through, 2 to 3 minutes. Add the orange juice, lemon juice and all but 2 tablespoons parsley; season with salt and pepper. Stir in the beets. Sprinkle with the remaining parsley. Serve warm or at room temperature.\n            \n\n              Photograph by Ryan Liebe\n            \n", "ingredients": [{"food": "wheat flour", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "mixed nuts", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 5.0}, {"food": "pepper", "quantity": 1}, {"food": "pineapple chunks", "quantity": 4.75}, {"food": "onion powder", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "ginger", "quantity": 2.0}, {"food": "orange juice", "quantity": 0.25}, {"food": "lemon juice", "quantity": 1.0}, {"food": "parsley", "quantity": 0.5}], "title": "\nWheat Berries with Roasted Beets and Carrots\n"}, {"directions": "\n\n              Cook the wheat berries: Bring a medium saucepan of water to a boil. Add the wheat berries, and cook until plump and tender, 35 to 40 minutes. Drain the wheat berries, and transfer them to a medium bowl. Toss with the sesame oil and 1/2 teaspoon salt. Serve warm or at room temperature. (The wheat berries can be cooked and refrigerated in an airtight container up to 2 days ahead. Microwave just enough to take the chill off, about 2 minutes, stirring about halfway through.)\n            \n\n              Make the miso sauce: While the wheat berries cook, whisk together the mayonnaise, miso, mirin, vinegar and 1 tablespoon water in a small bowl until smooth.\n            \n\n              Toast the sesame seeds: Swirl the sesame seeds in a medium nonstick skillet over medium heat until toasted and golden, about 3 minutes. Pour them into a small bowl.\n            \n\n              Cook the salmon: Season the salmon with salt. Add the oil to the skillet, set over medium-high heat and heat the oil until it just starts to smoke faintly. Arrange the salmon, skin-side down, in the skillet. As the salmon cooks you'll see the dark orange flesh turn a paler orange. Once the lighter color reaches about 2/3 up the side of each piece, turn the salmon over; continue to cook for about 1 minute more (for medium-rare) for thicker pieces, 30 seconds more for thinner pieces. As each piece finishes, remove it from the skillet and transfer it to a plate.\n            \n\n              Build the bowls: Evenly divide the wheat berries among 4 bowls. Make neat piles and/or rows of the cabbage, avocado and scallions. Top each with a piece of salmon and some miso sauce, a sprinkling of sesame and some seaweed-snack strips. Serve each bowl with a lemon wedge.\n            \n", "ingredients": [{"food": "wheat flour", "quantity": 1.5}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "mayonnaise dressing", "quantity": 2.0}, {"food": "miso", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "sesame seeds", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 8.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "swamp cabbage", "quantity": 2.25}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "seaweed", "quantity": 2.0}, {"food": "lemon juice", "quantity": 1.0}], "title": "\nWheat Berry Bowl with Salmon and Miso Sauce\n"}, {"directions": "\nSpecial equipment: 2 Pastry bags; Ateco #10 round tip; Ateco #2 small round tip\n\n              Frost the cupcakes with the buttercream.\n            \n\n              To pipe the flower: Place the grapefruit-tinted frosting in a pastry bag with a #10 round tip. Hold the bag straight above the cupcake. To create a 5-petal flower, start 1/2 inch from the edge, and squeeze and release while dragging toward the center of the cupcake to create a tear-shaped petal. Rotate the cupcake slightly after each petal.\n            \n\n              Place the egg yolk-tinted frosting in a pastry bag with a #2 small round tip. Hold the bag straight up, and pipe a small dot into the center of the flower.\n            \n\n              Repeat with the remaining cupcakes.\n            \n", "ingredients": [{"food": "", "quantity": 24.0}, {"food": "", "quantity": 2.0}, {"food": "", "quantity": 0.5}, {"food": "", "quantity": 0.25}], "title": "\nWhimsical Flower Cupcakes\n"}, {"directions": "\n\n              Combine 1 can whole-berry cranberry sauce and the grated zest of half an orange in a skillet and warm over low heat, stirring, just until the cranberry sauce loosens. Sweeten 2 cups freshly whipped cream with a touch of confectioners' sugar; fold into the cranberries until ribbons of color form, but stop before the two mix completely.\n            \n\n              Photograph by Anita Calero\n            \n", "ingredients": [], "title": "\nWhipped Cranberry Dressing\n"}, {"directions": "\n\n              Peel and chop 1 pound parsnips and 1 large russet potato; put in a saucepan with 2 garlic cloves. cover with water, add kosher salt and bring to a boil; cook until soft, 20 minutes. reserve 1/2 cup cooking water, then drain the vegetables and return to the pan. add the reserved cooking liquid, 1/3 cup sour cream, 3 tablespoons butter, 1 teaspoon salt, and nutmeg to taste. beat with a mixer until smooth. season with pepper.\n            \n\n              Photograph by Christopher Testani\n            \n", "ingredients": [], "title": "\nWhipped Parsnips\n"}, {"directions": "\n\n              Whisk 3 tablespoons water, 2 tablespoons vinegar, 1/2 teaspoon honey and a pinch of salt in a small saucepan. Bring to a boil, then reduce the heat to a simmer and add the raisins. Cook until reduced by half, 6 to 8 minutes. Let the raisins cool in the liquid, then drain.\n            \n\n              Meanwhile, whisk the remaining 1 teaspoon each vinegar and honey with the olive oil, a pinch of salt and a few grinds of pepper in a small bowl; set aside.\n            \n\n              Combine the ricotta, capers, 1 teaspoon salt and a few grinds of pepper in a food processor; pulse a few times. Transfer to a bowl and drizzle with the vinaigrette. Top with the raisins, pine nuts and parsley. Serve with baguette slices.\n            \n\n              Photograph by Ryan Liebe\n            \n", "ingredients": [{"food": "vinegar", "quantity": 2.0}, {"food": "honey smoked ham", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "pepper", "quantity": 1}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "capers", "quantity": 1.0}, {"food": "pine nuts", "quantity": 2.0}, {"food": "parsley", "quantity": 1}, {"food": "luncheon slices", "quantity": 1}], "title": "\nWhipped Ricotta with Raisins and Pine Nuts\n"}, {"directions": "\n\n              Preheat a grill on medium-high heat. Whisk together the whiskey, brown sugar, 1 1/2 teaspoons salt and 1 teaspoon pepper until the sugar and salt are dissolved. Stir in 2 tablespoons of the oil and the garlic. Add the steaks, turn a few times to coat with the marinade and let stand at room temperature for 20 minutes. \n            \n\n              Meanwhile, quarter each potato lengthwise to form wedges and put in a medium pot. Cover with cold water to cover by 1-inch and add salt until the water tastes like sea water. Bring to a boil over medium-high heat, reduce the heat to medium and simmer until tender (but not falling apart), about 15 minutes. Drain well. Toss with 1 tablespoon olive oil. \n            \n\n              Remove the steaks from the marinade and pat dry with paper towels. Pour the marinade into a small pot and bring to a boil. Boil for 2 to 3 minutes until slightly reduced, making sure the sugar does not burn, to make a glaze and sauce for the steak. \n            \n\n              Grill the steaks until an internal temperature on an instant-read thermometer reads about 130 degrees F, 3 to 4 minutes per side, brushing with the boiled marinade several times in the last few minutes of grilling time. (If you are cooking the filet mignon steaks, you will need to increase this time to 8 to 10 minutes per side to account for the thicker cut). Transfer to a large plate to rest for 5 to 10 minutes. While the steaks grill, add the potatoes to the grill and grill until well-marked and crispy, turning to grill all sides, about 5 minutes total. Transfer the potato wedges to a bowl. \n            \n\n              Toss the grilled potatoes with the remaining 1 tablespoon oil, chives, vinegar and salt and pepper to taste. Remove the garlic cloves from the remaining glaze and serve drizzled over the steaks with the potatoes on the side.\n            \n", "ingredients": [{"food": "whiskey sour mix", "quantity": 0.5}, {"food": "sugar", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "garlic powder", "quantity": 4.0}, {"food": "prime steaks", "quantity": 8.0}, {"food": "sweet potatoes", "quantity": 1.5}, {"food": "chives", "quantity": 2.0}, {"food": "vinegar", "quantity": 1.0}], "title": "\nWhiskey Glazed Flat Iron Steaks and Grilled Potatoes\n"}, {"directions": "\n\n              Bring 4 cups water to a boil in a medium saucepan. Add the sugar, and stir until it has dissolved. Let cool for 2 minutes. Add the tea bags, stir and let steep for 3 minutes. Remove the tea bags, and squeeze the liquid back into the pot. Transfer the tea to a container, and refrigerate until cool, about 10 minutes.\n            \n\n              Fill 4 highball glasses, Collins glasses or 12-ounce mason jars with ice. Add 2 to 3 ounces of the whiskey and 8 ounces of the tea to each. Garnish with lemon slices and dried jasmine flowers if using.\n            \n", "ingredients": [{"food": "luncheon slices", "quantity": 1}, {"food": "pumpkin flowers", "quantity": 1}, {"food": "tea", "quantity": 8.0}, {"food": "whiskey sour mix", "quantity": 8.0}, {"food": "sugar", "quantity": 0.5}], "title": "\nWhiskey and Jasmine Green Tea Chillers\n"}, {"directions": "\n\n              Puree a 15-ounce can drained white beans with 1 garlic clove, 2 tablespoons each lemon juice and tahini, add 1 teaspoon cumin and 1/2 cup chopped scallions; add water if needed. Season with salt. Serve with pita or breadsticks.\n            \n", "ingredients": [], "title": "\nWhite Bean Hummus\n"}, {"directions": "\n\n              Serving suggestions:\n            \n\n              Drizzle each serving with extra-virgin olive oil and/or sprinkle with freshly grated Parmesan and serve with a good crusty bread.\n            \n\n              In a soup pot, heat the oil over medium heat, add the pancetta, and saute for about 5 minutes. Remove meat with a slotted spoon and set aside. Add the onion and saute until golden, about 10 minutes. Add the garlic, rosemary, and pepper flakes; saute for 3 minutes more. Add the escarole, stirring for 2 minutes more. Add the beans, tomato, broth, and salt to taste; bring to a boil. Lower the heat to maintain a gentle simmer, cover, and cook for 10 to 15 minutes. Stir in the reserved pancetta and season with salt and pepper to taste. Serve with the oil and/or cheese and the crusty bread. Cook's note: Swiss chard is a welcome substitute for the escarole.\n            \n\n              Copyright 2001 Television Food Network, G.P. All rights reserved. \n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "barley flour or meal", "quantity": 2.25}, {"food": "onion powder", "quantity": 0.5}, {"food": "garlic powder", "quantity": 4.0}, {"food": "barley flour or meal", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "escarole", "quantity": 1.0}, {"food": "fava beans", "quantity": 15.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "diced chicken", "quantity": 5.0}, {"food": "salt", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nWhite Bean and Escarole Soup\n"}, {"directions": "\n\n              Heat 1 tablespoon olive oil in a medium pot over medium-high heat. Add the onion, celery and 1 1/2 teaspoons salt and cook until the vegetables are golden brown, about 5 minutes. Add the beans and broth, bring to a simmer and cook 15 minutes.\n            \n\n              Meanwhile, heat the remaining 3 tablespoons olive oil in a large skillet over medium heat. Add the roasted peppers, minced garlic and cilantro and cook until the garlic is soft, about 2 minutes. Stir in the chard, cover and cook until wilted, 1 to 2 minutes. Scrape the contents of the skillet into the pot and simmer until heated through, about 5 minutes. Season with salt and pepper.\n            \n\n              Toast the bread, then rub with the whole garlic clove. Serve the soup with the bread and lemon wedges, if desired.\n            \n\n              Photographs by Antonis Achilleos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 4.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "diced chicken", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "fava beans", "quantity": 2.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "cloves", "quantity": 5.0}, {"food": "", "quantity": 0.25}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "pepper", "quantity": 1}, {"food": "garlic bread", "quantity": 4.0}, {"food": "", "quantity": 1}], "title": "\nWhite Bean-Chard Soup\n"}, {"directions": "\n\n              Mix 1/2 cup pomegranate seeds and 1 tablespoon each sherry vinegar, chopped parsley and honey; season with salt and pepper. Cook 1 chopped shallot and 3 chopped garlic cloves in a skillet with olive oil until softened, about 5 minutes. Stir in one drained 15-ounce can cannellini beans plus 1/4 cup reserved liquid from the can and 1/4 cup water; season with salt and pepper and simmer 5 minutes. Smash, then spread on toasted baguette slices; top with the pomegranate mixture, a drizzle of olive oil and some orange zest.\n            \n\n              Photograph by Andrew Purcell\n            \n", "ingredients": [], "title": "\nWhite Bean-Pomegranate Crostini\n"}, {"directions": "\n\n              In a small saucepan, combine the milk, butter, and the sugar. Place over medium-high heat and cook, stirring, until the butter has melted. Remove from the heat and cool to about 110 degrees F. Sprinkle the yeast over the surface of the milk. Set aside until foamy, about 10 minutes. \n            \n\n              Meanwhile, in large bowl, whisk together the flour and salt and set aside. \n            \n\n              Pour the milk and yeast mixture into the bowl of flour and mix until a soft, ragged mixture is formed. Transfer the flour mixture to a well-floured work surface and knead until a soft elastic dough is formed, about 10 minutes. \n            \n\n              Transfer the dough to a lightly oiled bowl, cover with a kitchen towel, and place in a warm spot in the kitchen, until puffed and doubled in size, about 2 hours.\n            \n\n              Transfer the dough to the work surface and, using your hands, gently flatten into a 10-inch-long oval shape. Fold the dough into thirds lengthwise, overlapping the sides in the center. Press down on the overlapping side to seal and make a seam. Place seam side-down in a buttered 9x5 loaf pan, cover with a kitchen towel, and return to the warm spot until the dough has just risen about 1 1/2 inches over the top of the pan, about 2 to 2 1/2 hours. \n            \n\n              Place a rack in the center of the oven and preheat to 400 degrees F. Brush the top of the dough lightly with warm water and, using a sharp knife, make 1/4-inch-deep slit down the center. Bake until golden brown, about 30 minutes. \n            \n\n              Remove the loaf from the pan and place in the center of the rack. Continue baking until the loaf sounds hollow when rapt lightly with your knuckles, on the bottom and top, or an instant read thermometer inserted in the center registers about 190 degrees F., about 15 minutes. \n            \n\n              Transfer the bread loaf to a cooling rack and cool completely before slicing.\n            \n", "ingredients": [{"food": "whole milk", "quantity": 2.0}, {"food": "butter oil", "quantity": 3.0}, {"food": "sugar", "quantity": 2.0}, {"food": "yeast extract spread", "quantity": 0.25}, {"food": "potato flour", "quantity": 5.0}, {"food": "salt", "quantity": 1.0}, {"food": "", "quantity": 1}], "title": "\nWhite Bread Sandwich Loaf\n"}, {"directions": "\n\n              Put the onion in a medium bowl and cover with 1/2 cup water. Set aside 30 minutes.\n            \n\n              Meanwhile, puree the beef with 2 teaspoons water, the onion powder, 3/4 teaspoon salt and a few grinds of pepper in a food processor until smooth. Draw a 6-by-12-inch rectangle on a piece of parchment paper; flip over the paper so the pencil side is down (you should still be able to see the rectangle). Press the beef into the rectangle; cover with another piece of parchment and press until the beef is very thin and fills the rectangle completely. Uncover and score the beef into eight 3-inch-square patties. Poke 5 holes into each patty with a chopstick (one in the center and one near each corner). Slide the beef on the parchment onto a baking sheet, loosely cover with plastic wrap and freeze until firm, 10 to 15 minutes.\n            \n\n              Trim the edges of the rectangle to make it even; cut patties along the scored lines. Heat an extra-large skillet over medium-high heat. Add the onion and liquid; bring to a boil. Stir in the butter and arrange the patties over the onion. Cook until the meat is no longer pink around the edges, 3 to 4 minutes. Put a bun bottom upside down on each patty. To steam the bun tops, rest each across 2 bun bottoms (like a bridge). Continue cooking until the patties are completely cooked through, about 2 more minutes, adding 1 to 2 tablespoons water if the skillet is too dry or if the onion starts browning.\n            \n\n              Remove the bun tops from the skillet. Slide a spatula under each patty, picking up the onions and bun bottoms along with the meat; flip over onto a plate. Top each with a pickle and a bun top.\n            \n\n              Photograph by Ralph Smith\n            \n", "ingredients": [{"food": "onion powder", "quantity": 1.0}, {"food": "frankfurter beef", "quantity": 10.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 1.0}, {"food": "split pea soup", "quantity": 8.0}, {"food": "pickle loaf", "quantity": 8.0}], "title": "\nWhite Castle-Style Sliders\n"}, {"directions": "\n\n              Heat the olive oil in a large Dutch oven or pot over medium heat. Add the onion, garlic, both jalapenos, the poblano, cumin, coriander, oregano and allspice. Cook, stirring occasionally, until the vegetables are softened and the spices are toasted, about 7 minutes. Add the chicken, 1 teaspoon salt and a few grinds of pepper. Cook, stirring and breaking up the meat with a wooden spoon, until it starts browning, about 5 minutes.\n            \n\n              Add the beans, canned chiles, chicken broth and 1 1/4 cups water; bring to a boil. Add the torn tortillas to the pot; reduce the heat to medium low and simmer, stirring occasionally, until slightly thickened, about 40 minutes.\n            \n\n              Remove the halved jalapeno from the chili and stir in all but a few tablespoons of the cilantro; season with 1/2 teaspoon salt and a few grinds of pepper. Serve with assorted toppings, the reserved cilantro, lime wedges and more tortillas.\n            \n\n              Photograph by Ryan Liebe\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 3.0}, {"food": "seeds", "quantity": 2.0}, {"food": "pepper", "quantity": 1.0}, {"food": "cumin seed", "quantity": 1.0}, {"food": "ground turkey", "quantity": 1.0}, {"food": "", "quantity": 0.5}, {"food": "allspice", "quantity": 0.25}, {"food": "diced chicken", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "fava beans", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "diced chicken", "quantity": 2.0}, {"food": "corn bran", "quantity": 3.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "sour cream", "quantity": 1}, {"food": "", "quantity": 1}], "title": "\nWhite Chicken Chili\n"}, {"directions": "\n\n              Heat the oil in a large pot over medium-high heat. Add the scallions, garlic, jalapeno, chili powder and 2 teaspoons salt and cook until soft, about 2 minutes. Add the chicken broth, yucca, corn, carrots and chipotles and bring to a boil. Cover, reduce to a simmer and cook until the yucca is tender, about 15 minutes. Stir to break up the yucca and thicken the broth slightly.\n            \n\n              Add the chicken and beans and cook, stirring occasionally, to heat and thicken, about 10 minutes. Stir in the cilantro before serving.\n            \n\n              Photograph by Antonis Achiellos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.75}, {"food": "garlic powder", "quantity": 3.0}, {"food": "", "quantity": 0.5}, {"food": "chili powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "diced chicken", "quantity": 6.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 1}, {"food": "sunflower seed kernels", "quantity": 1.0}, {"food": "carrots", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "diced chicken", "quantity": 0.5}, {"food": "fava beans", "quantity": 1.0}, {"food": "", "quantity": 0.5}], "title": "\nWhite Chicken Chili Stew\n"}, {"directions": "\n\n              Preheat the oven to 250 degrees F. Scatter the chocolate into a 9- by 13-inch glass baking dish. Roast the chocolate, stirring and smoothing it out with a rubber spatula every 5 to 10 minutes, until it is the color of peanut butter, 30 to 35 minutes. Don't panic if it looks clumpy and crumbly at first; working the chocolate back and forth with a rubber spatula will help it become smooth and creamy. Store at room temperature in a resealable mason jar for up to 2 months.\n            \n\n              To reheat, warm the jar in a pot of simmering water.\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 1.0}], "title": "\nWhite Chocolate Caramel\n"}, {"directions": "\nSpecial equipment: Chocolate thermometer\n\n              Tempering the chocolate for the bark requires a double boiler. If you don't have a double boiler, improvise one by using a saucepan and a stainless steel bowl: Nestle the bowl into the saucepan, allowing a few inches of space to remain between the bottom of the bowl and the bottom of the saucepan. Keep an extra bowl of a similar size on hand to transfer the chocolate for cooling. Rest the chocolate thermometer on a towel. Line a baking sheet with foil.\n            \n\n              Pour a couple inches of water into the bottom half of the double boiler and heat over medium-low to just below a simmer. Put the chocolate in the top half of the double boiler and set over the hot water. Slowly melt the chocolate, stirring with a heat-resistant rubber spatula. As the chocolate melts, check the temperature periodically to make sure it stays between 82 and 86 degrees F. If it starts to rise above this temperature, quickly transfer the chocolate to the bowl on reserve and stir briskly to reduce heat. Return bowl to double boiler to maintain heat between 82 and 86 degrees F.\n            \n\n              Remove bowl from over the hot water just before all the chocolate melts. Stir vigorously until the chocolate melts completely. Check temperature again. Stir in the oil until evenly blended. Chocolate is now tempered and ready to use. Keep within the 82 to 86 degree F range, returning bowl briefly to the double boiler if necessary.\n            \n\n              Quickly stir the fruit and nuts into the chocolate. Spread chocolate mixture out on the prepared baking sheet so it's about 1/2-inch thick and the fruit and nuts are coated. Set bark aside at room temperature to harden. Break into angled pieces. Store in an airtight container at room temperature.\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.5}, {"food": "cranberries", "quantity": 0.5}, {"food": "pistachio nuts", "quantity": 1.25}], "title": "\nWhite Chocolate Holiday Bark\n"}, {"directions": "\n\n              Scrape the seeds out of the vanilla bean and combine with the liqueur in a small saucepan. Sprinkle the gelatin on top and let stand 5 minutes. Add 1/2 cup heavy cream and cook over low heat, stirring, until the gelatin dissolves. Add the white chocolate and continue to cook, stirring, until melted. Transfer to a large bowl; let cool 25 minutes.\n            \n\n              Beat the egg whites and cream of tartar in a large bowl with a mixer on medium-high speed until stiff peaks form, about 4 minutes. Fold the egg whites into the white chocolate mixture until almost incorporated. Add the remaining 3/4 cup cream to the mixer bowl and beat on medium-high speed until medium peaks form; fold into the white chocolate mixture until incorporated. Divide among small bowls. Refrigerate until set, at least 3 hours or overnight. Top with shaved chocolate.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "baking chocolate", "quantity": 1}, {"food": "baking chocolate", "quantity": 8.0}, {"food": "egg substitute", "quantity": 0.3333333333333333}, {"food": "ice cream swich", "quantity": 0.125}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "chocolate hazelnut spread", "quantity": 3.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1.25}], "title": "\nWhite Chocolate Mousse\n"}, {"directions": "\n\n              Line a 9-by-13-inch pan with foil. Bring the marshmallows, sugar, cream, butter and salt to a simmer in a medium saucepan over medium heat, stirring constantly. Continue to stir until the marshmallows melt and all the sugar dissolves. Remove the saucepan from the heat, add the white chocolate chips and vanilla, and stir until the chips are completely melted.\n            \n\n              Pour the mixture into the prepared pan, and scatter the crushed candies over the top. Let cool to room temperature, then wrap and refrigerate until chilled and firm, about 2 hours. Cut into 1-inch squares.\n            \n", "ingredients": [{"food": "", "quantity": 4.0}, {"food": "sugar", "quantity": 2.0}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "butter oil", "quantity": 4.0}, {"food": "salt", "quantity": 1}, {"food": "baking chocolate", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "peppermint", "quantity": 10.0}], "title": "\nWhite Chocolate Peppermint Fudge\n"}, {"directions": "\n\n              Make the crust: Set racks in the lower third and middle of the oven; preheat to 350 degrees F. Mix the graham cracker crumbs, sugar, nutmeg and salt in a bowl. Add the melted butter and mix with your hands until combined. Press into the bottom and 1 inch up the side of a 9-inch springform pan. Freeze until ready to fill.\n            \n\n              Make the filling: Bring 1 inch of water to a boil in a small pot; remove from the heat. Put the white chocolate in a medium heatproof bowl and set over the pot (do not let the bowl touch the water); stir until melted, about 4 minutes. Remove the bowl from the pot and set aside.\n            \n\n              Beat the cream cheese, sour cream and sugar in a large bowl with a mixer on medium-high speed until light and fluffy, about 7 minutes. Beat in the eggs, one at a time, then add the cornstarch and beat 2 minutes. Beat in the melted white chocolate, vanilla and salt until combined.\n            \n\n              Fill a roasting pan halfway with water and set on the lower oven rack. Pour the filling into the prepared crust and set on the middle oven rack. Bake until the edge is set but the center still jiggles slightly, 1 hour, 10 minutes. Turn off the oven and let the cheesecake sit in the oven, 30 minutes. Transfer to a rack to cool completely. Cover and refrigerate 8 hours or overnight.\n            \n\n              Make the compote: Spread the cranberries on a rimmed baking sheet, sprinkle with 1/3 cup sugar and set aside until they release some of their juices, about 1 hour. Meanwhile, combine the remaining 2/3 cup sugar, the orange zest and juice, and 3/4 cup water in a medium saucepan. Bring to a boil, stirring, then reduce the heat to medium low and simmer until thick enough to coat the back of a spoon, about 10 minutes.\n            \n\n              Drain the cranberries and add them to the saucepan. Cook, stirring, until they begin to burst, about 7 minutes. Transfer the compote to a bowl and refrigerate until completely cool.\n            \n\n              Before serving, run a hot knife around the edge of the cheesecake, then remove the springform ring. Top with the cranberry compote and shaved white chocolate.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [{"food": "crackers", "quantity": 18.0}, {"food": "sugar", "quantity": 2.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "hearts of palm", "quantity": 1}, {"food": "butter oil", "quantity": 5.0}, {"food": "baking chocolate", "quantity": 4.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "sour cream", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "eggs", "quantity": 4.0}, {"food": "cornstarch", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "frozen yogurt", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "orange", "quantity": 1.0}, {"food": "orange juice", "quantity": 2.0}], "title": "\nWhite Chocolate-Cranberry Cheesecake\n"}, {"directions": "\n\n              Position racks in the upper and lower thirds of the oven and preheat to 350 degrees F. Line 2 baking sheets with parchment paper. Place one-third of the white chocolate in a small microwave-safe bowl; microwave in 30-second intervals, stirring, until melted. Set aside to cool slightly. Whisk the flour, baking powder and salt in a medium bowl. Beat the butter and sugar in a large bowl with a mixer on medium-high speed until light and fluffy, about 2 minutes. Beat in the melted white chocolate until smooth, then beat in the egg and vanilla. Reduce the mixer speed to low; add the flour mixture in 2 batches and beat until combined. Beat in half of the remaining chopped white chocolate. Roll heaping tablespoonfuls of dough into balls and arrange about 2 inches apart on the prepared baking sheets. Bake the cookies, switching the position of the pans halfway through, until the edges are slightly golden, about 15 minutes. Let cool 3 minutes on the baking sheets, then transfer to a rack to cool completely. Make the glaze: Microwave the remaining chopped white chocolate (you can use the same bowl as before) in 30-second intervals, stirring, until melted; stir in the heavy cream, and peppermint extract to taste. Dip the tops of the cookies in the glaze and return to the rack. Sprinkle with the crushed candy cane and let set, about 1 hour.\n            \n\n               Photograph by Johnny Miller\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.75}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.25}, {"food": "butter oil", "quantity": 1.0}, {"food": "sugar", "quantity": 0.3333333333333333}, {"food": "baking chocolate", "quantity": 6.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 4.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "peppermint", "quantity": 1.0}], "title": "\nWhite Chocolate-Peppermint Drops\n"}, {"directions": "\n\n              Make the sauce: Combine the raspberries, granulated sugar and lemon juice in a small saucepan and bring to a simmer over medium-high heat, mashing with a spoon. Press through a fine-mesh sieve into a bowl using the back of a spoon. Refrigerate until cold.\n            \n\n              Make the mousse: Put the white chocolate and 1/4 cup heavy cream in a medium microwave-safe bowl. Microwave in 30-second intervals, stirring, until the chocolate is melted; whisk until smooth and creamy. Beat the remaining 1 3/4 cups heavy cream in a large bowl with a mixer on medium-high speed until foamy. Add the confectioners' sugar and vanilla; beat until soft peaks form, about 2 more minutes. Whisk about 1 cup of the whipped cream into the chocolate mixture, then fold in the rest until combined.\n            \n\n              Divide half of the mousse among 6 small glasses; top each with about 1 tablespoon raspberry sauce and a few raspberries. Top with the remaining mousse, sauce and raspberries; sprinkle with shaved white chocolate. Refrigerate until cold, at least 30 minutes.\n            \n\n              Photograph by Ryan Dausch\n            \n", "ingredients": [{"food": "raspberries", "quantity": 1.5}, {"food": "sugar", "quantity": 3.0}, {"food": "lemon juice", "quantity": 1.5}, {"food": "", "quantity": 1}, {"food": "baking chocolate", "quantity": 4.0}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "sugar", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "raspberries", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1}], "title": "\nWhite Chocolate-Raspberry Parfaits\n"}, {"directions": "\n\n              Preheat the oven to 500 degrees. Place a pizza stone or inverted rimmed baking sheet on the bottom rack.\n            \n\n              Mix the garlic and 1/4 cup olive oil in a small bowl. Knead the dough about 6 times on a lightly floured surface. Roll and stretch into a 12-inch round. Place the dough on a pizza peel, or another inverted baking sheet, dusted with cornmeal.\n            \n\n              Brush half of the garlic-oil over the dough; season with salt. Scatter the mozzarella and clams over the crust; drizzle with 2 tablespoons of the reserved clam juice and the remaining garlic-oil. Sprinkle with the oregano, parmesan, and salt to taste. Slip the pizza onto the preheated pizza stone or baking sheet (the cornmeal will help it slide off). Bake until the crust is light brown, 13 to 15 minutes.\n            \n\n              Just before the pizza is done, drizzle the arugula with olive oil and lemon juice. Slice the pizza; top each piece with arugula and season with red pepper flakes, if desired.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "garlic powder", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "pizza rolls", "quantity": 1.0}, {"food": "potato flour", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.5}, {"food": "grape juice", "quantity": 2.0}, {"food": "", "quantity": 0.25}, {"food": "parmesan cheese", "quantity": 2.0}, {"food": "arugula", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "celery flakes", "quantity": 1}], "title": "\nWhite Clam Pizza\n"}, {"directions": "\n\n              Whisk the egg whites, sugar and salt in a heatproof bowl set over a saucepan of simmering water (do not let the bowl touch the water) until the mixture is warm and the sugar dissolves. Remove the bowl from the pan; let cool slightly. \n            \n\n              Beat the egg white mixture in a stand mixer fitted with the whisk attachment (or with a hand mixer) on medium-high speed until stiff peaks form, 12 to 15 minutes. Beat in the butter a few pieces at a time, then continue beating until smooth. (Don't worry if the mixture looks separated at first-it will come together as you keep beating.)\n            \n", "ingredients": [{"food": "egg substitute", "quantity": 4.0}, {"food": "sugar", "quantity": 0.75}, {"food": "hearts of palm", "quantity": 1}, {"food": "butter oil", "quantity": 2.0}, {"food": "", "quantity": 1}], "title": "\nWhite Frosting\n"}, {"directions": "\n\n              Bring 4 cups milk, 1/2 teaspoon freshly cracked pepper, 1 split vanilla bean and 7 ounces chopped white chocolate to a boil, whisking to melt the chocolate. Remove from the heat; steep 1 hour. Discard the vanilla bean and reheat. Garnish with pink peppercorns.\n            \n\n              Photographs by Marko Metzinger/Studio D\n            \n", "ingredients": [], "title": "\nWhite Hot\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              For the base: Bring the milk and white chocolate to a slow boil in a small saucepan, whisking until the chocolate is melted and smooth. Remove from the heat and stir in the vanilla.\n            \n\n              Mix in add-ins as desired, and serve immediately.\n            \n", "ingredients": [{"food": "whole milk", "quantity": 3.0}, {"food": "baking chocolate", "quantity": 6.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "orange", "quantity": 1.0}, {"food": "orange peel", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "", "quantity": 2.0}, {"food": "silk coffee", "quantity": 1.0}, {"food": "ice cream swich", "quantity": 1}, {"food": "fava beans", "quantity": 1}], "title": "\nWhite Hot Chocolate 2 Ways\n"}, {"directions": "\n\n              Bring 6 cups water to a boil in a medium saucepan. Add the tapioca, reduce the heat to medium and cook, stirring occasionally, until tender, about 15 minutes. Strain the tapioca in a large sieve, and rinse under cold running water until cold. Spoon the tapioca into a 3-quart pitcher.\n            \n\n              Add the wine, grape juice and liqueur to the pitcher, and stir to combine. Add the tarragon and peaches, and cover the pitcher with plastic wrap. Refrigerate the sangria to chill, at least 4 hours up to overnight.\n            \n\n              To serve, fill 8 glasses halfway with ice. Stir the sangria to redistribute the tapioca, then pour the sangria, fruit, and tapioca into each glass.\n            \n", "ingredients": [{"food": "tapioca", "quantity": 0.5}, {"food": "barley flour or meal", "quantity": 750.0}, {"food": "grape juice", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "peaches", "quantity": 2.25}], "title": "\nWhite Peach, Tarragon and Bubble Sangria\n"}, {"directions": "\n\n              Position a rack in the lower third of the oven. Place a pizza stone or upside-down baking sheet on the rack and preheat to 500 degrees F. Cover another upside-down baking sheet with parchment paper and brush with 2 tablespoons olive oil. Put the pizza dough on the oiled paper and turn to coat. Cover with another piece of parchment and set aside.\n            \n\n              Mix the cheeses, red pepper flakes, and salt and pepper to taste in a bowl. Combine the scallion greens and herbs in another bowl. Toss the broccolini and scallion whites on a baking sheet with the remaining 1 tablespoon olive oil, and salt and pepper to taste. Roast 15 minutes.\n            \n\n              Uncover the dough; stretch into a 12-by-16-inch rectangle. Season with salt and pepper, then slide the dough and parchment onto the hot stone or baking sheet. Bake until golden, 6 to 8 minutes.\n            \n\n              Slide the crust and parchment back onto the baking sheet and remove from the oven. Top with the cheese mixture, then the roasted vegetables and herb mixture. Return the pizza to the oven and bake until the cheese melts, about 3 more minutes. Drizzle with olive oil.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 3.0}, {"food": "pizza rolls", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "macaroni cheese", "quantity": 2.0}, {"food": "parmesan cheese", "quantity": 0.5}, {"food": "macaroni cheese", "quantity": 0.25}, {"food": "hearts of palm", "quantity": 1}, {"food": "salt", "quantity": 1}, {"food": "turnip greens", "quantity": 8.0}, {"food": "dill seed", "quantity": 0.25}, {"food": "", "quantity": 2.0}], "title": "\nWhite Pizza With Broccolini\n"}, {"directions": "\n\n              Put a pizza stone or inverted baking sheet on the middle oven rack and preheat to 450 degrees F for 1 hour. Meanwhile, bring the pizza dough to room temperature.\n            \n\n              Heat 1 tablespoon olive oil in a small skillet over medium heat. Add the shallot and chopped garlic and cook, stirring often, until softened but not browned, 3 to 5 minutes; season with pepper. Transfer to a bowl to cool.\n            \n\n              Combine the sesame seeds, poppy seeds, coarse salt and caraway seeds in a small bowl. Sprinkle a sheet of parchment paper with cornmeal. Stretch the pizza dough on the parchment into a 12-inch circle, pressing with your fingertips (lightly oil your hands if the dough is too sticky). Spread the shallot mixture around the edge of the dough and top with the seed mixture.\n            \n\n              Combine the ricotta, parmesan, the remaining 2 tablespoons olive oil, the grated garlic, oregano and red pepper flakes in a bowl; season with kosher salt. Spread the ricotta mixture in the middle of the dough. Top with the mozzarella.\n            \n\n              Slide the parchment onto a pizza peel or another inverted baking sheet, then slide the pizza (on the parchment) onto the hot stone. Bake until the crust is puffed and browned and the cheese is browned, 13 to 15 minutes.\n            \n\n              Photograph by Levi Brown\n            \n", "ingredients": [{"food": "pizza rolls", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "", "quantity": 1.0}, {"food": "cloves", "quantity": 3.0}, {"food": "pepper", "quantity": 1}, {"food": "sesame seeds", "quantity": 2.0}, {"food": "seeds", "quantity": 1.0}, {"food": "sea lion", "quantity": 2.0}, {"food": "seeds", "quantity": 11.0}, {"food": "macaroni cheese", "quantity": 0.3333333333333333}, {"food": "parmesan cheese", "quantity": 0.25}, {"food": "barley flour or meal", "quantity": 0.25}, {"food": "hearts of palm", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}], "title": "\nWhite Pizza with Everything Bagel Crust\n"}, {"directions": "\n\n              Mix the wine, liqueur and sugar in a pitcher, stirring to dissolve the sugar, then add the fruit.\n            \n\n              Refrigerate at least 1 hour and up to 1 day.\n            \n\n              Add the seltzer just before serving.\n            \n\n              Photograph by Yunhee Kim\n            \n", "ingredients": [{"food": "martha white foods", "quantity": 1.0}, {"food": "silk light vanilla", "quantity": 0.25}, {"food": "", "quantity": 3.0}, {"food": "sugar", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "", "quantity": 1.5}], "title": "\nWhite Sangria\n"}, {"directions": "\n\n              Heat a large cast-iron skillet over medium-high heat. Add the sausage, break it up with a wooden spoon, and cook, stirring occasionally, until well browned and cooked through, about 7 minutes. \n            \n\n              Using a slotted spoon, transfer the sausage to a bowl, leaving the rendered fat in the skillet. Whisk the flour into the fat and cook, stirring, for about 1 minute. While whisking, pour the milk into the skillet and bring the gravy to a boil. Lower the heat and simmer gently for 2 minutes. Stir in the sausage and season with pepper. Split the biscuits in half and divide them among plates. Top each biscuit with some of the gravy and serve immediately.\n            \n\nBaking Powder Biscuits\n\n\n              To make the biscuits: Place a rack in the center of the oven and preheat to 450 degrees F. Line a baking sheet with two layers of parchment paper. Set aside. \n            \n\n              In a large bowl, whisk together the flour, baking powder, sugar, and salt. Rub 2 tablespoons of the butter into the flour with your fingertips until completely absorbed. Work the remaining butter into the flour until it is in even pieces about the size of a pea. Gently stir the milk into the flour mixture to make a loose dough. \n            \n\n              Lightly dust a clean work surface with flour and turn the dough out onto it. Pat the dough into a 1/2-inch thick rectangle. Fold the dough in thirds like a business letter. (For a flakier biscuit repeat the folding a second time.) Pat the dough into a 5 by 8-inch rectangle about 3/4-inch thick. Use a 2- to 3-inch round cutter to make 6 biscuits, and transfer them to the prepared baking sheet. Press together the scraps of dough and cut 2 more biscuits. \n            \n\n              To make the glaze: Mix the cream and melted butter together in a small bowl. Lightly brush the tops of the biscuits with the glaze. Bake until lightly browned, about 15 minutes. Cool on a rack for 5 minutes before serving. \n            \n", "ingredients": [{"food": "pork turkey sausage", "quantity": 12.0}, {"food": "potato flour", "quantity": 2.0}, {"food": "milk", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "butter oil", "quantity": 7.0}, {"food": "milk", "quantity": 0.75}, {"food": "ice cream swich", "quantity": 1.0}, {"food": "butter oil", "quantity": 1.0}], "title": "\nWhite Sausage Gravy\n"}, {"directions": "\n\n              Season the swordfish with salt. Pour some flour on a plate and dredge the swordfish in the flour. Heat 3 tablespoons olive oil in a large Dutch oven over medium-high heat. Working in batches, cook the swordfish until golden on all sides, about 4 minutes. Transfer to a plate.\n            \n\n              Reduce the heat to medium; add the remaining 2 tablespoons olive oil to the pot. Add the garlic, onion and red pepper flakes and cook about 3 minutes. Season with salt and add the wine. Cover and cook, stirring a few times, until the onion is tender, about 5 more minutes.\n            \n\n              Add the seafood to the pot in layers, starting with the clams, then the shrimp, calamari rings and tentacles, and the swordfish. Cover and cook until the clams have just opened, about 6 minutes. Lightly stir, cover again and simmer 5 more minutes. Discard any clams that do not open. Stir in the butter, parsley, vinegar and salt to taste. Serve with bread.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "swordfish", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "potato flour", "quantity": 1}, {"food": "vegetable oil", "quantity": 5.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "martha white foods", "quantity": 0.75}, {"food": "", "quantity": 1.0}, {"food": "shrimp", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "butter oil", "quantity": 3.0}, {"food": "parsley", "quantity": 0.5}, {"food": "lemon juice", "quantity": 3.0}, {"food": "garlic bread", "quantity": 1}], "title": "\nWhite Seafood Brodetto\n"}, {"directions": "\n\n              Fry the bacon in a medium saucepan over medium heat until halfway done, 3 minutes. Add the olive oil, butter and shallots and saute until soft, 6 minutes. Add the beans, sage, garlic and broth, bring to a simmer and cook 15 more minutes.\n            \n\n              Transfer the mixture to a blender or food processor in three batches and puree until smooth. (Be careful-hot liquids are prone to explode when whipped!) Return the pureed soup to the pan and add the cream, cayenne, and salt to taste. Keep warm.\n            \n\n              Smear the toasted bread generously with goat cheese and cut into 3/4-inch croutons. To serve, ladle the soup into shot glasses, top with goat cheese croutons and sprinkle with black pepper.\n            \n", "ingredients": [{"food": "diced chicken", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "butter oil", "quantity": 1.0}, {"food": "shallots", "quantity": 2.0}, {"food": "fava beans", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 6.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "diced chicken", "quantity": 3.0}, {"food": "ice cream swich", "quantity": 0.5}, {"food": "pepper", "quantity": 0.25}, {"food": "salt", "quantity": 1}, {"food": "garlic bread", "quantity": 3.0}, {"food": "macaroni cheese", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nWhite-Bean Soup Shooters with Bacon\n"}, {"directions": "\n\n              Heat 1 tablespoon olive oil in large skillet over medium-low heat. Add bread crumbs and cook, tossing occasionally, until crumbs are crisp and golden, about 5 minutes. Stir in lemon zest. Transfer to a bowl and set aside; wipe out pan.\n            \n\n              Cook pancetta in the same pan in 1 tablespoon olive oil over medium heat, until crisp, 5 minutes. Drain on paper towels. Season shrimp with salt and pepper. Sear shrimp in pan drippings over high heat until just cooked, 2 minutes a side. Add to pancetta.\n            \n\n              Cook pasta according to package directions until quite \"al dente\", 5 minutes, reserving cooking water.\n            \n\n              Add garlic, capers, thyme and parsley to the skillet and cook until slightly toasted, 2 minutes. Add vermouth and lemon juice; boil until reduced by about half.\n            \n\n              Add pasta to the sauce, along with 1 to 1 1/2 cups pasta water. Toss pasta with the pancetta, shrimp, and remaining 2 tablespoons olive oil. Divide among warm pasta bowls. Serve with lemon bread crumbs on top and additional olive oil, as desired.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 0.25}, {"food": "bread crumbs", "quantity": 1.0}, {"food": "lemon juice", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "shrimp", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 1.0}, {"food": "garlic powder", "quantity": 4.0}, {"food": "capers", "quantity": 2.0}, {"food": "thyme", "quantity": 1.0}, {"food": "parsley", "quantity": 2.0}, {"food": "martha white foods", "quantity": 0.5}, {"food": "lemon juice", "quantity": 2.0}], "title": "\nWhole Grain Spaghetti with Shrimp, Pancetta and Lemon Breadcrumbs\n"}, {"directions": "\n\n              Crush and chop the garlic with 2 teaspoons salt and pepper flakes. Cut the tomatoes into 1 to 2 inch pieces. Halve or quarter them, if small. Toss the tomatoes with the seasoned garlic, mozzarella, herbs, and extra-virgin olive oil. (This can be prepared up to 2 hours ahead).\n            \n\n              Cook pasta according to the package directions. Drain and toss with the tomato mixture. Serve warm or at room temperature.\n            \n\n              [Styling Notes: What makes this beautiful is a great variety of tomato shapes, sizes, and colors, including green, yellow, orange, and red to dark brown blood red. A variety of cuts also give it a beautiful texture and a \"Fresh-from-the Farm\" look.]\n            \n", "ingredients": [{"food": "garlic powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "tomatoes", "quantity": 2.0}, {"food": "diced chicken", "quantity": 12.0}, {"food": "chrysanthemum leaves", "quantity": 0.5}, {"food": "chrysanthemum leaves", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "", "quantity": 1.0}], "title": "\nWhole Grain Thin Spaghetti Caprese\n"}, {"directions": "\n\n              Preheat a waffle iron to medium-high.\n            \n\n              Whisk the flour with the oats, sugar, wheat germ, baking powder, cinnamon, and salt in a medium bowl. In another medium bowl, lightly whisk the eggs, then add the milk, butter, and oil.\n            \n\n              Gently stir the wet ingredients into the dry ingredients with a wooden spoon, to make a batter. Take care not to overwork the batter, it's fine if there are a few lumps.\n            \n\n              Pour 1/3 to 1/2 cup of batter per waffle (it depends on the size of your waffle iron) and cook until the outside of the waffle is crisp and inside is cooked through, 3 to 5 minutes. (The time varies depending on the size and spread of a waffle iron). Serve warm with maple syrup. Repeat with remaining batter.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.25}, {"food": "oats", "quantity": 0.75}, {"food": "sugar", "quantity": 0.25}, {"food": "wheat germ", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 4.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "eggs", "quantity": 2.0}, {"food": "milk", "quantity": 1.5}, {"food": "butter oil", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "syrup", "quantity": 1}], "title": "\nWhole Grain Waffles\n"}, {"directions": "\n\n              Preheat an outdoor grill to medium heat.\n            \n\n              Put the zucchini on the grill and cover. Cook, turning every 5 minutes, until slightly charred all over and tender when poked with the tip of a paring knife, 15 20 minutes. Remove to a cutting board and let cool slightly, about 5 minutes.\n            \n\n              Meanwhile, combine the basil, oil, vinegar and 1 teaspoon salt in a small bowl and whisk until combined. Slice the zucchini into 1/4-inch slices, arrange on a plate, drizzle with the vinaigrette and sprinkle with the chives.\n            \n", "ingredients": [{"food": "", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 0.25}, {"food": "vinegar", "quantity": 3.0}, {"food": "chives", "quantity": 0.25}, {"food": "salt", "quantity": 1}], "title": "\nWhole Grilled Zucchini with Basil Vinaigrette\n"}, {"directions": "\n\n              1. Preheat the oven to 400 degrees F. Rinse the fish under cold water and pat dry. Rub inside and out with 1 tablespoon salt. Lay the fish on an oiled baking dish. \n            \n\n              2. Lay the orange slices over the fish and brush lightly with oil. In a small bowl, whisk together 5 tablespoons olive oil, the garlic, orange juice, sumac, and cinnamon. Pour half over the fish. Bake until the fish is opaque inside, 30 to 40 minutes, drizzling a tablespoon of the remaining marinade over the fish a few times during cooking. \n            \n\n              3. Serve the fish on a large platter and pour the pan juices over the top. Sprinkle more sumac over the fish and the platter and serve with saffron rice.\n            \n", "ingredients": [{"food": "sea bass", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 5.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.125}, {"food": "garlic powder", "quantity": 2.0}, {"food": "orange juice", "quantity": 6.0}, {"food": "", "quantity": 2.0}, {"food": "cinnamon", "quantity": 0.5}, {"food": "crisped rice bar", "quantity": 1}], "title": "\nWhole Roasted Fish with Orange, Cinnamon, and Sumac\n"}, {"directions": "\n\n              Preheat the broiler to high.\n            \n\n              Bring a large pot of water to a boil. Add the shells and cook according to package directions. Drain, reserving some of the pasta water and set aside.\n            \n\n              Meanwhile, arrange the tomatoes, cut-side up, on baking sheet and broil until wrinkled and soft, 4 to 5 minutes. Combine the breadcrumbs, 1 teaspoon of the oil and the Italian seasoning. Sprinkle over the tomatoes. Continue to broil until golden brown, about 1 minute.\n            \n\n              Heat the remaining 1 tablespoon of oil in a medium saucepan over medium heat. Add the flour and garlic, stirring until the flour turns light brown, about 1 minute. Add the pumpkin puree and evaporated milk, bring to a simmer, stirring, and cook until sauce just begins to bubble and thickens, 4 to 5 minutes. Stir in the Cheddar, mozzarella and Parmesan, 1/2 teaspoon salt and some pepper. Stir until melted, about 1 minute.\n            \n\n              Add the spinach and stir until wilted, about 1 minute. Add the cooked pasta and stir until coated, thin out with the reserved pasta water as desired. Divide the mac n cheese, tomatoes and grapes among four plates.\n            \n", "ingredients": [{"food": "italian veg medley pasta", "quantity": 8.0}, {"food": "plum", "quantity": 4.0}, {"food": "whole milk", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "seasoning mix", "quantity": 0.5}, {"food": "potato flour", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "pumpkin flowers", "quantity": 0.5}, {"food": "milk", "quantity": 12.0}, {"food": "", "quantity": 0.5}, {"food": "", "quantity": 0.5}, {"food": "", "quantity": 0.25}, {"food": "black bean mango", "quantity": 1}, {"food": "mustard spinach", "quantity": 4.0}, {"food": "grapes", "quantity": 2.0}], "title": "\nWhole Wheat Spinach Mac n Cheese with Broiled Tomatoes\n"}, {"directions": "\nSpecial equipment: Cheesecloth\n\n              Preheat the oven to 400 degrees F. Spray a 3-quart casserole dish with cooking spray; set aside.\n            \n\n              Cut a 12-inch square of cheesecloth, lay it flat and place the onion, celery, parsley, thyme, garlic, bay leaf and cloves in the center. Tie opposite corners of the cloth to make a packet; set aside.\n            \n\n              Mix the breadcrumbs and melted butter together in a small bowl until the breadcrumbs are coated with the butter; set aside.\n            \n\n              Heat the oil in a large Dutch oven or pot over medium heat. Add the kielbasa and cook, stirring occasionally, until browned and crisp around the edges, 8 to 10 minutes. (Take care not to let the kielbasa drippings burn; reduce the heat to medium-low if necessary.) Remove the kielbasa and set aside. Add the broth to the pot and scrape up any browned bits. Increase the heat to medium-high. Add 5 cups water; stir in the farro and 1/2 teaspoon salt and nestle the cheesecloth packet in the liquid. Bring to a boil, then partially cover and reduce the heat to simmer. Cook the farro, stirring occasionally, until tender, about 1 hour (it will just be visible above the liquid). Discard the cheesecloth packet. Stir in the beans, tomatoes, 1/2 cup water, wine, browned kielbasa, 1 1/2 teaspoons salt and a few grinds of black pepper and bring to a medium boil; cook until much of the liquid has been absorbed and the beans and farro are visible above the liquid, about 10 minutes.\n            \n\n              Carefully transfer the mixture to the prepared casserole dish and top with the buttered breadcrumbs. Bake until golden brown and bubbling around the edges, 15 to 20 minutes. Serve hot.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "onion powder", "quantity": 1.0}, {"food": "celery seed", "quantity": 1.0}, {"food": "parsley", "quantity": 4.0}, {"food": "thyme", "quantity": 3.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "corier leaf", "quantity": 1.0}, {"food": "cloves", "quantity": 2.0}, {"food": "", "quantity": 0.75}, {"food": "butter oil", "quantity": 3.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "smoked turkey roll", "quantity": 1.0}, {"food": "diced chicken", "quantity": 4.0}, {"food": "", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "fava beans", "quantity": 15.0}, {"food": "tomatoes", "quantity": 0.5}, {"food": "ruby red grapefruit juice blend", "quantity": 0.5}, {"food": "black bean mango", "quantity": 1}], "title": "\nWhole-Grain Bean and Turkey Cassoulet\n"}, {"directions": "\n\n              Preheat the oven to 425 degrees F. Line a baking sheet with parchment paper.\n            \n\n              Whisk together both flours, the baking powder, sugar, 1/2 teaspoon salt and 1/4 teaspoon pepper in a large bowl. Work in the butter using your fingers or a pastry cutter until the mixture resembles small peas.\n            \n\n              Add the milk and stir until just incorporated. Gently knead into a ball, and then pat into a 1-inch-thick rectangle. Cut into twenty-four 1 1/2-inch squares and place on the prepared baking sheet, leaving about 1 inch between each biscuit. Sprinkle an additional 1/4 teaspoon salt and pepper on top.\n            \n\n              Bake until golden brown, about 20 minutes. Cool on the baking sheet and serve warm.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.0}, {"food": "wheat flour", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 4.0}, {"food": "sugar", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "butter oil", "quantity": 0.5}, {"food": "milk", "quantity": 0.6666666666666666}], "title": "\nWhole-Grain Biscuits\n"}, {"directions": "\n\n              Up to 12 hours before serving, put the rice, oats, barley and farina in a 6-to-10-cup rice cooker. Stir in the orange peel, cinnamon stick, sugar, salt and 5 cups water. Add the dried fruit.\n            \n\n              Close the cooker, set the timer and program for the porridge cycle so that breakfast is ready at the desired time. (If you don't have a porridge setting on your rice cooker, program for 50 to 55 minutes.\n            \n\n              Serve the warm porridge with nuts, syrup and/or milk, if desired.\n            \n\n              Photograph by Kana Okada\n            \n", "ingredients": [{"food": "wild rice", "quantity": 0.5}, {"food": "oats", "quantity": 0.5}, {"food": "barley flour or meal", "quantity": 0.25}, {"food": "cereal bar", "quantity": 0.5}, {"food": "orange peel", "quantity": 1.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "salt", "quantity": 0.25}, {"food": "fruit cocktail", "quantity": 0.25}, {"food": "mixed nuts", "quantity": 1}], "title": "\nWhole-Grain Breakfast Porridge\n"}, {"directions": "\n\n              Up to 12 hours before serving, put the rice, oats, barley and farina in a 6-to-10-cup rice cooker. Stir in the orange peel, cinnamon stick, sugar, salt and 5 cups water. Add the dried fruit.\n            \n\n              Close the cooker, set the timer and program for the porridge cycle so that breakfast is ready at the desired time. (If you don't have a porridge setting on your rice cooker, program for 50 to 55 minutes.\n            \n\n              Serve the warm porridge with nuts, syrup and/or milk, if desired.\n            \n\n              Photograph by Kana Okada\n            \n", "ingredients": [{"food": "wild rice", "quantity": 0.5}, {"food": "oats", "quantity": 0.5}, {"food": "barley flour or meal", "quantity": 0.25}, {"food": "cereal bar", "quantity": 0.5}, {"food": "orange peel", "quantity": 1.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "salt", "quantity": 0.25}, {"food": "fruit cocktail", "quantity": 0.25}, {"food": "mixed nuts", "quantity": 1}], "title": "\nWhole-Grain Breakfast Porridge\n"}, {"directions": "\n\n              Preheat the oven to 400 degrees F. Blend the milk and eggs in a blender until thoroughly mixed. Add the flour, vanilla, cinnamon, 1/2 teaspoon salt and lemon zest and blend again until combined, scraping down the sides if necessary, about 15 seconds. Cover the blender jar and refrigerate while cooking the apples.\n            \n\n              Melt the butter in a 10-inch nonstick oven-safe skillet over medium heat. Add the apples and sprinkle them with the granulated sugar. Reduce the heat to medium-low and cook the apples, stirring occasionally, until golden brown and softened, 20 to 25 minutes. Arrange the apples evenly in the skillet. Remix the batter to reincorporate the ingredients, then pour it over the apples.\n            \n\n              Bake the pancake until it is browned and set in the center and the sides have risen about 1 1/2 inches, 25 to 30 minutes. Serve directly from the skillet or use a large spatula to transfer the pancake to a plate. Dust with confectioners' sugar.\n            \n", "ingredients": [{"food": "whole milk", "quantity": 0.75}, {"food": "eggs", "quantity": 3.0}, {"food": "potato flour", "quantity": 0.75}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "cinnamon", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "lemon juice", "quantity": 0.25}, {"food": "butter oil", "quantity": 3.0}, {"food": "sweet potatoes", "quantity": 3.0}, {"food": "sugar", "quantity": 3.0}, {"food": "sugar", "quantity": 1}], "title": "\nWhole-Grain Caramel Apple Oven Pancake\n"}, {"directions": "\n\n              Combine the flours, wheat germ, baking soda and salt in a medium bowl. In a large bowl, beat the butter and sugars with a mixer at medium speed until light and fluffy, about 3 minutes. Beat in the eggs, one at a time, until well blended, then beat in the vanilla.\n            \n\n              At low speed, add the flour mixture in batches until just combined. Using a wooden spoon, stir in the chocolate chips.\n            \n\n              Position the racks in the upper and lower thirds of the oven and preheat the oven to 350 degrees F. Line baking sheets with parchment paper or silicone mats.\n            \n\n              Drop heaping tablespoons of the dough onto the lined baking sheets, leaving about 2 inches of space between them (you should fit about 12 cookies on each baking sheet).\n            \n\n              Bake until the cookies are slightly golden around the edges, 14 to 15 minutes. Let cool for about 3 minutes, then transfer the cookies with a spatula to a wire rack to cool completely (or for as long as you can wait).\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.25}, {"food": "potato flour", "quantity": 1.0}, {"food": "wheat germ", "quantity": 3.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "butter oil", "quantity": 2.0}, {"food": "sugar", "quantity": 0.5}, {"food": "sugar", "quantity": 0.5}, {"food": "eggs", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 2.0}, {"food": "baking chocolate", "quantity": 2.0}], "title": "\nWhole-Grain Chocolate Chip Cookies\n"}, {"directions": "\n\n              Adjust two oven racks to the lower and upper third of the oven and preheat to 350 degrees F. Line two baking sheets with parchment paper.\n            \n\n              Add the flour and oats to a food processor and pulse until the oats are finely ground. Transfer to a medium bowl, add the baking soda and 1/2 teaspoon salt and whisk to combine. Whisk together the egg, applesauce and vanilla in a small bowl.\n            \n\n              Add the butter, granulated sugar and brown sugar to the bowl of a stand mixer fitted with a paddle attachment (or to a large bowl if using a hand mixer). Beat on medium-high until the mixture is light and fluffy, about 4 minutes. Add the applesauce-egg mixture and beat until incorporated, scraping down the sides of the bowl as needed. Reduce the mixer speed to medium-low and add the flour-oats mixture in two batches, mixing until just incorporated. Add the chocolate chips and mix until evenly distributed in the batter.\n            \n\n              Drop heaping tablespoonfuls of batter onto the prepared baking sheets, about 2 inches apart. All the batter won't fit on the two sheets; cookies will need to be baked in batches. Bake until golden brown, 10 to 12 minutes, rotating the pans halfway through. Let the cookies cool for a few minutes on the baking sheets, then transfer to racks to cool completely. Once the lined baking sheets are cool, repeat with the remaining batter. Store the cookies at room temperature in airtight containers for up to 3 days.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1.5}, {"food": "oats", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "egg substitute", "quantity": 1.0}, {"food": "applesauce", "quantity": 0.25}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "butter oil", "quantity": 12.0}, {"food": "sugar", "quantity": 0.5}, {"food": "sugar", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.75}], "title": "\nWhole-Grain Chocolate Chip Cookies\n"}, {"directions": "\n\n              Bring 2 cups of water to boil in a small pot. Add the bulgur and quinoa and simmer for 10 minutes. Place the grains in a fine-mesh strainer and run under cold water to stop the cooking. Let the grains drain in the strainer for 15 minutes, then spread out on a thick layer of paper towels to absorb any extra moisture. Meanwhile, coarsely grind the flaxseed in a spice grinder, just to break them open.\n            \n\n              Stir together the warm water, agave and yeast in a measuring cup or small bowl. Let sit until a small layer of foam develops at the top, about 3-5 minutes. (If this doesn't happen, discard and try again with new yeast.)\n            \n\n              Whisk the flour and 1/2 teaspoon salt together in a medium bowl. Add the foamy yeast mixture and olive oil to the flour and mix together with a stiff rubber spatula. When the dough starts to come together, mix in the cooked grains, crushed flaxseeds, sunflower seeds, cherries and chocolate. Form into a uniform ball in the center of the bowl. Be sure to scrape and use any dough stuck to the sides. The dough will be very sticky at this stage. Cover the bowl tightly with plastic wrap and keep in a warm place until doubled in size, about 2 hours.\n            \n\n              Preheat the oven to 350 degrees F. Line a baking sheet with parchment. Sprinkle a generous amount of flour on a clean, dry work surface. Scrape the dough out of the bowl and knead for a couple of minutes, working in just enough flour to make the dough less sticky but still moist to the tough. Flour your hands periodically to prevent sticking.\n            \n\n              Roll the dough out into a 10-inch square; cut the square in half and then cut each half into 6 crosswise strips about 5 inches long. Brush the strips all over with 1 tablespoon of the butter. Combine the sugar and cinnamon in a small bowl and sprinkle half over the butter. Take the ends of one strip and twist in opposite directions until fully twisted. Transfer to the prepared baking sheet. Repeat with the remaining strips, spaced about 1 inch apart. Cover loosely with plastic wrap or a dish towel and let rest in a warm place until puffed slightly, about 30 minutes. \n            \n\n              Uncover the strips and bake until the bottoms are golden brown, 20 to 25 minutes. Remove them from the oven; brush with the remaining 1 tablespoon of butter and sprinkle with the remaining cinnamon-sugar. Serve warm or at room temperature. Store in an airtight container for up to 1 day.\n            \n", "ingredients": [{"food": "bulgur", "quantity": 2.0}, {"food": "quinoa", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 0.75}, {"food": "syrup", "quantity": 1.0}, {"food": "yeast extract spread", "quantity": 1.0}, {"food": "martha white foods", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "sunflower seed kernels", "quantity": 1.0}, {"food": "maraschino cherries", "quantity": 0.25}, {"food": "baking chocolate", "quantity": 3.0}, {"food": "butter oil", "quantity": 2.0}, {"food": "sugar", "quantity": 2.0}, {"food": "cinnamon", "quantity": 0.25}], "title": "\nWhole-Grain Chocolate-Cherry Bread Twists\n"}, {"directions": "\n\n              Position oven racks in the upper and lower third of the oven and preheat to 400 degrees F.\n            \n\n              Line two baking sheets with parchment.\n            \n\n              Generously sprinkle flour on a work surface. Roll the pizza dough out into a 12-inch square, using more flour as needed to prevent sticking. Cut the dough into quarters, then cut each quarter into 4 strips.\n            \n\n              Carefully tie each strip into a knot and arrange on the prepared baking sheets about 2 inches apart. Wrap loosely with plastic wrap and let sit at room temperature until slightly puffed, about 30 minutes.\n            \n\n              Bake the knots until golden brown on the bottom and lightly golden on the top, 20 to 25 minutes, rotating the baking sheets as needed.\n            \n\n              Meanwhile, put the butter, garlic and 1/2 teaspoon of salt in a small saucepan over medium heat. Once the butter is melted and beginning to bubble, cook the garlic, swirling the pan, until it is soft and fragrant but not brown, about 3 minutes. Remove from the heat and stir in the parsley.\n            \n\n              Brush the garlic butter on the warm knots and sprinkle each with Parmesan. Eat warm or at room temperature. Garlic knots can be baked, cooled and frozen for up to 1 month.\n            \n\nWhole-Multigrain Pizza Dough:\n\n\n              Bring 2 cups of water to a boil in a small pot. Add the bulgur and quinoa and simmer for 10 minutes. Transfer the grains to a fine-mesh strainer and hold under cold running water to stop the cooking. Let the grains drain in the strainer for 15 minutes, then spread them out on a thick layer of paper towels to absorb any extra moisture. Meanwhile, coarsely grind the flaxseeds in a spice grinder, just to break them open.\n            \n\n              Stir together the warm water, agave and yeast in a measuring cup or small bowl. Let sit until a small layer of foam develops at the top, 3 to 5 minutes. (If this doesn't happen, discard and try again with new yeast.)\n            \n\n              Whisk the flour and 1/2 teaspoon salt together in a medium bowl; add the foamy yeast mixture and olive oil and mix together with a stiff rubber spatula. When the dough starts to come together, mix in the cooked grains, ground flaxseeds and sunflower seeds; form the dough into a uniform ball in the center of the bowl. Be sure to scrape and use any dough stuck to the sides. The dough will be very sticky at this stage. Cover the bowl tightly with plastic wrap and keep in a warm place until the dough has doubled in size, about 2 hours.\n            \n\n              Lightly dust a baking sheet with flour. Sprinkle a generous amount of flour on a clean, dry work surface. Scrape the dough onto the floured surface and knead for a couple of minutes, working in just enough flour to make the dough less sticky but still moist to the touch. Flour your hands periodically to prevent sticking. Form the dough into one single ball or divide it into smaller balls. Place the dough ball(s) on the prepared baking sheet. Cover loosely with plastic wrap or a dish towel and let the dough rest for 30 minutes. After the 30 minutes, the dough can be shaped and cooked as desired.\n            \n", "ingredients": [{"food": "potato flour", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "butter oil", "quantity": 3.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "parsley", "quantity": 1.0}, {"food": "", "quantity": 2.0}, {"food": "bulgur", "quantity": 2.0}, {"food": "quinoa", "quantity": 2.0}, {"food": "", "quantity": 1.0}, {"food": "", "quantity": 0.75}, {"food": "syrup", "quantity": 1.0}, {"food": "yeast extract spread", "quantity": 1.0}, {"food": "martha white foods", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "sunflower seed kernels", "quantity": 1.0}], "title": "\nWhole-Grain Garlic Knots\n"}, {"directions": "\n\n              Put the bulgur in a small bowl, cover with hot water and soak until softened, about 1 hour. Strain and set aside.\n            \n\n              Toss the cucumbers, tomatoes, half the mint, 1 tablespoon of the oil, lemon juice, 1/2 teaspoon salt and 1/4 teaspoon pepper in a medium bowl; cover and refrigerate until ready to serve.\n            \n\n              Preheat the oven to 400 degrees F. Spray an 8-inch square baking pan lightly with cooking spray and set aside.\n            \n\n              Pulse the onions into a paste in a food processor, scraping down the bowl as needed. Heat the remaining 2 tablespoons oil in a large nonstick skillet over medium heat. Add the onion paste and any onion juice and cook, stirring occasionally, until the paste begins to brown (it will still be light), about 10 minutes. Add the cumin, cinnamon, allspice, 1 1/2 teaspoons salt and a few grinds of pepper and continue cooking until the onion-spice paste starts to look dry and is fragrant, 4 to 6 minutes.\n            \n\n              Add the onion-spice paste, bulgur, ground beef, egg, breadcrumbs, remaining chopped mint, 1/2 teaspoon salt and several grinds of pepper to a large mixing bowl and mix with your hands until thoroughly combined. Press the mixture into the prepared baking pan; sprinkle with the pine nuts if using and press in. Bake until the meatloaf begins to pull away from the sides, is browned on top and registers 165 degrees F on an instant-read thermometer, 30 to 35 minutes. Slice the meatloaf into 1-inch-thick slices and serve hot with the cucumber-tomato salad and dollops of Greek yogurt alongside.\n            \n", "ingredients": [{"food": "wheat flour", "quantity": 1.0}, {"food": "pineapple chunks", "quantity": 1.25}, {"food": "plum", "quantity": 2.0}, {"food": "chrysanthemum leaves", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 3.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "onions", "quantity": 2.0}, {"food": "cumin seed", "quantity": 1.0}, {"food": "cinnamon", "quantity": 1.0}, {"food": "allspice", "quantity": 0.5}, {"food": "frankfurter beef", "quantity": 1.0}, {"food": "egg substitute", "quantity": 1.0}, {"food": "", "quantity": 0.25}, {"food": "pine nuts", "quantity": 0.25}, {"food": "silk banana-strawberry soy yogurt", "quantity": 1}], "title": "\nWhole-Grain Greek Meatloaf\n"}, {"directions": "\n\n              Preheat the oven to 375 degrees F. Place the garlic on a double-thick square of aluminum foil, drizzle with 1/2 teaspoon of the oil and fold up the foil to enclose the garlic securely. Place the garlic directly on the oven rack and bake until it is golden brown and meltingly soft, about 1 hour. Unwrap and set aside until cool enough to handle, about 5 minutes. \n            \n\n              Combine the parsley, thyme and remaining 1 1/2 teaspoons olive oil in a small bowl. Remove the roasted garlic cloves from the white papery husks with the tip of a butter knife and place them in the bowl. Mash with a fork until smooth and spreadable. Spread the mixture evenly over the bread halves and sprinkle with the Parmesan and salt to taste. Place on a baking sheet and broil (about 6 inches from the heat source) until the top is just browned, about 2 minutes. Cut into 4 pieces and serve warm. \n            \n", "ingredients": [{"food": "garlic powder", "quantity": 0.5}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "parsley", "quantity": 2.0}, {"food": "thyme", "quantity": 2.0}, {"food": "smoked turkey roll", "quantity": 4.0}, {"food": "", "quantity": 1.5}, {"food": "salt", "quantity": 1}], "title": "\nWhole-Grain Herbed Garlic Bread\n"}, {"directions": "\n\n              Mix the kimchi, soy sauce, sesame oil and sugar in a small bowl or measuring cup until the sugar is dissolved; set aside.\n            \n\n              Heat the vegetable oil in a medium nonstick skillet over medium-high heat until shimmering. Add the mushrooms and 1/8 teaspoon salt and cook, stirring, until the mushrooms release water, about 2 minutes. Lower the heat to medium-low and continue to stir until the mushrooms are lightly browned and soft, about 5 minutes. Add the ginger and garlic and cook, stirring, until fragrant, 1 minute. Add the chicken broth, scraping up any browned bits in the skillet, and simmer until slightly reduced, about 1 minute. Stir in the rice, reduce the heat to low, cover and cook until the liquid is absorbed and the rice is heated through, about 3 minutes. Stir in the kimchi mixture and cook until everything is heated through, about 2 minutes. Transfer to a serving dish and top with the scallions. Serve hot.\n            \n", "ingredients": [{"food": "", "quantity": 0.5}, {"food": "soy sauce", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "sugar", "quantity": 0.25}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "mushrooms", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "ginger", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "diced chicken", "quantity": 0.25}, {"food": "crisped rice bar", "quantity": 3.0}, {"food": "", "quantity": 4.0}], "title": "\nWhole-Grain Mushroom and Kimchi Brown Rice\n"}, {"directions": "\n\n              Make the bacon: Preheat the oven to 400 degrees F. Put the Canadian bacon on a baking sheet lined with aluminum foil and brush with 1 tablespoon maple syrup. Bake until golden and crisp, about 5 minutes per side; let cool slightly. Cut into strips and transfer to a bowl; toss with 1 tablespoon syrup and set aside. Reduce the oven temperature to 200 degrees F.\n            \n\n              Make the pancakes: Pulse the oats and flaxseed in a blender or food processor until finely ground; transfer to a large bowl. Add the flour, baking powder and salt and whisk until combined. Whisk the 2 egg yolks and milk in a separate bowl; add to the dry ingredients along with the melted butter and whisk until just smooth. Beat the 2 egg whites and sugar in another bowl with a mixer until soft peaks form; fold into the batter until just combined.\n            \n\n              Lightly butter a nonstick skillet and place over medium heat. Working in batches, add about 1/4 cup batter for each pancake; cook until bubbly on top, then flip and cook until golden brown on the other side, about 3 minutes per side. (Add more butter to the skillet between batches, if needed.) Transfer the pancakes to a baking sheet, cover loosely with aluminum foil and keep warm in the oven until ready to serve. Reserve the skillet for the eggs. Put 1/2 cup maple syrup and the jam in a microwave-safe bowl and microwave 1 minute, then stir to combine; keep warm.\n            \n\n              Make the eggs: Whisk the eggs, 2 tablespoons water and a pinch each of salt and pepper in a bowl. Butter the skillet and return to medium heat. Add the egg mixture and cook, stirring with a rubber spatula, until set, about 4 minutes, adding the cheese halfway through. Divide the pancakes among plates; top with the flavored syrup, eggs and bacon.\n            \n", "ingredients": [{"food": "bacon", "quantity": 8.0}, {"food": "syrup", "quantity": 2.0}, {"food": "oats", "quantity": 0.75}, {"food": "", "quantity": 0.25}, {"food": "potato flour", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 0.5}, {"food": "eggs", "quantity": 2.0}, {"food": "milk", "quantity": 1.5}, {"food": "butter oil", "quantity": 3.0}, {"food": "sugar", "quantity": 3.0}, {"food": "syrup", "quantity": 0.5}, {"food": "jam", "quantity": 0.25}, {"food": "eggs", "quantity": 6.0}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 1}, {"food": "cheddar cheese", "quantity": 0.25}], "title": "\nWhole-Grain Pancakes With Eggs and Bacon\n"}]