[{"directions": "\n\n              In a large punch bowl, steep 1 cup pineapple chunks in 750 ml cognac for an hour or two in the refrigerator. Add 2 1/2 cups seltzer or club soda and 1/4 cup superfine sugar, stirring until the sugar is dissolved, then add between 375 ml and 750 ml cold demi-sec champagne.\n            \n", "ingredients": [], "title": "\nYale College Punch\n"}, {"directions": "\nSpecial equipment: A twelve 1/2-cup muffin pan\n\n              Place a rack in the middle of the oven and preheat to 375 degrees F. Line the muffin pan with paper cupcake liners. \n            \n\n              In a standing mixer fitted with the paddle attachment, combine the butter and sugar and mix on low speed until just incorporated. Raise the speed to high and mix until light and fluffy, about 10 minutes. (Occasionally turn the mixer off, and scrape the sides of the bowl down with a rubber spatula.) \n            \n\n              Meanwhile, in a medium bowl, whisk together the flour, baking powder, and salt. Set aside. In a small bowl, whisk together the milk and vanilla, and also set aside. \n            \n\n              Add the egg yolks to the creamed butter one at time, waiting for each one to be fully incorporated before adding the next. \n            \n\n              Reduce the speed of the mixer to low. Alternately, add the flour mixture in 3 additions and the milk in 2 additions, waiting for each to be fully incorporated before adding the next (scrape the bowl down occasionally). Raise the speed to medium and mix briefly until a smooth batter is formed. Transfer the batter to a large bowl. \n            \n\n              Thoroughly clean the bowl of the mixer and put the egg whites inside. Whip the egg whites on high speed, using the whisk attachment, until stiff peaks are formed. \n            \n\n              Working in 3 batches, using a rubber spatula, fold the egg whites into the batter, until just incorporated. Divide the batter evenly among the cups in the muffin pan. Bake, rotating the pan once, until golden brown and a toothpick inserted in the center of the cakes comes out clean, about 30 minutes. \n            \n\n              Remove the cakes from the oven and cool completely. \n            \n\n              Using a palette knife or rubber, spread some of the frosting all over the tops of the cakes and decorate with the sprinkles.\n            \n\nCream Cheese Frosting:\n\n\n              In a standing mixer fitted with the paddle attachment, or with a hand-held electric mixer in a large bowl, mix the cream cheese and sugar on low speed until incorporated. Increase the speed to high, and mix until light and fluffy, about 5 minutes. (Occasionally turn the mixer off, and scrape the down the sides of the bowl with a rubber spatula.) \n            \n\n              Reduce the speed of the mixer to low. Add the heavy cream, vanilla, and zest. Raise the speed to high and mix briefly until fluffy (scrape down the bowl occasionally). Store in the refrigerator until somewhat stiff, before using. May be stored in the refrigerator for 3 days. \n            \n", "ingredients": [{"food": "", "quantity": 0.75}, {"food": "sugar", "quantity": 1.0}, {"food": "potato flour", "quantity": 1.5}, {"food": "baking chocolate", "quantity": 1.5}, {"food": "salt", "quantity": 0.25}, {"food": "milk", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 0.75}, {"food": "eggs", "quantity": 3.0}, {"food": "frosting", "quantity": 2.0}, {"food": "", "quantity": 1}, {"food": "macaroni cheese", "quantity": 8.0}, {"food": "sugar", "quantity": 2.75}, {"food": "ice cream swich", "quantity": 2.0}, {"food": "vanilla extract", "quantity": 0.75}, {"food": "orange", "quantity": 0.25}], "title": "\nYellow Cupcakes\n"}, {"directions": "\n\n              Roll the edge of the cupcake in the yellow sanding sugar, leaving the top sugar free. Cut the green jelly candy into 2 small strips and put them on the cupcake with the bottom ends touching.\n            \n\n              Snip the marshmallows diagonally. Press the cut sides into the sanding sugars and arrange them on the vines like buds.\n            \n", "ingredients": [{"food": "frosting", "quantity": 1.0}, {"food": "", "quantity": 1}, {"food": "", "quantity": 1}, {"food": "", "quantity": 2.0}], "title": "\nYellow Marshmallow Vines\n"}, {"directions": "\n\n              Heat the olive oil in a large saucepan over medium-low heat. Add the peppers, leek, garlic, salt and turmeric, and cook, stirring occasionally, until the vegetables begin to soften, about 10 minutes.\n            \n\n              Tie the parsley, thyme, and bay leaf together with kitchen twine. Add the potato, water, and herb bundle and bring to a boil, reduce the heat, and simmer, uncovered, until the potato is very tender, about 20 minutes.\n            \n\n              Discard the herb bundle. Puree the soup in small batches in a blender (keep the lid cracked to allow steam to escape), or in the pot with an immersion blender, until smooth. Return to the pot and reheat. Stir in the vermouth, and season, to taste, with salt and pepper. Serve warm.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.0}, {"food": "pineapple chunks", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "seasoning mix", "quantity": 1.0}, {"food": "turmeric", "quantity": 0.25}, {"food": "parsley", "quantity": 3.0}, {"food": "thyme", "quantity": 3.0}, {"food": "corier leaf", "quantity": 1.0}, {"food": "sweet potatoes", "quantity": 2.0}, {"food": "coconut water", "quantity": 4.0}, {"food": "martha white foods", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}], "title": "\nYellow Pepper Soup\n"}, {"directions": "\n\n              Heat the oil in a medium saucepan, with a tight-fitting lid, over medium-high heat. Add the onion, pepper, and annatto, and cook, stirring, until somewhat soft, about 2 minutes. Add the rice and cook, stirring, until toasted, about 2 minutes more. Add water, salt, and bay leaf and bring to a boil. Wrap the lid tightly with a kitchen towel. Cover the rice, lower the heat to a simmer, cook for 20 minutes.\n            \n\n              Remove the rice from the heat and set aside, covered, for 10 minutes. Remove the lid and fluff the rice with a fork. Serve with the black beans.\n            \n\nBlack Beans:\n\n\n              Put the beans in a large saucepan, add the water and bay leaf, and bring to a boil. Set aside, covered, for 1 hour.\n            \n\n              Return the beans to a boil, lower the heat to a simmer, cook uncovered, for 1 1/2 hours. \n            \n\n              Heat the oil in a medium skillet over medium-high heat. Add the onion and peppers and cook, stirring, until soft, about 5 minutes. Add the garlic, cumin, oregano, and coriander and cook, stirring, until fragrant, about 1 minute more. Add the onion mixture to the beans and continue simmering until the beans are very tender and the liquid has thickened, about 1 1/2 hours more. \n            \n\n              If the beans seem too thick, adjust the consistency with a little bit of water. Stir in the vinegar, season with the salt, cayenne, and pepper to taste. Serve. \n            \n\n              Yield: about 4 side dish servings \n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "pepper", "quantity": 0.5}, {"food": "watermelon seed krnls", "quantity": 1.0}, {"food": "crisped rice bar", "quantity": 1.5}, {"food": "coconut water", "quantity": 2.5}, {"food": "salt", "quantity": 2.0}, {"food": "corier leaf", "quantity": 1.0}, {"food": "", "quantity": 1}, {"food": "fava beans", "quantity": 1.25}, {"food": "coconut water", "quantity": 12.0}, {"food": "corier leaf", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "pepper", "quantity": 1.0}, {"food": "garlic powder", "quantity": 10.0}, {"food": "cumin seed", "quantity": 2.0}, {"food": "", "quantity": 2.0}, {"food": "ground turkey", "quantity": 1.0}, {"food": "vinegar", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "hearts of palm", "quantity": 1}, {"food": "black bean mango", "quantity": 1}], "title": "\nYellow Rice\n"}, {"directions": "\n\n              Cut the kernels off an ear of corn; saute in olive oil with yellow squash slices. Toss with yellow grape tomatoes, basil, salt and pepper.\n            \n\n              See all 50 Simple Salads\n            \n", "ingredients": [], "title": "\nYellow Trio\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: a 8-inch cake pan\n\n              For the Spiced Rum: Remove the cap from the rum bottle and drop the allspice, cloves, star anise, orange zest, vanilla bean and cinnamon stick into the bottle. Reseal and let sit at room temperature for 2 days to up to a week, shaking it once a day.\n            \n\n              Put 2 cups of ice cubes in an 8-inch square cake pan and layer in half of the fruit. Top with another 2 cups of ice and then the remaining fruit (the ice cubes keep the fruit from sinking to the bottom). Fill with water and freeze until solid, about 6 hours.\n            \n\n              When ready to serve, combine the sugar with 1 cup water in a small saucepan and bring to a boil. Cook, stirring, until the sugar is completely dissolved, about 2 minutes. Remove from the heat and let cool to room temperature. Stir together the sugar syrup, orange juice, lime juice and bitters in a large punch bowl. Pour the rum into the punch bowl, through a fine mesh sieve, and discard the spices. Let the ice island sit at room temperature for about 10 minutes, unmold and float in the punch. \n            \n\n              Fill a highball glass with ice cubes pour in 1 cup of punch. Top with about 2 ounces of seltzer and the garnish of your choice.\n            \n", "ingredients": [{"food": "martha white foods", "quantity": 750.0}, {"food": "allspice", "quantity": 5.0}, {"food": "cloves", "quantity": 5.0}, {"food": "whole milk", "quantity": 1.0}, {"food": "orange", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "cinnamon", "quantity": 0.5}, {"food": "sugar", "quantity": 1.0}, {"food": "orange juice", "quantity": 4.0}, {"food": "lime juice", "quantity": 1.0}, {"food": "", "quantity": 6.0}, {"food": "luncheon slices", "quantity": 4.0}, {"food": "", "quantity": 2.0}, {"food": "", "quantity": 1}], "title": "\nYo-Ho-Ho and a Bottle of Rum Punch\n"}, {"directions": "\n\n              Put the potatoes in a saucepan; cover with cold water and add 2 tablespoons kosher salt. Bring to a simmer over medium-low to medium heat and cook, uncovered, until tender, about 45 minutes. Drain the potatoes and let sit until just cool enough to handle, then peel and transfer to a bowl.\n            \n\n              Add the butter to the potatoes. Add the yogurt, 2 teaspoons kosher salt, and pepper to taste; mash with a potato masher or fork.\n            \n\n              Stir the chipotle peppers. Fold in the goat cheese. Spoon the mashed potatoes into a serving dish and sprinkle with the caramelized shallots.\n            \n\n              Photograph by Yunhee Kim\n            \n", "ingredients": [{"food": "sweet potatoes", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 1.5}, {"food": "silk plain soy yogurt", "quantity": 1.5}, {"food": "pepper", "quantity": 1}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 6.0}], "title": "\nYogurt Mashed Potatoes With Chipotle Peppers, Goat Cheese and Caramelized Shallots\n"}, {"directions": "\n\n              Whisk together the yogurt, hummus, lemon juice, 1/4 teaspoon salt and hot sauce. Refrigerate in an airtight container for up to 3 days.\n            \n", "ingredients": [{"food": "silk banana-strawberry soy yogurt", "quantity": 0.3333333333333333}, {"food": "hummus", "quantity": 0.3333333333333333}, {"food": "", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "Worcestershire sauce", "quantity": 1}], "title": "\nYogurt-Hummus Dip\n"}, {"directions": "\n\n              Place a scoop of frozen yogurt between graham cracker squares. Roll the edges in chocolate chips. Freeze until firm.\n            \n", "ingredients": [], "title": "\nYogurtwiches\n"}, {"directions": "\n\n              1. Combine the yucca, chicken stock, vinegar, smashed garlic, and 2 cups water in a medium saucepan. Bring to a boil, reduce the heat, and simmer, 9 to 10 minutes. Drain and let dry on a baking sheet.\n            \n\n              2. Combine the mayonnaise, 1/4 cup cilantro, roasted garlic, lime juice, agave, and Sriracha in a small bowl.\n            \n\n              3. Heat the vegetable oil in a large heavy-bottomed pot to 350 degrees F. In batches, fry the yucca for about 3 minutes, turning after each minute, until the fries are lightly golden. Drain on a paper towel-lined baking sheet; sprinkle with salt and garnish with cilantro while warm.\n            \n\n              Serve with the mojo mayo sauce.\n            \n", "ingredients": [{"food": "", "quantity": 2.25}, {"food": "diced chicken", "quantity": 4.0}, {"food": "vinegar", "quantity": 0.3333333333333333}, {"food": "garlic powder", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 6.0}, {"food": "salt", "quantity": 1}, {"food": "mayonnaise dressing", "quantity": 0.5}, {"food": "", "quantity": 0.25}, {"food": "garlic powder", "quantity": 2.0}, {"food": "lime juice", "quantity": 2.0}, {"food": "tamarind nectar", "quantity": 1.0}, {"food": "Worcestershire sauce", "quantity": 0.25}], "title": "\nYucca Fries with Mojo Mayo\n"}, {"directions": "\n\n              Peel the yucca, cut it into 3- to 4-inch sections and quarter it lengthwise. Lay the quarters with a cut side down and slice off the core; discard. Cut cored quarters into 1 1/2-inch pieces. Put the yucca in a medium saucepan with salted cold water to cover by a few inches. Bring to a boil over high heat and cook until translucent and just tender but not falling apart, about 15 minutes. Strain, return the yucca to the pot, set over low heat and toss once or twice to dry it out.\n            \n\n              While the yucca boils, put 2 tablespoons of the oil and the chorizo in a large cast-iron skillet over medium-high heat. Cook, stirring occasionally, until the chorizo is browned and just cooked through, about 4 minutes. Transfer to a plate, using a slotted spoon. Add the onions to the skillet, sprinkle with salt and cook, stirring occasionally, until translucent and beginning to soften, about 3 minutes. Add the bell peppers and cook, stirring occasionally, until soft and charred in spots, about 5 minutes. Transfer to the plate with the chorizo.\n            \n\n              Heat the remaining 4 tablespoons oil in the skillet. Add the yucca and sprinkle with salt; using a metal spatula, chop and press the yucca into the hot oil. When it is a little crusty on the bottom, after 1 or 2 minutes, turn the yucca over and keep pressing and turning until you have lots of crispy yucca, about 4 minutes more. Stir in the chorizo-vegetable mixture and heat through. Serve hot, topped with fried eggs.\n            \n", "ingredients": [{"food": "mashu roots", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 6.0}, {"food": "chorizo", "quantity": 6.0}, {"food": "onion powder", "quantity": 1.0}, {"food": "ruby red grapefruit juice blend", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "fried chicken", "quantity": 1}], "title": "\nYucca Hash Browns with Chorizo\n"}, {"directions": "\n\n              Toss 1 quart sliced strawberries with 1 tablespoon sugar in a bowl; let macerate 10 minutes. Put 5 egg yolks, 1 egg white, 3 tablespoons sugar, 1 tablespoon marsala wine, 1/2 teaspoon vanilla and a pinch of salt in a large heatproof bowl. Set the bowl over a saucepan of barely simmering water (do not let the bowl touch the water) and whisk vigorously over medium to medium-high heat until thick and creamy, 8 to 10 minutes. Immediately pour over the berries and serve with biscotti.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nZabaglione With Berries\n"}, {"directions": "\n\n              Fill one shot glass with the whiskey and serve with the Lemon-Ginger Zapper in a second shot glass as a chaser.\n            \n\nLemon-Ginger Zapper:\n\n\n              Juice the lemons, then the ginger, following your juicer's specific settings for each. Stir in the coconut water, agave syrup and cayenne. Serve the juice immediately over ice, if desired.\n            \n", "ingredients": [{"food": "whiskey sour mix", "quantity": 1.0}, {"food": "", "quantity": 3.0}, {"food": "lemons", "quantity": 6.0}, {"food": "ginger", "quantity": 2.0}, {"food": "coconut water", "quantity": 0.5}, {"food": "syrup", "quantity": 1.0}, {"food": "pepper", "quantity": 0.375}], "title": "\nZapperback\n"}, {"directions": "\n\n              Whisk the vinegar with the mustard, salt and pepper, to taste, in a large bowl. Gradually whisk in the olive oil, starting with a few drops and then adding the rest in a steady stream to make a smooth, slightly thick dressing. Add the cabbage, scallions, and bell pepper and toss until the vegetables are coated. Serve now or cover and refrigerate for up to 4 hours.\n            \n\n              Before serving, grate the apple (with the skin but not the seeds) directly into the slaw, add the watercress leaves, and toss again. Season, to taste, with salt and pepper.\n            \n", "ingredients": [{"food": "vinegar", "quantity": 3.0}, {"food": "mustard spinach", "quantity": 2.0}, {"food": "salt", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "swamp cabbage", "quantity": 0.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 6.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "apple", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 2.0}], "title": "\nZesty Napa Slaw\n"}, {"directions": "\n\n              Heat the oil in a large nonstick skillet over medium-high heat. Add the onions and cook, stirring, until soft and lightly browned, about 6 minutes. Add the sage, garlic and jalapenos and cook, stirring, until fragrant, about 30 seconds. Add the squash, vinegar, 3/4 teaspoon salt and a few grinds of pepper and stir to combine. Cover and cook, stirring occasionally, until the squash begins to soften, 6 to 8 minutes. Uncover and add the red pepper and half of the parsley. Cook until the squash is completely soft and lightly brown, 6 to 8 minutes more. Remove from the heat. \n            \n\n              Make 8 small indentations in the squash with a measuring cup or the back of a ladle. Crack the eggs into the indentations and sprinkle with salt and pepper. Return the pan to medium heat, cover and cook until the egg whites are set and the yolks are still runny, about 4 minutes. \n            \n\n              Sprinkle with the remaining parsley and serve.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.5}, {"food": "onion powder", "quantity": 1.0}, {"food": "sage", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "yellow rice", "quantity": 3.5}, {"food": "vinegar", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "barley flour or meal", "quantity": 0.25}, {"food": "eggs", "quantity": 8.0}], "title": "\nZucchini \"Hash Browns\" and Eggs\n"}, {"directions": "\n\n              For the smoothies: Combine the berries, yogurt, orange juice, honey and bananas together in a blender, and puree until smooth. Divide evenly among four glasses and refrigerate until ready to serve.\n            \n\n              For the \"hash browns\": Heat the oil in a large nonstick skillet over medium-high heat. Add the onions and cook, stirring, until soft and lightly browned, about 6 minutes. Add the sage, garlic and jalapenos and cook, stirring, until fragrant, about 30 seconds. Add the vinegar, squash, 3/4 teaspoon salt and some pepper, and stir to combine. Cover and cook, stirring occasionally, until the squash begins to soften, 6 to 8 minutes. Uncover and add the red pepper and half of the parsley. Cook until the squash is completely soft and lightly brown, 6 to 8 minutes more. Remove from the heat.\n            \n\n              Make 8 small indentations in the squash with a measuring cup or the back of a ladle. Crack the eggs into the indentations and sprinkle with salt and pepper. Return the pan to medium heat, cover and cook until the egg whites are set and the yolks are still runny, about 4 minutes.\n            \n\n              Divide the \"hash browns\" and eggs evenly among four plates. Serve each with a smoothie and 1 slice of toast.\n            \n", "ingredients": [{"food": "mixed nuts", "quantity": 2.0}, {"food": "silk vanilla soy yogurt ", "quantity": 1.0}, {"food": "orange juice", "quantity": 0.5}, {"food": "honey smoked ham", "quantity": 2.0}, {"food": "frozen yogurt", "quantity": 2.0}, {"food": "vegetable oil", "quantity": 1.5}, {"food": "onion powder", "quantity": 1.0}, {"food": "sage", "quantity": 2.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "pasta with tomato sauce", "quantity": 1.0}, {"food": "vinegar", "quantity": 2.0}, {"food": "yellow rice", "quantity": 3.5}, {"food": "black bean mango", "quantity": 1}, {"food": "ruby red grapefruit juice blend", "quantity": 0.25}, {"food": "barley flour or meal", "quantity": 0.25}, {"food": "eggs", "quantity": 8.0}, {"food": "garlic bread", "quantity": 4.0}], "title": "\nZucchini \"Hash Browns\" and Eggs with Berry-Nana Smoothie\n"}, {"directions": "\n\n              1. Preheat the oven to 350 degrees F. Butter and flour a 9 by 5 by 3-inch loaf pan. Trim the ends off the zucchini and grate on the large holes of a box grater. Toss with 2 tablespoons sugar and place in a colander set over a bowl. Let stand 15 minutes.\n            \n\n              2. Meanwhile, in a food processor, finely grind 1/4 cup almonds and set aside. Roughly chop the remaining 1/4 cup nuts and reserve. In a medium bowl, whisk the ground almonds with 1 cup flour, baking soda, and 1/4 teaspoon fine salt. In another bowl whisk the remaining 2/3 cup sugar with the vegetable oil, eggs, honey, and vanilla until the sugar dissolves. Stir in the flour mixture until just combined.\n            \n\n              3. Using your hands, firmly squeeze handfuls of the grated zucchini to remove excess water and add the drained zucchini to the batter along with the reserved chopped almonds and lemon zest. Stir a few times to incorporate into the batter and transfer batter to the prepared loaf pan.\n            \n\n              4. Bake until golden brown and a toothpick inserted into the center comes out clean, 55 to 60 minutes. Cool in the pan, on a wire rack for 10 minutes. Turn the bread out of the pan and cool completely on the rack. Serve.\n            \n", "ingredients": [{"food": "pan dulce", "quantity": 1}, {"food": "potato flour", "quantity": 1.25}, {"food": "", "quantity": 2.0}, {"food": "sugar", "quantity": 0.6666666666666666}, {"food": "almonds", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "eggs", "quantity": 2.0}, {"food": "honey smoked ham", "quantity": 0.25}, {"food": "vanilla extract", "quantity": 0.5}, {"food": "lemon juice", "quantity": 0.5}], "title": "\nZucchini Almond Bread\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 350 degrees F. Generously coat a 9- by 5-inch loaf pan with cooking spray. Spread the walnuts out on a baking sheet and toast in the oven until lightly golden, about 7 minutes. Cool and roughly chop. Coarsely grate the zucchini into a bowl and squeeze out the excess liquid; you should have about 1 1/2 cups zucchini. Whisk together the flour, cinnamon, baking powder, baking soda and salt in a medium bowl. Beat the sugar, oil, apple butter, vanilla and eggs with an electric mixer on medium speed in a large bowl. Add the flour mixture and beat on low speed until just combined, and then on medium speed for 30 seconds. Stir in the zucchini and nuts until evenly combined. Pour the batter into the loaf pan. Bake until a toothpick inserted in the center comes out clean, 50 to 55 minutes. Cool in the pan on a wire rack for 20 minutes. Remove the bread from the pan and completely cool. Cut into 24 slices and serve at room temperature.\n            \n", "ingredients": [{"food": "barbecue loaf", "quantity": 1}, {"food": "walnuts", "quantity": 0.3333333333333333}, {"food": "", "quantity": 1.0}, {"food": "wheat flour", "quantity": 1.5}, {"food": "cinnamon", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "salt", "quantity": 0.5}, {"food": "sugar", "quantity": 0.75}, {"food": "vegetable oil", "quantity": 0.3333333333333333}, {"food": "butter oil", "quantity": 3.0}, {"food": "vanilla extract", "quantity": 1.25}, {"food": "eggs", "quantity": 2.0}], "title": "\nZucchini Bread\n"}, {"directions": "\n\n              Make the zucchini bread: Preheat the oven to 350 degrees F. Lightly butter one 9-by-5-inch loaf pan or three 6-by-3-inch mini pans.\n            \n\n              Whisk the flour, granulated sugar, baking powder, salt, baking soda, cinnamon and nutmeg in a large bowl. Add the dried cranberries.\n            \n\n              Whisk the eggs, melted butter, yogurt, vanilla and orange zest (if using) in a medium bowl. Stir in the shredded zucchini. Fold the zucchini mixture into the flour mixture until just combined.\n            \n\n              Spread the batter in the prepared pan(s). Bake until a toothpick inserted into the center comes out clean, about 55 minutes for a standard loaf or 35 to 40 minutes for mini loaves. Cool 30 minutes in the pan(s) on a rack, then turn out onto the rack to cool completely.\n            \n\n              Make the glaze: Whisk the confectioners' sugar, milk and vanilla seeds in a bowl. Pour over the cooled zucchini bread and let set, 15 to 20 minutes.\n            \n\n              Photograph by Charles Masters\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 1.5}, {"food": "potato flour", "quantity": 1.25}, {"food": "sugar", "quantity": 0.75}, {"food": "baking chocolate", "quantity": 1.0}, {"food": "salt", "quantity": 1.0}, {"food": "baking chocolate", "quantity": 0.5}, {"food": "cinnamon", "quantity": 0.5}, {"food": "nutmeg", "quantity": 0.5}, {"food": "cranberries", "quantity": 1.0}, {"food": "eggs", "quantity": 2.0}, {"food": "silk plain soy yogurt", "quantity": 0.5}, {"food": "vanilla extract", "quantity": 1.0}, {"food": "orange", "quantity": 1.0}, {"food": "", "quantity": 1.0}, {"food": "sugar", "quantity": 1.0}, {"food": "milk", "quantity": 1.0}, {"food": "vanilla extract", "quantity": 1.0}], "title": "\nZucchini Bread With Dried Cranberries and Vanilla Bean Glaze\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 375 degrees F.\n            \n\n              Heat the oil in a large skillet over medium heat. Add the scallion whites and garlic and cook, stirring frequently, until soft, about 5 minutes. Sprinkle in the chili powder and cook, stirring, until the scallions are coated and the oil is brick red, about 1 minute. Remove from the heat and stir in the chicken, 1/2 cup of the salsa and 1/2 cup of the cheese. Set aside. \n            \n\n              Halve the zucchini lengthwise and arrange cut-side down on a work surface. Use a Y-shaped vegetable peeler to shave off ribbons the entire length of each zucchini and as wide as possible (the first few may be too skinny). Make 36 zucchini ribbons total. \n            \n\n              Lay out 3 ribbons, slightly overlapping to make a rectangle (think of this as your \"tortilla\"). Pile about 1/4 cup of the chicken mixture down along one of the short ends of the zucchini tortilla and then roll up to enclose the filling. Put in a 2- to 3-quart baking dish. Roll up the remaining zucchini ribbons and filling and arrange in the dish. Top the rolls with the remaining 1 cup salsa. Add several dashes of the hot sauce and sprinkle with the remaining 1/2 cup cheese. \n            \n\n              Bake until the cheese is melted and the filling is hot, about 25 minutes. Let cool for a few minutes. Thin the sour cream out with a little water and drizzle over the enchiladas. Sprinkle with the reserved scallion greens and serve with more hot sauce if you'd like.\n            \n", "ingredients": [{"food": "vegetable oil", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 4.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "chili powder", "quantity": 1.0}, {"food": "diced chicken", "quantity": 3.0}, {"food": "chunky soup", "quantity": 1.5}, {"food": "macaroni cheese", "quantity": 1.0}, {"food": "", "quantity": 3.0}, {"food": "Worcestershire sauce", "quantity": 1}, {"food": "sour cream", "quantity": 2.0}], "title": "\nZucchini Enchiladas\n"}, {"directions": "\n\n              Grate 2 small zucchini into a colander in the sink; toss with 2 teaspoons salt and let sit 10 minutes. Squeeze out the liquid. Mix with 4 minced scallions, 1/4 cup each chopped parsley and dill, 1 beaten egg, 3/4 cup grated parmesan and 1/4 cup flour. Pan-fry spoonfuls of the mixture in olive oil, flattening with a spatula, 3 to 4 minutes per side. Drain on paper towels and season with salt.\n            \n\n              Photograph by Antonis Achilleos\n            \n", "ingredients": [], "title": "\nZucchini Fritters\n"}, {"directions": "\n\nWatch how to make this recipe.\n\nSpecial equipment: 2 wire racks 2 rimmed baking sheets\n\n              Adjust 2 oven racks to the top and bottom thirds of the oven and preheat to 425 degrees F. Put the wire racks in the baking sheets and coat each generously with cooking spray.\n            \n\n              Combine the flour and 3/4 teaspoon salt in a large re-sealable plastic bag. Combine the eggs and 3/4 teaspoon salt in another large plastic bag; combine the breadcrumbs and 3/4 teaspoon salt in a third large plastic bag.\n            \n\n              Add about a half of the zucchini rounds to the flour, and use a combination of your hands and shaking the bag to coat the zucchini. Remove the zucchini and shake off any excess flour. Transfer to the egg wash and repeat until coated. (It's less messy if you use only one hand for the dry ingredients and the other for the wet.) Let any excess egg drip off before transferring to the breadcrumb mixture; repeat until fully coated (you'll still see some green and white of the zucchini peeking through the breading). Transfer to the prepared baking sheets and coat the breaded zucchini generously with cooking spray (there's no need to turn them). Repeat with the remaining zucchini.\n            \n\n              Bake, rotating the baking sheets from top to bottom about halfway through, until golden brown and tender, 25 to 30 minutes.\n            \n\n              Lower the oven to 350 degrees F and let the baking sheet cool for a few minutes. Remove the rack from one of the baking sheets and line the baking sheet with foil. Slide the baked zucchini onto the baking sheet and scatter the cheese and jalapenos on top. Bake until the cheese melts, about 10 minutes. Thin the sour cream out with a little water, until it's pourable, and drizzle over the nachos. Then garnish with the pico de gallo, avocado, radish and cilantro. Serve with lime on the side.\n            \n", "ingredients": [{"food": "", "quantity": 1}, {"food": "potato flour", "quantity": 0.5}, {"food": "salt", "quantity": 1}, {"food": "eggs", "quantity": 3.0}, {"food": "", "quantity": 2.5}, {"food": "", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 1.5}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 0.25}, {"food": "sour cream", "quantity": 0.5}, {"food": "barley flour or meal", "quantity": 1.0}, {"food": "diced chicken", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "chrysanthemum leaves", "quantity": 1}, {"food": "lime", "quantity": 1.0}], "title": "\nZucchini Fry Nachos\n"}, {"directions": "\n\n              Cut the zucchini diagonally into 1/4-inch-thick slices so they are the size of the the width of the bread. Spread them out on a plate or cutting board and season both sides with salt and pepper.\n            \n\n              Preheat a griddle or grill pan to medium-high.\n            \n\n              Cut the bread into 6-inch segments and then cut each segment horizontally almost completely through so you can open it like a book. Open the sandwich halves and press them flat against the work surface with your hands until the bread doesn't spring back. Put cheese on the bottom half of each sandwich.\n            \n\n              Working in batches, melt 1 tablespoon butter on the griddle. Cook the zucchini until slightly browned and soft, about 3 minutes. Turn and cook until pliable and nearly transparent, another 2 minutes. As zucchini is cooked, put it on top of the cheese, dividing equally among the sandwiches. Divide the olives among the sandwiches and close them, pressing to flatten.\n            \n\n              Working in batches, reduce the heat to medium-low and melt 1 tablespoon butter (for a small griddle) or 2 tablespoons butter (for a large griddle). Put the sandwiches on the griddle. Place a baking sheet on top of the sandwiches and weigh it down with something heavy, like canned goods or a cast-iron skillet. The idea is to make the sandwiches as flat as possible. (Alternatively, use a panini press.)\n            \n\n              Cook until the bread is crisp, about 3 minutes. Turn and cook, adding more butter if necessary, until the cheese is melted and the bread is crisp, 2 minutes more. Serve immediately.\n            \n", "ingredients": [{"food": "", "quantity": 1.0}, {"food": "black bean mango", "quantity": 1}, {"food": "", "quantity": 1.0}, {"food": "macaroni cheese", "quantity": 4.0}, {"food": "butter oil", "quantity": 3.0}, {"food": "olives", "quantity": 0.25}], "title": "\nZucchini Panini\n"}, {"directions": "\n\n              Make the sauce: Heat the olive oil in a large skillet over medium-high heat. Add the garlic, fennel seeds and red pepper flakes and cook, stirring, until the garlic is lightly golden, about 1 minute. Add the tomatoes and 1 teaspoon salt; cook, stirring occasionally, until the tomatoes begin to sizzle, about 5 minutes. Add half of the basil and 1/2 cup water and bring to a boil. Reduce the heat to medium low and simmer, stirring occasionally and smashing the tomatoes with the back of a spoon, 25 minutes. Stir in the remaining basil and season with salt.\n            \n\n              Prepare the zucchini: Preheat the oven to 400 degrees F. Trim the zucchini and halve crosswise, then slice lengthwise into 18 strips, about 1/4 inch thick. Put the flour in a shallow dish. Whisk the eggs and milk in another dish. In a third dish, combine the panko, parmesan, parsley, garlic, 1/2 teaspoon salt, and pepper to taste. Working in batches, dredge the zucchini in the flour and shake off the excess. Dip in the egg mixture, turning to coat; let the excess drip off, then dredge in the panko mixture, pressing to help it stick. Set aside.\n            \n\n              Heat the olive oil in a large, deep skillet over medium-high heat. Working in batches, add the zucchini in a single layer and fry until golden brown, 2 to 3 minutes per side. Drain on paper towels; season with salt.\n            \n\n              Lay 6 pieces fried zucchini a few inches apart in a 9-by-13-inch baking dish. Top each with a few tablespoons of the tomato sauce, a slice of mozzarella and a piece of prosciutto. Repeat the layering (zucchini, sauce, mozzarella, prosciutto), then top with the remaining zucchini. Top with a little more sauce, sprinkle with parmesan and dollop with the ricotta. Bake until heated through, about 15 minutes. Top the stacks with more prosciutto. Serve with the remaining sauce.\n            \n\n              Photograph by Con Poulos\n            \n", "ingredients": [{"food": "Worcestershire sauce", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "garlic powder", "quantity": 2.0}, {"food": "fennel seed", "quantity": 0.5}, {"food": "ruby red grapefruit juice blend", "quantity": 0.75}, {"food": "plum", "quantity": 3.0}, {"food": "salt", "quantity": 1}, {"food": "basil", "quantity": 0.5}, {"food": "", "quantity": 1}, {"food": "", "quantity": 2.0}, {"food": "potato flour", "quantity": 0.75}, {"food": "eggs", "quantity": 2.0}, {"food": "milk", "quantity": 0.3333333333333333}, {"food": "", "quantity": 2.0}, {"food": "parmesan cheese", "quantity": 0.5}, {"food": "parsley", "quantity": 0.25}, {"food": "garlic powder", "quantity": 1.0}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 6.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 2.0}, {"food": "macaroni cheese", "quantity": 0.6666666666666666}], "title": "\nZucchini Parmesan\n"}, {"directions": "\n\nWatch how to make this recipe.\n\n\n              Preheat the oven to 400 degrees F. Roll the puff pastry out to a 12-inch square on a floured work surface. Brush lightly with the olive oil and sprinkle evenly with the cheese, thyme and lemon zest. Cut into 6 even strips.\n            \n\n              Shingle alternating yellow and green slices of squash and zucchini along the length of each strip of dough making sure to leave half the dough strip uncovered and allowing the green and yellow skins to hang over one edge slightly. Fold the uncovered dough over the squash and pinch together at the two ends. Starting at one end, roll each strip into a spiral. Lightly press the rolled tarts into a muffin tin sprayed with cooking spray. \n            \n\n              Bake until the crusts are browned and crisp on the bottom, the top is dry and crisp and the squash is tender and browned on the edges, about 40 minutes. Remove to a rack to cool slightly. Serve warm.\n            \n", "ingredients": [{"food": "puff pastry", "quantity": 1.0}, {"food": "potato flour", "quantity": 1}, {"food": "vegetable oil", "quantity": 2.0}, {"food": "", "quantity": 0.25}, {"food": "chrysanthemum leaves", "quantity": 2.0}, {"food": "lemon juice", "quantity": 2.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "pasta with sliced franks in tomato sauce", "quantity": 1.0}, {"food": "", "quantity": 1}], "title": "\nZucchini Rose Tartlets\n"}, {"directions": "\n\n              Preheat oven to 350 degrees F. Shred the squash on the large holes of a box grater, into a colander. Sprinkle with a heaping tablespoon salt and toss well. Place in the sink and drain for 15 minutes. Rinse and the squeeze firmly, by the handful, to remove excess water. Set aside.\n            \n\n              Meanwhile, pulse bread into crumbs in a food processor. Heat 2 tablespoons olive oil in a large skillet over medium heat; add bread crumbs and stir until evenly toasted, about 5 minutes. Evenly spread crumbs in a 9-inch glass or ceramic pie pan. Place pan on a baking sheet.\n            \n\n              Wipe out the skillet, add remaining 2 tablespoons oil, the onions and garlic and season with 1/2 teaspoon salt, cook over medium-high heat, until onions are start to brown, about 5 minutes. Add the zucchini, and cook, stirring, for 2 minutes. Stir in parsley, dill and marjoram or oregano. Remove from heat, cool slightly.\n            \n\n              Whisk half-and-half, eggs and yolks in large glass measuring cup. Season with salt and pepper to taste. Spread the zucchini mixture in the prepared pan. Crumble the goat cheese and evenly scatter on the vegetables. Sprinkle Gruyere on top and pour the custard over the fillings.\n            \n\n              Bake until the quiche is just set in the center, about 40 to 50 minutes. Cool completely on a rack before serving.\n            \n", "ingredients": [{"food": "hearts of palm", "quantity": 1.5}, {"food": "salt", "quantity": 1}, {"food": "vegetable oil", "quantity": 4.0}, {"food": "garlic bread", "quantity": 1.5}, {"food": "onion powder", "quantity": 1.0}, {"food": "garlic powder", "quantity": 1.0}, {"food": "parsley", "quantity": 2.0}, {"food": "dill seed", "quantity": 1.0}, {"food": "barley flour or meal", "quantity": 1.0}, {"food": "", "quantity": 2.0}, {"food": "eggs", "quantity": 2.0}, {"food": "egg substitute", "quantity": 2.0}, {"food": "black bean mango", "quantity": 1}, {"food": "macaroni cheese", "quantity": 6.0}, {"food": "macaroni cheese", "quantity": 2.5}], "title": "\nZucchini and Goat Cheese Crustless Quiche\n"}, {"directions": "\n\n              Toss the zucchini with 1/2 teaspoon salt in a bowl; let stand 10 minutes. Wrap the zucchini in a kitchen towel and squeeze dry.\n            \n\n              Meanwhile, heat the butter in a large nonstick skillet over medium-high heat. Add the onion and garlic and cook, stirring occasionally, until slightly softened, about 4 minutes. Add the corn and cook, stirring occasionally, until crisp-tender, about 3 minutes. Set aside.\n            \n\n              Whisk the cornmeal, flour, baking soda, 3/4 teaspoon salt and 1/4 teaspoon pepper in a medium bowl. Whisk the buttermilk and egg in a large bowl, then stir in the corn-onion mixture and zucchini. Add the cornmeal mixture and stir until just combined.\n            \n\n              Heat about 1/8 inch vegetable oil in a large nonstick skillet over medium heat. Working in batches, scoop scant 1/4 cupfuls of the batter into the oil and use the back of the measuring cup to flatten the scoops. Cook until the fritters are golden brown, 3 to 4 minutes per side. Drain on paper towels and sprinkle with salt. Serve warm or at room temperature. (You can make the fritters up to 2 hours ahead; reheat in a 375 degrees F oven on a rack set on a baking sheet.)\n            \n\n              Photograph by Anna Williams\n            \n", "ingredients": [{"food": "", "quantity": 2.0}, {"food": "salt", "quantity": 1}, {"food": "butter oil", "quantity": 1.0}, {"food": "onion powder", "quantity": 0.5}, {"food": "garlic powder", "quantity": 1.0}, {"food": "sunflower seed kernels", "quantity": 2.5}, {"food": "potato flour", "quantity": 0.5}, {"food": "baking chocolate", "quantity": 0.25}, {"food": "pepper", "quantity": 1}, {"food": "pillsbury golden layer buttermilk biscuits", "quantity": 0.75}, {"food": "egg substitute", "quantity": 1.0}, {"food": "vegetable oil", "quantity": 1}], "title": "\nZucchini-Corn Fritters\n"}, {"directions": "\n\n              Thinly slice a baguette; arrange in a single layer on a baking sheet. Brush with olive oil and sprinkle with salt. Bake at 425 degrees F until lightly golden, about 7 minutes. Let cool slightly.\n            \n\n              Slice a small zucchini into long ribbons with a vegetable peeler. Toss with lemon juice, olive oil and a big pinch of salt. Rub the warm toast rounds with a smashed garlic clove. Top with the zucchini, shaved ricotta salata and fresh pepper; drizzle with any juices from the zucchini.\n            \n\n              Photograph by Andrew McCaul\n            \n", "ingredients": [], "title": "\nZucchini-Ricotta Salata Bruschetta\n"}]